{
    "id": "429edc6b34e43d35",
    "companyDescription": "",
    "description": "Great Minds. One Goal. Canada's Success.\n     \n     \n    Help bring research to life and drive your career forward with the National Research Council of Canada (NRC), Canada's largest research and technology organization.\n     \n     \n    We are looking for a Research Officer (RO) to join the Gas Turbine Laboratory (GTL) within the Aerospace Research Centre (ARC). The Research Officer would be someone who shares our core values of Integrity, Excellence, Respect and Creativity.\n     \n     \n    The Aerospace Research Centre is expanding its research and development capabilities in the field of sustainable aviation, including hybrid electric propulsion (HEP) systems and electric propulsion (EP) for aerospace applications. This expansion will allow the incumbent to lead research projects in this area by working with an interdisciplinary team and utilizing world-class research facilities including the Hybrid-Electric Research Outfit facility and Altitude Research Facility. Activities include the development and delivery of research and development, and/or technical service projects, project management, and external collaboration and relationship building.\n     \n     \n    The Research Officer will also provide inputs to the overall direction of research priorities in sustainable aviation propulsion, as well as for the development of new research facilities and capabilities, which enable such activities.\n     \n     \n    This is an excellent opportunity for the right candidate interested in working within a fast-growing research & business environment at Canada’s leading research and technology organization. \n   \n  \n  \n   \n     Screening Criteria \n   \n   \n     Applicants must demonstrate within the content of their application that they meet the following screening criteria in order to be given further consideration as candidates: \n   \n  \n  \n   \n     Education \n   \n   \n     PhD in an Engineering field applicable to sustainable aviation (e.g. electrical, aerospace, mechanical, etc.).  Candidate with Master’s degree in Engineering combined with significant experience in the relevant areas may be considered. \n    For information on certificates and diplomas issued abroad, please see Degree equivalency \n   \n  \n  \n   \n     Experience \n   \n   \n    \n     Significant industry experience in the design, development, and performance testing and integration of hybrid electric propulsion and/or electric propulsion for aircraft propulsion; \n     Experience in one or more of the following is required: \n      \n       Fuel cells and subsystem; \n       Electric machines such as motors, inverters, controllers and generators and power distribution, conversion, and controls; \n       Energy storage devices such as batteries. \n      \n     Experience in leading the technical execution of applied R&D projects; \n     Experience in working in medium to large scale industrial and/or academic projects in a multidisciplinary environment in collaboration with multiple stakeholders; and \n     Experience in research networking, publications, Intellectual Property (IP) and preparation of project proposals. \n    \n   \n  \n  \n   \n    Condition of Employment \n   \n   \n     \n     Reliability Status; and \n     Must be able to travel locally, nationally, and internationally. \n    \n   \n  \n  \n   \n    Language Requirements \n   \n   \n     English\n     \n     \n    Information on language requirements and self-assessment tests \n   \n  \n  \n   \n     Assessment Criteria \n   \n   \n     Candidates will be assessed on the basis of the following criteria: \n   \n  \n  \n   \n     Technical Competencies \n   \n   \n    \n     Solid knowledge in the integration and architecture of electric and mechanical components for HEP and EP systems; \n     Solid knowledge of the state-of-the art in one or more of the following systems for low to zero emission transportation applications: and \n      \n       Testing and performance evaluation of mechanical and electric components of HEP and EP systems at a component level and/or system level; \n       Fuel cell and its performance test; \n       Electric components (advanced battery, generator, electric motor, inverter and motor controller); \n       Modeling and Simulation of HEP system; \n       High-Voltage power distribution. \n      \n     Knowledge of codes and standards related to hybrid electric propulsion systems would be an asset. \n    \n   \n  \n  \n   \n    Behavioural Competencies \n   \n   \n    Research - Communication (Level 3) \n    Research - Teamwork (Level 3) \n    Research - Networking (Level 3) \n    Research - Self-knowing and self-development (Level 2) \n    Research - Initiative (Level 2) \n   \n  \n  \n   \n    Competency Profile(s) \n   \n   \n     For this position, the NRC will evaluate candidates using the following competency profile: Research\n     \n     \n   \n  \n  \n   \n     Compensation \n   \n   \n     This position is classified as a Research Officer (RO), a group that is unique to the NRC. Candidates are remunerated based on their expertise, outcomes and impacts of their previous work experience relative to the requirements of the level. The salary scale for this group is vast, from $57,220 to $161,754 per annum, which permits for employees of all levels from new graduates to world renowned experts to be fairly compensated for their contributions.\n     \n     \n    NOTE: Please note that the full RO/RCO salary scale has five levels. Salary determination will be based on a review of the candidate’s expertise, outcomes and impacts of their previous work experience relative to the requirements of the level. As such, the initial salary could be within another level of the RO/RCO salary scale (i.e. above or below the intended level for this position).\n     \n     \n    NRC employees enjoy a wide-range of competitive benefits including comprehensive health and dental plans, vacation, sick, and other leave entitlements, disability insurance and pension plans. \n   \n  \n  \n   \n     The NRC Advantage \n   \n   \n     The National Research Council of Canada (NRC) is the Government of Canada's largest research organization supporting industrial innovation, the advancement of knowledge and technology development. We collaborate with over 70 colleges, universities and hospitals annually, work with 800 companies on their projects, and provide advice or funding to over 8000 Small and Medium-sized Enterprises (SMEs) each year.\n     \n     \n    We bring together the brightest minds to deliver tangible impacts on the lives of Canadians and people around the world. And now, we want to partner with you. Let your expertise and inspirations make an impact by joining the NRC.\n     \n     \n    At the NRC Employee wellness matters. We offer flexible work schedules as well as part-time work to help employees maintain work-life balance. We are one of the few federal organizations that close our offices during the December holiday season. We offer professional learning and development opportunities such as conferences, workshops, and a suite of mentorship, award and recognition programs. Diversity enables creativity and innovation. Fostering a diverse, inclusive, welcoming and supportive workplace is important to us, and contributes to a more inclusive Canadian innovation system. We welcome all qualified applicants and encourage you to complete the employment equity self-declaration questions during the job application process. Please let us know of any accommodation measures required to help you to be assessed in a fair and equitable manner. Please note that the information you provide will be treated confidentially.\n     \n     \n    Help us solve problems for Canada. Grow your career with us today! \n   \n  \n  \n   \n     Notes \n   \n   \n    \n     Relocation assistance will be determined in accordance with the NRC's directives. \n     A pre-qualified list may be established for similar positions for a one year period. \n     Preference will be given to Canadian Citizens and Permanent Residents of Canada. Please include citizenship information in your application. \n     The incumbent must adhere to safe workplace practices at all times. \n     We thank all those who apply, however only those selected for further consideration will be contacted.\n    \n   \n  \n \n  \n  \n Please direct your questions, with the requisition number (20704) to: \n E-mail: NRC.NRCHiring-EmbaucheCNRC.CNRC@nrc-cnrc.gc.ca \n Telephone: 438-455-5335 \n Closing Date: 15 January 2024 - 23:59 Eastern Time",
    "preprocessed_description": "Great Minds. One Goal. Canada's Success. Help bring research to life and drive your career forward with the National Research Council of Canada (National Research Council Canada), Canada's largest research and technology organization. We are looking for a Research Officer (RO) to join the Gas Turbine Laboratory (GTL) within the Aerospace Research Centre (ARC). The Research Officer would be someone who shares our core values of Integrity, Excellence, Respect and Creativity. The Aerospace Research Centre is expanding its research and development capabilities in the field of sustainable aviation, including hybrid electric propulsion (HEP) systems and electric propulsion (EP) for aerospace applications. This expansion will allow the incumbent to lead research projects in this area by working with an interdisciplinary team and utilizing world-class research facilities including the Hybrid-Electric Research Outfit facility and Altitude Research Facility. Activities include the development and delivery of research and development, and/or technical service projects, project management, and external collaboration and relationship building. The Research Officer will also provide inputs to the overall direction of research priorities in sustainable aviation propulsion, as well as for the development of new research facilities and capabilities, which enable such activities. This is an excellent opportunity for the right candidate interested in working within a fast-growing research & business environment at Canada's leading research and technology organization. Screening Criteria Applicants must demonstrate within the content of their application that they meet the following screening criteria in order to be given further consideration as candidates: Education PhD in an Engineering field applicable to sustainable aviation (e.g. electrical, aerospace, mechanical, etc.). Candidate with Master's degree in Engineering combined with significant experience in the relevant areas may be considered. For information on certificates and diplomas issued abroad, please see Degree equivalency Experience Significant industry experience in the design, development, and performance testing and integration of hybrid electric propulsion and/or electric propulsion for aircraft propulsion; Experience in one or more of the following is required: Fuel cells and subsystem; Electric machines such as motors, inverters, controllers and generators and power distribution, conversion, and controls; Energy storage devices such as batteries. Experience in leading the technical execution of applied Research and Development projects; Experience in working in medium to large scale industrial and/or academic projects in a multidisciplinary environment in collaboration with multiple stakeholders; and Experience in research networking, publications, Intellectual Property (IP) and preparation of project proposals. Condition of Employment Reliability Status; and Must be able to travel locally, nationally, and internationally. Language Requirements English Information on language requirements and self-assessment tests Assessment Criteria Candidates will be assessed on the basis of the following criteria: Technical Competencies Solid knowledge in the integration and architecture of electric and mechanical components for HEP and EP systems; Solid knowledge of the state-of-the art in one or more of the following systems for low to zero emission transportation applications: and Testing and performance evaluation of mechanical and electric components of HEP and EP systems at a component level and/or system level; Fuel cell and its performance test; Electric components (advanced battery, generator, electric motor, inverter and motor controller); Modeling and Simulation of HEP system; High-Voltage power distribution. Knowledge of codes and standards related to hybrid electric propulsion systems would be an asset. Behavioural Competencies Research - Communication (Level 3) Research - Teamwork (Level 3) Research - Networking (Level 3) Research - Self-knowing and self-development (Level 2) Research - Initiative (Level 2) Competency Profile(s) For this position, the National Research Council Canada will evaluate candidates using the following competency profile: Research Compensation This position is classified as a Research Officer (RO), a group that is unique to the National Research Council Canada. Candidates are remunerated based on their expertise, outcomes and impacts of their previous work experience relative to the requirements of the level. The salary scale for this group is vast, from $57,220 to $161,754 per annum, which permits for employees of all levels from new graduates to world renowned experts to be fairly compensated for their contributions. NOTE: Please note that the full RO/RCO salary scale has five levels. Salary determination will be based on a review of the candidate's expertise, outcomes and impacts of their previous work experience relative to the requirements of the level. As such, the initial salary could be within another level of the RO/RCO salary scale (i.e. above or below the intended level for this position). National Research Council Canada employees enjoy a wide-range of competitive benefits including comprehensive health and dental plans, vacation, sick, and other leave entitlements, disability insurance and pension plans. The National Research Council Canada Advantage The National Research Council of Canada (National Research Council Canada) is the Government of Canada's largest research organization supporting industrial innovation, the advancement of knowledge and technology development. We collaborate with over 70 colleges, universities and hospitals annually, work with 800 companies on their projects, and provide advice or funding to over 8000 Small and Medium-sized Enterprises (SMEs) each year. We bring together the brightest minds to deliver tangible impacts on the lives of Canadians and people around the world. And now, we want to partner with you. Let your expertise and inspirations make an impact by joining the National Research Council Canada. At the National Research Council Canada Employee wellness matters. We offer flexible work schedules as well as part-time work to help employees maintain work-life balance. We are one of the few federal organizations that close our offices during the December holiday season. We offer professional learning and development opportunities such as conferences, workshops, and a suite of mentorship, award and recognition programs. Diversity enables creativity and innovation. Fostering a diverse, inclusive, welcoming and supportive workplace is important to us, and contributes to a more inclusive Canadian innovation system. We welcome all qualified applicants and encourage you to complete the employment equity self-declaration questions during the job application process. Please let us know of any accommodation measures required to help you to be assessed in a fair and equitable manner. Please note that the information you provide will be treated confidentially. Help us solve problems for Canada. Grow your career with us today! Notes Relocation assistance will be determined in accordance with the National Research Council Canada's directives. A pre-qualified list may be established for similar positions for a one year period. Preference will be given to Canadian Citizens and Permanent Residents of Canada. Please include citizenship information in your application. The incumbent must adhere to safe workplace practices at all times. We thank all those who apply, however only those selected for further consideration will be contacted. Please direct your questions, with the requisition number (20704) to: E-mail: National Research Council Canada.NRCHiring-EmbaucheCNRC.CNRC@nrc-cnrc.gc.ca Telephone: 438-455-5335 Closing Date: 15 January 2024 - 23:59 Eastern Time",
    "processed_description": ". goal . . help bring research life drive career forward large research technology organization . Research Officer RO join GTL ARC . Research Officer share core respect Creativity . expand research development capability field sustainable aviation include hybrid electric propulsion HEP system electric propulsion EP aerospace application . expansion allow incumbent lead research project area interdisciplinary team utilize class research facility include Hybrid Electric Research Outfit facility Altitude Research Facility . activity include development delivery research development technical service project project management external collaboration relationship building . Research Officer provide input direction research priority sustainable aviation propulsion development research facility capability enable activity . excellent interested fast grow research business environment Canada's lead research technology organization . screen Criteria Applicants demonstrate content application meet follow screening criterion order consideration education phd Engineering field applicable sustainable aviation e.g. electrical aerospace mechanical . . Master's degree Engineering combine relevant area consider . information certificate diploma issue abroad degree equivalency industry design development performance testing integration hybrid electric propulsion electric propulsion aircraft propulsion require fuel cell subsystem electric machine motor inverter controller generator power distribution conversion control energy storage device battery . lead technical execution apply Research Development project medium large scale industrial academic project multidisciplinary environment collaboration multiple stakeholder research networking publication ip preparation project proposal . condition Employment Reliability Status travel locally nationally internationally . language requirement assessment test Assessment Criteria assess basis follow criterion Technical Competencies solid knowledge integration architecture electric mechanical component ep system solid knowledge state art follow system low zero emission transportation application testing performance evaluation mechanical electric component ep system component level system level fuel cell performance test electric component advanced battery generator electric motor inverter motor controller system high voltage power distribution . knowledge code standard relate hybrid electric propulsion system asset . Level Research Teamwork Level Research Networking Level Research development Level Research Initiative Level competency profile position evaluate follow competency profile position classify Research Officer RO group unique . remunerate base expertise outcome impact previous relative requirement level . salary scale group vast annum permit employee level graduate renowned expert fairly compensated contribution . note note RO RCO salary scale level . salary determination base review candidate's expertise outcome impact previous relative requirement level . initial salary level RO RCO salary scale i.e. intended level position . National Research Council employee enjoy wide range competitive benefit include comprehensive health dental plan vacation sick leave entitlement insurance pension plan . large research organization support industrial innovation advancement knowledge technology development . collaborate college university hospital company project provide advice funding small medium sized Enterprises sme . bring bright mind deliver tangible impact life people . partner . expertise inspiration impact join . wellness matter . offer flexible schedule help employee maintain life balance . federal organization close office . offer professional learning development conference workshop suite mentorship award recognition program . diversity enable creativity innovation . foster diverse inclusive welcoming supportive workplace contribute inclusive canadian innovation system . qualified applicant encourage complete employment equity declaration question application process . accommodation measure require help assess fair equitable manner . note information provide treat confidentially . help solve problem . grow career note relocation assistance determine National Research Council Canada's directive . pre qualified list establish position period . . include citizenship information application . incumbent adhere safe workplace practice . apply select consideration contact . direct question requisition number mail closing Eastern",
    "results_group": {
        "extracted_noun_chunks": [
            "hybrid electric propulsion HEP system electric propulsion EP aerospace application",
            "hybrid electric propulsion system asset",
            "diverse inclusive welcoming supportive workplace",
            "help",
            "qualified applicant",
            "treat",
            "fairly compensated contribution",
            "salary determination base review candidate's expertise outcome impact",
            "life balance",
            "bright mind",
            "research life drive career",
            "Research Officer RO group",
            "technical execution",
            "select consideration contact",
            "safe workplace practice",
            "previous relative requirement level",
            "large research technology organization",
            "activity",
            "salary scale group vast annum permit employee level graduate renowned expert",
            "National Research Council Canada's directive",
            "RO RCO salary scale level",
            "basis follow criterion Technical Competencies solid knowledge integration architecture electric mechanical component ep system solid knowledge state art follow system low zero emission transportation application testing performance evaluation mechanical electric component ep system component level system level fuel cell performance test electric component advanced battery generator electric motor inverter motor controller system high voltage power distribution",
            "research development capability field sustainable aviation",
            "development delivery research development technical service project project management external collaboration relationship building",
            "complete employment equity declaration question application process",
            "base expertise outcome impact",
            "Research Officer",
            "goal",
            "Master's degree Engineering",
            "excellent interested fast grow research business environment",
            "college university hospital company project",
            "screen Criteria Applicants",
            "problem",
            "incumbent",
            "follow competency profile position",
            "partner",
            "incumbent lead research project area interdisciplinary team",
            "industrial innovation advancement knowledge technology development",
            "inclusive canadian innovation system",
            "large research organization",
            "federal organization close office",
            "note",
            "Level Research Teamwork Level Research Networking Level Research development Level Research Initiative Level competency profile position",
            "fair equitable manner",
            "relocation assistance",
            "National Research Council employee",
            "knowledge code standard",
            "entitlement insurance pension plan",
            "content application meet follow screening criterion order consideration education phd Engineering field applicable sustainable aviation",
            "expertise inspiration impact",
            "flexible schedule help",
            "information",
            "position period",
            "employee",
            "relevant area",
            "class research facility",
            "wide range competitive benefit",
            "wellness matter",
            "Research Development project medium large scale industrial academic project multidisciplinary environment collaboration multiple stakeholder research networking publication ip preparation project proposal",
            "career note",
            "condition Employment Reliability Status",
            "Research Officer RO",
            "initial salary level RO RCO salary scale i.e. intended level position",
            "input direction research priority sustainable aviation propulsion development research facility capability",
            "Hybrid Electric Research Outfit facility Altitude Research Facility",
            "Canada's lead research technology organization",
            "advice",
            "direct question requisition number mail",
            "diversity",
            "qualified list",
            "citizenship information application",
            "GTL ARC",
            "small medium sized Enterprises",
            "language requirement assessment test Assessment Criteria",
            "creativity innovation",
            "tangible impact life people",
            "information certificate diploma issue abroad degree equivalency industry design development performance testing integration hybrid electric propulsion electric propulsion aircraft propulsion",
            "accommodation measure",
            "comprehensive health dental plan vacation",
            "fuel cell subsystem electric machine motor inverter controller generator power distribution conversion control energy storage device battery",
            "professional learning development conference workshop suite mentorship award recognition program",
            "expansion"
        ],
        "combined_lemmatized_tokens": ". goal . . help bring research life drive career forward large research technology organization . Research Officer RO join GTL ARC . Research Officer share core respect Creativity . expand research development capability field sustainable aviation include hybrid electric propulsion HEP system electric propulsion EP aerospace application . expansion allow incumbent lead research project area interdisciplinary team utilize class research facility include Hybrid Electric Research Outfit facility Altitude Research Facility . activity include development delivery research development technical service project project management external collaboration relationship building . Research Officer provide input direction research priority sustainable aviation propulsion development research facility capability enable activity . excellent interested fast grow research business environment Canada's lead research technology organization . screen Criteria Applicants demonstrate content application meet follow screening criterion order consideration education phd Engineering field applicable sustainable aviation e.g. electrical aerospace mechanical . . Master's degree Engineering combine relevant area consider . information certificate diploma issue abroad degree equivalency industry design development performance testing integration hybrid electric propulsion electric propulsion aircraft propulsion require fuel cell subsystem electric machine motor inverter controller generator power distribution conversion control energy storage device battery . lead technical execution apply Research Development project medium large scale industrial academic project multidisciplinary environment collaboration multiple stakeholder research networking publication ip preparation project proposal . condition Employment Reliability Status travel locally nationally internationally . language requirement assessment test Assessment Criteria assess basis follow criterion Technical Competencies solid knowledge integration architecture electric mechanical component ep system solid knowledge state art follow system low zero emission transportation application testing performance evaluation mechanical electric component ep system component level system level fuel cell performance test electric component advanced battery generator electric motor inverter motor controller system high voltage power distribution . knowledge code standard relate hybrid electric propulsion system asset . Level Research Teamwork Level Research Networking Level Research development Level Research Initiative Level competency profile position evaluate follow competency profile position classify Research Officer RO group unique . remunerate base expertise outcome impact previous relative requirement level . salary scale group vast annum permit employee level graduate renowned expert fairly compensated contribution . note note RO RCO salary scale level . salary determination base review candidate's expertise outcome impact previous relative requirement level . initial salary level RO RCO salary scale i.e. intended level position . National Research Council employee enjoy wide range competitive benefit include comprehensive health dental plan vacation sick leave entitlement insurance pension plan . large research organization support industrial innovation advancement knowledge technology development . collaborate college university hospital company project provide advice funding small medium sized Enterprises sme . bring bright mind deliver tangible impact life people . partner . expertise inspiration impact join . wellness matter . offer flexible schedule help employee maintain life balance . federal organization close office . offer professional learning development conference workshop suite mentorship award recognition program . diversity enable creativity innovation . foster diverse inclusive welcoming supportive workplace contribute inclusive canadian innovation system . qualified applicant encourage complete employment equity declaration question application process . accommodation measure require help assess fair equitable manner . note information provide treat confidentially . help solve problem . grow career note relocation assistance determine National Research Council Canada's directive . pre qualified list establish position period . . include citizenship information application . incumbent adhere safe workplace practice . apply select consideration contact . direct question requisition number mail closing Eastern"
    }
}