{
    "id": "c0d5572608d3e351",
    "company": "SurveyMonkey",
    "positionName": "Senior Product Manager - Machine Learning",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-13T18:55:15.537Z",
    "url": "https://www.indeed.ca/rc/clk?jk=c0d5572608d3e351&from=jasx&tk=1hcvfr1frj4hv800&vjs=3",
    "externalApplyLink": "https://boards.greenhouse.io/surveymonkey/jobs/5397181?gh_src=0a85c7ab1us",
    "companyDescription": "",
    "description": "SurveyMonkey is a global leader in online surveys and forms that empowers people with the insights they need to make decisions with speed and confidence. Our fast, intuitive feedback management platform connects millions of users worldwide with real-time AI-powered insights that drive meaningful decisions. We provide answers to more than 20 million questions every day so that people and organizations can attract new audiences, delight customers, create advocates, and extend their competitive advantage in the marketplace. Our vision is to raise the bar for human experiences by amplifying individual voices. Learn more at surveymonkey.com.\n \n  More about our Machine Learning Team \n  Survey Monkey's Machine Learning Team powers the core Survey Monkey Product and is part of the core strategy in differentiating our product offering. Through our ML capabilities, we make our users' survey journey a delightful experience. The machine learning team owns the machine learning platform that helps efficiently scale AI to meet the needs of our business. We are looking for a senior product management professional to manage the machine learning and Insights vision, strategy and execution. \n  What we're looking for \n  The Sr. Product Manager for ML will report to our Director of Product in the AI/ML and Analyze team. You will play a vital role across our product organization, coordinating with other product line PMs and cross-functional stakeholders in Machine Learning, Product, Engineering, Design, Growth, Customer Support, Sales and Product Marketing. You will bring domain expertise in ML, and develop a deep understanding of user problems to identify opportunities where AI/ML can help. The Machine Learning charter will be pivotal to the future growth of SurveyMonkey and its position in the market vs other leading competitors. \n  What you'll be working on \n  \n  Drive ML product strategy and lead teams toward the vision of a ML-enabled product \n  Work closely with other product managers to ship ML capabilities across the users' survey journey. \n  Develop ML product and ML platform roadmap and requirements working with cross functional teams to execute by planning and managing expectations with stakeholders across the company \n  Deliver key ML & Insights features and capabilities from concept-to-launch \n  Work closely with our UX design and research teams to deeply understand our persona across various segments to drive common ML and Insights capabilities that can be leveraged by other product teams \n  Analyze data and other feedback sources to refine product delivery iteratively \n  Define a set of success metrics to measure customer satisfaction and business impact and utilize them in decision-making \n  Lead us through change, evolution, and growth. \n  \n We'd love to hear from people with \n  \n  7+ years of Product Management experience which includes 3+ years of delivering ML features that involve UI/UX for external customers \n  Knowledge of technical infrastructure needed for training and deploying machine learning products \n  A knack for keeping an eye on competition and building a data driven business case and justification for your product roadmap \n  Familiarity with machine learning strategies to solve customer problems \n  Experience working on an Insights product is a huge plus \n  Clear understanding of product led growth and how products can be leveraged as a sales, marketing, onboarding and retention strategy. \n  Experience managing a complex set of products at different stages of their lifecycle and communicating the complexity simply and cleanly \n  Demonstrated ability to drive impact through cross-functional leadership \n  Effectively balance short-term goals and long-term vision \n  Strong collaborator, you love helping product managers, engineers, designers, and other teams around you do their best work \n  Ability to deal with ambiguity, change, and shifting priorities \n  \n #LI-remote\n \n   Why SurveyMonkey? We're glad you asked \n   SurveyMonkey is a place where the curious come to grow. We're building an inclusive workplace where people of every background can excel no matter their time zone. At SurveyMonkey, we weave employee feedback into everything we do to create forward-looking benefits policies, employee programs, and an award-winning culture, including best workplace for parents, our annual holiday refresh, our annual week of service, and our C.H.O.I.C.E Fund. In addition, we've reimagined the way we work to allow employees to choose what works best for them - working in-person, fully remote, or a hybrid model that combines the two through our Choice Model. \n   Our commitment to an inclusive workplace \n   SurveyMonkey is an equal opportunity employer committed to providing a workplace free from harassment and discrimination. We celebrate the unique differences of our employees because that is what drives curiosity, innovation, and the success of our business. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, gender identity or expression, age, marital status, veteran status, disability status, pregnancy, parental status, genetic information, political affiliation, or any other status protected by the laws or regulations in the locations where we operate. Accommodations are available for applicants with disabilities."
}