{
    "id": "8cb9226f40c7e7b3",
    "company": "La Cité - Bureau de la recherche et de l'innovation",
    "positionName": "Assistant(e) de recherche | Research assitant",
    "jobType": [
        "Full-time",
        "Fixed term contract"
    ],
    "location": "Ottawa, ON",
    "salary": "$25–$30 an hour",
    "postingDateParsed": "2024-01-25T12:16:04.395Z",
    "url": "https://www.indeed.ca/rc/clk?jk=8cb9226f40c7e7b3&from=jasx&tk=1hl5dhvd9ia2n800&bb=sVrMdsVcIt_OfIQS18JHMdp69SZrNB1Q_e_h_nHTIPxNqxnUzK6_9R7L7BvZ_9XqRZmyUf4k0zFMj7dxTYxkTXWXdwFB3AsOu3h0Wqf8zlEctN1GaXnwDQ%3D%3D&xkcb=SoCj67M3FlTIK7WZUZ0ObzkdCdPP&vjs=3",
    "externalApplyLink": null,
    "job_info_group": {
        "extracted_phone_numbers": [],
        "extracted_links": [
            "HTTP/HTTPS Links",
            "General Links",
            "WWW Links",
            "TLDs"
        ],
        "extracted_emails": [],
        "extracted_location_data": [
            "le titulaire",
            "au besoin",
            "- Participer"
        ],
        "extracted_dates": [
            "2024-02-01"
        ],
        "extracted_languages": [],
        "extracted_laws": [],
        "extracted_norps": [],
        "extracted_orgs": [
            "Le candidat doit pouvoir communiquer oralement et par écrit en français.- Une expérience",
            "Congés payés Flexible Language Requirement",
            "Biotechnology, Biochemistry",
            "the Technology Access Centre in Bio",
            "the Research Associates",
            "de recherche et à",
            "Temps Plein, Contractuel",
            "Français",
            "du superviseur du Centre d'accès à la technologie",
            "des activités de recherche appliquée qui se déroulent en laboratoire",
            "possibilité de renouvèlement Salaire",
            "Du Lundi au Vendredi",
            "recherche appliquée reliées aux",
            "microbiologie ou domaine"
        ],
        "extracted_persons": [
            "Préparer",
            "Pouvez-vous",
            "Horaires",
            "Sous la",
            "Biotechnologie"
        ],
        "extracted_products": [
            "doit avoir gradué d'un programme d'étude de 3 ans dans les domaines suivants"
        ],
        "extracted_money": [],
        "processed_text": "preference aux francophone . Description du poste suit Francais . summary description direction Manager innovation incumbent support apply research activity laboratory . complete laboratory experiment achieve project goal . requirement qualification graduate field study chemistry biology Microbiology field. write oral skill french. previous research laboratory consider asset . MAIN duty support carry apply research project activitiesprepare perform laboratory experiment perform demonstration provide technical explanation student involve research projects communicate progress task regularly supervisor participate meeting relate research project involved prepare equipment supply ensure progression research projects ensure order cleanliness laboratory dedicate apply research shared laboratory DESCRIPTION SOMMAIRE DU POSTE direction bio innovation soutient realisation . Il est responsable preparer d'effectuer realisation des experiences laboratoire . exigence candidat biochimie chimie biologie connexe. prealable dans laboratoire recherche sera consideree atout . fonction PRINCIPALES Appui dans realisation des activites projet effectuer les manipulation laboratoire necessaire au projetfaire des demonstrations fournir des explication technique aux etudiants impliques dans les projets recherche Communiquer regulierement aux associes son superviseur l'avancement dans ses tache des rencontres lien avec les projets recherche auxquels il participe les appareil equipements necessaires au bon fonctionnement des projets recherche Assurer l'ordre proprete des laboratoires dedies recherche appliquee les laboratoires partages Type dthemploi avec par heure Type dthemploi Temps plein Contrat duree determineeLa duree du contrat mois Salaire par heure Heures prevues par semaine Avantages Anglais requis requis travail heure Question preselection soutenir une conversation francais Formation Baccalaureat Obligatoire Lieu du poste"
    },
    "companyDescription": null,
    "description": "Préférence aux francophones. Description du poste suit en Francais.\nSUMMARY OF JOB DESCRIPTION\nUnder the direction of the Manager of the Technology Access Centre in Bio-innovation, the incumbents will support applied research activities in the laboratory. He/she will complete the laboratory experiment necessary to achieve the project goals.\nREQUIREMENTS AND QUALIFICATIONS\n- The candidate must have graduated in the field of study of Biotechnology, Biochemistry, Chemistry-biology, Microbiology or a related field.- The candidate must show written and oral skills in French.- Previous experience in a research laboratory will be considered an asset.\nMAIN DUTIES\nSupport in carrying out applied research project activities- Prepare and perform the laboratory experiment;- Perform demonstrations and provide technical explanations to students involved in research projects;- Communicate the progress of their tasks regularly with the Research Associates and Supervisor;- Participate, as needed, in meetings related to the research projects in which he/she is involved;- Prepare equipment and supplies necessary to ensure the progression of research projects;- Ensure the order and cleanliness of laboratories dedicated to applied research and shared laboratories;\n----\nDESCRIPTION SOMMAIRE DU POSTE\nSous la direction du superviseur du Centre d’accès à la technologie en bio-innovation, le titulaire soutient la réalisation des activités de recherche appliquée qui se déroulent en laboratoire. Il est responsable de préparer et d’effectuer la réalisation des expériences de laboratoires.\nEXIGENCES\n- Le candidat doit avoir gradué d’un programme d’étude de 3 ans dans les domaines suivants : Biotechnologie, biochimie, chimie-biologie, microbiologie ou domaine connexe.- Le candidat doit pouvoir communiquer oralement et par écrit en français.- Une expérience préalable dans un laboratoire de recherche sera considérée un atout.\nFONCTIONS PRINCIPALES\n- Appui dans la réalisation des activités en recherche appliquée reliées aux projets :- Effectuer les manipulations de laboratoire nécessaire au projet- Faire des démonstrations et fournir des explications techniques aux étudiants impliqués dans les projets de recherche ;- Communiquer régulièrement aux associés de recherche et à son superviseur l’avancement dans ses tâches ;- Participer, au besoin, à des rencontres en lien avec les projets de recherche auxquels il participe ;- Préparer les appareils et équipements nécessaires au bon fonctionnement des projets de recherche;- Assurer l’ordre et la propreté des laboratoires dédiés à la recherche appliquée et les laboratoires partagés\nType d'emploi : Temps Plein, Contractuel, 1 an avec possibilité de renouvèlement\nSalaire : 25$ à 30$ par heure\nType d'emploi : Temps plein, Contrat à durée déterminéeLa durée du contrat : 12 mois\nSalaire : 25,00$ à 30,00$ par heure\nHeures prévues : 35 par semaine\nAvantages :\n\n Congés payés\n\nFlexible Language Requirement :\n\n Anglais non requis\n Français non requis\n\nHoraires de travail :\n\n 8 Heures\n Du Lundi au Vendredi\n\nQuestion(s) de présélection:\n\n Pouvez-vous soutenir une conversation en français\n\nFormation:\n\n Baccalauréat (Obligatoire)\n\nLieu du poste : En présentiel\nDate de début prévue : 2024-02-01"
}