{
    "id": "d88455d3a999456e",
    "companyDescription": "",
    "description": "We have an exciting opportunity in our Ottawa office for an Intermediate Biologist / Environmental Scientist specializing in Natural Science and Impact Assessment with expertise and experience in one or more of the following specialized areas: species at risk, wetlands, terrestrial, avian and aquatic biology, or climate change adaption. We are looking for someone to be part of our diverse and multi-disciplinary Environmental Sciences Team. At CBCL, we work as a collaborative team, and foster development of new skills and growing together. \n At CBCL Limited, we are a successful, dynamic, and multi-disciplined engineering and environmental firm, looking to grow our Ottawa team. Our employee-owned organization is driven by the values and passion of our employees. CBCL’s culture is shaped by our Atlantic Canadian roots, and our experience extends throughout Canada and the world. We are looking for someone with an entrepreneurial spirit that shares our corporate values of diversity, inclusion and improving the communities where we live and work. \n \n  \n Your Key Responsibilities: \n  \n  Provide consulting services in the capacity of an Intermediate Biologist related to the areas of expertise provided above including conducting field surveys and report preparation. \n \n \n  Support our clients with their Federal, Provincial and Municipal environmental legislation and policy requirements. \n  Provide technical direction and leadership to environmental project teams to achieve compliance with quality standards and relevant regulations. \n  Collaboration with other environmental team members and project managers from our various other engineering departments. \n \n \n  Mentor and direct some junior staff and collaborate with other environmental professionals on our Team. \n \n \n  Provide input related to growth opportunities, business development and planning. \n  Build and/or support client relationships. \n \n \n  Lead preparation of proposal submissions, including development of project scope, schedule, and budget, as appropriate. \n \n \n  Potential for travel throughout Ontario, Canada, and international locations. \n  Uphold CBCL’s safety culture and adhere to company safety protocols and programs and applicable health and safety regulations. Maintain compliance with specific client, and site-specific health and safety protocols and programs, as required. \n  \n \n Your Capabilities & Credentials \n  \n  A Bachelor’s or Master’s degree in Biology, Ecology, Zoology, Botany, or other Environmental/Applied Science. \n  Minimum of 5 years’ experience in environmental consulting or relevant environmental industry, including prior field experience such as wetland delineation and functional assessments, stream and culvert assessments, vegetation surveys, aquatic invertebrate collection and identification. \n \n \n  Biological Training and certifications relevant to one’s areas of practice, such as: \n   \n    Ontario Wetland Evaluation System (OWES) \n    Ecological Land Classification (ELC) \n    Butternut Health Assessment Expert and/or Experience \n    Ontario Stream Assessment Protocol (OSAP) \n    Ontario Benthos Biomonitoring Network (OBBN) \n    Electro-fishing certification \n   \n \n \n  Experience with Ontario Class Environmental Assessments. \n \n \n  Experience with the Natural Heritage Assessment under the Provincial Policy statements. \n \n \n  Strong team player with excellent interpersonal skills and strong oral and written communication skills \n  Strong analytical skills, attention to detail, problem solving, and decision-making capabilities. \n  Strong interpersonal, organization, and time management skills. \n  Highly professional demeanor with emphasis on client service and client profile management. \n  Eligible to obtain security requirements for contracting with the Government of Canada. \n  Applicant must have a valid Class G driver’s license. \n \n \n  Experience working on Canadian Federal Impact Assessments is considered a strong asset.\n \n  \n  \n  What we can offer you: A competitive compensation package effective on your first day of employment: \n  \n  \n   \n    Comprehensive health and dental benefits \n    Defined Contribution Pension Plan with employer contributions \n    Generous vacation allowance commensurate with experience \n   \n  Respect for work-life balance with flexible environment and remote work options \n  Employee ownership potential \n  Employer contributions towards maternity leave top up \n  Health and wellness incentive \n  Membership dues reimbursement \n  Education and lifelong learning subsidization \n  Community volunteering incentive \n  Employee Family Assistance Program\n \n  \n  \n  In addition to the above benefits, we offer: \n  \n  Flexible hours and locations to support work/life balance, including hybrid or remote options; \n  Diverse team with a wide range of experience and expertise; \n  Exposure to a variety of projects; \n  Support to develop skills and pursue projects related to your own interests; \n  Collaboration between multiple disciplines and levels of expertise; \n  Mentoring opportunities to foster your personal and professional development; \n  Accessible and central offices in Ottawa and Atlantic Canada; \n  Access to training opportunities in areas ranging from technical development to leadership skills.\n \n  \n  \n  About Us \n  As an employee-owned firm, at CBCL, our people are everything. We are committed to promoting inclusivity and diversity for a workplace where everyone can thrive, and we build long-term relationships with our clients while providing them with innovative solutions. \n \n  \n We have earned recognition as one of Canada’s Top 100 Employers and one of Canada’s Best Managed Companies. Our multitalented group of professionals offer consulting in the Infrastructure, Water and Wastewater, Buildings, Industrial, and Earth and Environment sectors. We value our people, our communities, and our history and look forward to continuing our steady growth.\n \n  Along with our commitment to reducing our carbon footprint corporately, CBCL develops and implements sustainable engineering solutions that respect the current social and environmental impacts, as well as future implications of our designs.\n  \n  \n  CBCL operates from its twelve offices in Ottawa, ON, Halifax and Sydney, NS; Charlottetown, PE; Saint John, Fredericton and Moncton, NB; and St. John's, NL,\n  \n  \n  CBCL Limited strives to provide a diverse workplace that is inclusive, accessible and celebrates individuals and what makes us unique. \n Accommodations are available upon request for candidates taking part in all aspects of the recruitment process. Please contact hr@cbcl.ca.\n  \n  \n We thank all applicants for their interest, but only those applicants who are selected to interview will be contacted.",
    "preprocessed_description": "We have an exciting opportunity in our Ottawa office for an Intermediate Biologist / Environmental Scientist specializing in Natural Science and Impact Assessment with expertise and experience in one or more of the following specialized areas: species at risk, wetlands, terrestrial, avian and aquatic biology, or climate change adaption. We are looking for someone to be part of our diverse and multi-disciplinary Environmental Sciences Team. At CBCL, we work as a collaborative team, and foster development of new skills and growing together. At CBCL Limited, we are a successful, dynamic, and multi-disciplined engineering and environmental firm, looking to grow our Ottawa team. Our employee-owned organization is driven by the values and passion of our employees. CBCL's culture is shaped by our Atlantic Canadian roots, and our experience extends throughout Canada and the world. We are looking for someone with an entrepreneurial spirit that shares our corporate values of diversity, inclusion and improving the communities where we live and work. Your Key Responsibilities: Provide consulting services in the capacity of an Intermediate Biologist related to the areas of expertise provided above including conducting field surveys and report preparation. Support our clients with their Federal, Provincial and Municipal environmental legislation and policy requirements. Provide technical direction and leadership to environmental project teams to achieve compliance with quality standards and relevant regulations. Collaboration with other environmental team members and project managers from our various other engineering departments. Mentor and direct some junior staff and collaborate with other environmental professionals on our Team. Provide input related to growth opportunities, business development and planning. Build and/or support client relationships. Lead preparation of proposal submissions, including development of project scope, schedule, and budget, as appropriate. Potential for travel throughout Ontario, Canada, and international locations. Uphold CBCL's safety culture and adhere to company safety protocols and programs and applicable health and safety regulations. Maintain compliance with specific client, and site-specific health and safety protocols and programs, as required. Your Capabilities & Credentials A Bachelor's or Master's degree in Biology, Ecology, Zoology, Botany, or other Environmental/Applied Science. Minimum of 5 years' experience in environmental consulting or relevant environmental industry, including prior field experience such as wetland delineation and functional assessments, stream and culvert assessments, vegetation surveys, aquatic invertebrate collection and identification. Biological Training and certifications relevant to one's areas of practice, such as: Ontario Wetland Evaluation System (OWES) Ecological Land Classification (ELC) Butternut Health Assessment Expert and/or Experience Ontario Stream Assessment Protocol (OSAP) Ontario Benthos Biomonitoring Network (OBBN) Electro-fishing certification Experience with Ontario Class Environmental Assessments. Experience with the Natural Heritage Assessment under the Provincial Policy statements. Strong team player with excellent interpersonal skills and strong oral and written communication skills Strong analytical skills, attention to detail, problem solving, and decision-making capabilities. Strong interpersonal, organization, and time management skills. Highly professional demeanor with emphasis on client service and client profile management. Eligible to obtain security requirements for contracting with the Government of Canada. Applicant must have a valid Class G driver's license. Experience working on Canadian Federal Impact Assessments is considered a strong asset. What we can offer you: A competitive compensation package effective on your first day of employment: Comprehensive health and dental benefits Defined Contribution Pension Plan with employer contributions Generous vacation allowance commensurate with experience Respect for work-life balance with flexible environment and remote work options Employee ownership potential Employer contributions towards maternity leave top up Health and wellness incentive Membership dues reimbursement Education and lifelong learning subsidization Community volunteering incentive Employee Family Assistance Program In addition to the above benefits, we offer: Flexible hours and locations to support work/life balance, including hybrid or remote options; Diverse team with a wide range of experience and expertise; Exposure to a variety of projects; Support to develop skills and pursue projects related to your own interests; Collaboration between multiple disciplines and levels of expertise; Mentoring opportunities to foster your personal and professional development; Accessible and central offices in Ottawa and Atlantic Canada; Access to training opportunities in areas ranging from technical development to leadership skills. About Us As an employee-owned firm, at CBCL, our people are everything. We are committed to promoting inclusivity and diversity for a workplace where everyone can thrive, and we build long-term relationships with our clients while providing them with innovative solutions. We have earned recognition as one of Canada's Top 100 Employers and one of Canada's Best Managed Companies. Our multitalented group of professionals offer consulting in the Infrastructure, Water and Wastewater, Buildings, Industrial, and Earth and Environment sectors. We value our people, our communities, and our history and look forward to continuing our steady growth. Along with our commitment to reducing our carbon footprint corporately, CBCL develops and implements sustainable engineering solutions that respect the current social and environmental impacts, as well as future implications of our designs. CBCL operates from its twelve offices in Ottawa, ON, Halifax and Sydney, NS; Charlottetown, Private Equity; Saint John, Fredericton and Moncton, NB; and St. John's, NL, CBCL Limited strives to provide a diverse workplace that is inclusive, accessible and celebrates individuals and what makes us unique. Accommodations are available upon request for candidates taking part in all aspects of the recruitment process. Please contact hr@cbcl.ca. We thank all applicants for their interest, but only those applicants who are selected to interview will be contacted.",
    "processed_description": "exciting office Intermediate Biologist Environmental Scientist specialize expertise follow specialized area specie risk wetland terrestrial avian aquatic biology climate change adaption . . collaborative team foster development skill grow . successful dynamic multi disciplined engineering environmental firm grow team . employee organization drive passion employee . CBCL's culture shape atlantic canadian root extend . entrepreneurial spirit share corporate diversity inclusion improve community live . Key responsibility provide consulting service capacity Intermediate Biologist relate area expertise provide include conduct field survey report preparation . support client Federal Provincial municipal environmental legislation policy requirement . provide technical direction leadership environmental project team achieve compliance quality standard relevant regulation . collaboration environmental team project manager engineering department . mentor direct junior staff collaborate environmental professional . provide input relate growth business development planning . build support client relationship . lead preparation proposal submission include development project scope schedule budget appropriate . potential travel international location . Uphold CBCL's safety culture adhere company safety protocol program applicable health safety regulation . maintain compliance specific client site specific health safety protocol program require . Capabilities Credentials Bachelor Master's degree Biology Ecology Zoology . minimum year' environmental consulting relevant environmental industry include prior field wetland delineation functional assessment stream culvert assessment vegetation survey aquatic invertebrate collection identification . certification relevant one's area practice Wetland Evaluation System owes ELC OSAP Benthos Biomonitoring Network OBBN electro fishing certification Class Environmental assessment . Provincial Policy statement . strong team player excellent interpersonal skill strong oral write communication skill strong analytical skill attention detail problem solving decision capability . strong interpersonal organization management skill . highly professional demeanor emphasis client service client profile management . eligible security requirement contract . Applicant valid class driver's license . consider strong asset . offer competitive compensation package effective employment comprehensive health dental benefit Defined contribution pension Plan employer contribution generous vacation allowance commensurate respect life balance flexible environment remote option employee ownership potential employer contribution maternity leave lifelong learning subsidization community volunteering incentive addition benefit offer location support life balance include hybrid remote option diverse team wide range expertise exposure variety project support develop skill pursue project relate interest collaboration multiple discipline level expertise mentor foster personal professional development accessible central office access training area range technical development leadership skill . employee firm people . committed promote inclusivity diversity workplace thrive build long term relationship client provide innovative solution . earn recognition . multitalented group professional offer consult Infrastructure Water Wastewater Buildings Industrial Earth Environment sector . people community history forward continue steady growth . commitment reduce carbon footprint corporately develop implement sustainable engineering solution respect current social environmental impact future implication design . operate office strive provide diverse workplace inclusive accessible celebrate individual unique . accommodation request aspect recruitment process . contact . applicant interest applicant select interview contact .",
    "results_group": {
        "extracted_noun_chunks": [
            "strong asset",
            "highly professional demeanor emphasis client service client profile management",
            "certification",
            "input",
            "respect",
            "Capabilities Credentials Bachelor Master's degree",
            "Infrastructure Water Wastewater Buildings Industrial Earth Environment sector",
            "eligible security requirement contract",
            "team",
            "current social environmental impact future implication design",
            "relevant one's area practice Wetland Evaluation System",
            "conduct field survey report preparation",
            "technical direction leadership environmental project team",
            "compliance quality standard relevant regulation",
            "inclusivity diversity workplace",
            "competitive compensation package effective employment comprehensive health dental benefit Defined contribution pension Plan employer contribution generous vacation allowance commensurate respect life balance flexible environment remote option employee ownership potential employer contribution maternity",
            "employee organization",
            "skill pursue project",
            "compliance specific client site specific health safety protocol program",
            "strong interpersonal organization management skill",
            "steady growth",
            "Applicant valid class driver's license",
            "innovative solution",
            "lifelong learning subsidization community volunteering incentive addition benefit offer location support life balance",
            "strong analytical skill attention detail problem",
            "decision capability",
            "office",
            "successful dynamic multi disciplined engineering environmental firm",
            "long term relationship client",
            "interest collaboration multiple discipline level expertise mentor foster personal professional development accessible central office access training area range technical development leadership skill",
            "commitment",
            "prior field wetland delineation functional assessment stream culvert assessment vegetation survey aquatic invertebrate collection identification",
            "entrepreneurial spirit share corporate diversity inclusion",
            "preparation proposal submission",
            "Provincial Policy statement",
            "hybrid remote option diverse team wide range expertise exposure variety project support",
            "exciting office Intermediate Biologist Environmental Scientist",
            "consulting service capacity Intermediate Biologist",
            "Uphold CBCL's safety culture",
            "company safety protocol program applicable health safety regulation",
            "support client Federal Provincial municipal environmental legislation policy requirement",
            "applicant interest applicant select interview contact",
            "ELC OSAP Benthos Biomonitoring Network OBBN electro fishing certification Class Environmental assessment",
            "sustainable engineering solution",
            "recognition",
            "area expertise provide",
            "contact",
            "employee firm people",
            "potential travel international location",
            "strong team player excellent interpersonal skill",
            "mentor direct junior staff",
            "expertise",
            "environmental professional",
            "specialized area specie risk wetland terrestrial avian aquatic biology climate change adaption",
            "collaboration environmental team project manager engineering department",
            "minimum year' environmental consulting relevant environmental industry",
            "support client relationship",
            "people community history",
            "multitalented group professional offer",
            "carbon footprint",
            "community",
            "accommodation request aspect recruitment process",
            "collaborative team foster development skill",
            "growth business development planning",
            "Biology Ecology Zoology",
            "Key responsibility"
        ],
        "combined_lemmatized_tokens": "exciting office Intermediate Biologist Environmental Scientist specialize expertise follow specialized area specie risk wetland terrestrial avian aquatic biology climate change adaption . . collaborative team foster development skill grow . successful dynamic multi disciplined engineering environmental firm grow team . employee organization drive passion employee . CBCL's culture shape atlantic canadian root extend . entrepreneurial spirit share corporate diversity inclusion improve community live . Key responsibility provide consulting service capacity Intermediate Biologist relate area expertise provide include conduct field survey report preparation . support client Federal Provincial municipal environmental legislation policy requirement . provide technical direction leadership environmental project team achieve compliance quality standard relevant regulation . collaboration environmental team project manager engineering department . mentor direct junior staff collaborate environmental professional . provide input relate growth business development planning . build support client relationship . lead preparation proposal submission include development project scope schedule budget appropriate . potential travel international location . Uphold CBCL's safety culture adhere company safety protocol program applicable health safety regulation . maintain compliance specific client site specific health safety protocol program require . Capabilities Credentials Bachelor Master's degree Biology Ecology Zoology . minimum year' environmental consulting relevant environmental industry include prior field wetland delineation functional assessment stream culvert assessment vegetation survey aquatic invertebrate collection identification . certification relevant one's area practice Wetland Evaluation System owes ELC OSAP Benthos Biomonitoring Network OBBN electro fishing certification Class Environmental assessment . Provincial Policy statement . strong team player excellent interpersonal skill strong oral write communication skill strong analytical skill attention detail problem solving decision capability . strong interpersonal organization management skill . highly professional demeanor emphasis client service client profile management . eligible security requirement contract . Applicant valid class driver's license . consider strong asset . offer competitive compensation package effective employment comprehensive health dental benefit Defined contribution pension Plan employer contribution generous vacation allowance commensurate respect life balance flexible environment remote option employee ownership potential employer contribution maternity leave lifelong learning subsidization community volunteering incentive addition benefit offer location support life balance include hybrid remote option diverse team wide range expertise exposure variety project support develop skill pursue project relate interest collaboration multiple discipline level expertise mentor foster personal professional development accessible central office access training area range technical development leadership skill . employee firm people . committed promote inclusivity diversity workplace thrive build long term relationship client provide innovative solution . earn recognition . multitalented group professional offer consult Infrastructure Water Wastewater Buildings Industrial Earth Environment sector . people community history forward continue steady growth . commitment reduce carbon footprint corporately develop implement sustainable engineering solution respect current social environmental impact future implication design . operate office strive provide diverse workplace inclusive accessible celebrate individual unique . accommodation request aspect recruitment process . contact . applicant interest applicant select interview contact ."
    }
}