{
    "id": "c01fd5b4266bd4fc",
    "company": "Canadian Food Inspection Agency",
    "positionName": "Veterinary Anatomic Pathologist - AMENDMENT",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-01T20:09:51.743Z",
    "url": "https://www.indeed.ca/rc/clk?jk=c01fd5b4266bd4fc&from=jasx&tk=1he3lmb38joqj800&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=c01fd5b4266bd4fc&atk=&xpse=SoDB67I3IDjVM8yRbJ0LbzkdCdPP",
    "companyDescription": "",
    "description": "Canadian Food Inspection Agency - Science Branch \n    Ottawa (Ontario) - The incumbent must be present in the laboratory. \n    VM-04 \n    $113,150 to $134,058 \n   For further information on the organization, please visit Canadian Food Inspection Agency \n   Closing date: 3 November 2023 - 23:59, Pacific Time \n   Who can apply: Persons residing in Canada and Canadian citizens residing abroad. \n   Apply online \n  \n \n Important messages \n We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process. If you need to be accommodated during any phase of the evaluation process, please use the Contact information below to request specialized accommodation. All information received in relation to accommodation will be kept confidential.\n  Assessment accommodation \n When you apply to this selection process, you are not applying for a specific job, but to an inventory for future vacancies.   The sooner you submit your application into the inventory, the sooner you may be referred for opportunities.  There is currently an opportunity to staff in the Ottawa Animal Health Laboratory. We’re asking applicants who are interested in this opportunity to apply by December 05, 2021 - 23:59, Pacific Time to be considered for the first round of assessment. \n \n  Please be advised that CFIA has suspended it’s Policy on COVID-19 Vaccination. Accordingly, this poster has been amended to remove references to MANDATORY COVID-19 VACCINATION in the Important messages and Conditions of employment sections.\n \n  The Canadian Food Inspection Agency (CFIA) is a separate employer and is not subject to the Public Service Employment Act.\n  \n  The CFIA considers applications from individuals who have legal status to work in Canada and does not give preference to Canadian citizens.\n  \n  We will only accept applications received through the GC Jobs website, therefore you must submit your application by clicking on “Apply online” in this advertisement. Persons who are unable to apply online must use the “Contact information” below, prior to the closing date, to request specialized accommodation. \n Duties\n  The mandate of the Ottawa Animal Health Laboratory (OAHL) is primarily to offer diagnostic and research services in the field of veterinary transmissible spongiform encephalopathies (TSE) and bacterial diseases, chiefly for those regulated by the Government of Canada.   List of notifiable diseases in Canada: https://inspection.canada.ca/animal-health/terrestrial-animals/diseases/reportable/eng/1303768471142/1303768544412   List of immediately notifiable diseases in Canada: https://inspection.canada.ca/animal-health/terrestrial-animals/diseases/immediately-notifiable/eng/1305670991321/1305671848331   Reporting directly to the OAHL Director, the position is responsible for providing diagnostic pathology services for diseases of high priority to CFIA, pathology support for meat inspection and forensic pathology services for animal welfare. Bovine tuberculosis, scrapie and chronic wasting disease are the main priorities in anatomic pathology at OAHL.  Leading a technical team, the incumbent ensures compliance with ISO 17025 certification, manages assets and human and financial resources. The pathologist also provides advice to internal and external CFIA clients, contributors and senior management. The incumbent plays an important role in various research projects by providing pathology services and advice to project leads or collaborators. The pathologist will formulate recommendations to clients, senior management and international stakeholders on animal disease prevention, control, laboratory diagnosis and sample collection.  The incumbent must be present in the laboratory. \n Work environment\n  We offer a bilingual, science-based environment, with excellent benefits, flexible hours, opportunities for advancement, an emphasis on learning and development, and a high level of employee satisfaction. Join a workforce that’s as diverse as the people it serves. You can find some more great reasons to join us on our website: http://www.inspection.gc.ca/about-the-cfia/cfia-jobs/top-10-reasons-to-join-us/eng/1299859095075/1299859142835 \n Intent of the process \n The intent is to have an inventory of candidates to draw from when vacancies arise for current and future needs of the CFIA. Applications will be accepted on an ongoing basis as long as the poster is active.  This inventory may be used to staff positions with similar qualifications, with various language requirements, various conditions of employment and/or various tenures including term appointments, indeterminate appointments, acting appointments and/or assignments. This inventory may also be used to staff positions at the VM-03 group and level. \n Positions to be filled: 1 \n Information you must provide \n Your résumé. \n In order to be considered, your application must clearly explain how you meet the following (essential qualifications)\n \n   You must meet all essential qualifications in order to be appointed to the position. Other qualifications may be a deciding factor in choosing the person to be appointed. Some essential and other qualifications will be assessed through your application. It is your responsibility to provide appropriate examples that illustrate how you meet each qualification. Failing to do so could result in your application being rejected.\n   \n   ESSENTIAL EDUCATION\n   \n   EEd1 Graduation from a recognized school of Veterinary Medicine, defined as:\n   \n  \n   graduation from a veterinary school accredited or approved by the Canadian Veterinary Medical Association (CVMA); or\n   graduation from another veterinary school and holding a Certificate of Qualification (Parts A, B & C) granted by the National Examining Board of the CVMA.\n  \n   EEd2 Post-graduate degree in a position-related field providing eligibility for board certification by the American College of Veterinary Pathologists or the European College of Veterinary Pathologists. \n   \n   Applicants submitting education credentials from a non-Canadian institution are responsible for obtaining certification that these credentials are the equivalent of the Canadian education level required for the position. \n   \n   Please refer to the link below for more information.\n \n  Degree equivalency\n \n   ESSENTIAL OCCUPATIONAL CERTIFICATION\n   \n   Eligibility for membership in a Canadian veterinary association, defined as:\n   \n  \n   current members of a Canadian veterinary association with a license recognized by the Canadian Veterinary Medical Association; and\n   non-members of Canadian veterinary associations holding a Certificate of Qualification granted by the National Examining Board (NEB) of the CVMA.\n  \n \n \n   ESSENTIAL EXPERIENCE\n   \n   EE1 Significant* experience in delivering veterinary anatomic pathology diagnostic laboratory services.\n   \n   \n  \n   Significant is defined as extensive and substantial experience normally associated with the performance of full-time duties over a period of at least two years, or acquired during a relevant pathology training program.\n  \n   EE2 Experience working with various stakeholders (e.g., clients, industry, educational institutions, researchers/project leads, regulatory/international bodies).\n   \n   EE3 Experience in assembling, summarizing and analyzing scientific information or data with a view to providing advice or recommendations or making science-based decisions.\n \n  The following will be applied / assessed at a later date (essential for the job)\n  Various language requirements Official languages proficiency will not be assessed for entry to the pool. Candidates entered in the pool will have an opportunity for assessment of their official languages proficiency if and when they are considered for an appointment.  For acting appointments and assignments, the candidate may not be required to meet the language requirements of the position.\n  Information on language requirements\n  The following may be applied / assessed at a later date (may be needed for the job)\n  ASSET EDUCATION  AEd1 Post-graduate degree (at least three years of studies) in diagnostic anatomic pathology.  AEd2 Diplomate of the American College of Veterinary Pathologists or of the European College of Veterinary Pathologists.\n  Degree equivalency\n \n   ASSET EXPERIENCE\n   \n   AEx1 Recent* experience in delivering veterinary pathology diagnostic laboratory services.\n   \n   \n  \n   Recent experience is defined as experience normally acquired within the last five (5) years.\n  \n   AEx2 Experience in providing veterinary pathology diagnostic services in the area of meat hygiene. \n   \n   AEx3 Experience in providing veterinary pathology expertise in the area of animal welfare.\n \n  Conditions of employment\n  Reliability Status security clearance - Applicants who have not lived in Canada for the past five (or ten, depending on security level) years may be required to submit a police certificate from each country in which they have lived for six months or more during this period, as well as other documentation required for the security screening process. Failure to submit this documentation if requested, will result in the elimination of your application\n \n   The following conditions of employment are required for an appointment:\n   \n  \n   Adherence to the CFIA Code of Conduct.\n   Adherence to the CFIA Conflict of Interest and Post-Employment Policy. \n   Compliance with the Values and Ethics Code for the Public Sector.\n   Legal status to accept employment for the entire period of employment.\n  \n   Any of the following conditions of employment may be required for an appointment:\n   \n  \n   Medical suitability: Pass a Pre-placement Health Evaluation and Periodic Health Evaluation.\n   To use in the prescribed circumstances and manner all prescribed safety materials, equipment, devices and clothing.\n   To use prescribed and provided respiratory equipment that meets the respiratory program requirements; to undergo fit testing (e.g. may need to be clean-shaven, depending on the respirator design).\n   Willingness to abide by strict biosecurity protocols which may require showering several times a day or abiding by certain restrictions on contact with livestock outside of the workplace.\n   Willing and able to work in environmentally challenging or physically demanding conditions and with pathogens in high security laboratory biocontainment or with potential allergens.\n   Willing and available to travel, as required.\n   Willing and available to work overtime, as required.\n  \n  \n Other information \n The Canadian Food Inspection Agency is committed to building a skilled and diverse workforce that reflects the Canadians we serve. We promote employment equity and encourage you to indicate if you belong to one of the designated groups when you apply. \n Personal information is obtained for the purpose of determining an individual’s competence and suitability for employment. If a staffing complaint questions this determination, please be advised that relevant personal information you will provide in the course of this staffing process may be disclosed to substantiate the staffing decision.  You are entitled to participate in the staffing process in the official language of your choice.  For this staffing process, the CFIA will communicate with you by email. You must provide a valid email address to which you wish to receive communication regarding this staffing process. You must ensure that you check your email account including spam, promotion or other folders regularly as there may be a deadline for responses. If you respond past the deadline you risk being removed from the staffing process.  Applicants who are screened in to this staffing process will be sent further information by email regarding what to expect during subsequent phases of this staffing process.  During the application or assessment process both cheating and plagiarism are considered forms of misconduct and are not permitted. Any person found cheating, including those who help others to cheat, may be subject to removal from the staffing process.  A current copy of your resume may be used as another source to confirm the education and experience you will be asked to describe in the screening questions. It may also be reviewed by prospective hiring managers at the appointment stage.  For more information on how to apply to a CFIA staffing process, please visit: https://inspection.gc.ca/about-the-cfia/job-opportunities/how-to-apply/eng/1340676915348/1340679107182  You will be asked to provide proof of your education credentials later in the staffing process.  Various assessment tools may be used in this staffing process such as: standardized tests, reference checks, written tests, an interview, etc.  All written and verbal communication obtained throughout the staffing process, from the time of application to close of process, may be used to evaluate the candidate. \n We thank all those who apply. Only those selected for further consideration will be contacted."
}