{
    "id": "c2ed9cc30cc5fd72",
    "companyDescription": "",
    "description": "Position Overview\n  The Director, Event Technology II (DET II) is responsible for leading a successful sales and operations team to achieve the revenue and profitability goals of an assigned location(s). This position ensures the team delivers World-Class service while cultivating and maintaining relationships with key venue personnel to enhance the overall business relationship with the venue. The DET II promotes high performance, accountability and continuous improvement in the team and fosters a collaborative environment that values learning and a commitment to quality. This role will report to an Area Director, Venues or an RVP, Venues.\n  Key Job Responsibilities\n  Account Management\n \n  Develop and maintain strong relationships with clients at all levels of their organization and provide outstanding customer service while focusing on customer retention.\n  Service high profile/visibility events and act as a point of escalation when needed.\n  Identify key issues and decision makers that will influence the contract renewal and leverage all available internal resources to facilitate the planning effort for renewing existing business.\n  Partners with Venue Sales Leadership on sales strategies\n  Creates and participate in business review presentations.\n \n  Financial Management and Reporting\n \n  Drive Results by managing an efficient and profitable operation with a focused approach on revenue maximization and profitability using cost control measures in accordance with the company’s standard operating procedures.\n  Strategically ensure event profitability is maintained based on proper staffing per event\n  Achieves ENCORE’s financial goals for the location(s) by effectively directing the management of labor, equipment sub-rentals and other costs.\n  Train and directs operations and sales managers to complete standard and ad hoc reports.\n  Complete and analyze reports to effectively manage the business.\n  Enforce the utilization of the company billing system, coordination of invoicing activities and that billing is reviewed and approved by clients.\n  Review location P & L and develops action plans to address deficiencies/grow the business\n  Confirm venue partners process all payments to ENCORE in a timely basis.\n \n  Operations Management\n \n  Responsible for the strategic, long-term direction of large and small high tech, high volume events at the property\n  Direct operations team to manage daily floor operations including scheduling and equipment setups, operation, and strikes are completed, and in accordance to brand standards.\n  Confirm operations team is using inventory control procedures to maintain proper inventory levels while also maintaining safety, security, and quality assurance of equipment.\n  See the Big Picture by efficiently sharing labor and equipment within the local market.\n  Guarantees a ENCORE management presence at all venue meetings, such as daily stand ups or sales meetings.\n  See the Big Picture by analyzing schedules and available labor and equipment resources and makes recommendations for labor and equipment sharing within local markets.\n \n \n  Sales Management\n \n  Hold Sales Manager and/or Sr. Sales Manager accountable to maintaining a healthy pipeline at all times to achieve established revenue targets.\n  Confirm all known opportunities are in CRM and completed accurately and updated at all times.\n  See the Big Picture by leading the sales forecasting efforts at home location(s), ensuring they are accurate and submitted timely.\n  Create and present information and reports, as needed, to senior management related to performance, pipeline, forecasting, etc.\n  Maintain knowledge of new product/service offerings and emerging technology supporting meetings and events.\n \n  Customer Service\n \n  Deliver World-Class Service by cultivating and maintaining relationships with customers, venue personnel and various ENCORE supporting functions and departments.\n  Lead the team to exceed the expectations and needs of internal and external customers.\n  Meet with guests on site or assigns this to a team member, and verify equipment is setup accurately and working properly to customer needs, and verify the team is monitoring each event and checking in on customers throughout the day.\n  Enforce the guidelines in the Employee Guide and/or venue standards for the team to portray a polished and professional image.\n \n  People Development\n \n  Value People by promoting a culture of high performance, accountability and continuous improvement that values learning and a commitment to quality.\n  Directs and Manages performance, addresses employee concerns, maintains adequate staffing levels, and facilitates team development.\n  Navigate the union labor market and associated management dynamics, where applicable.\n  Directs and Manages the human resources activities including selection, performance management, and learning.\n  Directs and provides focused and continued coaching to develop the skills of team members.\n  Verifies that employees are trained on ENCORE standards for service and equipment, and properly trained on company computer systems.\n  Recommends team members for training opportunities, as needed\n \n  Job Qualifications\n \n  High School Diploma is required. Bachelor’s degree is preferred.\n  5+ years of audio visual experience\n  5+ years of sales/customer service experience\n  3+ years of operations supervisory/management experience\n  Proficiency with the use of computer hardware\n  Proficiency with computer software and programs, including the Internet and Microsoft Office\n  Effective leadership abilities and customer satisfaction and people development focus.\n  A valid driver’s license is required for team members who may operate Company vehicles.\n \n \n  Work Environment\n  Work is performed in a venue/convention center environment with moderate exposure to outdoor temperatures and to dirt, sand and/or dust. The working conditions will vary between moderately quiet to noisy volumes. Team members will use high-end audio visual equipment and electrical components, and will be exposed to heights via lifts and ladders. Team members may be asked to work in multiple venue locations. Working times will include irregular hours and on-call status including days, evenings, weekends and holidays. Team members must adhere to appearance guidelines as defined by ENCORE based on an individual venue or a representation of venues in that city or area.",
    "preprocessed_description": "Position Overview The Director, Event Technology II (DET II) is responsible for leading a successful sales and operations team to achieve the revenue and profitability goals of an assigned location(s). This position ensures the team delivers World-Class service while cultivating and maintaining relationships with key venue personnel to enhance the overall business relationship with the venue. The DET II promotes high performance, accountability and continuous improvement in the team and fosters a collaborative environment that values learning and a commitment to quality. This role will report to an Area Director, Venues or an RVP, Venues. Key Job Responsibilities Account Management Develop and maintain strong relationships with clients at all levels of their organization and provide outstanding customer service while focusing on customer retention. Service high profile/visibility events and act as a point of escalation when needed. Identify key issues and decision makers that will influence the contract renewal and leverage all available internal resources to facilitate the planning effort for renewing existing business. Partners with Venue Sales Leadership on sales strategies Creates and participate in business review presentations. Financial Management and Reporting Drive Results by managing an efficient and profitable operation with a focused approach on revenue maximization and profitability using cost control measures in accordance with the company's standard operating procedures. Strategically ensure event profitability is maintained based on proper staffing per event Achieves ENCORE's financial goals for the location(s) by effectively directing the management of labor, equipment sub-rentals and other costs. Train and directs operations and sales managers to complete standard and ad hoc reports. Complete and analyze reports to effectively manage the business. Enforce the utilization of the company billing system, coordination of invoicing activities and that billing is reviewed and approved by clients. Review location P & L and develops action plans to address deficiencies/grow the business Confirm venue partners process all payments to ENCORE in a timely basis. Operations Management Responsible for the strategic, long-term direction of large and small high tech, high volume events at the property Direct operations team to manage daily floor operations including scheduling and equipment setups, operation, and strikes are completed, and in accordance to brand standards. Confirm operations team is using inventory control procedures to maintain proper inventory levels while also maintaining safety, security, and quality assurance of equipment. See the Big Picture by efficiently sharing labor and equipment within the local market. Guarantees a ENCORE management presence at all venue meetings, such as daily stand ups or sales meetings. See the Big Picture by analyzing schedules and available labor and equipment resources and makes recommendations for labor and equipment sharing within local markets. Sales Management Hold Sales Manager and/or Sr. Sales Manager accountable to maintaining a healthy pipeline at all times to achieve established revenue targets. Confirm all known opportunities are in Customer Relationship Management and completed accurately and updated at all times. See the Big Picture by leading the sales forecasting efforts at home location(s), ensuring they are accurate and submitted timely. Create and present information and reports, as needed, to senior management related to performance, pipeline, forecasting, etc. Maintain knowledge of new product/service offerings and emerging technology supporting meetings and events. Customer Service Deliver World-Class Service by cultivating and maintaining relationships with customers, venue personnel and various ENCORE supporting functions and departments. Lead the team to exceed the expectations and needs of internal and external customers. Meet with guests on site or assigns this to a team member, and verify equipment is setup accurately and working properly to customer needs, and verify the team is monitoring each event and checking in on customers throughout the day. Enforce the guidelines in the Employee Guide and/or venue standards for the team to portray a polished and professional image. People Development Value People by promoting a culture of high performance, accountability and continuous improvement that values learning and a commitment to quality. Directs and Manages performance, addresses employee concerns, maintains adequate staffing levels, and facilitates team development. Navigate the union labor market and associated management dynamics, where applicable. Directs and Manages the human resources activities including selection, performance management, and learning. Directs and provides focused and continued coaching to develop the skills of team members. Verifies that employees are trained on ENCORE standards for service and equipment, and properly trained on company computer systems. Recommends team members for training opportunities, as needed Job Qualifications High School Diploma is required. Bachelor's degree is preferred. 5+ years of audio visual experience 5+ years of sales/customer service experience 3+ years of operations supervisory/management experience Proficiency with the use of computer hardware Proficiency with computer software and programs, including the Internet and Microsoft Office Effective leadership abilities and customer satisfaction and people development focus. A valid driver's license is required for team members who may operate Company vehicles. Work Environment Work is performed in a venue/convention center environment with moderate exposure to outdoor temperatures and to dirt, sand and/or dust. The working conditions will vary between moderately quiet to noisy volumes. Team members will use high-end audio visual equipment and electrical components, and will be exposed to heights via lifts and ladders. Team members may be asked to work in multiple venue locations. Working times will include irregular hours and on-call status including days, evenings, weekends and holidays. Team members must adhere to appearance guidelines as defined by ENCORE based on an individual venue or a representation of venues in that city or area.",
    "processed_description": "Position Overview Director Event Technology II DET II responsible lead successful sale operation team achieve revenue profitability goal assign location . position ensure team deliver class service cultivate maintain relationship key venue personnel enhance business relationship venue . DET II promote high performance accountability continuous improvement team foster collaborative environment learn commitment quality . role report Area Director venue RVP venue . Key Responsibilities Account Management Develop maintain strong relationship client level organization provide outstanding customer service focus customer retention . service high profile visibility event point escalation . identify key issue decision maker influence contract renewal leverage internal resource facilitate planning effort renew exist business . partner Venue Sales Leadership sale strategy create participate business review presentation . Financial Management Reporting Drive result manage efficient profitable operation focused approach revenue maximization profitability cost control measure company's standard operating procedure . strategically ensure event profitability maintain base proper staffing event achieve ENCORE's financial goal location effectively direct management labor equipment rental cost . train direct operation sale manager complete standard ad hoc report . complete analyze report effectively manage business . enforce utilization company billing system coordination invoicing activity billing review approve client . develop action plan address deficiency grow business Confirm venue partner process payment timely basis . strategic long term direction large small high tech high volume event property Direct operation team manage daily floor operation include scheduling equipment setup operation strike complete brand standard . confirm operation team inventory control procedure maintain proper inventory level maintain safety security quality assurance equipment . Big Picture efficiently share labor equipment local market . guarantee ENCORE management presence venue meeting daily stand sale meeting . Big Picture analyze schedule labor equipment resource recommendation labor equipment sharing local market . sale Management hold Sales Manager Sr . Sales Manager accountable maintain healthy pipeline achieve establish revenue target . confirm complete accurately update . Big Picture lead sale forecasting effort location ensure accurate submit timely . create information report senior management relate performance pipeline forecasting . maintain knowledge product service offering emerge technology support meeting event . cultivate maintain relationship customer venue personnel ENCORE support function department . lead team exceed expectation internal external customer . meet guest site assign team verify equipment setup accurately properly customer verify team monitor event check customer . enforce guideline Employee Guide venue standard team portray polished professional image . People Development People promote culture high performance accountability continuous improvement learn commitment quality . direct Manages performance address employee concern maintain adequate staffing level facilitate team development . navigate union labor market associated management dynamic applicable . direct manage human resource activity include selection performance management learn . direct provide focused continue coaching develop skill team . verifie employee train ENCORE standard service equipment properly train company computer system . recommend team training require . Bachelor's degree prefer . audio visual sale customer service operation supervisory management proficiency computer hardware proficiency computer software program include internet Microsoft Office effective leadership customer satisfaction people development focus . valid driver's license require team operate company vehicle . Environment perform venue convention center environment moderate exposure outdoor temperature dirt sand dust . working condition vary moderately quiet noisy volume . team high audio visual equipment electrical component expose height lift ladder . team multiple venue location . working include status include evening weekend holiday . team adhere appearance guideline define base individual venue representation venue city area .",
    "results_group": {
        "extracted_noun_chunks": [
            "high performance accountability continuous improvement team foster collaborative environment",
            "audio visual sale customer service operation supervisory management proficiency computer hardware proficiency computer software program",
            "business relationship venue",
            "revenue target",
            "sale Management",
            "internet Microsoft Office effective leadership customer satisfaction people development focus",
            "event profitability",
            "skill team",
            "scheduling equipment setup operation strike complete brand standard",
            "technology support meeting event",
            "Environment",
            "customer",
            "direct provide",
            "company computer system",
            "train direct operation sale manager complete standard ad hoc report",
            "participate business review presentation",
            "Bachelor's degree",
            "local market",
            "complete accurately update",
            "expectation internal external customer",
            "outstanding customer service",
            "efficient profitable operation focused approach revenue maximization profitability cost control measure company's standard operating procedure",
            "team multiple venue location",
            "lead team",
            "information report",
            "stand sale meeting",
            "polished professional image",
            "culture high performance accountability continuous improvement",
            "base individual venue representation venue city area",
            "safety security quality assurance equipment",
            "action plan address deficiency",
            "complete analyze report",
            "team monitor event",
            "performance pipeline forecasting",
            "exist business",
            "ENCORE's financial goal location",
            "proper inventory level",
            "venue convention center environment moderate exposure outdoor temperature dirt sand dust",
            "Position Overview Director Event Technology II DET II responsible lead successful sale operation team",
            "equipment setup",
            "Big Picture",
            "service high profile visibility event point escalation",
            "utilization company billing system coordination invoicing activity billing review",
            "appearance guideline",
            "knowledge product service offering",
            "People Development People",
            "team development",
            "customer retention",
            "commitment quality",
            "working condition",
            "guideline Employee Guide venue standard team",
            "key issue decision maker influence contract renewal leverage internal resource",
            "relationship key venue personnel",
            "operation team inventory control procedure",
            "senior management",
            "team",
            "verifie employee train ENCORE standard service equipment",
            "partner Venue Sales Leadership sale strategy",
            "proper staffing event",
            "human resource activity",
            "strategic long term direction large small high tech high volume event property Direct operation team",
            "status",
            "Financial Management Reporting Drive result",
            "Big Picture lead sale forecasting effort location",
            "strong relationship client level organization",
            "Key Responsibilities Account Management Develop",
            "business Confirm venue partner process payment timely basis",
            "relationship customer venue personnel ENCORE support function department",
            "labor equipment resource recommendation labor equipment",
            "selection performance management",
            "company vehicle",
            "healthy pipeline",
            "Sales Manager Sr",
            "daily floor operation",
            "guest site assign team",
            "direct Manages performance address employee concern",
            "position",
            "class service cultivate",
            "moderately quiet noisy volume",
            "height lift ladder",
            "team high audio visual equipment electrical component",
            "base",
            "effectively direct management labor equipment rental cost",
            "DET II",
            "revenue profitability goal assign location",
            "evening weekend holiday",
            "planning effort",
            "role report Area Director venue RVP venue",
            "valid driver's license",
            "business",
            "labor equipment local market",
            "client"
        ],
        "combined_lemmatized_tokens": "Position Overview Director Event Technology II DET II responsible lead successful sale operation team achieve revenue profitability goal assign location . position ensure team deliver class service cultivate maintain relationship key venue personnel enhance business relationship venue . DET II promote high performance accountability continuous improvement team foster collaborative environment learn commitment quality . role report Area Director venue RVP venue . Key Responsibilities Account Management Develop maintain strong relationship client level organization provide outstanding customer service focus customer retention . service high profile visibility event point escalation . identify key issue decision maker influence contract renewal leverage internal resource facilitate planning effort renew exist business . partner Venue Sales Leadership sale strategy create participate business review presentation . Financial Management Reporting Drive result manage efficient profitable operation focused approach revenue maximization profitability cost control measure company's standard operating procedure . strategically ensure event profitability maintain base proper staffing event achieve ENCORE's financial goal location effectively direct management labor equipment rental cost . train direct operation sale manager complete standard ad hoc report . complete analyze report effectively manage business . enforce utilization company billing system coordination invoicing activity billing review approve client . develop action plan address deficiency grow business Confirm venue partner process payment timely basis . strategic long term direction large small high tech high volume event property Direct operation team manage daily floor operation include scheduling equipment setup operation strike complete brand standard . confirm operation team inventory control procedure maintain proper inventory level maintain safety security quality assurance equipment . Big Picture efficiently share labor equipment local market . guarantee ENCORE management presence venue meeting daily stand sale meeting . Big Picture analyze schedule labor equipment resource recommendation labor equipment sharing local market . sale Management hold Sales Manager Sr . Sales Manager accountable maintain healthy pipeline achieve establish revenue target . confirm complete accurately update . Big Picture lead sale forecasting effort location ensure accurate submit timely . create information report senior management relate performance pipeline forecasting . maintain knowledge product service offering emerge technology support meeting event . cultivate maintain relationship customer venue personnel ENCORE support function department . lead team exceed expectation internal external customer . meet guest site assign team verify equipment setup accurately properly customer verify team monitor event check customer . enforce guideline Employee Guide venue standard team portray polished professional image . People Development People promote culture high performance accountability continuous improvement learn commitment quality . direct Manages performance address employee concern maintain adequate staffing level facilitate team development . navigate union labor market associated management dynamic applicable . direct manage human resource activity include selection performance management learn . direct provide focused continue coaching develop skill team . verifie employee train ENCORE standard service equipment properly train company computer system . recommend team training require . Bachelor's degree prefer . audio visual sale customer service operation supervisory management proficiency computer hardware proficiency computer software program include internet Microsoft Office effective leadership customer satisfaction people development focus . valid driver's license require team operate company vehicle . Environment perform venue convention center environment moderate exposure outdoor temperature dirt sand dust . working condition vary moderately quiet noisy volume . team high audio visual equipment electrical component expose height lift ladder . team multiple venue location . working include status include evening weekend holiday . team adhere appearance guideline define base individual venue representation venue city area ."
    }
}