{
    "id": "f2efb3bb5c76332c",
    "companyDescription": "The federal government of Canada is the body responsible for the federal administration of Canada. A constitutional monarchy, the Crown is the corporation sole, assuming distinct roles: the executive, as the Queen-in-Council; the legislature, as the Queen-in-Parliament; and the courts, as the Queen-on-the-Bench.",
    "description": "Great Minds. One Goal. Canada's Success.\n     \n     \n    Help bring research to life and drive your career forward with the National Research Council of Canada (NRC), Canada's largest research and technology organization.\n     \n     \n    Do you possess a keen interest in technology and an inquisitive nature? We’re seeking an Application Development Analyst who is enthusiastic about analytical challenges and committed to exceeding client expectations. The right individual will align with our foundational values of Integrity, Excellence, Respect, and Creativity.\n     \n     \n    This position provides and contributes to analysis and research for the development of Grants and Contribution Online Applications and services and other IT business solutions required to deliver on the Department’s operational mandate.\n     \n     \n    Key Activities: \n    \n     Works with clients and stakeholders to elicit, analyze, define, model and document IT requirements. Ensure requirements are documented according to established standards and following Agile best practices. \n     Acts as a liaison between clients, technical and testing teams to ensure that the detailed business and IT requirements are clearly understood. \n     Participates in project teams and liaises and collaborates with stakeholders. Occasionally leads short-term teams or components of a large project. Prepares work plans and explains and provides technical information to new staff as required. \n     Contributes to the continuous improvement of the IT business solutions environment through activities such as research, learning, and collaboration, departmental working groups, soliciting and responding to stakeholder, client and technical feedback. \n    \n   \n  \n  \n   \n    Screening Criteria \n   \n   \n     Applicants must demonstrate within the content of their application that they meet the following screening criteria in order to be given further consideration as candidates: \n   \n  \n  \n   \n     Education \n   \n   \n     Bachelor degree in Computer Science from a recognized University or a Technical College diploma in Computer Science or related field. An equivalent combination of education and direct experience may be considered.\n     \n     \n    For information on certificates and diplomas issued abroad, please see Degree equivalency \n   \n  \n  \n   \n     Experience \n   \n   \n    \n     Experience working with client and stakeholders to elicit and analyze IT requirements. \n     Experience documenting (e.g. Use Cases, Wireframes, User Stories) and modeling processes or requirements. \n     Experience working in an Agile / SCRUM environment, developing and monitoring features and user stories, participating in stands-up, sprint planning and retrospectives. \n     Experience liaising between stakeholders, developers and quality assurance to ensure that business needs (for IT applications) are met. \n     Experience in the delivery of demos, training and/or information sessions to groups of users using a variety of methods, such as boardroom delivery or online conferencing (Teams / Zoom). \n     Experience with client-facing web applications, including knowledge of Web Content Accessibility Guidelines (WCAG) and the Web Experience Toolkit (WET). \n     Experience with Microsoft Dynamics, including knowledge of out-of-the-box functionality and configuration options, would be considered an asset. \n    \n   \n  \n  \n   \n    Condition of Employment \n   \n   \n     Reliability Status \n   \n  \n  \n   \n     Language Requirements \n   \n   \n     English\n     \n     \n    Information on language requirements and self-assessment tests \n   \n  \n  \n   \n     Assessment Criteria \n   \n   \n     Candidates will be assessed on the basis of the following criteria: \n   \n  \n  \n   \n     Technical Competencies \n   \n   \n    \n     Knowledge of tools and methods used to elicit requirements and develop acceptance criteria, such as Azure DevOps or JIRA. \n     Ability to produce clear, logical and cohesive user stories, acceptance criteria, requirements documents, specifications, technical documents, training guides and correspondence. \n     Ability to ascertain feasibility, perform options analysis and ensure compliance with existing IT frameworks of new or improved IT systems and services. \n     Ability to effectively communicate orally, provide clear explanations and provide technical training. \n     Knowledge of Microsoft Dynamics, Salesforce or similar technologies. \n     Knowledge of Web Content Accessibility Guidelines (WCAG) and the Web Experience Toolkit (WET). \n    \n   \n  \n  \n   \n    Behavioural Competencies \n   \n   \n    Technology support - Communication (Level 2) \n    Technology support - Conceptual and analytical ability (Level 2) \n    Technology support - Initiative (Level 2) \n    Technology support - Results orientation (Level 2) \n    Technology support - Teamwork (Level 2) \n   \n  \n  \n   \n    Competency Profile(s) \n   \n   \n     For this position, the NRC will evaluate candidates using the following competency profile: Technology Support\n     \n     \n   \n  \n  \n   \n     Compensation \n   \n   \n     Rates under review\n     \n     \n    From $ 74,552 to $ 93,612 per annum.\n     \n     \n    An incumbent occupying a position within the CS Group is currently entitled to receive a terminable allowance of $176 per month.\n     \n     \n    NRC employees enjoy a wide-range of competitive benefits including comprehensive health and dental plans, vacation, sick, and other leave entitlements, disability insurance and pension plans. \n   \n  \n  \n   \n     The NRC Advantage \n   \n   \n     The National Research Council of Canada (NRC) is the Government of Canada's largest research organization supporting industrial innovation, the advancement of knowledge and technology development. We collaborate with over 70 colleges, universities and hospitals annually, work with 800 companies on their projects, and provide advice or funding to over 8000 Small and Medium-sized Enterprises (SMEs) each year.\n     \n     \n    We bring together the brightest minds to deliver tangible impacts on the lives of Canadians and people around the world. And now, we want to partner with you. Let your expertise and inspirations make an impact by joining the NRC.\n     \n     \n    At the NRC Employee wellness matters. We offer flexible work schedules as well as part-time work to help employees maintain work-life balance. We are one of the few federal organizations that close our offices during the December holiday season. We offer professional learning and development opportunities such as conferences, workshops, and a suite of mentorship, award and recognition programs. Diversity enables creativity and innovation. Fostering a diverse, inclusive, welcoming and supportive workplace is important to us, and contributes to a more inclusive Canadian innovation system. We welcome all qualified applicants and encourage you to complete the employment equity self-declaration questions during the job application process. Please let us know of any accommodation measures required to help you to be assessed in a fair and equitable manner. Please note that the information you provide will be treated confidentially.\n     \n     \n    Help us solve problems for Canada. Grow your career with us today! \n   \n  \n  \n   \n     Notes \n   \n   \n    \n     Relocation assistance will be determined in accordance with the NRC's directives. \n     A pre-qualified list may be established for similar positions for a one year period. \n     Candidates who have Second Language Evaluation (SLE) test results with the Public Service Commission should include these results with their application. \n     This position is being advertised internally and externally simultaneously, however first consideration will be given to internal NRC applicants. \n     Preference will be given to Canadian Citizens and Permanent Residents of Canada. Please include citizenship information in your application. \n     The incumbent must adhere to safe workplace practices at all times. \n     We thank all those who apply, however only those selected for further consideration will be contacted.\n    \n   \n  \n \n  \n  \n Please direct your questions, with the requisition number (21151) to: \n E-mail: NRC.NRCHiring-EmbaucheCNRC.CNRC@nrc-cnrc.gc.ca \n Telephone: 343-596-8193 Closing Date: February 4, 2024 - 23:59 Eastern Time",
    "preprocessed_description": "Great Minds. One Goal. Canada's Success. Help bring research to life and drive your career forward with the National Research Council of Canada (National Research Council Canada), Canada's largest research and technology organization. Do you possess a keen interest in technology and an inquisitive nature? We're seeking an Application Development Analyst who is enthusiastic about analytical challenges and committed to exceeding client expectations. The right individual will align with our foundational values of Integrity, Excellence, Respect, and Creativity. This position provides and contributes to analysis and research for the development of Grants and Contribution Online Applications and services and other IT business solutions required to deliver on the Department's operational mandate. Key Activities: Works with clients and stakeholders to elicit, analyze, define, model and document IT requirements. Ensure requirements are documented according to established standards and following Agile best practices. Acts as a liaison between clients, technical and testing teams to ensure that the detailed business and IT requirements are clearly understood. Participates in project teams and liaises and collaborates with stakeholders. Occasionally leads short-term teams or components of a large project. Prepares work plans and explains and provides technical information to new staff as required. Contributes to the continuous improvement of the IT business solutions environment through activities such as research, learning, and collaboration, departmental working groups, soliciting and responding to stakeholder, client and technical feedback. Screening Criteria Applicants must demonstrate within the content of their application that they meet the following screening criteria in order to be given further consideration as candidates: Education Bachelor degree in Computer Science from a recognized University or a Technical College diploma in Computer Science or related field. An equivalent combination of education and direct experience may be considered. For information on certificates and diplomas issued abroad, please see Degree equivalency Experience Experience working with client and stakeholders to elicit and analyze IT requirements. Experience documenting (e.g. Use Cases, Wireframes, User Stories) and modeling processes or requirements. Experience working in an Agile / SCRUM environment, developing and monitoring features and user stories, participating in stands-up, sprint planning and retrospectives. Experience liaising between stakeholders, developers and quality assurance to ensure that business needs (for IT applications) are met. Experience in the delivery of demos, training and/or information sessions to groups of users using a variety of methods, such as boardroom delivery or online conferencing (Teams / Zoom). Experience with client-facing web applications, including knowledge of Web Content Accessibility Guidelines (WCAG) and the Web Experience Toolkit (WET). Experience with Microsoft Dynamics, including knowledge of out-of-the-box functionality and configuration options, would be considered an asset. Condition of Employment Reliability Status Language Requirements English Information on language requirements and self-assessment tests Assessment Criteria Candidates will be assessed on the basis of the following criteria: Technical Competencies Knowledge of tools and methods used to elicit requirements and develop acceptance criteria, such as Microsoft Azure Development Operations or JIRA. Ability to produce clear, logical and cohesive user stories, acceptance criteria, requirements documents, specifications, technical documents, training guides and correspondence. Ability to ascertain feasibility, perform options analysis and ensure compliance with existing IT frameworks of new or improved IT systems and services. Ability to effectively communicate orally, provide clear explanations and provide technical training. Knowledge of Microsoft Dynamics, Salesforce or similar technologies. Knowledge of Web Content Accessibility Guidelines (WCAG) and the Web Experience Toolkit (WET). Behavioural Competencies Technology support - Communication (Level 2) Technology support - Conceptual and analytical ability (Level 2) Technology support - Initiative (Level 2) Technology support - Results orientation (Level 2) Technology support - Teamwork (Level 2) Competency Profile(s) For this position, the National Research Council Canada will evaluate candidates using the following competency profile: Technology Support Compensation Rates under review From $ 74,552 to $ 93,612 per annum. An incumbent occupying a position within the CS Group is currently entitled to receive a terminable allowance of $176 per month. National Research Council Canada employees enjoy a wide-range of competitive benefits including comprehensive health and dental plans, vacation, sick, and other leave entitlements, disability insurance and pension plans. The National Research Council Canada Advantage The National Research Council of Canada (National Research Council Canada) is the Government of Canada's largest research organization supporting industrial innovation, the advancement of knowledge and technology development. We collaborate with over 70 colleges, universities and hospitals annually, work with 800 companies on their projects, and provide advice or funding to over 8000 Small and Medium-sized Enterprises (SMEs) each year. We bring together the brightest minds to deliver tangible impacts on the lives of Canadians and people around the world. And now, we want to partner with you. Let your expertise and inspirations make an impact by joining the National Research Council Canada. At the National Research Council Canada Employee wellness matters. We offer flexible work schedules as well as part-time work to help employees maintain work-life balance. We are one of the few federal organizations that close our offices during the December holiday season. We offer professional learning and development opportunities such as conferences, workshops, and a suite of mentorship, award and recognition programs. Diversity enables creativity and innovation. Fostering a diverse, inclusive, welcoming and supportive workplace is important to us, and contributes to a more inclusive Canadian innovation system. We welcome all qualified applicants and encourage you to complete the employment equity self-declaration questions during the job application process. Please let us know of any accommodation measures required to help you to be assessed in a fair and equitable manner. Please note that the information you provide will be treated confidentially. Help us solve problems for Canada. Grow your career with us today! Notes Relocation assistance will be determined in accordance with the National Research Council Canada's directives. A pre-qualified list may be established for similar positions for a one year period. Candidates who have Second Language Evaluation (SLE) test results with the Public Service Commission should include these results with their application. This position is being advertised internally and externally simultaneously, however first consideration will be given to internal National Research Council Canada applicants. Preference will be given to Canadian Citizens and Permanent Residents of Canada. Please include citizenship information in your application. The incumbent must adhere to safe workplace practices at all times. We thank all those who apply, however only those selected for further consideration will be contacted. Please direct your questions, with the requisition number (21151) to: E-mail: National Research Council Canada.NRCHiring-EmbaucheCNRC.CNRC@nrc-cnrc.gc.ca Telephone: 343-596-8193 Closing Date: February 4, 2024 - 23:59 Eastern Time",
    "processed_description": ". goal . . help bring research life drive career forward large research technology organization . possess keen interest technology inquisitive nature seek Application Development Analyst enthusiastic analytical challenge commit exceed client expectation . individual align foundational respect creativity . position provide contribute analysis research development service business solution require deliver Department's operational mandate . key activity client stakeholder elicit analyze define model document requirement . ensure requirement document accord established standard follow agile good practice . liaison client technical testing team ensure detailed business requirement understand . participate project team liaise collaborate stakeholder . occasionally lead short term team component large project . prepare plan explain provide technical information staff require . contribute continuous improvement business solution environment activity research learning collaboration departmental group solicit respond stakeholder client technical feedback . screen Criteria Applicants demonstrate content application meet follow screening criterion order consideration education Bachelor degree Technical College diploma field . equivalent combination education direct consider . information certificate diploma issue abroad degree equivalency client stakeholder elicit analyze requirement . document e.g. Cases User Stories modeling process requirement . agile SCRUM environment develop monitoring feature user story participate stand sprint planning retrospective . liaise stakeholder developer quality assurance ensure business application meet . delivery demo training information session group user variety method boardroom delivery online conferencing . client face web application include knowledge WCAG . include knowledge box functionality configuration option consider asset . condition Employment Reliability Status Language Requirements English Information language requirement assessment test Assessment Criteria assess basis follow criterion Technical Competencies Knowledge tool method elicit requirement develop acceptance criterion JIRA . produce clear logical cohesive user story acceptance criterion requirement document specification technical document training guide correspondence . ascertain feasibility perform option analysis ensure compliance exist framework improve system service . effectively communicate orally provide clear explanation provide technical training . knowledge technology . knowledge Web Content Accessibility Guidelines WCAG . support Communication Level technology support conceptual analytical level technology support Initiative Level technology support result orientation Level technology support Teamwork Level competency profile position evaluate follow competency profile Technology Support Compensation rate review annum . incumbent occupy position currently entitle receive terminable allowance month . National Research Council employee enjoy wide range competitive benefit include comprehensive health dental plan vacation sick leave entitlement insurance pension plan . large research organization support industrial innovation advancement knowledge technology development . collaborate college university hospital company project provide advice funding small medium sized Enterprises sme . bring bright mind deliver tangible impact life people . partner . expertise inspiration impact join . wellness matter . offer flexible schedule help employee maintain life balance . federal organization close office . offer professional learning development conference workshop suite mentorship award recognition program . diversity enable creativity innovation . foster diverse inclusive welcoming supportive workplace contribute inclusive canadian innovation system . qualified applicant encourage complete employment equity declaration question application process . accommodation measure require help assess fair equitable manner . note information provide treat confidentially . help solve problem . grow career note relocation assistance determine National Research Council Canada's directive . pre qualified list establish position period . Second Language Evaluation SLE test result include result application . position advertise internally externally simultaneously consideration internal National Research Council applicant . . include citizenship information application . incumbent adhere safe workplace practice . apply select consideration contact . direct question requisition number mail closing Eastern",
    "results_group": {
        "extracted_noun_chunks": [
            "diverse inclusive welcoming supportive workplace",
            "system service",
            "help",
            "qualified applicant",
            "treat",
            "plan",
            "entitle",
            "technical training",
            "analysis research development service business solution",
            "large project",
            "requirement",
            "short term team",
            "life balance",
            "Employment Reliability Status Language Requirements English Information language requirement assessment test Assessment Criteria",
            "component",
            "bright mind",
            "knowledge box functionality configuration option",
            "research life drive career",
            "knowledge WCAG",
            "participate project team liaise",
            "Second Language Evaluation SLE test result",
            "document",
            "content application",
            "select consideration contact",
            "safe workplace practice",
            "basis follow criterion Technical Competencies Knowledge tool method elicit requirement",
            "large research technology organization",
            "foundational respect creativity",
            "National Research Council Canada's directive",
            "feature user story",
            "asset",
            "model document requirement",
            "knowledge Web Content Accessibility Guidelines WCAG",
            "knowledge technology",
            "developer quality assurance",
            "condition",
            "acceptance criterion JIRA",
            "result application",
            "complete employment equity declaration question application process",
            "stakeholder client technical feedback",
            "goal",
            "stakeholder",
            "key activity client stakeholder",
            "feasibility perform option analysis",
            "college university hospital company project",
            "screen Criteria Applicants",
            "problem",
            "incumbent",
            "partner",
            "Department's operational mandate",
            "business application meet",
            "industrial innovation advancement knowledge technology development",
            "equivalent combination education direct consider",
            "technical information staff",
            "clear explanation",
            "inclusive canadian innovation system",
            "large research organization",
            "federal organization close office",
            "degree equivalency client stakeholder",
            "sprint planning retrospective",
            "liaison client technical testing team",
            "Application Development Analyst enthusiastic analytical challenge commit",
            "client face web application",
            "fair equitable manner",
            "position advertise",
            "agile SCRUM environment",
            "clear logical cohesive user story acceptance criterion requirement document specification technical document training guide correspondence",
            "delivery demo training information session group user variety method boardroom delivery online conferencing",
            "relocation assistance",
            "National Research Council employee",
            "entitlement insurance pension plan",
            "expertise inspiration impact",
            "flexible schedule help",
            "information",
            "User Stories modeling process requirement",
            "position period",
            "employee",
            "internal National Research Council applicant",
            "wide range competitive benefit",
            "wellness matter",
            "client expectation",
            "position",
            "compliance exist framework",
            "Communication Level technology support",
            "agile good practice",
            "detailed business requirement",
            "career note",
            "advice",
            "requirement document accord",
            "direct question requisition number mail",
            "diversity",
            "qualified list",
            "citizenship information application",
            "keen interest technology inquisitive nature",
            "small medium sized Enterprises",
            "creativity innovation",
            "follow competency profile Technology Support Compensation rate review annum",
            "tangible impact life people",
            "accommodation measure",
            "comprehensive health dental plan vacation",
            "information certificate diploma issue",
            "professional learning development conference workshop suite mentorship award recognition program",
            "orientation Level technology support Teamwork Level competency profile position",
            "conceptual analytical level technology support Initiative Level technology support"
        ],
        "combined_lemmatized_tokens": ". goal . . help bring research life drive career forward large research technology organization . possess keen interest technology inquisitive nature seek Application Development Analyst enthusiastic analytical challenge commit exceed client expectation . individual align foundational respect creativity . position provide contribute analysis research development service business solution require deliver Department's operational mandate . key activity client stakeholder elicit analyze define model document requirement . ensure requirement document accord established standard follow agile good practice . liaison client technical testing team ensure detailed business requirement understand . participate project team liaise collaborate stakeholder . occasionally lead short term team component large project . prepare plan explain provide technical information staff require . contribute continuous improvement business solution environment activity research learning collaboration departmental group solicit respond stakeholder client technical feedback . screen Criteria Applicants demonstrate content application meet follow screening criterion order consideration education Bachelor degree Technical College diploma field . equivalent combination education direct consider . information certificate diploma issue abroad degree equivalency client stakeholder elicit analyze requirement . document e.g. Cases User Stories modeling process requirement . agile SCRUM environment develop monitoring feature user story participate stand sprint planning retrospective . liaise stakeholder developer quality assurance ensure business application meet . delivery demo training information session group user variety method boardroom delivery online conferencing . client face web application include knowledge WCAG . include knowledge box functionality configuration option consider asset . condition Employment Reliability Status Language Requirements English Information language requirement assessment test Assessment Criteria assess basis follow criterion Technical Competencies Knowledge tool method elicit requirement develop acceptance criterion JIRA . produce clear logical cohesive user story acceptance criterion requirement document specification technical document training guide correspondence . ascertain feasibility perform option analysis ensure compliance exist framework improve system service . effectively communicate orally provide clear explanation provide technical training . knowledge technology . knowledge Web Content Accessibility Guidelines WCAG . support Communication Level technology support conceptual analytical level technology support Initiative Level technology support result orientation Level technology support Teamwork Level competency profile position evaluate follow competency profile Technology Support Compensation rate review annum . incumbent occupy position currently entitle receive terminable allowance month . National Research Council employee enjoy wide range competitive benefit include comprehensive health dental plan vacation sick leave entitlement insurance pension plan . large research organization support industrial innovation advancement knowledge technology development . collaborate college university hospital company project provide advice funding small medium sized Enterprises sme . bring bright mind deliver tangible impact life people . partner . expertise inspiration impact join . wellness matter . offer flexible schedule help employee maintain life balance . federal organization close office . offer professional learning development conference workshop suite mentorship award recognition program . diversity enable creativity innovation . foster diverse inclusive welcoming supportive workplace contribute inclusive canadian innovation system . qualified applicant encourage complete employment equity declaration question application process . accommodation measure require help assess fair equitable manner . note information provide treat confidentially . help solve problem . grow career note relocation assistance determine National Research Council Canada's directive . pre qualified list establish position period . Second Language Evaluation SLE test result include result application . position advertise internally externally simultaneously consideration internal National Research Council applicant . . include citizenship information application . incumbent adhere safe workplace practice . apply select consideration contact . direct question requisition number mail closing Eastern"
    }
}