{
    "id": "3d93b800f094d8ef",
    "company": "BrightPath Kids Canada",
    "positionName": "Montessori Teacher - Child Care Centre",
    "jobType": [
        "Part-time",
        "Full-time"
    ],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-05T03:14:35.467Z",
    "url": "https://www.indeed.ca/rc/clk?jk=3d93b800f094d8ef&from=jasx&tk=1hjm3csar2cja000&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/applystart?jk=3d93b800f094d8ef&from=vj&pos=top&mvj=0&spon=0&sjdu=o7sfz71MPdMgyiV0LZq0d4DDplm6SwWjHcxyoDIphKnserxmf7D1noCJ9wjokKiB7L5tFw27OFb5kbF2h4Tj1BMDZSdEUCA5vNQc9ozx_f6bCov4cpKaILS8xOQ029sQBpoBHK0qcCxTlMOeIq0LkY4BaFBtXYCXuLoNjI1X-grm-xgy6lsJxIkgIKmcMx_Lw9_XINGINv7OnqX9-Wv1cg&vjfrom=serp&log=1&astse=c5e0fae3bae47c41&assa=4694",
    "companyDescription": "",
    "description": "Center: Montessori Kanata, ON \n  Job Type: Full-Time, Part-Time, Supply \n  No evenings or weekends! \n  Build your career in the early childhood education field and become a valued member of our team at BrightPath Kids! As a proud member of the Busy Bees global childcare community, we offer exceptional opportunities for your career to thrive. Join our diverse community of over 5,000 dedicated employees, and experience competitive pay and benefits, including a childcare discount. With our rapid growth, now is the perfect time to apply and shape an extraordinary future with us. Unleash your potential and join BrightPath! \n  What will you be doing?   As a Montessori Teacher, you will help the children in our care to reach their full potential in all areas of life by taking a child-centered approach to learning. Responsibilities include: \n \n  Developing and implementing a program based on Montessori material provided by BrightPath.\n  \n \n  Planning and maintaining an environment that is meticulously prepared to maximize learning and growth in students.\n  \n \n  Assessing the abilities, interests, and needs of children and discuss progress with parents and other staff.\n  \n \n  Establishing and maintaining collaborative relationships with co-workers, management, and families.\n  \n \n  Attending staff meetings and professional development opportunities as necessary.\n  \n \n  Working in partnership to maintain cleanliness and organization of classroom materials.\n  \n \n  Other duties as assigned.\n \n  \n  \n Top Reasons to join BrightPath Kids:\n  \n  \n  • We offer a 40% child care discount to ALL Full-time employees & 10% to Part-time so that your family can take advantage of our great learning environment!\n  \n \n  We will support your long-term career goals by offering opportunities for professional development and tuition reimbursement for courses related to your field.\n  Full-time staff are eligible to participate in a retirement plan (RRSP) which offers a company match – this is free money!\n  Full-time and Part-time staff receive 6 days of sick time per calendar year.\n  Full-time staff are given 10 paid statutory holidays off.\n  Full-time staff are paid for at least 10 vacation days per calendar year.\n  Full-time staff are offered health insurance, dental insurance, vision insurance and life insurance.\n  \n  Requirements:  \n \n  Montessori Experience - AMI (Montessori Association International Degree) OR AMS (American Montessori Society) \n  Must meet province requirements for childcare employment \n  Current Standard First Aid and infant child CPR\n  Current immunization and health assessment as per the local Minister of Health Requirements\n  \n  If this sounds like a good fit, we want to meet you! Please submit your application today. \n BrightPath Kids Corp is an equal opportunity employer that is committed to diversity and inclusion in the workplace. We prohibit discrimination and harassment of any kind based on race, color, sex, religion, sexual orientation, national origin, disability, genetic information, pregnancy, or any other protected characteristic as outlined by federal, provincial, or local laws. \n  BrightPath Kids Corp has an accommodation process in place that provides accommodations for employees with disabilities. If you require a specific accommodation because of a disability or a medical need, please contact Careers@BrightPathKids.com. This ensures that the appropriate accommodations are in place before you begin your employment."
}