{
    "id": "d5fc1c7de8ffce2e",
    "company": "CIMA+",
    "positionName": "Senior Industrial Structure Technician - Hybrid",
    "jobType": [
        "Permanent"
    ],
    "location": "Gatineau, QC",
    "salary": null,
    "postingDateParsed": "2024-01-24T12:18:47.422Z",
    "url": "https://www.indeed.ca/rc/clk?jk=d5fc1c7de8ffce2e&from=jasx&tk=1hl5dm6khi7nm801&bb=4vTZCg55PSkBGcVT_DsrT2KyTJ_7roym8ICyvXzIDyqCs_0e0C-uINU0aEIS6W9nHCGC5DWHRGsGQamidzmrR5iZKG6tQxm0rT9MnaSY-sFMsEsb4ykKIA%3D%3D&xkcb=SoAf67M3FlTXDAgEH70IbzkdCdPP&vjs=3",
    "externalApplyLink": "https://jobs.smartrecruiters.com/CIMA2/743999962439043-senior-industrial-structure-technician-hybrid",
    "companyDescription": "With more than 30 offices across the country and over 2,600 employees, 60% of which share ownership in the company, CIMA+ is one of Canada’s largest private consulting engineering firms and a “Best Employer” according to the Kincentric survey. \r\n\r\nFor more than 30 years, our multidisciplinary teams have been offering clients a complete range of solutions in the building, energy and resources, municipal infrastructure, telecommunications and transportation sectors. We also offer a multitude of complementary services, including environmental and project management services. Innovative and integrated solutions that place people at the centre of engineering, reflect our values and our corporate culture.",
    "description": "Company Description\n  Welcome to a place where people are at the heart of everything we do.\n  Welcome to people with an inspiring vision and who seek stimulating challenges. At CIMA+, you’ll find a place where you’ll have many opportunities to learn and develop while working on engaging projects.\n  We are a firm 100% owned by its employees and we value a collaborative and entrepreneurial mindset. You will have the flexibility to manage your work on your own terms and define what work-life balance means to you.\n  When you join CIMA+, we welcome you to a place that you can call home.\n  Job Description\n  Mission\n  The highly skilled Structures team is seeking a Technician with excellent analytical skills and familiarity with REVIT and AutoCAD software to add to their expertise in executing numerous and diversified industrial projects in the area of energy and resources. The main duties of the Industrial Structures Technician will be to contribute to the success of structural projects by participating in the design and producing drawings that respect the high standards at CIMA+.\n  Primary responsibilities\n \n   Actively participate in the design and preparation of drawings and specifications\n   Produce structural construction drawings\n   Assume responsibility for respecting the provisions of the quality-assurance system\n   Solve technical issues that require research and in-depth analysis\n   Design and prepare structural models and drawings (wood, steel and reinforced concrete framing) using REVIT and AutoCAD software\n   Oversee coordination with other disciplines (mechanical processes, architecture, electromechanics, civil engineering)\n   Train and provide guidance for junior technicians\n   Review designs and deliverables\n   Conduct field surveys\n   Provide technical assistance to site supervisors\n   Assist in verifying shop drawings\n \n  \n  Qualifications\n  \n \n   Diploma of Collegial Studies (DCS) in Civil Engineering, Architecture or equivalent\n   Minimum of 10 years of relevant experience in industrial and/or commercial / institutional / residential structure\n   Minimum of 2 years of relevant experience in the Canadian market\n   Mastery of 3D Design software applications REVIT, AutoCAD\n   Knowledge of Solidworks, Inventor, Navisworks, Advanced Steel and Plant 3D software a considerable asset\n   Experience working with point clouds, a considerable asset\n   Experience in structural drawing\n   Familiarity with structural design norms and standards\n   Familiarity with Building Information Modeling / BIM is an asset\n   Valid driver’s licence and access to a vehicle\n   Proficiency in French (oral and written)\n \n  Contact Alexandra Doroshenko\n  #LI-Hybrid\n  Additional Information\n \n  Ethics and integrity are fundamental values at CIMA+, and we are looking for people who uphold these principles. We are committed to creating opportunities for all our talents to contribute to the firm’s success, develop and grow, regardless of cultural or other differences. We fully endorse employment equity principles and encourage women, visible minorities, indigenous peoples, and individuals with disabilities to apply for any position offered at CIMA+. Adaptation measures are provided upon request to facilitate participation in the recruitment process."
}