{
    "id": "5614743c782ccd9d",
    "company": "Bath & Body Works",
    "positionName": "BBW Supervisor-Place D'Orleans",
    "jobType": [
        "Full-time"
    ],
    "location": "Orleans, ON",
    "salary": null,
    "postingDateParsed": "2024-01-06T03:12:29.880Z",
    "url": "https://www.indeed.ca/rc/clk?jk=5614743c782ccd9d&from=jasx&tk=1hjm39h30jroo800&vjs=3",
    "externalApplyLink": "https://careers.bathandbodyworks.com/en/job/19664329/bbw-supervisor-place-d-orleans/",
    "companyDescription": "",
    "description": "Brand: Bath & Body Works Location: Orleans, ON, CA Location Type: On-site Job ID: 041NV Job Area: Store: Management Employment type: Full-time \n \n \n \n  Description \n  \n   At Bath & Body Works, everyone belongs. We are committed to creating a diverse, equitable and inclusive culture focused on delivering exceptional fragrances and experiences to our customers. We focus on recruiting, retaining, and advancing diverse talent where our associate population is as diverse as the communities we serve, live and work. In addition, we work to improve our communities and our planet in a way that will make us proud for years to come because we believe the world is a brighter, happier place when everyone has access to the things that make them happy. \n   We invite you to join Gingham Nation, where we invest in our associates through competitive compensation, benefits, and development opportunities, so they can continue to be their best at work, at home, and in their communities. \n   Our store leaders are the front line of our field leadership team: they’re retail and customer-savvy, dedicated brand ambassadors and thrive on the connections we make with our customers. As a Supervisor, you will enjoy the opportunity to work in partnership with the Store manager to develop outstanding associates, deliver exceptional and consistent customer experiences, and positively impact growth across Bath & Body Works. \n   Responsibilities \n   \n    Responsible for leadership tasks as delegated by the store manager \n    Provide individual and team performance feedback and recommendations to managers \n    Train, coach, reward and motivate associates to improve selling and the customer experience \n    Reinforce selling expectations, performance, results and accountability with all associates \n    Lead and model selling and customer experience standards \n    Set the direction and goals for the day/shift when associates arrive for work \n    Build a highly satisfied and loyal customer base through engagement, conversion and capturing customer phone and e-mail information \n    Perform opening and closing routines including execution of bank deposits, receipt of shipment, and interpretation/dissemination company directive \n    Act as the manager on duty when scheduled to support customer service, work with vendors, or address maintenance issues \n    Partner with the members of the sales leadership team to support action plans that optimize results and ensure effective execution of operational activities \n    Maintain policies and procedures \n   \n  \n  Qualifications \n  Qualifications & Experience \n  \n   Proven experience delivering sales results \n   Ability to effectively communicate and foster a customer focused selling culture \n   Ability to provide effective, in the moment coaching to associates \n   Available for varied weekly shifts including weekend, closing and peak periods \n   Prior experience in a supervisory role, preferably in a retail setting \n  \n  Core Competencies \n  \n   Lead with Curiosity & Humility \n   Build High Performing Teams for Today & Tomorrow \n   Influence & Inspire with Vision & Purpose \n   Observe, Engage & Connect \n   Strive to Achieve Operational Excellence \n   Deliver Business Results \n  \n  The above statements are intended to describe the general nature and level of work being performed by people assigned to this job. They are not intended to be an exhaustive list of all responsibilities, duties and skills required. \n  We will accommodate applicants and associates with disabilities in the recruitment, selection and assessment process as appropriate and as required by applicable law. Please call 855-556-2675 or email applicantaccomodation@bbw.com if you require an accommodation. \n  We are an equal opportunity and affirmative action employer. We do not make employment decisions based on an individual’s race, color, religion, gender, gender identity, national origin, citizenship, age, disability, sexual orientation, marital status, pregnancy, genetic information, protected veteran status or any other legally protected status, and we comply with all laws concerning nondiscriminatory employment practices. We are committed to providing reasonable accommodations for associates and job applicants with disabilities. Our management team is dedicated to ensuring fulfillment of this policy with respect to recruitment, hiring, placement, promotion, transfer, training, compensation, benefits, associate activities and general treatment during employment. We only hire individuals authorized for employment in Canada."
}