{
    "id": "923b94494d10b686",
    "company": "Intelerad",
    "positionName": "Application Support Analyst - Windows",
    "jobType": [],
    "location": "Gatineau, QC",
    "salary": null,
    "postingDateParsed": "2023-10-07T02:03:33.109Z",
    "url": "https://www.indeed.ca/rc/clk?jk=923b94494d10b686&from=jasx&tk=1hc6gclvdih64800&vjs=3",
    "externalApplyLink": "https://jobs.smartrecruiters.com/Intelerad/743999935395748-application-support-analyst-windows",
    "companyDescription": "",
    "description": "Company Description\n  Improving healthcare through innovative technology is at the core of Intelerad’s work. Our scalable medical imaging platform connects clinicians to a powerful imaging ecosystem that is fast, smart, and tapped into the data they need, no matter their location. We’re focused on delivering a best-in-class medical image management solution that improves provider efficiency, decreases the cost of healthcare, and improves the overall health of populations.\n  Headquartered in Raleigh, NC and Montreal, Intelerad has nearly 800 employees located in offices across six countries. The company empowers nearly 2,000 healthcare organizations around the world with the speed, scalability, and simplicity needed to increase business performance while, most importantly, improving patient outcomes. Intelerad’s modern enterprise solutions have been acknowledged by a Best in KLAS recognition, ranking #1 for PACS Asia/Oceania in the 2021 Best in KLAS: Global Software (Non-US) report.\n \n \n\n Job Description\n  The Application Support Analyst is responsible for providing technical support and guidance to our clients by answering their requests & addressing incidents regarding both server-side and client-side applications, by delivering advanced technical and troubleshooting skills, communication abilities, problem solving orientation, and computer proficiency on a day-to-day basis.\n \n  Duties/Responsibilities:\n \n   Ensure that all service level agreements (SLAs) are met and delivered according to Support specifications\n   Log and document all incidents within a ticketing system and problems within ServiceNow\n   Analyze, diagnose root causes, known errors and resolve challenging issues relating to software applications, Windows OS, SQL Server databases and other related technologies\n   Refer incidents to other parties when an incident is beyond your current skill-set\n   Proactively monitor, document and fix problems or anomalies found at our clients’ installations\n   Manage and exceed customers’ expectation by providing excellent service\n   Ensure that all service level agreements (SLAs) are met and delivered according to Support specifications\n   Versatility to rotation shift & pager scheduling\n   Participate in sharing knowledge and publishing Knowledge articles\n   Participate in any project deemed necessary by the organization\n \n \n \n\n Qualifications\n \n   Degree in Computer Science or equivalent\n   2 years of work experience in Windows administration and technical customer support and/or a tertiary degree in a computer related field\n   Knowledge of Microsoft Windows operating systems for Servers and Workstations\n   Excellent communication skills in English and French (verbal and written)\n   Experience running queries in Microsoft SQL Server\n   Knowledge of Linux\n   Remote troubleshooting (ssh, VPN tunnels)\n   Experience in a medical and/or research environment\n   Highly motivated and customer focused\n   Excellent professional communication skills (verbal, and written)\n   Team oriented\n   Attention to detail\n   Strong problem-solving skills\n   Remote server hardware diagnosis\n   MS SQL Administration\n \n \n  This job description may not be inclusive of all assigned duties and the scope of the job may change as necessitated by business demands\n  Additional Information\n  All applicants meeting minimum qualifications will be required to complete a 30 minute online assessment as part of your application.\n  Intelerad is committed to the principles of equal employment. We are committed to complying with all federal, state and local laws providing equal employment opportunities and all other employment laws and regulations. Applicants, employees and former employees are protected from employment discrimination based on race, color, religion, sex (including pregnancy, sexual orientation, or gender identity), national origin, age (40 or older), disability and genetic information (including family medical history). Intelerad is dedicated to the fulfillment of this policy regarding all aspects of employment, including but not limited to recruiting, hiring, placement, transfer, training, promotion, rates of pay, and other compensation, termination, and all other terms, conditions, and privileges of employment.\n \n  Intelerad is committed to ensuring equal employment opportunity for qualified individuals with disabilities. Intelerad uses the Americans with Disabilities Act (“ADA”)as a standard for global recruiting and hiring purposes. This prohibits discrimination against qualified individuals with disabilities. The ADA defines “disability” as a physical or mental impairment that substantially limits one or more of the major life activities of an individual, a record of such impairment, or being regarded as having such an impairment.\n  Intelerad and Ambra Health Combine to Form the Global Industry Leader in Cloud PACS and Enterprise Imaging\n  Intelerad Partners with Strategic Radiology to Bring Innovative Medical Image Management Solutions to More than 1,300 Radiologists Across the US\n  Meet Intelerad’s Leadership Team: https://www.intelerad.com/en/about/leadership-team/ \n #LI-remote #remoteUSA"
}