{
    "id": "721c33e4d7fca17e",
    "companyDescription": "At Thermo Fisher Scientific, we work together to accelerate research, solve complex analytical challenges, improve patient diagnostics, drive laboratory productivity and produce life-saving treatments for patients. We know that our people are the source of our global success, and we embrace the unique qualities, differences and experiences of each of our colleagues. As the world leader in serving science, we provide our teams the autonomy and support they need to drive cutting-edge innovation and progressive thinking.\r\n\r\nIf you’re looking for a career opportunity where you can build your future, you’ll discover that, at Thermo Fisher Scientific, each one of our 100,000 extraordinary minds has a unique story to tell. And we all contribute to a singular Mission—To enable our customers to make the world healthier, cleaner and safer.\r\n\r\nWhat story will you tell? Explore our opportunities at jobs.thermofisher.com and join our team. \r\n",
    "description": "Job Description\n \n  An opportunity exists for a Chemical Account Manager in the Laboratory Chemicals Division (LCD) of Thermo Fisher Scientific, covering Eastern Canada, Upstate New York, Vermont, New Hampshire and Maine.  LCD enables its customers by bringing chemistry to life! Scientific journeys begin with chemicals and end with life-enriching results. Our purpose is to deliver chemicals safely and efficiently, so that our customers can focus on results. Together, we will:\n \n   Become the trusted partner for chemicals in the markets we serve\n   Honor our commitments by consistently delivering results\n   Become an admired business to work for, and a safe and exciting career destination for outstanding talent.\n \n \n  Territory: Ideal candidate would live in territory (up to 50% travel) Watertown, NY, Burlington, VT, Canada (Montreal or Ottawa) and surrounding areas. Canadian residents must be bilingual (French speaking).\n \n  What will you do:\n \n   Develop strategic and tactical sales plans to pursue ambitious incremental growth of our Analytical Reagents, BioReagents and Discovery Chemicals businesses in the assigned territory.\n   Schedule and conduct formal sales activities, including capabilities-based presentations; focus groups; technical seminars; and new product launches to drive sales.\n   Represent and promote the Laboratory Chemicals’ value proposition at all levels within your accounts, and in the industry.\n   Provide market intelligence and appropriate detail regarding account sales position as requested.\n   Direct daily sales activities to ensure customer focus, timely customer response, and customer follow-up where required.\n   Coordinate and collaborate with various colleagues of Thermo Fisher Scientific to develop appropriate alliances and to promote the growth of our overall Chemicals business.\n   Coordinate and engage with various levels of the channel & distribution sales team- including managers, directors and local sales representatives.\n \n \n   Implement joint calls with distribution representatives as needed to provide sales and product training, and further technical sales activities.\n \n \n  How will you get here:\n \n \n   A Bachelor’s Degree is the required minimum education; an emphasis in the Life Sciences is recommended. \n \n \n Experience: \n \n \n  Minimum of 2+ years Sales Experience\n   1-3 Years Sales Experience in the Life sciences or Healthcare field preferred but not required\n   New Business/Hunter type sales background preferred\n   Ability to speak French preferred\n \n \n  Knowledge, Skills, Abilities: \n \n  Outstanding analytical capability and problem-solving skills.\n   Ability to work in a team environment and influence others to achieve results.\n   Self-motivated with bias for action.\n   Excellent interpersonal and persuasive communications abilities.\n   Substantiated capability to effectively negotiate and close business.\n   Evidence of professional presentation skills.\n   Outstanding follow up and organizational skills.\n   Willingness to travel to accomplish assigned goals.\n   Must show the ability to demonstrate the Thermo Fisher values (The Four I’s) – Integrity, Intensity, Innovation, and Involvement\n \n \n  About Thermo Fisher Scientific \n Thermo Fisher Scientific Inc. (NYSE: TMO) is the world leader in serving science, with annual revenue of approximately $40 billion. Our Mission is to enable our customers to make the world healthier, cleaner and safer. Whether our customers are accelerating life sciences research, solving complex analytical challenges, increasing efficiency in their laboratories, improving patient health through diagnostics or the development and manufacture of life-changing therapies, we are here to support them. Our global team of more than 100,000 colleagues delivers an outstanding combination of innovative technologies, purchasing convenience and pharmaceutical services through our industry-leading brands, including Thermo Scientific, Applied Biosystems, Invitrogen, Fisher Scientific, Unity Lab Services, Patheon and PPD. For more information, please visit www.thermofisher.com.\n \n  Apply today! http://jobs.thermofisher.com\n \n  Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status.\n \n  Accessibility/Disability Access\n  Job Seekers with a Disability: Thermo Fisher Scientific offers accessibility service for job seekers requiring accommodations in the job application process. For example, this may include individuals requiring assistance because of hearing, vision, mobility, or cognitive impairments. If you are a job seeker with a disability, or assisting a person with a disability, and require accessibility assistance or an accommodation to apply for one of our jobs, please submit a request by telephone at 1-855-471-2255*. Please include your contact information and specific details about your required accommodation to support you during the job application process.\n \n  This telephone line is reserved solely for job seekers with disabilities requiring accessibility assistance or an accommodation in the job application process. Messages left for other purposes, such as not being able to get into the career website, following up on an application, or other non-disability related technical issues will not receive a response.\n \n \n  Compensation and Benefits The salary range estimated for this position based in New York is $63,900.00–$95,850.00.\n \n  This position may also be eligible to receive a variable annual bonus based on company, team, and/or individual performance results in accordance with company policy. We offer a comprehensive Total Rewards package that our U.S. colleagues and their families can count on, which includes:\n \n   A choice of national medical and dental plans, and a national vision plan, including health incentive programs\n   Employee assistance and family support programs, including commuter benefits and tuition reimbursement\n   At least 120 hours paid time off (PTO), 10 paid holidays annually, paid parental leave (3 weeks for bonding and 8 weeks for caregiver leave), accident and life insurance, and short- and long-term disability in accordance with company policy\n   Retirement and savings programs, such as our competitive 401(k) U.S. retirement savings plan\n   Employees’ Stock Purchase Plan (ESPP) offers eligible colleagues the opportunity to purchase company stock at a discount\n \n \n  For more information on our benefits, please visit: https://jobs.thermofisher.com/global/en/total-rewards",
    "preprocessed_description": "Job Description An opportunity exists for a Chemical Account Manager in the Laboratory Chemicals Division (LCD) of Thermo Fisher Scientific, covering Eastern Canada, Upstate New York, Vermont, New Hampshire and Maine. LCD enables its customers by bringing chemistry to life! Scientific journeys begin with chemicals and end with life-enriching results. Our purpose is to deliver chemicals safely and efficiently, so that our customers can focus on results. Together, we will: Become the trusted partner for chemicals in the markets we serve Honor our commitments by consistently delivering results Become an admired business to work for, and a safe and exciting career destination for outstanding talent. Territory: Ideal candidate would live in territory (up to 50% travel) Watertown, NY, Burlington, VT, Canada (Montreal or Ottawa) and surrounding areas. Canadian residents must be bilingual (French speaking). What will you do: Develop strategic and tactical sales plans to pursue ambitious incremental growth of our Analytical Reagents, BioReagents and Discovery Chemicals businesses in the assigned territory. Schedule and conduct formal sales activities, including capabilities-based presentations; focus groups; technical seminars; and new product launches to drive sales. Represent and promote the Laboratory Chemicals' value proposition at all levels within your accounts, and in the industry. Provide market intelligence and appropriate detail regarding account sales position as requested. Direct daily sales activities to ensure customer focus, timely customer response, and customer follow-up where required. Coordinate and collaborate with various colleagues of Thermo Fisher Scientific to develop appropriate alliances and to promote the growth of our overall Chemicals business. Coordinate and engage with various levels of the channel & distribution sales teamincluding managers, directors and local sales representatives. Implement joint calls with distribution representatives as needed to provide sales and product training, and further technical sales activities. How will you get here: A Bachelor's Degree is the required minimum education; an emphasis in the Life Sciences is recommended. Experience: Minimum of 2+ years Sales Experience 1-3 Years Sales Experience in the Life sciences or Healthcare field preferred but not required New Business/Hunter type sales background preferred Ability to speak French preferred Knowledge, Skills, Abilities: Outstanding analytical capability and problem-solving skills. Ability to work in a team environment and influence others to achieve results. Self-motivated with bias for action. Excellent interpersonal and persuasive communications abilities. Substantiated capability to effectively negotiate and close business. Evidence of professional presentation skills. Outstanding follow up and organizational skills. Willingness to travel to accomplish assigned goals. Must show the ability to demonstrate the Thermo Fisher values (The Four I's) – Integrity, Intensity, Innovation, and Involvement About Thermo Fisher Scientific Thermo Fisher Scientific Inc. (NYSE: TMO) is the world leader in serving science, with annual revenue of approximately $40 billion. Our Mission is to enable our customers to make the world healthier, cleaner and safer. Whether our customers are accelerating life sciences research, solving complex analytical challenges, increasing efficiency in their laboratories, improving patient health through diagnostics or the development and manufacture of life-changing therapies, we are here to support them. Our global team of more than 100,000 colleagues delivers an outstanding combination of innovative technologies, purchasing convenience and pharmaceutical services through our industry-leading brands, including Thermo Scientific, Applied Biosystems, Invitrogen, Fisher Scientific, Unity Lab Services, Patheon and PPD. For more information, please visit www.thermofisher.com. Apply today! http://jobs.thermofisher.com Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status. Accessibility/Disability Access Job Seekers with a Disability: Thermo Fisher Scientific offers accessibility service for job seekers requiring accommodations in the job application process. For example, this may include individuals requiring assistance because of hearing, vision, mobility, or cognitive impairments. If you are a job seeker with a disability, or assisting a person with a disability, and require accessibility assistance or an accommodation to apply for one of our jobs, please submit a request by telephone at 1-855-471-2255. Please include your contact information and specific details about your required accommodation to support you during the job application process. This telephone line is reserved solely for job seekers with disabilities requiring accessibility assistance or an accommodation in the job application process. Messages left for other purposes, such as not being able to get into the career website, following up on an application, or other non-disability related technical issues will not receive a response. Compensation and Benefits The salary range estimated for this position based in New York is $63,900.00–$95,850.00. This position may also be eligible to receive a variable annual bonus based on company, team, and/or individual performance results in accordance with company policy. We offer a comprehensive Total Rewards package that our U.S. colleagues and their families can count on, which includes: A choice of national medical and dental plans, and a national vision plan, including health incentive programs Employee assistance and family support programs, including commuter benefits and tuition reimbursement At least 120 hours paid time off (Paid Time Off), 10 paid holidays annually, paid parental leave (3 weeks for bonding and 8 weeks for caregiver leave), accident and life insurance, and shortand long-term disability in accordance with company policy Retirement and savings programs, such as our competitive 401(k) U.S. retirement savings plan Employees' Stock Purchase Plan (ESPP) offers eligible colleagues the opportunity to purchase company stock at a discount For more information on our benefits, please visit: https://jobs.thermofisher.com/global/en/total-rewards",
    "processed_description": "description exist Chemical Account Manager LCD cover . lcd enable customer bring chemistry life scientific journey chemical life enrich result . purpose deliver chemical safely efficiently customer focus result . trusted partner chemical market serve Honor commitment consistently deliver result admired business safe exciting career destination outstanding talent . territory ideal live territory travel surround area . canadian resident french speaking . develop strategic tactical sale plan pursue ambitious incremental growth Discovery Chemicals business assign territory . schedule conduct formal sale activity include capability base presentation focus group technical seminar product launch drive sale . represent promote Laboratory chemical' proposition level account industry . provide market intelligence appropriate detail regard account sale position request . direct daily sale activity ensure customer focus timely customer response customer follow require . coordinate collaborate colleague develop appropriate alliance promote growth chemical business . coordinate engage level channel distribution sale teaminclude manager director local sale representative . implement joint distribution representative provide sale product training technical sale activity . required minimum education emphasis recommend . minimum sale sale Life sciences Healthcare field prefer require Business Hunter type sale background prefer speak french prefer Knowledge skill outstanding analytical capability problem solve skill . team environment influence achieve result . motivated bias action . excellent interpersonal persuasive communication . substantiated capability effectively negotiate close business . evidence professional presentation skill . outstanding follow organizational skill . willingness travel accomplish assign goal . demonstrate Thermo Fisher – Integrity Intensity Innovation involvement TMO leader serve science annual revenue . Mission enable customer healthy clean safe . customer accelerate life science research solve complex analytical challenge increase efficiency laboratory improve patient health diagnostic development manufacture life change therapy support . global team colleague deliver outstanding combination innovative technology purchase convenience pharmaceutical service industry lead brand include PPD . information visit . apply EEO Affirmative Action Employer discriminate basis race color religion sex sexual orientation gender identity national origin protect veteran status legally protect status . accessibility Access seeker offer accessibility service seeker require accommodation application process . example include individual require assistance hearing vision mobility cognitive impairment . seeker assist person require accessibility assistance accommodation apply submit request . include contact information specific detail require accommodation support application process . reserve solely seeker require accessibility assistance accommodation application process . message leave purpose career website follow application relate technical issue receive response . compensation Benefits salary range estimate position base . position eligible receive variable annual bonus base company team individual performance result company policy . offer comprehensive Total reward package U.S. colleague family count include choice national medical dental plan national vision plan include health incentive program employee assistance family support program include commuter benefit tuition reimbursement pay Paid pay pay parental leave bonding caregiver leave accident life insurance shortand long term company policy Retirement saving program competitive U.S. retirement saving plan employee' Stock Purchase Plan espp offer eligible colleague purchase company stock discount information benefit visit",
    "results_group": {
        "extracted_noun_chunks": [
            "required minimum education emphasis",
            "formal sale activity",
            "patient health diagnostic development manufacture life",
            "global team colleague",
            "response",
            "example",
            "veteran status",
            "growth chemical business",
            "efficiency laboratory",
            "Integrity Intensity Innovation involvement TMO leader",
            "professional presentation skill",
            "accident life insurance shortand long term company policy Retirement saving program competitive U.S. retirement saving plan employee' Stock Purchase Plan espp",
            "Knowledge skill outstanding analytical capability problem",
            "lcd",
            "close business",
            "direct daily sale activity",
            "customer",
            "accessibility service seeker",
            "motivated bias action",
            "purpose",
            "joint distribution representative",
            "accommodation support application process",
            "canadian resident french",
            "PPD",
            "life science research",
            "excellent interpersonal persuasive communication",
            "description",
            "ambitious incremental growth",
            "accessibility assistance accommodation",
            "brand",
            "health incentive program employee assistance family support program",
            "Laboratory chemical' proposition level account industry",
            "assign goal",
            "Discovery Chemicals business",
            "evidence",
            "schedule",
            "accessibility assistance accommodation application process",
            "sale product",
            "request",
            "minimum sale sale Life sciences Healthcare field",
            "appropriate alliance",
            "accommodation application process",
            "choice national medical dental plan national vision plan",
            "skill",
            "outstanding combination innovative technology purchase convenience pharmaceutical service industry",
            "Business Hunter type sale background",
            "commuter benefit tuition reimbursement pay Paid pay pay parental leave bonding caregiver",
            "result",
            "contact information specific detail",
            "status",
            "training technical sale activity",
            "accessibility Access seeker",
            "organizational skill",
            "team environment influence",
            "therapy support",
            "strategic tactical sale plan",
            "coordinate collaborate colleague",
            "territory ideal live territory travel surround area",
            "substantiated capability",
            "safely efficiently customer focus result",
            "Honor commitment",
            "vision mobility cognitive impairment",
            "position",
            "person",
            "basis race color religion",
            "trusted partner chemical market",
            "annual bonus base company team individual performance",
            "comprehensive Total reward package U.S. colleague family count",
            "timely customer response customer follow require",
            "result admired business safe exciting career destination outstanding talent",
            "compensation Benefits salary range estimate position base",
            "chemistry life scientific journey chemical life",
            "Mission",
            "message",
            "market intelligence appropriate detail regard account sale position request",
            "Thermo Fisher",
            "technical issue",
            "information visit",
            "Chemical Account Manager LCD cover",
            "science annual revenue",
            "engage level channel distribution sale teaminclude manager director local sale representative",
            "seeker",
            "territory",
            "capability base presentation focus group technical seminar product launch drive sale",
            "solely seeker"
        ],
        "combined_lemmatized_tokens": "description exist Chemical Account Manager LCD cover . lcd enable customer bring chemistry life scientific journey chemical life enrich result . purpose deliver chemical safely efficiently customer focus result . trusted partner chemical market serve Honor commitment consistently deliver result admired business safe exciting career destination outstanding talent . territory ideal live territory travel surround area . canadian resident french speaking . develop strategic tactical sale plan pursue ambitious incremental growth Discovery Chemicals business assign territory . schedule conduct formal sale activity include capability base presentation focus group technical seminar product launch drive sale . represent promote Laboratory chemical' proposition level account industry . provide market intelligence appropriate detail regard account sale position request . direct daily sale activity ensure customer focus timely customer response customer follow require . coordinate collaborate colleague develop appropriate alliance promote growth chemical business . coordinate engage level channel distribution sale teaminclude manager director local sale representative . implement joint distribution representative provide sale product training technical sale activity . required minimum education emphasis recommend . minimum sale sale Life sciences Healthcare field prefer require Business Hunter type sale background prefer speak french prefer Knowledge skill outstanding analytical capability problem solve skill . team environment influence achieve result . motivated bias action . excellent interpersonal persuasive communication . substantiated capability effectively negotiate close business . evidence professional presentation skill . outstanding follow organizational skill . willingness travel accomplish assign goal . demonstrate Thermo Fisher – Integrity Intensity Innovation involvement TMO leader serve science annual revenue . Mission enable customer healthy clean safe . customer accelerate life science research solve complex analytical challenge increase efficiency laboratory improve patient health diagnostic development manufacture life change therapy support . global team colleague deliver outstanding combination innovative technology purchase convenience pharmaceutical service industry lead brand include PPD . information visit . apply EEO Affirmative Action Employer discriminate basis race color religion sex sexual orientation gender identity national origin protect veteran status legally protect status . accessibility Access seeker offer accessibility service seeker require accommodation application process . example include individual require assistance hearing vision mobility cognitive impairment . seeker assist person require accessibility assistance accommodation apply submit request . include contact information specific detail require accommodation support application process . reserve solely seeker require accessibility assistance accommodation application process . message leave purpose career website follow application relate technical issue receive response . compensation Benefits salary range estimate position base . position eligible receive variable annual bonus base company team individual performance result company policy . offer comprehensive Total reward package U.S. colleague family count include choice national medical dental plan national vision plan include health incentive program employee assistance family support program include commuter benefit tuition reimbursement pay Paid pay pay parental leave bonding caregiver leave accident life insurance shortand long term company policy Retirement saving program competitive U.S. retirement saving plan employee' Stock Purchase Plan espp offer eligible colleague purchase company stock discount information benefit visit"
    }
}