{
    "id": "22af0383dffae2a0",
    "companyDescription": "With nearly 100,000 employees — including architects, engineers, designers, planners, scientists and management and construction services professionals — serving clients in more than 150 countries around the world following the acquisition of URS, AECOM is a premier, fully integrated infrastructure and support services firm. AECOM is ranked as the #1 engineering design firm by revenue in Engineering News-Record magazine’s annual industry rankings. The company is a leader in all of the key markets that it serves, including transportation, facilities, environmental, energy, oil and gas, water, high-rise buildings and government. AECOM provides a blend of global reach, local knowledge, innovation and technical excellence in delivering solutions that create, enhance and sustain the world’s built, natural and social environments. A Fortune 500 company, AECOM companies, including URS Corporation and Hunt Construction Group, had revenue of approximately $19.5 billion during the 12 months ended Sept. 30, 2014. More information on AECOM and its services can be found at www.aecom.com.",
    "description": "Company Description \n\n Work with Us. Change the World. \n\n At AECOM, we're delivering a better world. Whether improving your commute, keeping the lights on, providing access to clean water, or transforming skylines, our work helps people and communities thrive. We are the world's trusted infrastructure consulting firm, partnering with clients to solve the world’s most complex challenges and build legacies for future generations. \n\n There has never been a better time to be at AECOM. With accelerating infrastructure investment worldwide, our services are in great demand. We invite you to bring your bold ideas and big dreams and become part of a global team of nearly 50,000 planners, designers, engineers, scientists, digital innovators, program and construction managers and other professionals delivering projects that create a positive and tangible impact around the world. \n\n We're one global team driven by our common purpose to deliver a better world. Join us. \n\n Job Description \n\n AECOM Canada Nuclear Services at Chalk River Nuclear Laboratories is searching for a Field Management Supervisor for a full-time position based at Chalk River, supporting the Construction Management Team at the site. \n\n \nGENERAL ACCOUNTABILITIES:\n The Site Inspection Lead (SIL) is responsible for technical and quality inspections of civil, geotechnical, mechanical, electrical, and architectural installations, as well as surveillance and witnessing of work performed by other trades. The SIL will lead a team of qualified discipline inspectors and subcontractors with the primary responsibility of performing independent testing, surveillance, oversight and witnessing of activities related to procurement, construction, and commissioning of nuclear facilities. These duties include, but are not limited to, preparing & implementing inspection and test procedures, identifying installation, product & process issues, implementing the nonconformance process through records and tracking systems, and performing independent testing of electrical, civil, geotechnical, mechanical (including piping, pressure vessels) and architectural. \n\n \nSPECIFIC ACCOUNTABILITIES:\n Support projects in the execution of Quality Control Programs. Position responsibilities include: \n\n + Supervise inspection and testing personnel. \n\n + Plan and coordinate site-wide inspection and testing operations. \n\n + Review project Inspection & Testing Plans (ITP) and other Project Plans, as needed. \n\n + Prepare and review test reports. \n\n + Participate in independent quality oversight, surveillance and witnessing of field activities and installations. \n\n + Participate in independent sampling, testing and material receipt inspection. \n\n + Support the preparation and implementation of project inspection/assessment strategies and reports to cover all project phases. \n\n + Support reporting and addressing of corrective and preventive actions and analysis and trending of quality data. \n\n + Liaise with client and contractor quality representatives, and project members to ensure that all quality issues are documented and resolved. \n\n + Interface and coordinate with clients, contractors, and inspection & testing agencies on QC matters; oversee related inspection & testing activities for quality and conformance to deliverable requirements. \n\n + Coordinate QC deliverables and documentation; participate in QC planning activities. \n\n \nNecessary Skills and Knowledge:\n The skills and knowledge to execute this role are usually acquired through 15+ years of relevant construction experience, preferably in a nuclear environment. The individual would possess good written and verbal skills. \n\n Qualifications \n\n \nMinimum Requirements:\n + Engineering Degree in a related field + 6 Yr of related experience or \n\n + Diploma/Certificate Quality Engineer + 8 yrs or more of related experience. \n\n \nStrongly Preferred Qualifications:\n + P.Eng, Certified Technologist, or Certified Quality Engineer. \n\n + A minimum of six years of multi-discipline QC inspection and testing, or equivalent experience. \n\n + Demonstrated leadership experience supervising multi-discipline construction teams. \n\n + Experience in water treatment plant construction. \n\n + Experience in environmental remediation construction, including municipal landfill sites. \n\n + Demonstrated ability to understand drawings and specifications. \n\n + Demonstrated knowledge and ability in the application of QC procedures, inspection and testing techniques. \n\n + Demonstrated good analytical skills and familiarity with quality tools and methodologies. \n\n + Demonstrated knowledge of best practices for inspection, testing, quality control and defect management. \n\n Additional Information \n\n Offered rate of compensation in Chalk River will be based on individual education, qualifications, experience. The salary range for this position is $ 110K- $150K. \n\n About AECOM \n\n AECOM is the world’s trusted infrastructure consulting firm, delivering professional services throughout the project lifecycle – from advisory, planning, design and engineering to program and construction management. On projects spanning transportation, buildings, water, new energy and the environment, our public- and private-sector clients trust us to solve their most complex challenges. Our teams are driven by a common purpose to deliver a better world through our unrivaled technical and digital expertise, a culture of equity, diversity and inclusion, and a commitment to environmental, social and governance priorities. AECOM is a Fortune 500 firm and its Professional Services business had revenue of $13.1 billion in fiscal year 2022. See how we are delivering sustainable legacies for generations to come at aecom.com and @AECOM. \n\n Freedom to Grow in a World of Opportunity \n\n You will have the flexibility you need to do your best work with hybrid work options. Whether you’re working from an AECOM office, remote location or at a client site, you will be working in a dynamic environment where your integrity, entrepreneurial spirit and pioneering mindset are championed. \n\n You will help us foster a culture of equity, diversity and inclusion – a safe and respectful workplace, where we invite everyone to bring their whole selves to work using their unique talents, backgrounds and expertise to create transformational outcomes for our clients. \n\n AECOM provides a wide array of compensation and benefits programs to meet the diverse needs of our employees and their families. We also provide a robust global well-being program. We’re the world’s trusted global infrastructure firm, and we’re in this together – your growth and success are ours too. \n\n Join us, and you’ll get all the benefits of being a part of a global, publicly traded firm – access to industry-leading technology and thinking and transformational work with big impact and work flexibility. As an Equal Opportunity Employer, we believe in each person’s potential, and we’ll help you reach yours. \n\n All your information will be kept confidential according to EEO guidelines. \n\n \nReqID: J10102387 \n\n \nBusiness Line: Energy \n\n \nBusiness Group: DCS \n\n \nStrategic Business Unit: Canada \n\n \nCareer Area: Construction \n\n \nWork Location Model: On-Site",
    "preprocessed_description": "Company Description Work with Us. Change the World. At AECOM, we are delivering a better world. Whether improving your commute, keeping the lights on, providing access to clean water, or transforming skylines, our work helps people and communities thrive. We are the world's trusted infrastructure consulting firm, partnering with clients to solve the world's most complex challenges and build legacies for future generations. There has never been a better time to be at AECOM. With accelerating infrastructure investment worldwide, our services are in great demand. We invite you to bring your bold ideas and big dreams and become part of a global team of nearly 50,000 planners, designers, engineers, scientists, digital innovators, program and construction managers and other professionals delivering projects that create a positive and tangible impact around the world. We're one global team driven by our common purpose to deliver a better world. Join us. Job Description AECOM Canada Nuclear Services at Chalk River Nuclear Laboratories is searching for a Field Management Supervisor for a full-time position based at Chalk River, supporting the Construction Management Team at the site. GENERAL ACCOUNTABILITIES: The Site Inspection Lead (SIL) is responsible for technical and quality inspections of civil, geotechnical, mechanical, electrical, and architectural installations, as well as surveillance and witnessing of work performed by other trades. The SIL will lead a team of qualified discipline inspectors and subcontractors with the primary responsibility of performing independent testing, surveillance, oversight and witnessing of activities related to procurement, construction, and commissioning of nuclear facilities. These duties include, but are not limited to, preparing & implementing inspection and test procedures, identifying installation, product & process issues, implementing the nonconformance process through records and tracking systems, and performing independent testing of electrical, civil, geotechnical, mechanical (including piping, pressure vessels) and architectural. SPECIFIC ACCOUNTABILITIES: Support projects in the execution of Quality Control Programs. Position responsibilities include: + Supervise inspection and testing personnel. + Plan and coordinate site-wide inspection and testing operations. + Review project Inspection & Testing Plans (ITP) and other Project Plans, as needed. + Prepare and review test reports. + Participate in independent quality oversight, surveillance and witnessing of field activities and installations. + Participate in independent sampling, testing and material receipt inspection. + Support the preparation and implementation of project inspection/assessment strategies and reports to cover all project phases. + Support reporting and addressing of corrective and preventive actions and analysis and trending of quality data. + Liaise with client and contractor quality representatives, and project members to ensure that all quality issues are documented and resolved. + Interface and coordinate with clients, contractors, and inspection & testing agencies on Quality Control matters; oversee related inspection & testing activities for quality and conformance to deliverable requirements. + Coordinate Quality Control deliverables and documentation; participate in Quality Control planning activities. Necessary Skills and Knowledge: The skills and knowledge to execute this role are usually acquired through 15+ years of relevant construction experience, preferably in a nuclear environment. The individual would possess good written and verbal skills. Qualifications Minimum Requirements: + Engineering Degree in a related field + 6 Yr of related experience or + Diploma/Certificate Quality Engineer + 8 yrs or more of related experience. Strongly Preferred Qualifications: + P.Eng, Certified Technologist, or Certified Quality Engineer. + A minimum of six years of multi-discipline Quality Control inspection and testing, or equivalent experience. + Demonstrated leadership experience supervising multi-discipline construction teams. + Experience in water treatment plant construction. + Experience in environmental remediation construction, including municipal landfill sites. + Demonstrated ability to understand drawings and specifications. + Demonstrated knowledge and ability in the application of Quality Control procedures, inspection and testing techniques. + Demonstrated good analytical skills and familiarity with quality tools and methodologies. + Demonstrated knowledge of best practices for inspection, testing, quality control and defect management. Additional Information Offered rate of compensation in Chalk River will be based on individual education, qualifications, experience. The salary range for this position is $ 110K- $150K. About AECOM AECOM is the world's trusted infrastructure consulting firm, delivering professional services throughout the project lifecycle – from advisory, planning, design and engineering to program and construction management. On projects spanning transportation, buildings, water, new energy and the environment, our publicand private-sector clients trust us to solve their most complex challenges. Our teams are driven by a common purpose to deliver a better world through our unrivaled technical and digital expertise, a culture of equity, diversity and inclusion, and a commitment to environmental, social and governance priorities. AECOM is a Fortune 500 firm and its Professional Services business had revenue of $13.1 billion in fiscal year 2022. See how we are delivering sustainable legacies for generations to come at aecom.com and @AECOM. Freedom to Grow in a World of Opportunity You will have the flexibility you need to do your best work with hybrid work options. Whether you are working from an AECOM office, remote location or at a client site, you will be working in a dynamic environment where your integrity, entrepreneurial spirit and pioneering mindset are championed. You will help us foster a culture of equity, diversity and inclusion – a safe and respectful workplace, where we invite everyone to bring their whole selves to work using their unique talents, backgrounds and expertise to create transformational outcomes for our clients. AECOM provides a wide array of compensation and benefits programs to meet the diverse needs of our employees and their families. We also provide a robust global well-being program. We're the world's trusted global infrastructure firm, and we are in this together – your growth and success are ours too. Join us, and you will get all the benefits of being a part of a global, publicly traded firm – access to industry-leading technology and thinking and transformational work with big impact and work flexibility. As an Equal Opportunity Employer, we believe in each person's potential, and we will help you reach yours. All your information will be kept confidential according to EEO guidelines. ReqID: J10102387 Business Line: Energy Business Group: DCS Strategic Business Unit: Canada Career Area: Construction Work Location Model: On-Site",
    "processed_description": "company description . change . deliver . improve commute light provide access clean water transform skyline help people community thrive . world's trust infrastructure consulting firm partner client solve world's complex challenge build legacy future generation . . accelerate infrastructure investment worldwide service great demand . invite bring bold idea big dream global team planner designer engineer scientist digital innovator program construction manager professional deliver project create positive tangible impact . global team drive common purpose deliver . join . search Field Management Supervisor position base support site . GENERAL accountabilitie responsible technical quality inspection civil geotechnical mechanical electrical architectural installation surveillance witnessing perform trade . lead team qualified discipline inspector subcontractor primary responsibility perform independent testing surveillance oversight witnessing activity relate procurement construction commissioning nuclear facility . duty include limit prepare implement inspection test procedure identify installation product process issue implement nonconformance process record tracking system perform independent testing electrical civil geotechnical mechanical include piping pressure vessel architectural . specific accountability support project execution . position responsibility include + supervise inspection testing personnel . + plan coordinate site wide inspection testing operation . + Review project Inspection Testing Plans . + prepare review test report . + participate independent quality oversight surveillance witnessing field activity installation . + participate independent sampling testing material receipt inspection . + support preparation implementation project inspection assessment strategy report cover project phase . + support report address corrective preventive action analysis trending quality datum . + liaise client contractor quality representative project ensure quality issue document resolve . + interface coordinate client contractor inspection testing agency Quality Control matter oversee inspection testing activity quality conformance deliverable requirement . + Coordinate Quality Control deliverable documentation participate Quality Control planning activity . Skills Knowledge skill knowledge execute role acquire relevant construction preferably nuclear environment . individual possess good write verbal skill . Qualifications Minimum Requirements + Engineering Degree relate field + Yr + Diploma Certificate Quality Engineer + . preferred qualification + P.Eng . + minimum multi discipline Quality Control inspection testing equivalent . + demonstrate leadership supervise multi discipline construction team . + water treatment plant construction . + environmental remediation construction include municipal landfill site . + demonstrate understand drawing specification . + demonstrate knowledge application Quality Control procedure inspection testing technique . + demonstrate good analytical skill familiarity quality tool methodology . + demonstrate knowledge good practice inspection testing quality control defect management . Additional Information offer rate compensation base individual education qualification . salary range position world's trust infrastructure consulting firm deliver professional service project lifecycle – advisory planning design engineering program construction management . project span transportation building water energy environment publicand private sector client trust solve complex challenge . team drive common purpose deliver unrivaled technical digital expertise culture equity diversity inclusion commitment environmental social governance priority . Fortune firm Professional Services business revenue . deliver sustainable legacy generation . freedom grow flexibility good hybrid option . AECOM office remote location client site dynamic environment integrity entrepreneurial spirit pioneering mindset champion . help foster culture equity diversity inclusion – safe respectful workplace invite bring unique talent background expertise create transformational outcome client . provide wide array compensation benefit program meet diverse employee family . provide robust global program . world's trust global infrastructure firm – growth success . join benefit global publicly trade firm – access industry lead technology thinking transformational big impact flexibility . person's potential help reach . information confidential accord EEO guideline . ReqID J10102387 Business DCS Strategic Business Unit Career Area Construction Location Model site",
    "results_group": {
        "extracted_noun_chunks": [
            "inspection testing activity quality conformance deliverable requirement",
            "technology",
            "growth success",
            "transformational outcome client",
            "wide array compensation benefit program",
            "world's complex challenge",
            "plan",
            "multi discipline construction team",
            "foster culture equity diversity inclusion",
            "transformational big impact flexibility",
            "GENERAL accountabilitie responsible technical quality inspection civil geotechnical mechanical electrical architectural installation surveillance",
            "independent quality oversight surveillance",
            "inspection testing personnel",
            "unique talent background expertise",
            "duty",
            "environmental remediation construction",
            "+ Review project Inspection Testing Plans",
            "procurement construction",
            "piping pressure vessel architectural",
            "independent testing surveillance oversight",
            "Engineering Degree",
            "professional service project lifecycle",
            "robust global program",
            "company description",
            "Quality Control planning activity",
            "corrective preventive action analysis",
            "role",
            "activity",
            "global team",
            "search Field Management Supervisor position base support site",
            "safe respectful workplace",
            "independent sampling testing material receipt inspection",
            "leadership",
            "lead team qualified discipline inspector subcontractor primary responsibility",
            "Additional Information",
            "+ water treatment plant construction",
            "quality issue document",
            "Yr + Diploma Certificate Quality Engineer",
            "relevant construction preferably nuclear environment",
            "salary range position world's trust infrastructure consulting firm",
            "good analytical skill familiarity quality tool methodology",
            "municipal landfill site",
            "world's trust global infrastructure firm",
            "common purpose deliver",
            "legacy future generation",
            "AECOM office remote location client site dynamic environment integrity entrepreneurial spirit pioneering mindset champion",
            "access industry",
            "benefit global publicly trade firm",
            "private sector client trust",
            "complex challenge",
            "commute light",
            "verbal skill",
            "client contractor quality representative project",
            "team",
            "ReqID J10102387 Business DCS Strategic Business Unit Career Area Construction Location Model site",
            "nonconformance process record tracking system",
            "quality control defect management",
            "field activity installation",
            "drawing specification",
            "independent testing electrical civil geotechnical mechanical",
            "project span transportation building water energy environment",
            "nuclear facility",
            "perform trade",
            "quality datum",
            "world's trust infrastructure consulting firm partner client",
            "specific accountability support project execution",
            "people community",
            "P.Eng",
            "project phase",
            "advisory planning design engineering program construction management",
            "interface coordinate client contractor inspection testing agency Quality Control matter",
            "Coordinate Quality Control deliverable documentation",
            "+ minimum multi discipline Quality Control inspection testing",
            "installation product process issue",
            "Qualifications Minimum Requirements",
            "flexibility good hybrid option",
            "preferred qualification",
            "review test report",
            "diverse employee family",
            "sustainable legacy generation",
            "infrastructure investment",
            "freedom",
            "unrivaled technical digital expertise culture equity diversity inclusion commitment environmental social governance priority",
            "common purpose",
            "change",
            "field",
            "person's potential help",
            "access clean water transform skyline",
            "Fortune firm Professional Services business revenue",
            "rate compensation base individual education qualification",
            "bold idea big dream global team planner designer engineer scientist digital innovator program construction manager professional deliver project",
            "knowledge application Quality Control procedure inspection testing technique",
            "position responsibility",
            "Skills Knowledge skill knowledge",
            "information confidential accord EEO guideline",
            "great demand",
            "implement inspection test procedure",
            "liaise",
            "positive tangible impact"
        ],
        "combined_lemmatized_tokens": "company description . change . deliver . improve commute light provide access clean water transform skyline help people community thrive . world's trust infrastructure consulting firm partner client solve world's complex challenge build legacy future generation . . accelerate infrastructure investment worldwide service great demand . invite bring bold idea big dream global team planner designer engineer scientist digital innovator program construction manager professional deliver project create positive tangible impact . global team drive common purpose deliver . join . search Field Management Supervisor position base support site . GENERAL accountabilitie responsible technical quality inspection civil geotechnical mechanical electrical architectural installation surveillance witnessing perform trade . lead team qualified discipline inspector subcontractor primary responsibility perform independent testing surveillance oversight witnessing activity relate procurement construction commissioning nuclear facility . duty include limit prepare implement inspection test procedure identify installation product process issue implement nonconformance process record tracking system perform independent testing electrical civil geotechnical mechanical include piping pressure vessel architectural . specific accountability support project execution . position responsibility include + supervise inspection testing personnel . + plan coordinate site wide inspection testing operation . + Review project Inspection Testing Plans . + prepare review test report . + participate independent quality oversight surveillance witnessing field activity installation . + participate independent sampling testing material receipt inspection . + support preparation implementation project inspection assessment strategy report cover project phase . + support report address corrective preventive action analysis trending quality datum . + liaise client contractor quality representative project ensure quality issue document resolve . + interface coordinate client contractor inspection testing agency Quality Control matter oversee inspection testing activity quality conformance deliverable requirement . + Coordinate Quality Control deliverable documentation participate Quality Control planning activity . Skills Knowledge skill knowledge execute role acquire relevant construction preferably nuclear environment . individual possess good write verbal skill . Qualifications Minimum Requirements + Engineering Degree relate field + Yr + Diploma Certificate Quality Engineer + . preferred qualification + P.Eng . + minimum multi discipline Quality Control inspection testing equivalent . + demonstrate leadership supervise multi discipline construction team . + water treatment plant construction . + environmental remediation construction include municipal landfill site . + demonstrate understand drawing specification . + demonstrate knowledge application Quality Control procedure inspection testing technique . + demonstrate good analytical skill familiarity quality tool methodology . + demonstrate knowledge good practice inspection testing quality control defect management . Additional Information offer rate compensation base individual education qualification . salary range position world's trust infrastructure consulting firm deliver professional service project lifecycle – advisory planning design engineering program construction management . project span transportation building water energy environment publicand private sector client trust solve complex challenge . team drive common purpose deliver unrivaled technical digital expertise culture equity diversity inclusion commitment environmental social governance priority . Fortune firm Professional Services business revenue . deliver sustainable legacy generation . freedom grow flexibility good hybrid option . AECOM office remote location client site dynamic environment integrity entrepreneurial spirit pioneering mindset champion . help foster culture equity diversity inclusion – safe respectful workplace invite bring unique talent background expertise create transformational outcome client . provide wide array compensation benefit program meet diverse employee family . provide robust global program . world's trust global infrastructure firm – growth success . join benefit global publicly trade firm – access industry lead technology thinking transformational big impact flexibility . person's potential help reach . information confidential accord EEO guideline . ReqID J10102387 Business DCS Strategic Business Unit Career Area Construction Location Model site"
    }
}