{
    "id": "ed0a9db256048b35",
    "company": "Queensway Carleton Hospital",
    "positionName": "Director, Quality, Patient Relations & Safety, IPAC",
    "jobType": [],
    "location": "3045 Baseline Road, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-11-29T20:13:47.884Z",
    "url": "https://www.indeed.ca/rc/clk?jk=ed0a9db256048b35&from=jasx&tk=1hgol0erci16u800&vjs=3",
    "externalApplyLink": "https://erecruiter.qch.on.ca/default.aspx?REQ_ID=13162",
    "companyDescription": "",
    "description": "General Posting Information\n \n \n  \n    \n    \n   Director, Quality, Patient Relations \n   & Safety, IPAC \n    Queensway Carleton Hospital \n    Location: Ottawa, ON. \n    Located in fast-growing west Ottawa, Queensway Carleton Hospital (QCH) cares for more than 500,000 each year. With 264 beds, QCH is the secondary referral centre for the Ottawa Valley and offers diverse programs and services such as Emergency, Childbirth, Geriatrics, Mental Health, Rehabilitation, Medical and Surgical Services, and Critical Care Services. Its exemplary team of 2,500+ health care professionals have dedicated themselves to providing expert care that puts patients and families first and was recognized in Newsweek’s World’s Best Hospitals Survey in 2021 as the #1 hospital in Ottawa, #16 in Canada. \n    QCH is seeking its next Director, Quality, Patient Relations & Safety, IPAC. \n    Reporting to the Vice President, Patient Care and Chief Nurse Executive, the Director strategically directs the planning, development, implementation, maintenance, and evaluation of the QCH quality improvement, quality assurance, risk management, client experience, clinical education and infection prevention and control (IPAC) programs. To do so the Director acts a key liaison and relationship builder across the hospital, leading and participating on various internal and external committees, task forces, networks and multidisciplinary project teams. \n    As an ideal candidate, you are Masters prepared and bring a minimum of five years’ healthcare leadership experience combined with demonstrated oversight and leadership of progressive Quality Care Initiatives. QCH will benefit from your deep knowledge and experience in strategic planning, data analysis methods and risk management knowledge and your demonstrated skill in leading transformative change that will ensure that QCH’s commitment to deliver exceptional quality, patient safety and experience is delivered. You are an outstanding communicator whose strategic, analytical, continuous improvement skills, conceptual thinking and technological orientation have been of great value in conveying your expertise and advice to senior leaders. Proactive, progressive, courageous, emotionally intelligent, and resilient are all terms that peers would use to describe you. You have a bias to action and excel at making practical, transparent and evidence informed decisions and in building and leading high functioning teams. A Project Management Professional Designation (PMP) or Change Management (PROSCI or other) certification is an asset as is demonstrable knowledge of microbiology, epidemiology, infection prevention and control principles. \n    Play an exciting leadership role in driving initiatives to advance QCH’s culture of patient safety, ensuring that quality care remains at the forefront of all operations. To apply for this position, please visit: boyden.thriveapp.ly/job/2262. For more information, please contact Olivia Pfeffer at opfeffer@boyden.com and state the title of the position in the subject line of your e-mail. \n    We thank all applicants for their interest, however only those under consideration for the role will be contacted."
}