{
    "id": "9fe8398b29b603f0",
    "companyDescription": "",
    "description": "With over 17,000 employees worldwide, the mission of the Customer Experience & Success (CE&S) organization is to empower customers to accelerate business value through differentiated customer experiences that leverage Microsoft’s products, services, and partnerships. Come join CE&S and help us build a future where customers achieve their business outcomes faster with technology that does more.\n  Are you the tech-savvy cloud loving person that has Cloud and IT (information technology) Service Management blood running in your veins? Do you want to be that key person that helps our more strategic enterprise customers achieving the most out of the Microsoft products and services they use? Do you get your energy from making your customers succeed in making their strategic and transformational cloud projects real? \n As a Customer Success Account Manager (CSAM), you are the primary delivery lead and a partner for our more strategic customers, empowering them to achieve more by accelerating their value realization across our Digital Cloud platforms. By leveraging your technical expertise, business acumen and industry perspectives you will be responsible for the end-to-end post sales delivery and support orchestration across the Microsoft and Partner ecosystem to align the right resources at the right time to achieve customer business outcomes.\n  Check out the CSAM role in the Customer Success Unit at Microsoft! Be ready to make impact! This opportunity will allow you to accelerate your career growth, leverage your delivery management capabilities and deepen your cloud and industry expertise. This role is flexible in that you can work up to (50%- 75%) from home.\n  Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n  Responsibilities\n  Customer Relationship Management\n \n   Builds customer, partner, and internal stakeholder engagement models. Manages and/or supports foundational relationships with key customer stakeholders and technical professionals to enable quality solution delivery and health using partnerships with other account team leaders in collaboration with more experienced colleagues. Develops customer relationships beyond the current Unified Support contract consumers with a focus on understanding business priorities and how they align and realize the business value for customers and Microsoft.\n   Identifies, navigates, communicates, and influences key customer technical and business stakeholders at different levels. Guides and leads conversations to facilitate the achievement of customer business objectives by leveraging their investment in Microsoft. Maps internal roles to customer priorities to action the needs of customers. Holds, maintains, and nurtures internal stakeholder relationships. Learns how to establish senior/executive internal relationships. Develops communication techniques for holding business value conversations at customer executive levels.\n   Gathers information on the business and Information Technology objectives for customer organizations to identify customer priorities and map them to appropriate solutions. Contributes to the development of a shared customer account plan to support customer objectives using partnerships with other account team leaders.\n \n  Technical Relevance\n \n   Understands, identifies, and aligns Microsoft solutions, and technical capabilities (e.g., Azure, Modern Work, Dynamics) to customer needs and priorities. Leverages technical aptitude and industry awareness to translate customer interactions into customer business impact and value. Identifies customer scenarios and aligns with technical specialists to identify relevant cross-cloud technology solutions. Develops an awareness of the cloud technology marketplace, including Microsoft competitors.\n \n  Customer Success Leadership\n \n   Initiates conversations with customers to connect customer objectives and the current Microsoft portfolio of work in the customer account. Adopts the organizational and customer success strategy. Begins to align Microsoft technology and services with the customer goals and objectives. Supports account team planning, promoting business and technical needs for change. Aligns with the account team to link Customer Success Plans (CSPs) with account plan priorities and develop bookable programs of work. Works with their customers to design programs that improve operational health.\n   Delivers on program planning and customer-facing program reviews, prioritization of engagements, and engagement with key technical and business stakeholders to address agreed-upon customer outcomes and account priorities to deliver ongoing customer success. Applies the use of Microsoft delivery management methodologies, processes, and tools to manage customer operational health. Identifies and mitigates customer blockers by leveraging Microsoft solutions and services, and develops deliverable programs of work with guidance from more experienced colleagues. Orchestrates delivery resources to facilitate value realization with a focus on driving operational health. Performs delivery program reviews with internal stakeholders to ensure alignment on customer outcomes and account priorities. Provides escalation management and communications for delivery programs in the customer account.\n   Identifies actual and potential blockers to consumption through data analysis and feedback from customers. Mobilizes resources to address actual and potential blockers to consumption and associated issues. Holds accountability for identified consumption milestones and their completion. Partners with customer to track progress, resolve blockers, and keeps activities on schedule to ensure meeting consumption milestones. Tracks adoption and usage of Microsoft products and services, works with customers to identify areas where adoption could be improved, and takes action to drive usage. Develops and leverages an understanding of retention and churn in their customer portfolio to begin identifying potential opportunities where retention may become an issue.\n \n  Other\n \n   Embody our culture and values\n \n \n  Qualifications\n  Required/Minimum Qualifications\n \n   Bachelor's Degree in Business, Sociology, Psychology, Computer Science or related field AND 2+ years customer success, solution delivery, practice management, customer-facing consulting, or portfolio management experience \n   \n    OR equivalent experience.\n   \n \n \n   Other requirement:\n \n \n   Active Canadian Government Secret Clearance or the ability to secure Secret Clearance with the Canadian Industrial Security Directorate (CISD) of Public Services and Procurement Canada.\n \n  Additional or Preferred Qualifications\n \n   Bachelor's Degree in Business, Sociology, Psychology, Computer Science or related field AND 5+ years customer success, solution delivery, practice management, customer-facing consulting, or portfolio management experience\n   \n     OR equivalent experience.\n   \n   1+ year(s) relevant work experience within customer industry.\n   Microsoft or competitor equivalent (e.g., AWS) certification in relevant technologies (e.g., Azure, 365).\n   Information Technology Infrastructure Library (ITIL) Foundation certification or equivalent service management certification.\n \n \n \n   Customer Success Account Mgmt IC3 - The typical base pay range for this role across Canada is CAD $64,600 - CAD $125,400 per year.\n \n \n \n   Find additional pay information here: \n   https://careers.microsoft.com/v2/global/en/canada-pay-information.html\n \n  \n  Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
    "preprocessed_description": "With over 17,000 employees worldwide, the mission of the Customer Experience & Success (CEandS) organization is to empower customers to accelerate business value through differentiated customer experiences that leverage Microsoft's products, services, and partnerships. Come join CEandS and help us build a future where customers achieve their business outcomes faster with technology that does more. Are you the tech-savvy cloud loving person that has Cloud and IT (information technology) Service Management blood running in your veins? Do you want to be that key person that helps our more strategic enterprise customers achieving the most out of the Microsoft products and services they use? Do you get your energy from making your customers succeed in making their strategic and transformational cloud projects real? As a Customer Success Account Manager (CSAM), you are the primary delivery lead and a partner for our more strategic customers, empowering them to achieve more by accelerating their value realization across our Digital Cloud platforms. By leveraging your technical expertise, business acumen and industry perspectives you will be responsible for the end-to-end post sales delivery and support orchestration across the Microsoft and Partner ecosystem to align the right resources at the right time to achieve customer business outcomes. Check out the CSAM role in the Customer Success Unit at Microsoft! Be ready to make impact! This opportunity will allow you to accelerate your career growth, leverage your delivery management capabilities and deepen your cloud and industry expertise. This role is flexible in that you can work up to (50%- 75%) from home. Microsoft's mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. Responsibilities Customer Relationship Management Builds customer, partner, and internal stakeholder engagement models. Manages and/or supports foundational relationships with key customer stakeholders and technical professionals to enable quality solution delivery and health using partnerships with other account team leaders in collaboration with more experienced colleagues. Develops customer relationships beyond the current Unified Support contract consumers with a focus on understanding business priorities and how they align and realize the business value for customers and Microsoft. Identifies, navigates, communicates, and influences key customer technical and business stakeholders at different levels. Guides and leads conversations to facilitate the achievement of customer business objectives by leveraging their investment in Microsoft. Maps internal roles to customer priorities to action the needs of customers. Holds, maintains, and nurtures internal stakeholder relationships. Learns how to establish senior/executive internal relationships. Develops communication techniques for holding business value conversations at customer executive levels. Gathers information on the business and Information Technology objectives for customer organizations to identify customer priorities and map them to appropriate solutions. Contributes to the development of a shared customer account plan to support customer objectives using partnerships with other account team leaders. Technical Relevance Understands, identifies, and aligns Microsoft solutions, and technical capabilities (e.g., Microsoft Azure, Modern Work, Dynamics) to customer needs and priorities. Leverages technical aptitude and industry awareness to translate customer interactions into customer business impact and value. Identifies customer scenarios and aligns with technical specialists to identify relevant cross-cloud technology solutions. Develops an awareness of the cloud technology marketplace, including Microsoft competitors. Customer Success Leadership Initiates conversations with customers to connect customer objectives and the current Microsoft portfolio of work in the customer account. Adopts the organizational and customer success strategy. Begins to align Microsoft technology and services with the customer goals and objectives. Supports account team planning, promoting business and technical needs for change. Aligns with the account team to link Customer Success Plans (CSPs) with account plan priorities and develop bookable programs of work. Works with their customers to design programs that improve operational health. Delivers on program planning and customer-facing program reviews, prioritization of engagements, and engagement with key technical and business stakeholders to address agreed-upon customer outcomes and account priorities to deliver ongoing customer success. Applies the use of Microsoft delivery management methodologies, processes, and tools to manage customer operational health. Identifies and mitigates customer blockers by leveraging Microsoft solutions and services, and develops deliverable programs of work with guidance from more experienced colleagues. Orchestrates delivery resources to facilitate value realization with a focus on driving operational health. Performs delivery program reviews with internal stakeholders to ensure alignment on customer outcomes and account priorities. Provides escalation management and communications for delivery programs in the customer account. Identifies actual and potential blockers to consumption through data analysis and feedback from customers. Mobilizes resources to address actual and potential blockers to consumption and associated issues. Holds accountability for identified consumption milestones and their completion. Partners with customer to track progress, resolve blockers, and keeps activities on schedule to ensure meeting consumption milestones. Tracks adoption and usage of Microsoft products and services, works with customers to identify areas where adoption could be improved, and takes action to drive usage. Develops and leverages an understanding of retention and churn in their customer portfolio to begin identifying potential opportunities where retention may become an issue. Other Embody our culture and values Qualifications Required/Minimum Qualifications Bachelor's Degree in Business, Sociology, Psychology, Computer Science or related field AND 2+ years customer success, solution delivery, practice management, customer-facing consulting, or portfolio management experience OR equivalent experience. Other requirement: Active Canadian Government Secret Clearance or the ability to secure Secret Clearance with the Canadian Industrial Security Directorate (CISD) of Public Services and Procurement Canada. Additional or Preferred Qualifications Bachelor's Degree in Business, Sociology, Psychology, Computer Science or related field AND 5+ years customer success, solution delivery, practice management, customer-facing consulting, or portfolio management experience OR equivalent experience. 1+ year(s) relevant work experience within customer industry. Microsoft or competitor equivalent (e.g., Amazon Web Services) certification in relevant technologies (e.g., Microsoft Azure, 365). Information Technology Infrastructure Library (ITIL) Foundation certification or equivalent service management certification. Customer Success Account Mgmt IC3 - The typical base pay range for this role across Canada is Computer-Aided Design $64,600 - Computer-Aided Design $125,400 per year. Find additional pay information here: https://careers.microsoft.com/v2/global/en/canada-pay-information.html Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
    "processed_description": "employee worldwide mission CEandS organization empower customer accelerate business differentiated customer leverage Microsoft's product service partnership . join ceands help build future customer achieve business outcome fast technology . tech savvy cloud love person Cloud information technology Service Management blood vein key person help strategic enterprise customer achieve Microsoft product service energy customer succeed strategic transformational cloud project real Customer Success Account Manager primary delivery lead partner strategic customer empower achieve accelerate realization Digital Cloud platform . leverage technical expertise business acumen industry perspective responsible post sale delivery support orchestration Microsoft Partner ecosystem align resource achieve customer business outcome . check CSAM role ready impact allow accelerate career growth leverage delivery management capability deepen cloud industry expertise . role flexible . Microsoft's mission empower person organization planet achieve . employee growth mindset innovate empower collaborate realize share goal . build respect integrity accountability create culture inclusion thrive . responsibility Customer Relationship Management Builds customer partner internal stakeholder engagement model . manage support foundational relationship key customer stakeholder technical professional enable quality solution delivery health partnership account team leader collaboration experienced colleague . develop customer relationship current Unified Support contract consumer focus understand business priority align realize business customer . Identifies navigate communicate influence key customer technical business stakeholder level . guide lead conversation facilitate achievement customer business objective leverage investment . map internal role customer priority action customer . hold maintain nurture internal stakeholder relationship . learn establish senior executive internal relationship . develop communication technique hold business conversation customer executive level . gather information business Information Technology objective customer organization identify customer priority map appropriate solution . contribute development share customer account plan support customer objective partnership account team leader . Technical Relevance Understands identify align Microsoft solution technical capability customer priority . leverage technical aptitude industry awareness translate customer interaction customer business impact . identifies customer scenario align technical specialist identify relevant cross cloud technology solution . develop awareness cloud technology marketplace include Microsoft competitor . Customer Success Leadership Initiates conversation customer connect customer objective current Microsoft portfolio customer account . adopts organizational customer success strategy . align Microsoft technology service customer goal objective . support account team planning promote business technical change . align account team link Customer Success Plans CSPs account plan priority develop bookable program . customer design program improve operational health . deliver program planning customer face program review prioritization engagement engagement key technical business stakeholder address agree customer outcome account priority deliver ongoing customer success . applie Microsoft delivery management methodology process tool manage customer operational health . identifie mitigate customer blocker leverage Microsoft solution service develop deliverable program guidance experienced colleague . delivery resource facilitate realization focus drive operational health . perform delivery program review internal stakeholder ensure alignment customer outcome account priority . provide escalation management communication delivery program customer account . identifie actual potential blocker consumption datum analysis feedback customer . resource address actual potential blocker consumption associate issue . hold accountability identify consumption milestone completion . partner customer track progress resolve blocker activity schedule ensure meet consumption milestone . track adoption usage Microsoft product service customer identify area adoption improve action drive usage . develop leverage understanding retention churn customer portfolio identify potential retention issue . embody culture Qualifications require Minimum Qualifications Bachelor's Degree Business Sociology Psychology Computer Science field + customer success solution delivery practice management customer face consulting portfolio management equivalent . requirement secure Secret Clearance cisd . additional Preferred Qualifications Bachelor's Degree Business Sociology Psychology Computer Science field + customer success solution delivery practice management customer face consulting portfolio management equivalent . + relevant customer industry . competitor equivalent e.g. Amazon Web Services certification relevant technology . Information Technology Infrastructure Library itil Foundation certification equivalent service management certification . Customer Success Account Mgmt IC3 typical base pay range role computer aid Design . find additional pay information equal employer . consistent applicable law qualified applicant receive consideration employment regard age ancestry citizenship color family medical care leave gender identity expression genetic information immigration status marital status medical condition national origin physical mental political affiliation protect veteran military status race ethnicity religion sex include pregnancy sexual orientation characteristic protect applicable local law regulation ordinance . assistance reasonable accommodation application process read request accommodation .",
    "results_group": {
        "extracted_noun_chunks": [
            "leverage technical aptitude industry awareness",
            "additional pay information equal employer",
            "information business Information Technology objective customer organization",
            "key customer stakeholder technical professional enable quality solution delivery health partnership account team leader collaboration",
            "business priority align",
            "Microsoft solution technical capability customer priority",
            "employee growth mindset",
            "competitor equivalent e.g. Amazon Web Services certification",
            "achievement customer business objective leverage investment",
            "identifie",
            "requirement",
            "blood vein",
            "Customer Success Account Mgmt IC3 typical base pay range role computer aid Design",
            "alignment customer outcome account priority",
            "culture Qualifications",
            "CSPs",
            "consideration employment regard age ancestry citizenship color family medical care",
            "technical expertise business acumen industry perspective",
            "future customer",
            "career growth leverage delivery management capability",
            "Microsoft competitor",
            "Microsoft's mission empower person organization planet",
            "CSAM",
            "customer",
            "conversation",
            "additional Preferred Qualifications Bachelor's Degree Business Sociology Psychology Computer Science field",
            "respect integrity accountability",
            "cloud industry expertise",
            "technical specialist",
            "escalation management communication delivery program customer account",
            "delivery program review internal stakeholder",
            "customer design program",
            "customer objective current Microsoft portfolio customer account",
            "potential retention issue",
            "Customer Success Leadership Initiates",
            "Secret Clearance cisd",
            "+ relevant customer industry",
            "request accommodation",
            "support account team planning",
            "Microsoft technology service customer goal objective",
            "Technical Relevance",
            "business differentiated customer leverage",
            "operational health",
            "customer interaction customer business impact",
            "action drive usage",
            "organizational customer success strategy",
            "ceands",
            "relevant technology",
            "strategic enterprise customer",
            "responsibility",
            "employee worldwide mission",
            "business conversation customer executive level",
            "pregnancy sexual orientation",
            "actual potential blocker consumption datum analysis feedback customer",
            "customer partner internal stakeholder engagement model",
            "development share customer account plan",
            "accountability",
            "colleague",
            "customer scenario",
            "area adoption",
            "assistance reasonable accommodation application process",
            "nurture internal stakeholder relationship",
            "influence",
            "delivery resource",
            "Information Technology Infrastructure Library itil Foundation certification equivalent service management certification",
            "program planning customer",
            "share goal",
            "culture inclusion",
            "ongoing customer success",
            "resource address actual potential blocker consumption associate issue",
            "customer priority map appropriate solution",
            "track adoption usage",
            "Minimum Qualifications Bachelor's Degree Business Sociology Psychology Computer Science field",
            "consumption milestone completion",
            "business customer",
            "Microsoft product service energy customer",
            "customer operational health",
            "relevant cross cloud technology solution",
            "Customer Success Plans",
            "veteran military status race ethnicity religion sex",
            "senior executive internal relationship",
            "customer blocker leverage Microsoft solution service",
            "account team",
            "internal role customer priority action customer",
            "deliverable program guidance experienced colleague",
            "customer success solution delivery practice management customer",
            "current Unified Support contract consumer focus",
            "awareness cloud technology marketplace",
            "consistent applicable law qualified applicant",
            "portfolio management equivalent",
            "business outcome fast technology",
            "realization focus",
            "applie Microsoft delivery management methodology process tool",
            "support foundational relationship",
            "conversation customer",
            "partner customer track progress",
            "applicable local law regulation ordinance",
            "customer outcome account priority",
            "business technical change",
            "Identifies",
            "Microsoft's product service partnership",
            "Microsoft product service customer",
            "consumption milestone",
            "bookable program",
            "communication technique",
            "Digital Cloud platform",
            "realization",
            "customer objective partnership account team leader",
            "resource",
            "customer relationship",
            "blocker activity schedule",
            "organization",
            "customer business outcome",
            "role ready impact",
            "leverage understanding retention churn customer portfolio"
        ],
        "combined_lemmatized_tokens": "employee worldwide mission CEandS organization empower customer accelerate business differentiated customer leverage Microsoft's product service partnership . join ceands help build future customer achieve business outcome fast technology . tech savvy cloud love person Cloud information technology Service Management blood vein key person help strategic enterprise customer achieve Microsoft product service energy customer succeed strategic transformational cloud project real Customer Success Account Manager primary delivery lead partner strategic customer empower achieve accelerate realization Digital Cloud platform . leverage technical expertise business acumen industry perspective responsible post sale delivery support orchestration Microsoft Partner ecosystem align resource achieve customer business outcome . check CSAM role ready impact allow accelerate career growth leverage delivery management capability deepen cloud industry expertise . role flexible . Microsoft's mission empower person organization planet achieve . employee growth mindset innovate empower collaborate realize share goal . build respect integrity accountability create culture inclusion thrive . responsibility Customer Relationship Management Builds customer partner internal stakeholder engagement model . manage support foundational relationship key customer stakeholder technical professional enable quality solution delivery health partnership account team leader collaboration experienced colleague . develop customer relationship current Unified Support contract consumer focus understand business priority align realize business customer . Identifies navigate communicate influence key customer technical business stakeholder level . guide lead conversation facilitate achievement customer business objective leverage investment . map internal role customer priority action customer . hold maintain nurture internal stakeholder relationship . learn establish senior executive internal relationship . develop communication technique hold business conversation customer executive level . gather information business Information Technology objective customer organization identify customer priority map appropriate solution . contribute development share customer account plan support customer objective partnership account team leader . Technical Relevance Understands identify align Microsoft solution technical capability customer priority . leverage technical aptitude industry awareness translate customer interaction customer business impact . identifies customer scenario align technical specialist identify relevant cross cloud technology solution . develop awareness cloud technology marketplace include Microsoft competitor . Customer Success Leadership Initiates conversation customer connect customer objective current Microsoft portfolio customer account . adopts organizational customer success strategy . align Microsoft technology service customer goal objective . support account team planning promote business technical change . align account team link Customer Success Plans CSPs account plan priority develop bookable program . customer design program improve operational health . deliver program planning customer face program review prioritization engagement engagement key technical business stakeholder address agree customer outcome account priority deliver ongoing customer success . applie Microsoft delivery management methodology process tool manage customer operational health . identifie mitigate customer blocker leverage Microsoft solution service develop deliverable program guidance experienced colleague . delivery resource facilitate realization focus drive operational health . perform delivery program review internal stakeholder ensure alignment customer outcome account priority . provide escalation management communication delivery program customer account . identifie actual potential blocker consumption datum analysis feedback customer . resource address actual potential blocker consumption associate issue . hold accountability identify consumption milestone completion . partner customer track progress resolve blocker activity schedule ensure meet consumption milestone . track adoption usage Microsoft product service customer identify area adoption improve action drive usage . develop leverage understanding retention churn customer portfolio identify potential retention issue . embody culture Qualifications require Minimum Qualifications Bachelor's Degree Business Sociology Psychology Computer Science field + customer success solution delivery practice management customer face consulting portfolio management equivalent . requirement secure Secret Clearance cisd . additional Preferred Qualifications Bachelor's Degree Business Sociology Psychology Computer Science field + customer success solution delivery practice management customer face consulting portfolio management equivalent . + relevant customer industry . competitor equivalent e.g. Amazon Web Services certification relevant technology . Information Technology Infrastructure Library itil Foundation certification equivalent service management certification . Customer Success Account Mgmt IC3 typical base pay range role computer aid Design . find additional pay information equal employer . consistent applicable law qualified applicant receive consideration employment regard age ancestry citizenship color family medical care leave gender identity expression genetic information immigration status marital status medical condition national origin physical mental political affiliation protect veteran military status race ethnicity religion sex include pregnancy sexual orientation characteristic protect applicable local law regulation ordinance . assistance reasonable accommodation application process read request accommodation ."
    }
}