{
    "id": "ce51979badb9ea05",
    "company": "Scholars Tutoring of Stittsville and Kanata Lakes",
    "positionName": "Teacher/Tutor - MS/HS Science/Math",
    "jobType": [],
    "location": "5100 Kanata Avenue, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-06T20:08:35.476Z",
    "url": "https://www.indeed.ca/rc/clk?jk=ce51979badb9ea05&from=jasx&tk=1hc6gcllqltfi801&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "Company description\nScholars tutoring franchise is now has two locations: Stittsville and Kanata Lakes and is seeking passionate and enthusiastic part-time Teachers/Tutors for various ages and academic subjects, particularly in higher math and sciences. As a teacher at Scholars, you will have the opportunity to positively impact students both personally and academically. We take pride in delivering “results that matter” to all of our students, and our teachers play a key role in this journey. The successful candidate will be trained on Scholars’ teaching methodology. Candidates must be confident teaching their subject and grade level. If you're looking for a rewarding and challenging work environment, we want to hear from you!\nJob description\nSmall group (maximum 3:1 ratio), individualized tutoring for students ranging in age from from elementary school to university. Subject specialists (math, science, physics, chemistry) are being sought.\nHere’s what we’re looking for:\n\n Ontario Certified Teachers are preferred\n Candidates in Teachers College or university designation towards math and sciences are also encouraged to apply.\n Previous experience working with students is an asset.\n Excellent English oral and written skills. OR FRENCH FOR FRENCH LANGUAGE CANDIDATES\n A passion to help students reach their potential.\n Exceptionally organized and high attention to detail.\n Ability to teach groups of up to 3 students.\n Must be able to effectively teach their subject and level\n Hiring specialists tutoring: Advanced Functions, Calculus and Vectors, Data Management, Physics, Biology, and Chemistry.\n\nCandidates must be able to work a minimum of two shifts per week within our hours of operation below.\n\n Monday - Thursday, 3:00 - 8:00 pm\n Saturdays, 9:00 am - 1:00 pm\n\nJob Type: Part-timePart-time hours: 8-12 per week\nSalary: $19.00-$21.50 per hour\nBenefits:\n\n Flexible schedule\n On-site parking\n\nCOVID-19 considerations:Covid protocols are aligned with provincial requirements. \nApplication question(s):\n\n Are you eligible to work in Canada?\n\nEducation:\n\n Bachelor's Degree (preferred)\n\nLicence/Certification:\n\n teaching certification (preferred)\n\nWork Location: In person"
}