{
    "id": "139edc7f3868e9d6",
    "company": "Thera-Business Consulting",
    "positionName": "Director of Medical Writing and Research",
    "jobType": [],
    "location": "515 Legget Dr, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-07T02:04:25.335Z",
    "url": "https://www.indeed.ca/rc/clk?jk=139edc7f3868e9d6&from=jasx&tk=1hc6ge9ifk7pr800&vjs=3",
    "externalApplyLink": null,
    "job_info_group": {
        "extracted_phone_numbers": [],
        "extracted_links": [
            "HTTP/HTTPS Links",
            "General Links",
            "WWW Links",
            "TLDs"
        ],
        "extracted_emails": [],
        "extracted_location_data": [
            "Kanata North"
        ],
        "extracted_dates": [
            "7 years",
            "Monday",
            "5+ years"
        ],
        "extracted_languages": [
            "English"
        ],
        "extracted_laws": [],
        "extracted_norps": [
            "French"
        ],
        "extracted_orgs": [
            "Responsibilities Thera-Business",
            "Communicate",
            "Vision care Flexible Language Requirement",
            "study suitability and data contribution Synthesize",
            "Develop"
        ],
        "extracted_persons": [],
        "extracted_products": [],
        "extracted_money": [],
        "processed_text": "position term renewal advancement . short notice . competitive salary base . comprehensive benefit package . seek experienced medical writer researcher responsible lead individual project . key responsibility include design development product dossier message clinical summary peer review manuscript systematic review regulatory document report pharmaceutical biotechnology product medical device public health initiative . specific task include conduct structured systematic review clinical literature Conduct meta analysis network meta analysis provide expert analysis interpretation summarize clinical study result appraise study interpret communicate clinical datum include disease specific datum medical device pharmaceutical product datum public health datum Oversee mentor medical writer researcher client ensure understanding project strategy nature medical writing service require deliver project objective outline strategic content conduct revision perform proofreading quality assurance task Requirements advanced degree life science e.g. pharmacology field e.g. biology author report pharmaceutical biotechnology product medical device public health initiative love science combine strong writing skill interest intersection health care Critical skill leadership management skill demonstrate writing skill strong multi tasking organizational sense urgency meet goal objective deadline strong attention detail excellent interpersonal verbal write communication skill demonstrate initiative accountability literature review systematic review critical appraisal health technology assessment type fixed term contract benefit casual dress company event dental care insurance Extended health care Life insurance site gym site parking Paid require Schedule Friday Education Doctoral Degree require medical writing require language require location person"
    },
    "companyDescription": "",
    "description": "Full time position in Kanata North for one-year term with opportunity for renewal and advancement. Must be available on short notice. Competitive salary based on experience. Comprehensive benefits package.\nResponsibilities\nThera-Business is seeking an experienced medical writer/researcher responsible for leading individual projects. Key responsibilities include the design and development of product value dossiers, value messages, clinical summaries, peer-reviewed manuscripts, systematic reviews, regulatory documents, and reports for pharmaceutical and biotechnology products, medical devices, and public health initiatives. Specific tasks may include the following:\n\n Conduct structured and/or systematic reviews of clinical literature\n Conduct meta-analyses and network meta-analyses\n Provide expert analysis, interpretation, and summarizing of clinical study results, and appraise studies for study suitability and data contribution\n\n\n Synthesize, interpret, and communicate clinical data, including disease-specific data, medical device or pharmaceutical product data, or public health data\n Oversee and mentor medical writers and researchers\n Communicate with clients to ensure understanding of project strategy and the nature of medical writing services required to deliver on project objectives\n Develop outlines\n Develop strategic content\n Conduct revisions\n Perform proofreading and quality assurance tasks\n\nRequirements\n\n An advanced degree in life sciences (e.g., pharmacology) or a related field (e.g., biology)\n Experience (5+ years) authoring reports for pharmaceutical or biotechnology products, medical devices, or public health initiatives\n A love of science combined with strong writing skills and an interest in their intersection with health care\n\nCritical Skills:\n\n Leadership and management skills\n Demonstrated writing skills\n Strong multi-tasking and organizational abilities\n Sense of urgency to meet goals, objectives, and deadlines\n Strong attention to detail\n Excellent interpersonal, verbal, and written communications skills\n Demonstrated initiative and accountability\n Experience with literature reviews, systematic reviews, critical appraisals, and/or health technology assessments\n\nJob Types: Full-time, Fixed term contract\nBenefits:\n\n Casual dress\n Company events\n Dental care\n Disability insurance\n Extended health care\n Life insurance\n On-site gym\n On-site parking\n Paid time off\n Vision care\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n Monday to Friday\n\nEducation:\n\n Doctoral Degree (required)\n\nExperience:\n\n medical writing: 7 years (required)\n\nLanguage:\n\n English (required)\n\nWork Location: In person"
}