{
    "id": "0052e5087671f5f3",
    "companyDescription": "",
    "description": "Job description\nWe are looking for a dental laboratory assistant to join our CAD/CAM department.\nThis is a permanent, full time job with 40 hours/ week\n\n 1 to 3 year experience in CAD/CAM (computer assisted designing and manufacturing)\n Scan, design and mill crowns & implant abutments.\n Operate and maintain various dental milling machines and 3D printers\n Previous experience in plaster and model work is an asset\n computer skills and hardware troubleshooting.\n attention to details and good communication skills\n\nWe have a ton of on-site FREE parking\nPaid vacation/ sick days/ personal days\nDental/ health benefits/ wellness program\nFamily like atmosphere\nPlease send your resume to ahmad@livedentalstudio.com\nJob Type: Full-time\nSalary: $27.00-$33.00 per hour\nBenefits:\n\n Casual dress\n Dental care\n Extended health care\n On-site parking\n Paid time off\n Profit sharing\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n 8 hour shift\n\nSupplemental pay types:\n\n Bonus pay\n\nAbility to commute/relocate:\n\n Kanata, ON: reliably commute or plan to relocate before starting work (preferred)\n\nEducation:\n\n Secondary School (preferred)\n\nExperience:\n\n dental technician: 2 years (required)\n\nLanguage:\n\n English (required)\n\nWork Location: In person",
    "preprocessed_description": "Job description We are looking for a dental laboratory assistant to join our Computer-Aided Design/CAM department. This is a permanent, full time job with 40 hours/ week 1 to 3 year experience in Computer-Aided Design/CAM (computer assisted designing and manufacturing) Scan, design and mill crowns & implant abutments. Operate and maintain various dental milling machines and 3D printers Previous experience in plaster and model work is an asset computer skills and hardware troubleshooting. attention to details and good communication skills We have a ton of on-site FREE parking Paid vacation/ sick days/ personal days Dental/ health benefits/ wellness program Family like atmosphere Please send your resume to ahmad@livedentalstudio.com Job Type: Full-time Salary: $27.00-$33.00 per hour Benefits: Casual dress Dental care Extended health care On-site parking Paid time off Profit sharing Flexible Language Requirement: French not required Schedule: 8 hour shift Supplemental pay types: Bonus pay Ability to commute/relocate: Kanata, ON: reliably commute or plan to relocate before starting work (preferred) Education: Secondary School (preferred) Experience: dental technician: 2 years (required) Language: English (required) Work Location: In person",
    "processed_description": "description dental laboratory assistant join computer aid Design CAM department . permanent hours week Computer Aided Design CAM computer assist designing manufacturing Scan design mill crown implant abutment . operate maintain dental milling machine 3d printer previous plaster model asset computer skill hardware troubleshooting . attention detail good communication skill ton site free parking pay vacation sick days personal atmosphere send resume type salary hour benefit casual dress dental care extended health care site parking Paid profit share Flexible Language Requirement require Schedule hour shift supplemental pay type bonus pay commute relocate reliably commute plan relocate start preferred education Secondary School preferred dental technician require language require location person",
    "results_group": {
        "extracted_noun_chunks": [
            "Schedule hour shift supplemental pay type bonus pay commute",
            "manufacturing Scan design mill crown implant abutment",
            "dental milling machine 3d printer previous plaster model asset computer skill hardware troubleshooting",
            "Computer Aided Design CAM computer",
            "personal atmosphere",
            "location person",
            "preferred dental technician",
            "start preferred education Secondary School",
            "computer aid Design CAM department",
            "language",
            "resume type salary hour benefit casual dress dental care extended health care site parking Paid profit share Flexible Language Requirement",
            "reliably commute plan",
            "dental laboratory assistant"
        ],
        "combined_lemmatized_tokens": "description dental laboratory assistant join computer aid Design CAM department . permanent hours week Computer Aided Design CAM computer assist designing manufacturing Scan design mill crown implant abutment . operate maintain dental milling machine 3d printer previous plaster model asset computer skill hardware troubleshooting . attention detail good communication skill ton site free parking pay vacation sick days personal atmosphere send resume type salary hour benefit casual dress dental care extended health care site parking Paid profit share Flexible Language Requirement require Schedule hour shift supplemental pay type bonus pay commute relocate reliably commute plan relocate start preferred education Secondary School preferred dental technician require language require location person"
    }
}