{
    "id": "002fa76e76beca83",
    "company": "PSSI",
    "positionName": "HR Hiring Coordinator",
    "jobType": [
        "Full-time"
    ],
    "location": "2370 Walkley Rd Unit 160, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-09T03:09:09.260Z",
    "url": "https://www.indeed.ca/rc/clk?jk=002fa76e76beca83&from=jasx&tk=1hjm33n93k6rj800&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/applystart?jk=002fa76e76beca83&from=vj&pos=top&mvj=0&spon=0&sjdu=o7sfz71MPdMgyiV0LZq0d4DDplm6SwWjHcxyoDIphKn7ImfEABTBUJUxZDnfOraeadLtQs8fOXko1D4dVxPcmwVQhpZo5gKUxoJi9wgh8GZxdel8PiYLPcsnRnfn9Vm56_uHGFQc65TGUqXzNjvX6iM20r95K4olTBlVlWwaGV05zZHCtIqFYNREI65Y1ZfKw9_XINGINv7OnqX9-Wv1cg&vjfrom=serp&log=1&astse=51e4bc30977380e0&assa=8844",
    "companyDescription": "",
    "description": "Department: Human Resources \n\n \nJob Status: Full Time \n\n \nFLSA Status: Hourly Non-Exempt \n\n \nReports To: Human Resources Manager \n\n \nWork Schedule: Varies \n\n \nAmount of Travel Required: 0-10% \n\n \nPositions Supervised: None \n\n \nWHO YOU ARE:\n Do you have a passion for connecting people with the career meant for them? Do you have a knack for finding right-fit candidates and building pipelines for future hires? Can you take the hands-on approach to leading recruitment and hiring with compliance at the top of mind? If you are ready to make a positive impact on the people of your community, we want to hear from you! Take the next step in your career by applying today! \n\n \nWHO WE ARE:\n The Leader in food-industry-related contract sanitation and food safety \n\n Over $1 Billion in sales with an excellent history of organic and acquisition growth \n\n Over 16,500 team members throughout North America \n\n Corporate headquarters in Kieler, Wisconsin with team members working in over 400 customer plants throughout North America \n\n \nOUR VISION:\n To be the leading food safety solutions company that owns the standard of health and safety for our PSSI family and brand protection for our partners \n\n \nSafety: We are committed to the health and safety of our team members and set the standard of food safety for the protection of our customers products and brands. \n\n \nIntegrity: We speak with candor, act with transparency, follow through on our commitments and abide by our principles and values. \n\n \nTeam: We respect and value our team members, embrace diversity, and invest in their development through coaching and training. \n\n \nCustomer Focus: We strive to exceed our internal and external customers expectations through open communication, relationships, and continuous improvement. \n\n \nAchievement: We manage our business to provide opportunities and stability for our team members, and bring value to our customers, owners, and the communities we serve. \n\n \nWHAT YOU WILL DO:\n In this role, you will lead the end-to-end hiring solutions for the location(s) you support. You will be the point person for hiring tactics and compliance while connecting the people of your community with a career to support their future by: \n\n Maintaining an organized and clean hiring space and providing a positive and welcoming first impression to new and current team members. \n\n Ensuring a daily and organized implementation of full lifecycle hiring efforts including reviewing applications, sourcing, screening, interviewing, hiring, and onboarding potential candidates. \n\n Promptly completing relevant new hire paperwork; verifying accuracy of all forms including Form I-9 as well as the validity of required documentation of age, identification, and eligibility to work in the U.S.A. \n\n Ensuring proper and consistent application and compliance with all aspects of policies, \n\n procedures, recruiting, hiring, and onboarding activities. \n\n Actively educating new hires on company policies and procedures. \n\n Leading local compliance with all applicable local, state, and federal regulations. \n\n Providing support and guidance to plant leadership as it relates to staffing, hiring, and HR \n\n compliance needs. \n\n Providing support and documentation for offboarding and cross boarding team members. \n\n Preparing and communicating status updates for weekly meeting with HR Manager; \n\n additional communication as needed. \n\n Assisting with distribution and implementation of company changes. \n\n \nAdditional administrative duties will include:\n o Answering, responding to, and making calls \n\n o Ongoing maintenance of personnel-related data \n\n o Supporting payroll functions \n\n o Documenting disciplinary information in a timely manner \n\n o Documenting reported injuries \n\n o Assisting with investigations as needed \n\n o Maintaining various reports for leadership \n\n o Acting as a liaison between the Corporate Office and Team Members. \n\n Performing other duties and projects as needed and assigned. \n\n \nYOUR MUST HAVES:\n Must be 18 years of age or older \n\n High school diploma or General Education Degree (GED) \n\n Proficient in HR systems and Microsoft Office Suite \n\n Must have a minimum of 1 year of experience working within the hiring process (Recruiter, \n\n Sourcer, HR, Hiring Manager, etc.) \n\n Demonstrated communication skills both oral and written \n\n \nWHAT WE PREFER YOU HAVE:\n Bilingual skills (Spanish & English) \n\n Strong organizational skills and attention to detail \n\n Self-motivated, resourceful, and disciplined \n\n Ability to thrive in fast paced environment; \n\n \nOUR ENVIRONMENT:\n This position may be based out of a local hiring office with a traditional office setting OR in a Food \n\n Production Plant that includes hot/cold, wet/dry environments requiring the use of PPE. This \n\n position will also require some travel to support the grassroots recruiting activity with networking \n\n efforts within the community (requires driving to multiple networking opportunities within the \n\n market you support). \n\n \nWHAT WE OFFER:\n Medical, Dental, & Vision Insurance \n\n Basic Life Insurance \n\n 401k Retirement Plan \n\n Paid Holidays \n\n Paid Vacation \n\n Employee Assistance Program \n\n Training & Development Opportunities \n\n Packers Sanitation Services, Inc. (PSSI) is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, creed, sex, gender, gender identity, national origin, citizenship status, uniform service member status, veteran status, age, genetic information, disability, or any other protected status, in accordance with all applicable federal state, and local laws. PSSI is committed to complying with the laws protecting qualified individuals with disabilities. PSSI will provide a reasonable accommodation for any known physical or mental disability of a qualified individual with a disability to the extent required by law, provided the requested accommodation does not create an undue hardship for the Company and/or does not pose a direct threat to the health or safety of others in the workplace and/or to the individual. If a team member requires an accommodation, they must notify the site manager or the Corporate Human Resources Department. If an applicant requires an accommodation, they must notify the hiring manager and/or the Recruiter hiring for the position. \n\n \nYOUR NEXT STEPS: APPLY! All applications will be reviewed, and qualified candidates will be contacted to continue into the interview process. If you feel like you are a good fit for this position, APPLY! If you want to be a part of a large organization that treats you like family, APPLY NOW! \n\n \nBrand: PSSI \n\nAddress: 2370 Walkley Road Unit 160 Ottawa, ON - K1G4H9 \n\nProperty Description: 8112 - Ottawa, ON \n\nProperty Number: 8112"
}