{
    "id": "009dd0d43959597d",
    "company": "Compass Group",
    "positionName": "Food Service Supervisor",
    "jobType": [],
    "location": "Stittsville, ON",
    "salary": null,
    "postingDateParsed": "2024-01-17T05:13:37.230Z",
    "url": "https://www.indeed.ca/rc/clk?jk=009dd0d43959597d&from=jasx&tk=1hkikipjiii32800&bb=g3LG73kDIG2DKbipZ3VbGFnlLbYB8kvBkCgBNMtu3JafB7WIroIZPDa3sIGO8oNWgelgZQrkdqvl0u0-D551Tyyme9cg9t5UwH8I01KKmlPG_APJC8_zrQ%3D%3D&xkcb=SoBq67M3FShE7dQ2y50DbzkdCdPP&vjs=3",
    "externalApplyLink": "https://jobs.compassgroupcareers.com/Canada/job/Stittsville-Food-Service-Supervisor-ON/1119560200/?feedId=345000&utm_source=Indeed&utm_campaign=CompassGroupHoldings_Indeed&jobboard=indeed&c=organic",
    "companyDescription": "",
    "description": "Start Date: ASAP\n  Status: Full-Time\n  Schedule: Monday to Friday, 7:00am-2:00pm\n  Wage: $19.00/hr\n  Location: 5870 Abbott St E, Stittsville ON K2S 1X4\n  Important Information: Previous management experience in the food service industry is an asset. No evening or weekend shifts. Schedule follows the school calendar. Christmas, March and Summer Break off. Eligible for great benefits & bonus up to a max of $1,000.00.\n \n  You might not know our name, but you know where we are. That’s because Compass Group Canada is part of a global foodservice and support services company that’s the 6th largest employer in the world, with 625,000 employees.\n \n  You’ll find us in schools, colleges, hospitals, office buildings, senior living communities, tourist attractions, sports venues, remote camps and military installations and more. We’re in all major cities, at remote work sites and everywhere in between – doing business in Canada and 50+ other countries where you can learn and grow. Join us now and point your career forward!\n \n  Imagine creating a place where tomorrow’s leaders, big thinkers, and dreamers gather. Join us and know that you make it possible for others to learn, grow, and discover. Because of what we do, students and faculty share so much more than a meal. And that’s why this is so much more than a job.\n \n  Why work with Chartwells? We are a member of Compass Group Canada, the leading foodservice and support services company. We cater to Generation Z on college campuses and upcoming K-12 generations. We offer dining programs and solutions that fit the unique needs of today’s students. Join our commitment to providing responsible, healthy-eating solutions.\n \n  Click here to view our Team Member video!\n \n  \n   \n     Job Summary\n   \n   \n     Essential Duties and Responsibilities:\n    \n      Supervise the production of menu items, ensure completion of cash readings, manage associates, schedule staff working hours, hire and train employees.\n      Track and produce reports on weekly inventories, sales revenue, labour and food cost.\n      Ensure strict compliance with Compass’ Quality Assurance and Health and Safety Program, Occupational Health and Safety Act and WHMIS regulations.\n      Coordinate frequent workplace inspections and WHMIS training of all staff and promptly report any workplace accident or incident to head office.\n      Ensure Hazard Analysis and Critical Control Point (HACCP) standards are followed in the food preparation process.\n    \n     Qualifications:\n     Think you have what it takes to be our Food Service Supervisors? We’re committed to hiring the best talent for the role. Here’s how we’ll know you’ll be successful in the role.\n    \n      At least one year of strong operation food industry management experience.\n      Comprehensive health and safety knowledge and training.\n      Strong motivator, mentor and leader with management skills.\n      Excellent customer service skills.\n      Excellent communication skills (written and verbal).\n      Knowledge of Microsoft Office.\n    \n   \n  \n \n  Compass Group Canada is committed to nurturing a diverse workforce representative of the communities within which we operate. We encourage and are pleased to consider all qualified candidates, without regard to race, colour, citizenship, religion, sex, marital / family status, sexual orientation, gender identity, aboriginal status, age, disability or persons who may require an accommodation, to apply.\n \n  For accommodation requests during the hiring process, please contact PeopleHub@compass-canada.com for further information."
}