{
    "id": "11e54d0dd6342225",
    "company": "Somerset West Community Health Centre",
    "positionName": "Registered Practical Nurse - Clinical Aide",
    "jobType": [
        "Permanent"
    ],
    "location": "55 ECCLES ST, Ottawa, ON",
    "salary": "$26.19–$30.81 an hour",
    "postingDateParsed": "2024-01-24T12:18:15.020Z",
    "url": "https://www.indeed.ca/rc/clk?jk=11e54d0dd6342225&from=jasx&tk=1hl5dm5j5kc37800&bb=oevkGIDXh7gG1VwZljrf75vO8ysMCl_c-387u9gf1I5NItR6IvV67joNVuzZUCcktHC9WwOf3JtC15wk2-PVAfINfxpXydNG9aH_kB4T240sXYP9nfR3NQ%3D%3D&xkcb=SoBT67M3FlTXbXRRp50FbzkdCdPP&vjs=3",
    "externalApplyLink": "https://swchc.bamboohr.com/careers/604?source=indeed&src=indeed&postedDate=2024-01-23",
    "companyDescription": "Somerset West Community Health Centre (SWCHC) is a non-profit, community-governed organization. We were established in 1978 and are located in the heart of Chinatown.\r\n\r\nWe support people and communities to enjoy the best possible health and well-being by providing health and social services.\r\n\r\n\r\n\r\nWe do this by removing barriers to accessing services for people who are vulnerable because of their age, income, ability, sexual orientation or gender identity, and language or culture.\r\n\r\n\r\n\r\nWe work alongside community members to make our neighbourhood and our city an even better place to live.",
    "description": "JOB TITLE: Registered Practical Nurse - Clinical Aide \n  CLASSIFICATION: Registered Practical Nurse \n JOB TYPE: Permanent part-time 0.6 FTE  \n (21 hours/week) with HOOPP pension & \n  Entitlements \n  DEPARTMENT: Primary Health Care \n  REPORTS TO: Manager, Primary Health Care \n  START DATE: As soon as possible \n  PAY RANGE: $26.19 to $30.81 per hour \n  DEADLINE TO APPLY: Monday, February 5th, 2024 at 5 pm EST \n  ______________________ __________________________________________________________\n \n  ABOUT US \n  We are Somerset West Community Health Centre (SWCHC), a non-profit, community-governed organization that serves over 18,000 clients annually. Established in 1978, SWCHC provides a wide range of health care services such as primary health care, health promotion, community development, mental health and harm reduction. We are deeply connected to the communities we serve and committed to removing barriers to accessing services for people who are vulnerable because of their age, income, ability, sexual orientation or gender identity, and language or culture. \n  SWCHC strives to ensure that our team reflects the communities we serve. We work within an anti-racist, anti-oppressive framework that acknowledges the existence and impacts of systemic racism, and seeks to ensure that systems are fair and equitable for everyone. \n  JOB SUMMARY \n  Reporting to the Manager, the Clinical Aide is responsible for assisting Primary Health Care staff with duties that include ordering and maintaining medical and laboratory supplies, medication samples, medical equipment; and stocking all exam and procedure rooms. The Clinical Aide checks all sources for medical supplies, ensuring cost-effective purchasing and establishes working relationships with local representatives. With knowledge of infection prevention and control, the Clinical Aide conducts reprocessing of medical instruments, leads mask fit testing and assists the Manager of Primary Health Care with monitoring of infection prevention and control best practice guidelines. \n  POSITION REQUIREMENTS \n  \n  Registered Practical Nurse, current CNO license \n  Added skill diploma from a recognized program i.e. Algonquin College Level I and II \n  Valid driver’s license and use of own vehicle\n \n  \n  \n  Key Competencies \n  \n  Two - three years of nursing experience \n  Knowledge of infection prevention & control (IPAC) practices, certification(s) in reprocessing or IPAC an asset \n  Excellent communication skills \n  Able to work effectively in an inter-professional environment \n  Organized and detail-orientated \n  Ability to work independently with minimal supervision \n  Proficient use of computers and various software applications \n  Comfortable working in a busy environment with multiple demands\n \n  \n  \n  Linguistic profile \n  \n  English required \n  French or other languages an asset\n \n  \n  \n  If interested, please submit a cover letter and resume by Monday, February 5th at 5 pm EST\n  \n  \n  **It is the policy of SWCHC to require COVID-19 immunization for all employees, volunteers, and students, including those who work off-site with the following exceptions: Persons with a medical reason that prevents them from being vaccinated against COVID-19; Persons with other reasonable considerations pursuant to the Ontario Human Rights Code that restrict them from being vaccinated against Covid 19 vaccination.** \n  Somerset West Community Health Centre is an equal opportunity employer who values the diversity of individuals in our programs and services.\n  \n  \n  We welcome and encourage applications from members of Indigenous, Black and racialized communities, Two-Spirit, nonbinary, LGBTQ+ people; people with disabilities; and members of other equity deserving communities. Applicants are encouraged to share accessibility needs in the application process, and every attempt will be made to accommodate them.\n  \n  \n  Due to the high volume of applicants, we can neither confirm receipt of nor respond to inquiries regarding your application. Only candidates selected for an interview will be contacted."
}