{
    "id": "121a4fb4f8dd6498",
    "company": "Home Concierge- Limited Partnership",
    "positionName": "Personal Support Worker (PSW)",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-17T18:51:20.056Z",
    "url": "https://www.indeed.ca/rc/clk?jk=121a4fb4f8dd6498&from=jasx&tk=1hcvfjcolkedt800&vjs=3",
    "externalApplyLink": "https://careers.hireology.com/homeconcierge-limitedpartnership/1504850/description?ref=indeed.com&source=indeed",
    "companyDescription": "",
    "description": "PSW Servicing Ottawa\n  Casual – Flexible hours to suit your schedule \n Home Care – You will be working in the community providing one on one care to members in their home\n  About us:\n  Home Concierge provides personalized care to our members in their own home. Founded in 2019 Home Concierge is a fast-paced high growth company with a growing team of entrepreneurial leaders seeking to revolutionize what service excellence means in the private-pay, home care space.\n  About the role:\n  As a Personal Support Worker, you will follow a personal care plan aimed at supporting the independence of our members. You will assist with the activities of daily living that include everything from personal care, to grooming and exercise. \n The members receiving care are predominantly seniors who want to live and age at home. You may also provide care to youths and younger adults. The care is provided in shifts of 3 hours or more and you may be required to travel to more than one location during the working day.\n  We are currently hiring for PSW’s with availability for any of the below shifts:\n  Hours are not guaranteed and are on a casual as needed basis\n  Morning 7am-1pm\n  Afternoon 1pm – 6pm\n  Evening 6pm – 11pm\n  Overnight 11pm – 7am\n  Hourly Rate: $18.75 - $21.50\n  Position Type:\n  \n   Casual \n  Potential for full time hours \n  Must be available for a minimum of 10 hours a week\n \n \n  Benefits:\n  \n   Mobile Stipend \n  Quarterly Retention Bonus of $250 \n  Health Spending Account (Based on Hours Worked) \n  Meal Vouchers \n  Employee Referral Bonus of $250 \n  Reimbursement of Pre-Employment cost up to $100\n \n \n  Responsibilities:\n  \n   Caring for members in their own homes. \n  Responsible for assisting with activities of daily living (ADL), including personal hygiene and basic care. \n  Observe and report any changes in the member’s status to the Concierge and Director of Operations. \n  Supporting members in additional areas such as meal prep, laundry, changing sheets, vacuuming, dusting, sweeping, mopping, etc. \n  Participating with member in customized activities \n  Escorting seniors to appointments or to the grocery store (transportation would be coordinated). \n \n  \n What do you need to qualify?\n  \n   Must be a graduate from a recognized Personal Support Worker program, Health Care Aide Program, or an International Educated Nurse \n  Level 1 First Aid, CPR / AED Certificate. \n  Must be able to lift up to 40 lbs. \n  Must be able to walk, sit and stand for an extend period of time \n  Must be able to bend, reach and lift \n  Must be able to carry and transport object of various sizes up to 25 lbs. \n  Recent experience working with geriatrics, long-term care, or home services required. \n  Excellent relationship building skills and the ability to engage and support the seniors you care for – experience caregiving / fostering relationships with seniors is a plus \n  Excellent communicator, resilient, & flexible to meet the changing priorities \n  Ability to resolve contentious or sensitive issues or situations independently \n  Ability to maintain confidentiality of client information \n  Own a smartphone \n  Valid G class drivers’ license, valid automobile insurance \n  Familiarity with retirement industry resources is considered an asset \n  Must be available for a minimum of 10 hours a week\n \n \n  Covid-19 precautions:\n  \n   Remote interview process \n  Personal Protective Equipment Provided \n  Daily Screener to be completed by both Team Members and Members \n  Virtual Meetings\n \n \n  Why Work for Home Concierge?\n  Be a part of making history: As a founding team member, you play a role in shaping the future of the business and the people we serve and are provided the opportunity for growth into new roles as the business grows.\n  Help members retain their lifestyle in their home: Your role as a PSW at Home Concierge positively impacts each client you work with, enabling them to remain independent & age gracefully in the home they know & love\n  Be part of shaping the future of senior care: Canada will need over 800,000 long-term care beds by 2050 – over 2.5 times what we have now. By reinventing at-home care, you are developing a sustainable solution to ensure the wellbeing of Canada’s aging population\n  You are supported in & rewarded in your work: Working at Home Concierge comes with a strong support network of coordinators and mentors, competitive salary and benefits including a unique rewards system designed to motivate you based on the amount of services you provide to our members.\n  You have room to grow as a leader: The PSW position develops leadership skills & provides opportunities for career progression to management roles within our rapidly growing firm\n  You are supported by cutting edge technology: The Home Concierge app puts scheduling, payment, and client profile access at your fingertips – keeping you one step ahead as you deliver first class care\n  Home Concierge is committed to the success of all its employees. If you feel you need accommodations because of illness or disability, please do not hesitate to contact Human Resources at gabriella@thehomeconcierge.ca at your earliest convenience.\n  If Home Concierge sounds like the place for you, let’s talk. Please submit your application at https://www.thehomeconcierge.ca/careers to join our team!\n  You may also contact Gabriella Buczok, Regional Recruiter at gabriella@thehomeconcierge.ca\n  Applicants may receive a link to complete a video interview.\n \n  We are an equal opportunity employer and prohibit discrimination/harassment without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws."
}