{
    "id": "136ef8481bed7d68",
    "company": "Compass Group",
    "positionName": "Food Service Supervisor",
    "jobType": [
        "Full-time"
    ],
    "location": "501 Smyth Road, Ottawa, ON",
    "salary": "$18.11 an hour",
    "postingDateParsed": "2024-01-26T12:15:05.031Z",
    "url": "https://www.indeed.ca/rc/clk?jk=136ef8481bed7d68&from=jasx&tk=1hl5dg27tgspi800&bb=p2DViMR2A5Ah9kScPDlOWKdxKst_KIZS3BKgyZKCgduNlCcLtuYDlaxotsDJkEg6aC2GfPwt7VDJi4aw29v5_dkZaUPdfpO5iJd8Z3huD_Nom0Emp6cymg%3D%3D&xkcb=SoCZ67M3FlTPl1WZkx0PbzkdCdPP&vjs=3",
    "externalApplyLink": "https://jobs.compassgroupcareers.com/Canada/job/Ottawa-Food-Service-Supervisor-ON/1123860700/?feedId=345000&utm_source=Indeed&utm_campaign=CompassGroupHoldings_Indeed&jobboard=indeed&c=organic",
    "companyDescription": "We are Canada’s leading foodservice and support services company.\r\n\r\nCompass Group Canada is the country’s leading foodservice and support services provider with over 25,000 associates working in more than 2,200 location throughout the country. The company specializes in providing foodservices and support services across the core sectors including leading sports and leisure venues, executive dining rooms and cafes, schools, universities, seniors’ residences and hospitals as well as remote camps and off shore oil rigs.",
    "description": "You might not know our name, but you know where we are. That’s because Compass Group Canada is part of a global foodservice and support services company that’s the 6th largest employer in the world, with 625,000 employees.\n  You’ll find us in schools, colleges, hospitals, office buildings, senior living communities, tourist attractions, sports venues, remote camps and military installations and more. We’re in all major cities, at remote work sites and everywhere in between – doing business in Canada and 50+ other countries where you can learn and grow. Join us now and point your career forward!\n  Imagine a place where people work as one to create an experience that inspires many. Join us and know that you make it possible for friends, families, and co-workers to come together. No matter why they gather, we’re here to serve. Because of what we do, people share so much more than a meal. And that’s why this is so much more than a job.\n  Why work with Eurest Dining? We are a member of Compass Group Canada, the leading food and support Services Company. We provide diverse, innovative dining services to corporate headquarter locations, law firms, manufacturing facilities, distribution centres and call centres. Join our commitment to providing exceptional food service to the best of business and industry.\n \n  \n   \n     Job Details\n   \n   \n     Location: 501 Smyth Road, Ottawa ON\n     Start Date: ASAP Status: Full-Time Schedule: 11:00am -7:00 pm Wage: $18.11\n   \n  \n  \n   \n     Job Summary\n   \n   \n     Assists the Manager on duty with the coordination of activities of associates within the food service department while maintaining the highest standards and levels of customer service.\n     Essential Duties and Responsibilities:\n    \n      Assist the Shift Managers to supervise multiple food service units.\n      Supervise the production of menu items, ensure completion of cash readings, manage associates, schedule staff working hours, hire and train employees.\n      Learn from and assist the Shift Manager to resolve labour relation issues, track and produce reports on weekly inventories, sales revenue, labour and food cost.\n      Communicate positively and enthusiastically to the café patrons and address their issues promptly.\n      Ensure strict compliance with Compass’ Quality Assurance and Health and Safety Program, Occupational Health and Safety Act and WHMIS regulations.\n      Coordinate frequent workplace inspections and WHMIS training of all staff and promptly report any workplace accident or incident to head office.\n      Ensure Hazard Analysis and Critical Control Point (HACCP) standards are followed in the food preparation process.\n    \n     Qualifications:\n     Think you have what it takes to be our Food Service Supervisors? We’re committed to hiring the best talent for the role. Here’s how we’ll know you’ll be successful in the role.\n    \n      At least one year of strong operation food industry management experience.\n      FoodSafe Level 1 Certification.\n      Comprehensive health and safety knowledge and training.\n      Knowledge of food service catering.\n      Strong supervisory skills and the capability to motivate and lead staff.\n      Employee relations experience in a unionized environment is an asset.\n      Excellent customer service skills.\n      Excellent communication skills (written and verbal).\n      Knowledge of Microsoft Office.\n    \n   \n  \n \n  Compass Group Canada is committed to nurturing a diverse workforce representative of the communities within which we operate. We encourage and are pleased to consider all qualified candidates, without regard to race, colour, citizenship, religion, sex, marital / family status, sexual orientation, gender identity, aboriginal status, age, disability or persons who may require an accommodation, to apply.\n \n  For accommodation requests during the hiring process, please contact PeopleHub@compass-canada.com for further information."
}