{
    "id": "1a585869375d32b9",
    "company": "The Ottawa Hospital",
    "positionName": "Registered Practical Nurse",
    "jobType": [],
    "location": "501 Smyth Rd, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-17T18:51:00.733Z",
    "url": "https://www.indeed.ca/rc/clk?jk=1a585869375d32b9&from=jasx&tk=1hcvfjcolkedt800&vjs=3",
    "externalApplyLink": "https://ohhcmdmzweb01.ottawahospital.on.ca/psc/HRPRD/?cmd=login&errorPg=ckreq&languageCd=ENG",
    "companyDescription": "",
    "description": "About The Ottawa Hospital \n    \n    \n    \n     \n      Inspired by research and driven by compassion!\n     \n      \n     \n     \n       The Ottawa Hospital (TOH) is one of Canada’s largest learning and research multi-campus hospitals. With more than 1,100 beds and approximately 12,000 staff members, we deliver specialized care to the Eastern Ontario region. \n     \n      \n     \n     \n      From the compassion of our people to the relentless pursuit of new discoveries, The Ottawa Hospital never stops seeking solutions to the most complex health-care challenges while continually engaging with the community to support our vision for better patient care.\n     \n      \n     \n     \n       Working together with its research institute, the University of Ottawa, and other partners, the hospital is continually gaining national and international recognition for high-quality patient care, teaching and research, while striving to meet the needs of the culturally diverse community we serve.\n      \n    \n   \n  \n \n \n  \n   Rotation/Shifts \n    \n    \n    \n     \n      Days and nights, including weekends, 12 hour shifts (07:15-19:15, 19:15-07:15).\n     \n     \n      For information purposes only - The Hospital reserves the right to change.\n      \n    \n   \n  \n \n \n  \n   Basic Requirements \n    \n    \n    \n     \n      Certificate of registration from the College of Nurses of Ontario;\n       Current BCLS;\n       One (1) year of recent related RPN experience;\n       Recent experience on an inpatient unit providing care in obstetrics, gynaecology and newborn care (within the last 2 years);\n       Demonstrates theoretical knowledge of the nursing process as it relates to the patient population and the ability to apply this knowledge in a clinical setting;\n       Demonstrates the ability to participate as an active member of the health care team;\n       Demonstrates the ability to communicate effectively in an oral and a written format with patients, public, colleagues and other health disciplines;\n       Identifies a commitment to personal continuing education;\n       Demonstrates an understanding and a willingness to participate in self evaluation;\n       Demonstrates a desire and ability to participate in patient teaching;\n       Demonstrates an understanding of the application and relevance of the Quality Assurance Program and participates in unit activities;\n       Demonstrates an understanding of aseptic technique and an ability to apply this knowledge in a clinical setting;\n       Demonstrates knowledge of principles of safe medication administration and ability to practice this in a clinical setting;\n       Able to perform all tasks related to this position;\n       Eligible to work in Canada.\n      \n    \n   \n  \n \n \n  \n   What you can expect from us \n    \n    \n    \n     \n      The Ottawa Hospital is committed to providing a healthy, safe, and inclusive work environment for everyone. We are driven by our purpose to provide each patient with the world-class care, exceptional service and compassion we would want for our loved ones.\n     \n      \n     \n     \n       We offer an attractive and equitable compensation package including a comprehensive benefits package, a Defined Benefit Pension (DBP) plan, and insurance protection. We also offer discounts from choice providers on a variety of products and services. \n     \n      \n     \n     \n      The Ottawa Hospital provides various Health and Wellness resources as well as opportunities for personal and professional development opportunities from our in-house Learning and Leadership Development team to help align your goals with your career objectives.\n      \n    \n   \n  \n \n \n  \n   Interested? Apply today! \n    \n    \n    \n     \n      If you are passionate about what you do, motivated by improving the health of the community, excited by leading-edge medical technology, and as committed to excellence, quality and patient safety as we are, we would like to hear from you. Please submit an on-line application for the position you are interested in. We thank all those who apply but only those selected for further consideration will be contacted.\n       \n     \n     \n       The Ottawa Hospital is an equal opportunity employer. Upon request, accommodations due to a disability are available throughout the recruitment process."
}