{
    "id": "1abbd32f574f52be",
    "company": "Docebo",
    "positionName": "Technical Deployment Manager",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-20T05:09:27.980Z",
    "url": "https://www.indeed.ca/rc/clk?jk=1abbd32f574f52be&from=jasx&tk=1hkikb4a7k5qp800&bb=lTPy9GC8AEMesPUlCsHFKts9Qucc2TZK4uNb54iUWZJ0rDb_z4Fj-87AWNzMZbTcrSbjoqBTMKsGhG1lhe0CK2UIBjIk4F-nnnzvGtY0i48EKCE4XC-vZQ%3D%3D&xkcb=SoDK67M3FSgjV4x1FB0KbzkdCdPP&vjs=3",
    "externalApplyLink": "https://jobs.lever.co/docebo/20a83de1-e22d-4828-8445-2bea1c201e01?lever-source=Indeed&lever-source=Indeed",
    "companyDescription": "",
    "description": "Hey you! \\uD83D\\uDC4B Want to work for one of the fastest growing SaaS companies in the world? \\uD83D\\uDCC8\n \n \n   We’re building the next generation of learning software that companies like AWS, Netflix, Opentable and L’Oreal rely on to deliver training \\uD83D\\uDCBB We believe learning is for everyone, and that we all have something we can learn from each other. We rely on one another to continuously innovate our products and processes to create an exceptional experience for our employees, customers and partners.\n \n \n \n   Still not sure? We are a culture where values are at the center of everything we do. We also embody what we call the \n  Docebo Heart. We trust our teammates, assume the best of one another, and also hold space for all the differences that make us better. \\uD83D\\uDC99\n \n \n \n   So what are you waiting for? Apply today! Join 800+ global Docebians and change the way people learn.\n \n \n \n   Are you ready to be a part of the learning revolution? \\uD83D\\uDE80\n \n \n \n   About This Opportunity:\n \n \n \n   Docebo, the industry leader in cloud-based LMS, is looking for an experienced Technical Deployment Manager to join our growing organization. This is a hybrid role within our Professional Services Team and will provide technical expertise across projects managed by other members of our Professional Services Team while also directly managing a small number of customer onboardings and other services such as migrations, consulting hours and custom scope. The role is responsible for providing technical consulting services to the Docebo client-base, including configuration and troubleshooting of Docebo add-on modules, API usage and workflow guidance, and technical assistance for Single Sign-on applications.\n \n \n \n   The Technical Deployment Manager will also work with customers to understand customer needs, and prepare documentation or provide guidance on technical work flows involving the Docebo Platform. An individual in this role will work closely with Sales Engineering, Professional Services, and Customer Success Teams.\n  \n Responsibilities:\n \n   Scope API needs and define workflows utilizing Docebo’s APIs in order to enable Docebo customers to scope and initiate development effort\n   Document project activities to ensure alignment and continuity across the Customer\n   Success, Sales Engineering, and Professional Services departments.\n   Lend assistance in the configuration and troubleshooting of Docebo integrations and product Add-ons (including Salesforce, Single Sign-on, Web Conferencing tools, etc).\n   Produce or improve technical documentation to ensure alignment of Docebo personal and Docebo clients\n   Prevent, identify, quantify, and communicate risks internally and externally\n   Partner with customers from various countries, managing multiple projects concurrently.\n   Work with customers to identify and document Success Criteria\n   Develop/monitor overall implementation schedule (including all functional, customization and integration/technical projects) to meet client objectives\n   Manage ongoing implementation, project documentation, and ensure projects and teams stay within utilization and budget targets\n   Maintain existing and creation of new best practices and other supporting documentation ensuring successful onboarding of customers\n \n  Requirements:\n \n   Minimum of 3 years of experience in a technical role: Sales Engineer, Technical Trainer, Implementation, Support, etc.\n   Experience working with large accounts in the enterprise space\n   Good understanding of consulting processes and software implementation\n   A natural inclination to resolve customer problems and help them be highly successful\n   Extensive knowledge of SAML and other Single Sign on Protocols\n   Experience working with Rest APIs\n   Familiarity with HTTP clients such as Postman for testing web services\n   Basic coding ability in at least one language\n   Fast learner, excited and willing to learn new technology on an ongoing basis\n   Ability to write effective technical documentation\n   English Fluency (both written and spoken)\n   A strong desire to become a Docebo product expert\n   BA/BS or equivalent experience\n   Ability to travel as required (10% or less)\n \n  Nice to Haves: \n \n  Experience in E-Learning / Learning Management industry\n   Experience building SQL queries\n   Multilingual\n \n \n   #LI-Hybrid\n \n \n \n   Benefits & Perks \\uD83D\\uDE0D\n \n \n  Generous Vacation Policy, plus 2 extra floating holidays to use for religious or cultural events that matter to you\n  Employee Share Purchase Plan\n  Career progression/internal mobility opportunities\n  Four employee resource groups to get involved with (the Docebo Women's Alliance, PRIDE, BIDOC, and Green Ambassadors)\n  WeWork partnership and “Work from Anywhere” program\n \n \n \n   Hybrid Office Model \\uD83C\\uDFE2\n \n \n   We believe when people are together, they develop deeper relationships and accelerate innovation. Because of this, all Docebo employees worldwide are “hybrid.” We encourage in-person collaboration while supporting work-from-home when employees need dedicated focus time, allowing Docebians to do their best every day. Each team leader is able to decide how often their teams come into the office, considering the needs of the team and the employee’s needs. Our Talent Acquisition team will let you know about the role you are applying for and the hybrid details during the first interview.\n   \n \n \n  \n \n  About Docebo \\uD83D\\uDC99\n \n \n   Here at Docebo, we power learning experiences for over 3000 customers around the world with our easy-to-use, AI-powered Suite designed to close the enterprise learning loop. We have successfully achieved 2 IPOs (TSX: DCBO & NASDAQ: DCBO), been recognized as a Top SaaS e-learning Solution, and are growing exponentially in the process.\n \n \n   Docebo is a global company with offices in North America, EMEA, APAC and more. Our people believe in six core values, simply defined and manifested in everything we do - \n  Innovation, Simplicity, Accountability, Togetherness, Curiosity, and Impact. If this sounds like you, now is your time to join one of the fastest-growing learning technology companies on the market. Apply today!\n \n \n \n   Docebo is an Equal Employment Opportunity employer. We are committed to diversity and inclusion in our workforce. All qualified applicants and employees will receive consideration for employment regardless of their race, color, religion, sex (including pregnancy, gender identity, and sexual orientation), national origin, citizenship status, age, disability, genetic information, or any other category protected under applicable law.\n \n \n \n   Any individuals requiring a reasonable accommodation to assist with their job search or application for employment should send an e-mail to recruiting_accommodations (at) docebo.com. The e-mail should include a description of the requested accommodation and the position you’re applying for or interested in."
}