{
    "id": "21c212fbcd3b33ef",
    "company": "Wildpine Residence",
    "positionName": "Part-Time Registered Practical Nurse (RPN)",
    "jobType": [],
    "location": "Wildpine Residence in Stittsville, ON",
    "salary": null,
    "postingDateParsed": "2024-01-17T05:14:44.269Z",
    "url": "https://www.indeed.ca/rc/clk?jk=21c212fbcd3b33ef&from=jasx&tk=1hkikkt0b2bf3001&bb=yhJIT6P4TthyluDALQ78dsrpZN8LAR8KZEYROKtoApIvn0JAS3GPXcg9kAFYKuy2Unit8pJENgvIDI5ca2YOdNat8WCIn5GRZqSYxvzgL8blmnD4P2dNKQ%3D%3D&xkcb=SoDV67M3FShceOxytZ0ObzkdCdPP&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "Provide professional nursing care to residents in accordance with their individual resident required medical plans. Practice professional nursing care under the following RHRA programs; medication administration programs, fall management program, continence management program, responsive behavior management program, admission process, infection prevention program, quality assurance program. Supervise and delivers direct resident care. Establish nursing care plans based on recognized nursing assessments promoting best practices.\nKey Responsibilities:\n\n Admit resident, assess, plan, implement and evaluate individualized care to meet the residents' physical and emotional needs. Ensure resident care plan is developed in collaboration with other members of the services team.\n Communicate with residents and/or substitute decisions maker regarding the care and condition of respective residents as required\n Assists the Director of Care by participating in discharge planning, consultation, care conferences and/or transfer of residents\n Provide direct resident care and participate in resident teaching\n Encourage active participation by residents in all therapy programs and recreational activities\n Liaise with attending physicians, psychiatrists, consultants, social workers, clergy, relatives or responsible persons to ensure effective resident care is provided\n Practice ensuring compliance to standards of resident care in retirement home\n Participates as a member of the care team and provides support to the other members of the Services team\n Assist with setting goals and annual objectives for the Home\n Assign and/ or direct care staff according to Home policy. Delegate responsibilities to appropriately qualified staff as required\n Responsible to the well-being of the residents ensuring that care and service delivery is done in accordance with the plan of care, MARS, and job routine\n Provide leadership and supervision to ensure that all work performed is conducted in a safe manner and complies with occupational health and safety policies\n Supervise and assist non-professional staff. Lead / Participate in shift report, record significant changes in residents' condition, care plan and changes in physician's orders. Reviews residents' charts, ensuring that all requirements are promptly acted upon. As required, notify physicians of change in residents' condition\n Provides first aid to staff when necessary and completes Employee Injury Report\n Administer medications, and perform medication administration program related duties\n Participate in the orientation, on-the-job training and in-servicing of care staff as required\n Any other related duties as assigned, or evidently required\n\nOther:\n\n Is responsible for her/his own actions.\n Is responsible for maintaining and upgrading her/his competence related to the clinical practice and professional responsibility.\n Is aware of employees and supervisor’s responsibilities and follows all health and safety policies and procedures;\n Works safely to reduce the risk of injury to self, co-workers, guests and residents;\n Is alert to, remedies, and promptly reports all actual or potentially hazardous situations.\n All other related duties as assigned\n\nQualifications:\n\n A sound knowledge and background in seniors retirement housing including activation, nursing and personnel care administration\n Knowledge of the appropriate sections of the Health Disciplines Act, Occupational Health and Safety Act, Pharmacy Act, Food and Drugs Act (Canada), Narcotic Control Act (Canada) and other pertinent Federal, Provincial and Municipal Statutes which influence the operation of the Retirement Home and more specifically the care department\n Possess current certificate of competence with the College of Nurses of Ontario\n First Aid Certified – maintained current\n CPR certified – maintained current\n Must be able to stand for extended periods of time as well as lift heavy items\n\nJob Type: Part-time\nSalary: From $27.00 per hour\nSchedule:\n\n 8 hour shift\n Day shift\n Evening shift\n Night shift\n\nLicence/Certification:\n\n LPN/RPN (required)\n\nWork Location: In person"
}