{
    "id": "22af0383dffae2a0",
    "company": "AECOM",
    "positionName": "Quality Field Management Supervisor-Nuclear",
    "jobType": [
        "Full-time"
    ],
    "location": "Ottawa, ON",
    "salary": "$110,000–$150,000 a year",
    "postingDateParsed": "2024-01-25T12:15:10.662Z",
    "url": "https://www.indeed.ca/rc/clk?jk=22af0383dffae2a0&from=jasx&tk=1hl5dg16dk7ek800&bb=tMKIoX8lf2spUOlVC2NDMNsIDXbiT2rliNyCAOHgHxZmYRBAeHmwVeWqw0Gn4mNyFfOv-JdiKS3lI_H9zImk4uPY3BIu7ZlLC14WUj6jacWrjJ8HgcOZZQ%3D%3D&xkcb=SoBk67M3FlTP8hgNR70QbzkdCdPP&vjs=3",
    "externalApplyLink": "https://aecom.jobs/ottawa-on/quality-field-management-supervisor-nuclear/0BE84CB3DF9B464193E08E4B891F181C/job/?vs=1554&utm_source=Indeed-DE&utm_medium=Job%20Aggregator&utm_campaign=Indeed",
    "companyDescription": "With nearly 100,000 employees — including architects, engineers, designers, planners, scientists and management and construction services professionals — serving clients in more than 150 countries around the world following the acquisition of URS, AECOM is a premier, fully integrated infrastructure and support services firm. AECOM is ranked as the #1 engineering design firm by revenue in Engineering News-Record magazine’s annual industry rankings. The company is a leader in all of the key markets that it serves, including transportation, facilities, environmental, energy, oil and gas, water, high-rise buildings and government. AECOM provides a blend of global reach, local knowledge, innovation and technical excellence in delivering solutions that create, enhance and sustain the world’s built, natural and social environments. A Fortune 500 company, AECOM companies, including URS Corporation and Hunt Construction Group, had revenue of approximately $19.5 billion during the 12 months ended Sept. 30, 2014. More information on AECOM and its services can be found at www.aecom.com.",
    "description": "Company Description \n\n Work with Us. Change the World. \n\n At AECOM, we're delivering a better world. Whether improving your commute, keeping the lights on, providing access to clean water, or transforming skylines, our work helps people and communities thrive. We are the world's trusted infrastructure consulting firm, partnering with clients to solve the world’s most complex challenges and build legacies for future generations. \n\n There has never been a better time to be at AECOM. With accelerating infrastructure investment worldwide, our services are in great demand. We invite you to bring your bold ideas and big dreams and become part of a global team of nearly 50,000 planners, designers, engineers, scientists, digital innovators, program and construction managers and other professionals delivering projects that create a positive and tangible impact around the world. \n\n We're one global team driven by our common purpose to deliver a better world. Join us. \n\n Job Description \n\n AECOM Canada Nuclear Services at Chalk River Nuclear Laboratories is searching for a Field Management Supervisor for a full-time position based at Chalk River, supporting the Construction Management Team at the site. \n\n \nGENERAL ACCOUNTABILITIES:\n The Site Inspection Lead (SIL) is responsible for technical and quality inspections of civil, geotechnical, mechanical, electrical, and architectural installations, as well as surveillance and witnessing of work performed by other trades. The SIL will lead a team of qualified discipline inspectors and subcontractors with the primary responsibility of performing independent testing, surveillance, oversight and witnessing of activities related to procurement, construction, and commissioning of nuclear facilities. These duties include, but are not limited to, preparing & implementing inspection and test procedures, identifying installation, product & process issues, implementing the nonconformance process through records and tracking systems, and performing independent testing of electrical, civil, geotechnical, mechanical (including piping, pressure vessels) and architectural. \n\n \nSPECIFIC ACCOUNTABILITIES:\n Support projects in the execution of Quality Control Programs. Position responsibilities include: \n\n + Supervise inspection and testing personnel. \n\n + Plan and coordinate site-wide inspection and testing operations. \n\n + Review project Inspection & Testing Plans (ITP) and other Project Plans, as needed. \n\n + Prepare and review test reports. \n\n + Participate in independent quality oversight, surveillance and witnessing of field activities and installations. \n\n + Participate in independent sampling, testing and material receipt inspection. \n\n + Support the preparation and implementation of project inspection/assessment strategies and reports to cover all project phases. \n\n + Support reporting and addressing of corrective and preventive actions and analysis and trending of quality data. \n\n + Liaise with client and contractor quality representatives, and project members to ensure that all quality issues are documented and resolved. \n\n + Interface and coordinate with clients, contractors, and inspection & testing agencies on QC matters; oversee related inspection & testing activities for quality and conformance to deliverable requirements. \n\n + Coordinate QC deliverables and documentation; participate in QC planning activities. \n\n \nNecessary Skills and Knowledge:\n The skills and knowledge to execute this role are usually acquired through 15+ years of relevant construction experience, preferably in a nuclear environment. The individual would possess good written and verbal skills. \n\n Qualifications \n\n \nMinimum Requirements:\n + Engineering Degree in a related field + 6 Yr of related experience or \n\n + Diploma/Certificate Quality Engineer + 8 yrs or more of related experience. \n\n \nStrongly Preferred Qualifications:\n + P.Eng, Certified Technologist, or Certified Quality Engineer. \n\n + A minimum of six years of multi-discipline QC inspection and testing, or equivalent experience. \n\n + Demonstrated leadership experience supervising multi-discipline construction teams. \n\n + Experience in water treatment plant construction. \n\n + Experience in environmental remediation construction, including municipal landfill sites. \n\n + Demonstrated ability to understand drawings and specifications. \n\n + Demonstrated knowledge and ability in the application of QC procedures, inspection and testing techniques. \n\n + Demonstrated good analytical skills and familiarity with quality tools and methodologies. \n\n + Demonstrated knowledge of best practices for inspection, testing, quality control and defect management. \n\n Additional Information \n\n Offered rate of compensation in Chalk River will be based on individual education, qualifications, experience. The salary range for this position is $ 110K- $150K. \n\n About AECOM \n\n AECOM is the world’s trusted infrastructure consulting firm, delivering professional services throughout the project lifecycle – from advisory, planning, design and engineering to program and construction management. On projects spanning transportation, buildings, water, new energy and the environment, our public- and private-sector clients trust us to solve their most complex challenges. Our teams are driven by a common purpose to deliver a better world through our unrivaled technical and digital expertise, a culture of equity, diversity and inclusion, and a commitment to environmental, social and governance priorities. AECOM is a Fortune 500 firm and its Professional Services business had revenue of $13.1 billion in fiscal year 2022. See how we are delivering sustainable legacies for generations to come at aecom.com and @AECOM. \n\n Freedom to Grow in a World of Opportunity \n\n You will have the flexibility you need to do your best work with hybrid work options. Whether you’re working from an AECOM office, remote location or at a client site, you will be working in a dynamic environment where your integrity, entrepreneurial spirit and pioneering mindset are championed. \n\n You will help us foster a culture of equity, diversity and inclusion – a safe and respectful workplace, where we invite everyone to bring their whole selves to work using their unique talents, backgrounds and expertise to create transformational outcomes for our clients. \n\n AECOM provides a wide array of compensation and benefits programs to meet the diverse needs of our employees and their families. We also provide a robust global well-being program. We’re the world’s trusted global infrastructure firm, and we’re in this together – your growth and success are ours too. \n\n Join us, and you’ll get all the benefits of being a part of a global, publicly traded firm – access to industry-leading technology and thinking and transformational work with big impact and work flexibility. As an Equal Opportunity Employer, we believe in each person’s potential, and we’ll help you reach yours. \n\n All your information will be kept confidential according to EEO guidelines. \n\n \nReqID: J10102387 \n\n \nBusiness Line: Energy \n\n \nBusiness Group: DCS \n\n \nStrategic Business Unit: Canada \n\n \nCareer Area: Construction \n\n \nWork Location Model: On-Site"
}