{
    "id": "234ec9539bab1187",
    "company": "OHRI",
    "positionName": "Scientist/Assistant Professor, Stem cells and Regenerative Medicine",
    "jobType": [],
    "location": "501 Smyth Road, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-11-18T20:15:00.220Z",
    "url": "https://www.indeed.ca/rc/clk?jk=234ec9539bab1187&from=jasx&tk=1hgol2euhk7i3800&vjs=3",
    "externalApplyLink": "https://www.ohri.ca/Careers/Details.aspx?CareerID=2948",
    "companyDescription": "",
    "description": "We are searching for an outstanding scientist to establish and build an internationally competitive research program in stem cell and regenerative medicine research. We are interested in all aspects of stem cell biology ranging from molecular regulation of stem cell function, transcription, epigenetics, omics, signaling, cell-cell interactions, human stem cell biology, organoid models, tissue-specific stem cells, regeneration, pluripotency and reprogramming, ageing, and the application of stem cells in disease modeling and regenerative medicine, and their translation to novel regenerative therapies.  The successful candidate will join an exciting, multidisciplinary group of biomedical investigators at the OHRI that includes molecular biologists, cell biologists, bioinformaticists, and clinician researchers. The lab will be in the Sprott Centre for Stem Cell Research that contains fully equipped laboratories together with genomic, proteomic, imaging, cell sorting, iPSC/genome editing, and clinical grade GMP manufacturing facilities.  The successful candidate will be appointed as a Scientist at the OHRI will have an opportunity to be appointed as an Assistant Professor in the Faculty of Medicine at the University of Ottawa. A competitive start-up package will be provided.  Responsibilities: The successful candidates will be expected to conduct a vigorous program of independent, externally funded research, teach at the graduate level, attract excellent trainees, students, and future researchers, and work in a highly collaborative environment.  Basic Requirements (Education/Experience): Candidates must have a PhD and postdoctoral experience demonstrating outstanding achievement in their field. The successful candidate will have an interest in working in a multidisciplinary environment to address important questions in stem cell and/or regenerative medicine research.  Comments to Applicant: Qualified applicants are invited to apply by submitting the following: curriculum vitae, copies of representative reprints, statement of research accomplishments, statement of research interests, and names of three persons able to supply letters of reference.  Contact Info: Name: Sandy Martino Title: Research Administrative Assistant Program: Regenerative Medicine Ottawa Hospital Research Institute Address: 501 Smyth Rd, Ottawa ON Email: smartino@ohri.ca. Website: https://www.ohri.ca/Programs/Regenerative_Medicine/default.asp  The Ottawa Hospital Research Institute is committed to building and sustaining a welcoming and supportive culture that promotes equity, diversity and inclusion for trainees, researchers, and staff. We are devoted to identifying and removing barriers that limit equitable access to opportunities within our organization. The Ottawa Hospital Research Institute strongly supports initiatives that encourage the participation of all groups, in particular the four groups defined in the Employment Equity Act (women, Indigenous peoples, persons with disabilities and members of visible minorities).  We thank all applicants for their interest. However, only those invited for an interview will be contacted. The Ottawa Hospital Research Institute is an equal-opportunity employer. Upon request, accommodations due to a disability are available throughout the selection process."
}