{
    "id": "25e31f545dae37aa",
    "company": "HOK",
    "positionName": "Project Administrator",
    "jobType": [
        "Full-time"
    ],
    "location": "205 Catherine Street, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-04T03:14:20.336Z",
    "url": "https://www.indeed.ca/rc/clk?jk=25e31f545dae37aa&from=jasx&tk=1hjm3d03vjrq0800&vjs=3",
    "externalApplyLink": "https://jobs.silkroad.com/HOK/Careers/jobs/4955/?source=Indeed.com",
    "companyDescription": "",
    "description": "We are currently seeking a Project Administrator to join our team. As a Project Administrator, you will provide administrative support to the project manager and project team \n  \n  Under direction of the project manager, assist with tracking progress. \n  Collaborates with various staff and departments in administrating day to day projects and reporting requirements. \n  Manages project filing system both electronic and paper. \n  Serves as a contact for transfer of files, documents, drawings with external consultants and clients; manages distribution of these to the team. \n  Under direction from the project manager, schedules and coordinates all project meetings. \n  Assists project accountant in putting together invoicing and/or joint venture fee splits where applicable. \n  Will assist with tracking the process for obtaining fully executed consultant agreements. May require processing comments from the project manager and consultants and obtaining comments from corporate legal department before final sign-off. \n  On public projects, will track required MBE, WBE, and DBE consultant involvement on the project; provides timely reports to public agencies as required. May also need to establish files and procedures for annual audits by the public agency (or agencies) involved. \n  May attend client meetings to take meeting minutes and prepare for distribution. \n  Drafts letters to clients. Performs word processing and data entry, as required. \n  May perform office manager duties when project is located at a job site: \n   \n    May supervise support staff members \n    Ensures office supplies are stocked and equipment is maintained in good working order \n    Oversees facility maintenance needs, parking and office key assignments, interface with vendors, landlord contact, etc. \n   \n  May perform receptionist duties when project is located at a job site. \n  Takes personal responsibility for fostering a green workplace through sustainable work practices.\n \n  \n  \n  Required Skills\n  \n \n  Proficiency in MS Office, including Word, Excel and Outlook. \n  Must be detail-oriented and able to handle confidential information at the highest level. \n  Ability to communicate both verbally and in writing; including excellent interpersonal skills. \n  Ability to work in team environment. \n  Ability to effectively meet deadlines. \n  For those who provide BIM support; proficiency in AutoCAD/Architectural Desktop (Revit preferred).\n \n  \n  \n  Required Experience\n  \n \n  Equivalent of a Bachelor’s degree in related field and five years related experience. \n  For those who also provide BIM support; 3 years’ experience in computer-aided design. \n  \n HOK is committed to providing our employees with a comprehensive benefits plan to meet their current and future needs. Benefits include medical, dental and vision coverage; RRSP Matching plans; disability, life and accident insurance; paid time off (PTO) and a Flexible Spending Account. In addition, HOK employees enjoy a flexible work schedule with the option to work remotely on Mondays and Fridays. \n  HOK is a drug-free workplace. HOK is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, age, genetic information, sexual orientation, gender identity, status as a protected veteran or status as a qualified individual with a disability, or any other characteristic protected by applicable Federal, Provincial or Local law."
}