{
    "id": "2a2498b62f24dd86",
    "company": "Paracel Laboratories",
    "positionName": "Environmental Sample Management / Inventory Control Coordinator",
    "jobType": [],
    "location": "25 Northside Rd Unit C, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-11-17T20:15:04.150Z",
    "url": "https://www.indeed.ca/rc/clk?jk=2a2498b62f24dd86&from=jasx&tk=1hgol2euhk7i3800&vjs=3",
    "externalApplyLink": "https://paracellabs.applytojob.com/apply/3NrPmmR4uu/Environmental-Sample-Management-Inventory-Control-Coordinator?source=INDE&~",
    "companyDescription": "",
    "description": "Who we are\n  Paracel Laboratories Ltd. is one of the oldest privately owned and operated environmental analytical facilities in Canada. We are a multidisciplinary analytical laboratory providing environmental and microbiological Indoor Air Quality services to the industry. Our strength is our people; the staff at Paracel is dedicated to exceptional client service and our technical expertise is fundamental in supporting our clients in all aspects of their environmental and IAQ projects.\n \n  The Role\n  We’re currently searching for a full-time Environmental Sample Management / Inventory Control Coordinator to be our frontline liaison between our clients and lab operations in Ottawa. Working within the Sample Management group, and in conjunction with our Customer Service Representatives and Account Managers, the Sample Custodian will oversee the life cycle of the samples. The ideal candidate for this role is detail-oriented, a strong communicator, and a team player with superb data entry skills. This is a full-time, permanent role.\n \n  Location:\n  This role is on-site, at 25 Northside Rd, Unit C, Nepean, Ontario, K2H 8S1\n \n  Duties and Responsibilities:\n \n   Receive, verify and label samples as well as enter sample information into Laboratory Information Management System.\n   Work in conjunction with CSRs, Account Managers and Lab Analysts to assist in the verification of login and to resolve routine sample submission issues.\n   Process and updates customer orders and/or change orders in a timely manner.\n   Provide clients with field supplies such as bottles and sampling media.\n   Carry out sample pre-treatment if necessary.\n   Check and maintain inventory of field supplies, forms and documents.\n   Receive deliveries by couriers and suppliers and prepare courier pickups.\n   Answer incoming calls and greeting walk in clients, as necessary.\n \n \n  Qualifications:\n \n   Minimum High School Diploma-Post secondary education is desired, but not essential.\n   Experience in Inventory Control or Materials Management would be considered an asset.\n   Effective communication skills with the ability to establish and maintain productive work relationships with various levels of staff, to support sample management process.\n   Organized and keen attention to detail.\n   Very good computer skills – MS office. Data Entry experience an asset.\n   Demonstrated initiative, detail-oriented with a positive attitude and ability to multi-task.\n   A proven customer service orientation with a style that demonstrates timely response.\n   Quick learner, effective problem solver and demonstrates ability to follow procedures.\n   Ability to work effectively and independently in a fast-paced environment.\n   Lab experience is not essential and training will be provided.\n   Must be physically capable of lifting moving boxes and or coolers up to 50lbs on occasion.\n \n \n  Compensation Package\n  The compensation package includes full benefits including an Employee Family assistance program, a Group RRSP plan, and a Profit-Sharing program.\n \n  Application Process\n  In addition to your resume, please include a cover letter in your application. We thank all applicants for their interest; however, only those selected for an interview will be contacted.\n  We appreciate all applicants for their interest. However, only those selected for an interview will be contacted.\n \n  Paracel Laboratories is an equal-opportunity employer. If you require accommodation during the recruitment process, please let us know, and all efforts to provide the appropriate accommodation will be put into place.\n  \n  \n 3NrPmmR4uu"
}