{
    "id": "2bf142bc78eec121",
    "company": "Satcom Direct",
    "positionName": "Co-op Summer Term 2024 - Quality Assurance Test Automation",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-18T05:10:15.382Z",
    "url": "https://www.indeed.ca/rc/clk?jk=2bf142bc78eec121&from=jasx&tk=1hkikdavvii12803&bb=Z_xYV__n_sQAK0ynFsc1Lu1ylKNLa8wJ3Ie30tX-Nuje-XoQY1x9GoM7wAi3mmiVV4HoHJ9e1-v2MLTJa1eDlstVvdVnZN3mn37dc6mvfeYCiAtWU5RqMw%3D%3D&xkcb=SoAy67M3FSg6uFQ22p0XbzkdCdPP&vjs=3",
    "externalApplyLink": "https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html?cid=fcc14518-cc1c-4e96-be30-c26622eabb9a&ccId=19000101_000001&jobId=474473&source=IN&lang=en_US&ittk=VNRV2QCLIR",
    "companyDescription": "",
    "description": "COMPANY OVERVIEW:\n  Satcom Direct (SD) provides global connectivity solutions for business and general aviation, military, government, and land mobile services. Since 1997, SD has worked to solve the unsolvable and advance the technology of connectivity through our industry-leading hardware and flight operations software. Our company culture is based on innovation and creativity which allows our team members to thrive in a dynamic atmosphere. We are looking for people who are passionate about customer satisfaction and who excel in a constantly changing environment.\n  SD Avionics is a division of Satcom Direct located in Kanata, the high-tech hub of Ottawa, Ontario. Our second largest site globally, this location manufactures avionics hardware, cabin routers, and the SD Plane Simple Antenna System.\n  Satcom Direct offers an on-site gym and robust vacation time to have an excellent work/life balance.\n  JOB SUMMARY:\n  Consistently exemplifies the Satcom Direct (SD) mission, vision, and values focused around a philosophy directed toward customer service/satisfaction, job performance, and cooperative team interactions. Willingness to support organizational policies that foster \"continuous improvement\" activities, promote Satcom Direct's ongoing strategic growth plan, and maintain its position as the premier leader within the Aviation Satellite Communications industry.\n  SD is recruiting for a Co-op student to fulfill a role of a Quality Assurance (QA) Test Automation Professional. The primary focus of this role will be building and augmenting the automated test infrastructure for our tactical communications and satellite communication systems.\n  ESSENTIAL DUTIES/RESPONSIBILITIES:\n  To perform the job successfully, an individual must be able to perform each essential duty satisfactorily and should demonstrate the following competencies to consistently execute the functions of this position. All employees are expected to adhere to and be knowledgeable of Satcom Direct (SD) operations standards, established safety/security rules, and requirements for company work guidelines.\n  Main Responsibilities:\n \n   Create and apply test strategies that deliver high-quality software and hardware products.\n   Use your software development skills to develop tools, test frameworks, and automation for the system under test\n   Analyze product requirements and define technical test cases\n   Collaborate with members from QA, SW, HW, Systems, Support, and Product Management\n   Continuous communication with our tight-knit development teams\n   Ability to work productively alone and in a team.\n   Ability to be proactive and work effectively with little direct supervision.\n   Support day-to-day Test efforts in the Lab and in the field.\n \n  GENERAL QUALIFICATIONS, KNOWLEDGE, AND EXPERIENCE:\n  To perform this job successfully, an individual must be able to meet the minimum qualifications established for education, knowledge, and skills in order to be effective. The requirements listed below are representative of the traits required for the position:\n \n   Coding in any of Python, C/C++, scripting\n   Familiarity with any of the Atlassian tools (JIRA, Confluence) and Git source control\n   Familiarity with CI/CD and Jenkins\n   Day to day use of Linux\n   Basic IP networking knowledge and experience( function of switches, routers etc… )\n   “Hands-on” IT ability, ie able to setup small ad-hoc IP networks and install operating systems\n   Ability to document software designs\n   Experience in the use of test frameworks and unit tests in the testing of systems or software components (such as API’s or Libraries)\n \n  PHYSICAL DEMANDS:\n  While performing general office duties for this position, the employee is regularly required to sit, stand and/or walk around (including the use of stairs). Other demands include the ability to openly communicate with others by talking, listening, and reading, able to lift light objects (<25lbs), and use standard office equipment such as computer, printer, phone and cell phone. In addition, there is an occasional need to bend, twist or stoop in order to open/close cabinets, reach for files or other standard office type objects.\n  WORK ENVIRONMENT:\n  The office environment is generally quiet and, in a temperature, controlled setting with random adjustments in noise or temperature due to others talking or laughing loudly, unscheduled maintenance repairs to the building or its interior offices or unpredictable situations due to weather or other acts beyond company control. An employee must be willing to work their regularly assigned work schedule for their particular duties and/or job responsibilities and in times of need, be able to work an extended schedule depending on company/department needs, project requirements or customer demands. Work may require some physical effort in the handling of light materials, boxes or equipment. The temperature at client locations can vary from controlled to variations off hot/cold when working, standing or walking in or near the flight-line or maintenance repair center.\n  If you are interested in applying for employment and need special assistance or an accommodation to apply for a posted position, contact our Human Resources department at (321) 777-3000\n  SD Avionics is committed to hiring the most qualified candidates for approved company positions, without preference to any individual on the basis of race, color, age, religion, gender, sexual orientation, disability, or national origin. Our policy is to engage in recruitment and selection practices that are in compliance with all applicable national or local employment laws. SD Avionics and its various international entities follow talent acquisition practices that identify qualified and diverse candidates, promote opportunities for employee development, and provide equal employment opportunity for all applicants and employees. SD Avionics promotes equity in employment: As an equal opportunity employer, we welcome applications from women, Indigenous peoples, persons with disabilities and members of visible minorities."
}