{
    "id": "3577964e7730baee",
    "company": "Stella-Jones",
    "positionName": "Plant Manager",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-20T05:08:26.063Z",
    "url": "https://www.indeed.ca/rc/clk?jk=3577964e7730baee&from=jasx&tk=1hkik8vp5k633800&bb=3fcFSWL0Q64YUe5hx9GNduHg1EhUQ-RcPSLAI_tczKocZemRVOTnKkmrRtdpDWRsavnhW38rxcZwfOQKSvFIwuiMO2OwcDUIpVZ_0nT1qLC0OL8b1OKVsg%3D%3D&xkcb=SoAL67M3FSgsJ0AB1z0NbzkdCdPP&vjs=3",
    "externalApplyLink": "https://can232.dayforcehcm.com/CandidatePortal/en-CA/stellajones/Site/stellajonesinc/Posting/View/10302?source=Indeed",
    "companyDescription": "",
    "description": "Stella-Jones is North America's leading producer of industrial pressure-treated wood products. Responding to the vital infrastructure needs of our economy, we manufacture and distribute railway ties, utility poles, residential lumber and industrial wood products across the continent. The Company’s common shares are listed on the Toronto Stock Exchange (TSX: SJ). \n\n Stella-Jones recruits team members who embody our core values and desire an environment where growth is inspired, dedication is recognized, and achievement is rewarded. Our ever- expanding footprint provides a great prospect for career advancement as we seek to develop our emerging leaders. \n\n The Plant Manager is responsible for daily operations, including receiving and shipping goods, production activities, maintenance, and quality control. You will manage the operations budget and cost control, labor (both unionized and non-unionized), environment, health, safety, and investment expenses. \n\n \nResponsibilities:\nOperations/Production:\n Supervise factory operations, including receiving and shipping goods, production activities, maintenance, and quality control. \n\n \n Foster a positive safety culture by setting the right example and continually improving safety training and programs. \n Manage operations scheduling and production in coordination with sales, shipping, and supervisors. \n Optimize material use, labor productivity, and product quality through operational procedures and controls for efficient personnel management and effective use of materials, equipment, and machinery. \n Manage chemical and other product inventories to meet customer expectations. \n Control and organize stock, actively participate in periodic and annual inventories. \n Oversee the annual inventory with auditors. \n Ensure commitments regarding costs, quality, safety, and delivery are met. \n Manage the maintenance program to keep the factory safe and operational. \n Update monthly and quarterly budget forecasts. \n Prepare the annual budget for manufacturing costs and mobile equipment. \n Ensure maintenance programs are executed, minimizing production interruptions through constant monitoring of preventive maintenance. Recommend system improvements and productivity increase plans. \n Regularly review plant operating costs and investment expenses to stay within budget. \n Coordinate the annual capital expenditure project. \n Supervise facility modernization projects. \n Submit potential projects or improvements to increase production efficiency. \n \nWorkforce Management:\n \n \n Manage all employees in the plant \n Participate in hiring and developing a qualified and competent workforce. \n Manage payroll processing in the Ceridian system. \n Engage in employee relations and performance management in collaboration with the operations director. \n Ensure factory guidelines are followed. \n Manage team vacations. \n Handle various issues and requests from internal and external collaborators. \n \nEnvironment, Health, and Safety Program:\n \n \n Implement the health and safety program. \n Manage, maintain, and enforce the TRD program and annual certification. \n Actively participate in the health and safety committee. \n Address various issues with internal and external collaborators. \n Supervise the Environment program and monitor the factory environment. \n Manage communications with environmental authorities (local, provincial, and Canadian). \n \nKey Skills:\n \n \n Interpersonal and communication skills, strong leadership ability. \n Experience in a unionized work environment. \n Demonstrated problem-solving, prioritization, and conflict resolution skills. \n Presentation skills. \n Proven ability to act appropriately in emergency situations. \n Ability to motivate the team. \n Skill in problem-solving. \n Effective communication skills. \n \nAbility to:\n \n \n Train, motivate, and supervise employees. \n Stay calm and work effectively under pressure. \n Delegate appropriately and engage the team. \n Evaluate existing processes and identify opportunities for improvement. \n Develop and implement new processes and procedures. \n Manage time and stress. \n Intermediate computer skills (Microsoft Office). \n Knowledge of the wood processing industry (an asset). \n Education: Minimum 12th grade. \n \nPreferred Experience: Five years of experience in factory management in the field or a related field. Experience as a supervisor or production manager. \n\n \nLanguages:\n French (written and spoken), English (intermediate) \n\n As a Stella-Jones employee, you will enjoy access to excellent benefits and incentives, including: \n\n \n Extended health and dental coverage \n Life insurance and accidental death & dismemberment (AD&D) \n Short-Term and Long-Term disability coverage \n Competitive compensation \n Annual Profit Share Program \n Retirement program (RRSP) with generous Company match (150% of employee's 4% contribution) \n Company Share Purchase Program with 10% Company contribution match \n Career advancement opportunities \n Stella-Jones is an equal opportunity employer that is committed to diversity and inclusion in the workplace. We prohibit discrimination and harassment of any kind based on race, color, sex, religion, sexual orientation, national origin, disability, genetic information, pregnancy, or any other protected characteristic as outlined by federal, provincial, or local laws. \n\n This policy applies to all employment practices within our organization, including hiring, recruiting, promotion, termination, layoff, recall, leave of absence, compensation, benefits, training, and apprenticeship. Stella-Jones makes hiring decisions based solely on qualifications, merit, and business needs at the time."
}