{
    "id": "373396552fee4720",
    "company": "American Eagle Outfitters",
    "positionName": "Stock/Floorset/Service Associate at American Eagle Outfitters",
    "jobType": [],
    "location": "8555 Campeau Drive, Kanata, ON",
    "salary": null,
    "postingDateParsed": "2023-10-17T18:53:32.984Z",
    "url": "https://www.indeed.ca/rc/clk?jk=373396552fee4720&from=jasx&tk=1hcvfkunqk7dc802&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "STOCK/FLOORSET/SERVICE ASSOCIATE\nYOUR ROLE\nYou can't buy product if it's not on the floor, right?! As a part-time stock brand Ambassador, you're an expert at keeping product moving from the Stockroom to the Salesfloor through shipment processing, replenishment, markdowns and merchandising. You will also take part in late night/overnight Floorsets executing seasonal product changes. You've got a passion for AEO Brand Standards, an eye for merchandising and a keen attention to detail. Even though the Stockroom is #yourplace, you're able to flex your skills to support your team and guests on the Salesfloor as needed. Most importantly, you represent AEO values and you bring your REAL self to work every day!\nYOUR RESPONSIBILITIES\n\n You've got a passion for brand standards: You're a go-getter when it comes to keeping product moving and you do so through effective and timely shipment processing, replenishment, markdowns and merchandising.\n The Stockroom is your home base and you #ownit! You're a master at keeping the Stockroom running efficiently and productively by ensuring merchandise, visual props, marketing and fixtures stay organized.\n You're innovative: Whenever you see a merchandising opportunity, you inform store leadership, make a game plan, and take action to correct it.\n You know that teamwork makes the dream work: You're always prepared to step in and help fellow team members complete non stock-related tasks or assist with guests.\n Integrity is your middle name: Safety standards are a priority to you, both in the Stockroom and on the Salesfloor. You follow Asset Protection standards and always adhere to AEO's policies and procedures.\n\nYOU'D BE GREAT FOR THIS ROLE IF:\n\n You love AE and Aerie products!\n You love organization and have attention to detail; priority-setting and time management are your strong suits.\n You have flexible availability- you're there to get product moving early in the morning, late in the evening and on the weekends.\n You've worked in a stock-related role previously - #practicemakesperfect.\n\nOUR ASSOCIATES LOVE AEO BECAUSE:\n\n They work with REAL people - there's nothing like your #AEOFamily.\n They're given opportunities for development, the chance to learn new skills, and are offered great potential for career advancement.\n They receive 40% off product at both AE & Aerie year-round (plus additional seasonal discounts with new Floorsets!)\n They participate in store contests for the chance to win FREE merchandise and other exclusive prizes.\n\nAEO is an Equal Opportunity Employer and is committed to complying with all federal, state and local equal employment opportunity (\"EEO\") laws. AEO prohibits discrimination against associates and applicants for employment because of the individual's race or color, religion or creed, alienage or citizenship status, sex (including pregnancy), national origin, age, sexual orientation, disability, gender identity or expression, marital or partnership status, domestic violence or stalking victim status, genetic information or predisposing genetic characteristics, military or veteran status, or any other characteristic protected by law. This applies to all AEO activities, including, but not limited to, recruitment, hiring, compensation, assignment, training, promotion, performance evaluation, discipline and discharge. AEO also provides reasonable accommodation of religion and disability in accordance with applicable law.\nJob Type: Part-timePart-time hours: 10-25 per week\nSalary: $16.55-$18.00 per hour\nExpected hours: 4 – 30 per week\nBenefits:\n\n Casual dress\n On-site parking\n Store discount\n Wellness program\n\nSchedule:\n\n Day shift\n Evening shift\n Monday to Friday\n Night shift\n Weekends as needed\n\nAbility to commute/relocate:\n\n Kanata, ON K2S 0K5: reliably commute or plan to relocate before starting work (required)\n\nApplication question(s):\n\n Able to work 3-4 shifts during the week. Able to assist in stocking the store and new product layouts late in the night/early morning.\n\nWork Location: In person"
}