{
    "id": "3c1071a38a6ad25e",
    "company": "Journeys",
    "positionName": "Part-Time Sales Associate",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-17T05:14:51.066Z",
    "url": "https://www.indeed.ca/rc/clk?jk=3c1071a38a6ad25e&from=jasx&tk=1hkikkt0b2bf3001&bb=yhJIT6P4TthyluDALQ78dnyQEyLGpANhzegH-89UE8blFz8scGxumy2YBmoDEQ2pkPCDYvRhMxH4FFcBmlDyboUq7dPDYerodv5V_rgUqW261ecX3lhcOw%3D%3D&xkcb=SoBb67M3FShceOxytZ0JbzkdCdPP&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=3c1071a38a6ad25e&bb=WrL6Jv0js4CmewmB8bc2rtP_Si2Gzz08YQPJ_Cb60uNwqga2TAe5vF2gB1gv9aG4&xkcb=SoCk67M3FShX5ZQjgB0LbzkdCdPP&xpse=SoCE67I3FShXvYwjg50LbzkdCdPP",
    "companyDescription": "",
    "description": "COMPANY OVERVIEW \n  \n  Journeys is a teen retail leader with an emphasis on footwear and unique specialty items including apparel, backpacks, hats and accessories. With more than 800 stores in all 50 US states, Puerto Rico and Canada, Journeys offers the most popular brands that cater to the teen lifestyle such as Converse, Vans, Dr Martens, UGG, Adidas, Timberland, Birkenstock, Crocs and Hey Dude. Through strategic artistic partnerships, event sponsorships, exclusive content, creative collaborations with musicians, and a focus on giving back to the community through charitable events and volunteer programs- Journeys has become more than just a retailer, but a universal part of teen and youth culture. The in-store Journeys experience features an energetic environment, friendly, passionate staff, and an inclusive atmosphere where self-expression is not just accepted - but encouraged and embraced. Journeys is an attitude you can wear. \n  \n  Journeys is always looking for great people to join our team! \n  \n  For more information check out: www.journeys.com/careers\n  \n  \n WHY WORK FOR JOURNEYS? \n  \n \n  We celebrate and reward success! \n  Rapid promotion opportunities for top performers - we promote from within \n  We are a family with an Attitude That Cares \n  We encourage you to embrace your individuality \n  You get to work in a fun environment with the coolest people around \n  We conduct business with integrity and passion \n  Excellent benefits and employee discount Compensation includes base pay, sales commission, and bonus potential* \n \n  \n  \n JOB SUMMARY \n  \n  To provide a fun and memorable shopping experience at Journeys while assisting with basic store operations and achieving store and personal sales goals and standards of performance.\n  \n  \n ESSENTIAL JOB FUNCTIONS \n  \n \n  Meet and exceed store and personal sales goals and standards of performance \n  Perform all Operation/Loss Prevention procedures accurately according to policies \n  Maintain store appearance and stockroom organization \n  Effectively communicate all store needs to store management \n  Stay informed of current fashion trends \n  Complete all point of sale functions as required \n  Complete all assigned tasks and responsibilities promptly \n  Provide a fun, full service experience to all customers \n  Complete all required training \n  Understand the Journeys culture and demonstrate it to the team \n \n  \n JOB REQUIREMENTS \n  \n \n  Prior retail sales experience preferred \n  Ability to multi-task in a fast-paced environment \n  Excellent interpersonal and customer service skills \n  Desire to succeed in fast-paced retail environment \n  Willingness to learn \n  Ability to work night and weekend shifts \n  Ability to climb, reach, bend, and lift up to 50 pounds \n  Stand for long periods of time \n  Must be at least 16 years of age* \n \n  \n \n  Age requirements for part-time employment may vary based on state\n \n  \n  PAY AND BENEFITS \n  \n  Check out the following website for more information on all our awesome benefits: www.journeys.com/careers \n  \n  \n \n  The pay rate, commission, and bonus structure varies per job title, county, city, state or province. Benefits offered may include medical, vision, and dental insurance, a vacation package, and community service hours but may also vary by state, province, or territory. For clarification, refer to www.benefitsatgenesco.com\n \n  \n  PRE-APPLICATION DISCLOSURES \n  \n  Equal employment opportunity is provided to all employees and applicants for employment without regard to race, color, sex, religion, national origin, age, veteran status, pregnancy, childbirth, or related medical condition, physical or mental disability of otherwise qualified individuals, medical condition, genetic information, sexual orientation, citizenship, marital or registered domestic/civil union partner status, gender identity and/or expression, or any other factor that the law protects from employment discrimination. \n  \n  All employment decisions are based on business needs, job requirements and individual qualifications. This policy applies to all terms and conditions of employment, including, but not limited to, recruitment and hiring, placement, promotion, termination, reductions in force, recall, transfer, leaves of absence, compensation and training. Any applicant or employee who needs a reasonable accommodation to apply for employment or to perform the essential functions of his or her job should email accommodation@genesco.com or call (615) 367-7467. Genesco's employment practices will continue to be directed toward full utilization of all available human resources. We believe that this approach to our human resources is not only legally and morally proper, but also is an intelligent and economic business practice."
}