{
    "id": "3df92137d3a31aee",
    "company": "Aramark",
    "positionName": "Housekeeper",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-07T02:04:02.171Z",
    "url": "https://www.indeed.ca/rc/clk?jk=3df92137d3a31aee&from=jasx&tk=1hc6gclvdih64800&vjs=3",
    "externalApplyLink": "https://aramarkcareers.com/Canada/job/Ottawa-Housekeeper-ON-K1N-9J2/1084009300/?feedId=339900&utm_source=Indeed&utm_campaign=Aramark_Indeed&jobPipeline=Indeed",
    "companyDescription": "",
    "description": "Job Description\n  \n  \n    It’s time for a sweeping change to your career so that you can pursue what matters to you! At Aramark, making sure we provide clean environments is something in which we take pride and is a skill set that can help take you further in your career.\n   \n    As a professional Housekeeper on our team, you’ll take pride in cleaning and maintaining the cleanliness of our locations to help keep our guests happy and healthy. Integrity and attention to detail are also two must-have tools that you keep in your cleaning case.\n   \n    By helping us create clean, safe, and orderly environments for our guests, you’ll pave the way to more opportunities for yourself at Aramark!\n  \n \n \n  \n    Job Responsibilities\n  \n  \n   \n    Maintains friendly, efficient, positive customer service demeanor toward customers, clients, and co-workers. Is adaptable to customer needs.\n    Maintains all assigned ancillary and department areas and corridors in a clean neat and sanitary manner, to protect safety and health of others and in compliance with accurate preventative maintenance procedures as outlined in department policy.\n    Inspects and uses judgment in determining which cleaning techniques outlined in orientation guidelines to follow.\n    Demonstrates efficient and safe use of housekeeping equipment and solutions as observed by supervisor.\n    May disinfect and sterilize equipment and supplies, using germicides and sterilizing equipment.\n    Diligently employs universal precautions when disposing of trash and bio-hazardous materials.\n    Keeps cart properly stocked with equipment and cleaning supplies; ensures all chemicals are accurately labeled, and all equipment is in good working condition.\n    Promotes effective interpersonal and interdisciplinary relationships, maintains professional conduct at all times.\n    Assists in improving productivity and efficient operations of the department.\n    Demonstrates commitment to professional growth and competence by adherence to component and departmental training commitments.\n   \n    At Aramark, developing new skills and doing what it takes to get the job done make a positive impact for our employees and for our customers. In order to meet our commitments, job duties may change or new ones may be assigned without formal notice.\n  \n \n \n  \n    Qualifications\n  \n  \n   \n    Past cleaning experience preferred\n    Attention to detail\n    Ability to communicate effectively with clients, senior management, and Aramark support staff\n    Ability to respond effectively to changing demands\n   \n    This role may have physical demands including, but not limited to, lifting, bending, pushing, pulling and/or extended walking and standing. This role may also require uniforms and/or usage of Personal Protective Equipment (PPE).\n  \n \n \n  \n    Education\n  \n \n \n \n  \n    About Aramark\n  \n  \n    Our Mission\n    Rooted in service and united by our purpose, we strive to do great things for each other, our partners, our communities, and our planet.\n    At Aramark, we believe that every employee should enjoy equal employment opportunity and be free to participate in all aspects of the company. We do not discriminate on the basis of race, color, religion, national origin, age, sex, gender, pregnancy, disability, sexual orientation, gender identity, genetic information, military status, protected veteran status or other characteristics protected by applicable law. \n   About Aramark\n    The people of Aramark proudly serve millions of guests every day through food, facilities, and uniform services in 19 countries around the world. Rooted in service and united by our purpose, we strive to do great things for each other, our partners, our communities, and our planet. We believe a career should develop your talents, fuel your passions, and empower your professional growth. So, no matter what you're pursuing - a new challenge, a sense of belonging, or just a great place to work - our focus is helping you reach your full potential. Learn more about working here at http://www.aramarkcareers.com or connect with us on Facebook, Instagram and Twitter."
}