{
    "id": "4bc971c7b803bf0e",
    "company": "Pleora Technologies",
    "positionName": "Product Verification Specialist",
    "jobType": [],
    "location": "340 Terry Fox Dr, Kanata, ON",
    "salary": null,
    "postingDateParsed": "2024-01-17T05:12:17.824Z",
    "url": "https://www.indeed.ca/rc/clk?jk=4bc971c7b803bf0e&from=jasx&tk=1hkikh51mis10800&bb=JE9JfAnknjdhUU6JE_Re-llJm2SoOURla7w0cBHu_DIKFlkCEaikwqrWsfJXTxbJpr4I3-FPCtw3144f7BIa9ghdWtI_D8KSzgkG1NRqwnhHb9F7NL4f8g%3D%3D&xkcb=SoCH67M3FShLfggAKj0HbzkdCdPP&vjs=3",
    "externalApplyLink": "https://pleora.bamboohr.com/careers/82?source=indeed&src=indeed&postedDate=2024-01-16",
    "companyDescription": "",
    "description": "Fixed Term Contract (1 year)\n  \n  \n  Come work for us \n  Companies worldwide rely on Pleora’s solutions, standards knowledge, and systems expertise in mission-critical applications for the industrial automation, medical, and security & defense markets. Founded with a goal to simplify real-time data connectivity, machine vision device and system manufacturers have designed our products into cameras, X-ray panels, robotics, transportation monitoring and quality inspection systems, and more for over two decades. Our expertise extends into the manufacturing sector, with solutions integrating our machine vision and AI skills that digitize and automate processes to ensure quality and traceability for Industry 4.0.\n \n  Summary \n  Product Verification (PV) determines if our products meet design and functional specifications (did we build it right?) by creating, managing, and reviewing test plans that thoroughly assess our hardware and software products. Test cases are automated, when possible, to ensure timely and repeatable test results. As a team member of our Product Verification group, you will help ensure all new and existing products are reliable, defect-free and meet functional specifications. You will work alongside team members to meet/exceed established objectives.\n \n  What you do \n  \n  Translate design specs into test objectives and plans \n  Develop end-to-end test cases to identify product deficiencies prior to release \n  Build test automation tools to increase testing efficiency and effectiveness with new design loads and feature changes \n  Participate in system integration testing \n  Contribute to the project planning process, and adhere to established schedules and project constraints to deliver optimized testing \n  Provide feedback to design team regarding test results, ensuring their understanding of the methodology and results \n  Work with designers to debug issues and ensure quality \n  Streamline procedures resulting in increased efficiency and effectiveness \n  Create, distribute, and analyze various reports, i.e. defects, test plan progress, coverage, etc. \n  Create test scenarios to reproduce field problems to isolate and identify root cause of bugs \n  Interface closely with Product Management and Applications Engineering to address and proactively resolve quality issues\n \n  \n  \n  What you need \n  \n  Completion of a post-secondary Engineering or Applied Science University or College program that provides a general awareness of hardware and software product design and development methods and standards; or a combination of education and related experience \n  Minimum of 5 years direct testing and product verification experience \n  Proven ability to understand functional requirements and translate into test objectives and plans; \n  Specific Quality Assurance experience with networked devices, including both hardware and software; \n  Testing, debugging and qualifying embedded products, with sound knowledge of one or more of the following technologies: \n \n \n  \n   \n    Ethernet or IP networking \n    Video applications \n    USB 3.0 \n   \n \n \n  Success in building and/or assisting with verification infrastructure, with a focus on automation; \n  Proven ability to program in C, JavaScript, Python and/or Tcl; \n  Working knowledge of revision control systems (i.e. Git/SVN/CVS); \n  Effective communication skills, both written and oral; \n  Demonstrated analytical and problem solving skills; \n  Recognized ability to perform in a team environment\n \n  \n  \n  Why work at Pleora? \n  \n  We trust our team – you bring the expertise and drive, we give you the freedom to explore and innovate \n  Excellent work-life balance – and we mean it! \n  We offer a diverse and inclusive “office first” workplace, in a fast-paced environment without “red tape” – giving you the opportunity to contribute your ideas and make a real contribution to our success. \n  Pleora provides a wide range of employee wellbeing initiatives which include: \n   \n    $100 annual \"healthy living\" reimbursement \n    Comprehensive benefits plan (medical, dental, HCSA, etc.) \n    Employee assistance program \n   \n \n \n  We offer competitive vacation, pay, and benefits such as: \n   \n    Competitive market salary \n    Annual company performance bonus \n    RRSP contribution matching \n    Employee recognition programs \n    Referral program for new hires\n    \n  \n \n At Pleora we are an equal opportunity employer and are committed to creating an inclusive environment for all employees. We seek to recruit the best and most talented people for the job, and will provide reasonable accommodation to persons with disabilities to allow you to participate in the recruitment process, upon request."
}