{
    "id": "4bcdcbd0048d301f",
    "company": "The Ottawa Hospital",
    "positionName": "Manager, Research Services",
    "jobType": [
        "Full-time"
    ],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-24T12:17:31.195Z",
    "url": "https://www.indeed.ca/rc/clk?jk=4bcdcbd0048d301f&from=jasx&tk=1hl5dju1ci4nl800&bb=gCzgXPzOG1uTP-CnMJvHBfIH6rldxKFe7mpZRPeX1ZeCBe_7dSyCSmi7myoFk7bDPI4Wtjl7v64J8SLWCVNLMfZ0t5RYdsPJa_5vW7XrIWZL4O0dDoNDug%3D%3D&xkcb=SoAV67M3FlTAH9xNAp0NbzkdCdPP&vjs=3",
    "externalApplyLink": "https://ohhcmdmzweb01.ottawahospital.on.ca/psc/HRPRD/?cmd=login&errorPg=ckreq&languageCd=ENG",
    "companyDescription": "The Ottawa Hospital is one of Canada’s largest learning and research hospitals, with more than 1,100 beds, approximately 12,000 staff members and an annual budget of about $1.2 billion. \r\n\r\nOur focus on learning and research helps us develop new and innovative ways to treat patients and improve care. As a multi-campus hospital affiliated with the University of Ottawa, we deliver specialized care to the Eastern Ontario region, but our techniques and research discoveries are adopted around the world. We engage the community at all levels to support our vision for better patient care.\r\n\r\nFrom the compassion of our people to the relentless pursuit of new discoveries, The Ottawa Hospital never stops seeking solutions to the most complex health-care challenges.",
    "description": "Position Information\n   \n     \n    \n      \n     \n     Reporting to the Vice Chair (VC) of Research, the Manager, Research Services is responsible for a positive work culture, the development, implementation, and maintenance of work practices to permit the delivery of high-quality and efficient research coordination services while building excellence and capacity to respond to the research portfolio within the Department of Medicine (DoM). This includes managing a team, the administration and distribution of workload, communicating across teams, and performing quality control and assurance activities as required. The Manager develops processes and procedures, ensures fair and equitable access to resources, and identifies and addresses opportunities to improve processes and support and facilitate projects and communication to increase research productivity and impact. \n    \n   \n  \n \n \n  \n    Rotation/Shifts\n   \n     \n    \n      \n     \n     Days, 8 hour shifts. \n    \n   \n  \n \n \n  \n    Responsibilities\n   \n     \n    \n      \n     \n     \n      Work with the VC of Research, the VC of Member Support, and Technical Solutions Office (TSO) to develop and maintain an online 'hub' for researchers to navigate the complexity of the researcher environment;\n      Ensures equity in accessing Office services and resources;\n      Manages the staff of the Research Office, prioritizes and delegates workload to meet multiple demands, ensuring deadlines are met; provides guidance/training/coaching to Research Office employees;\n      Provide operational support to Vice-Chair of Research, including preparing and managing the annual Office budget;\n      Monitors the Office¿s programs and service offerings and makes appropriate recommendations to capitalize on opportunities, mitigate risk, and resolve issues;\n      Build and maintain productive and supportive relationships to facilitate research within DOM;\n      Provide advice and guidance on funding opportunities, complex REB submissions, ethics proposals, publications, etc.;\n      Manage compliance, limitations, and maintenance of the internal research output measurement system;\n      Coordinate operational support for the Research Plus Program and the Director, Medical Education Research;\n      Works to develop strategies to increase the visibility of DoM's research accomplishments and promote research events and activities.\n      \n    \n   \n  \n \n \n  \n    Basic Requirements\n   \n    \n     \n       \n     \n     \n       \n      \n       Minimum of 7 years of experience in clinical research at an academic hospital is strongly preferred, including but not limited to clinical trial management, and academic-led studies;\n       Familiarity with scientometric;\n       Experience with research ethics guidelines, applications and REB requirements;\n       Familiarity with concepts of The San Francisco Declaration on Research Assessment (DORA);\n       Demonstrated relevant clinical research knowledge;\n       A minimum of 5 years supervisory/management experience;\n       Working knowledge of clinical research standards and regulations governing human research ethics;\n       Ability to set priorities, work under pressure and meet deadlines with an attention to detail;\n       Experience in leadership, mentoring, and creating positive working relationships, demonstrating tact and diplomacy;\n       Experiencing with managing a budgets and metric reporting;\n       Ability to handle highly sensitive and confidential information;\n       Excellent interpersonal, verbal, and written communication skills;\n       Client service oriented, with the ability to work effectively in a highly diverse environment;\n       Ability to exercise judgement and make decisions while working with minimal supervision;\n       Proficiency in speaking and comprehending both English and French (Level B+) is an asset .\n      \n      \n    \n   \n  \n \n \n  \n    Interested? Apply today!\n   \n     \n    \n      \n     \n     To apply for this exciting opportunity, please forward your resume and cover letter, quoting the corresponding position title, by email at domcareers@toh.ca\n      IMPORTANT NOTICE: Support staff are employees of the University of Ottawa Medical Associates. The Ottawa Hospital is the paymaster of our employees. Although our employees have offices within the Ottawa Hospital, they are not employed by the Ottawa Hospital. The University of Ottawa Medical Associates is committed to the principle of equal opportunity in its employment practices and to providing an environment free from discrimination and harassment for all employees. The University of Ottawa Medical Associates will, upon request, provide accommodations in accordance with the Accessibility for Ontarians with Disabilities Act."
}