{
    "id": "4d783aac609674e5",
    "company": "Canadian Bank Note Company, Limited",
    "positionName": "Software Developer (Image processing)",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-08-25T22:42:34.779Z",
    "url": "https://www.indeed.ca/rc/clk?jk=4d783aac609674e5&from=jasx&tk=1haqc4jkgi46n802&vjs=3",
    "externalApplyLink": "https://cbnco.com/careers/opportunities/?p=job/oJFfofwL&__jvst=Job+Board&__jvsd=Indeed&nl=1",
    "companyDescription": "",
    "description": "Internal Job Title: Software Developer Job Type: Permanent Full-time Location: Ottawa Work Model: Hybrid\n  Deadline for Submissions: September 15, 2023\n  Position Summary\n  Are you a software developer that is looking for a job that rewards individual contribution while working and collaborating with a very experienced team. As a Software Developer on our cross-functional Operations Productions team, you will develop algorithms and applications for existing and new products that underpin and enable our successful systems deliveries. Our mandate includes integrating peripherals, such as document scanners, portrait capture devices (Webcams, DSLRs), fingerprint capture devices, Smartcard readers, ePassport readers seamlessly into larger applications. Individual growth is realized through expertise gained in technology areas such as RF, image processing and photography.\n  What We Can Offer You\n \n   Compensation: We seek long term relationships with our employees and recognize and reward them with a competitive total compensation package that includes:\n   An industry leading defined contribution pension plan with company matching contributions (up to 5%) and payment of service fees,\n   Best-in-class health, medical and life insurance benefits;\n   Access to virtual and telehealth services and apps; and\n   Very progressive fertility, adoption and surrogacy benefits to support all definitions of family.\n \n \n   Career: As a knowledge-based organization we will provide you with a wealth of learning opportunities and challenging work that will grow your knowledge, skills and abilities. At CBN, we encourage and empower our employees to chart their own career path, putting you in control of your future.\n   Culture: Personal character is the foundation of our culture. CBN’s 7 Core Principles shape and guide our behaviours and underpin the sense of community you will experience at CBN. Equality, diversity and inclusivity are important to us as an organization, and we are committed to fostering and developing a work environment where every employee is treated with dignity and respect.\n \n  What You Will Do\n \n   Utilize your Software development skills (Java, Python, C# );\n   Develop automated product and peripheral integration testing;\n   Maintain a test lab;\n   Develop your knowledge in areas such as RF, Image Processing and Photography;\n   Software requirements analysis;\n   Support Development Ops.\n \n  Qualifications\n  Knowledge and Experience\n \n   Bachelor’s Degree in Software Engineering/Computer Science\n   2-3 years of experience\n   Knowledge and interest in image processing\n   Experience troubleshooting electronic devices (peripherals)\n   Knowledge and interest in cameras and photography\n \n  Hard Skills\n \n   Languages: Java, Python, C#\n   Tracking: Jira\n   Other: MS 365\n \n  Skills and Abilities\n \n   Excellent analytical skills\n   Excellent organization/time management/prioritization skills\n   Excellent communication skills (verbal and written)\n   Well-developed interpersonal skills\n \n  Mandatory Requirements\n \n   Ability to obtain and maintain Government of Canada Secret (Level II) clearance.\n \n \n  About Us\n  CBN designs and develops industry leading solutions for the following domains: Border Security, Civil Identity, Driver Identification and Vehicle Information, Currency and Excise Control, and Lottery and Charitable Gaming. To learn more, visit www.cbnco.com.\n  As an Equal Opportunity Employer, Canadian Bank Note Company, Limited is committed to achieving a skilled workforce that reflects the diversity of the Canadian population. We encourage applications from women, visible minorities, people with disabilities and Aboriginal people. Canadian Bank Note Company Limited is committed to developing inclusive, barrier-free selection processes and work environments. If contacted regarding this competition, please advise the interview coordinator of any accommodation measures you may require."
}