{
    "id": "55e6a3f6618ac689",
    "company": "University of Ottawa",
    "positionName": "Assistant Professor (biomedical sciences)",
    "jobType": [],
    "location": "451 Smyth Rd, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-01T20:09:12.473Z",
    "url": "https://www.indeed.ca/rc/clk?jk=55e6a3f6618ac689&from=jasx&tk=1he3lkogbirpe800&vjs=3",
    "externalApplyLink": "https://uottawa.wd3.myworkdayjobs.com/en-US/uOttawa_External_Career_Site/job/Ottawa-ON/Assistant-Professor--biomedical-sciences-_JR3189",
    "companyDescription": "",
    "description": "Job Family:\n  Academic Leadership and Faculty\n \n   Union affiliation:\n \n  APUO\n \n \n   Faculty/Department:\n  CMM Professors\n \n \n   Campus:\n  Main Campus\n \n \n   Date Posted:\n  juin 30, 2023\n \n \n   Closing Date:\n \n \n   Note: Applications will be accepted until 11:59 PM on the day prior to the Posting End Date above\n \n \n \n   Assistant and Associate Professor position\n \n \n   The Faculty of Medicine at the University of Ottawa invites applications for a tenure-track faculty position in the Department of Cellular and Molecular Medicine. The teaching and pedagogical innovation position will focus on the following areas: anatomy, physiology, pharmacology, medical biochemistry, and the development and implementation of laboratory courses in the field of biomedical sciences. Teaching will require active knowledge of French.\n \n \n \n   The University of Ottawa is one of Canada’s leading research-intensive universities with over $340 million in annual research funding. The University is located on the unceded territory of the Anishinabe-Algonquin people, at the heart of Ottawa’s health research and education campus. Together with its \n  \n   affiliated research institutes\n  , the Faculty of Medicine consistently ranks among the top Faculties of Medicine in Canada for research impact and intensity.\n \n \n \n   The Department of Cellular and Molecular Medicine comprises over 100 faculty members, features a vibrant research atmosphere addressing fundamental questions in basic biomedical research with strong links to translational and clinical research. The successful candidate will also be expected to establish and maintain a vigorous program of independent, externally funded research and to contribute to undergraduate and graduate teaching programs.\n \n \n \n   Title of the position: Assistant Professor. The higher rank of Associate Professor will only be considered should the successful candidate possess an appropriate level of experience and commensurate achievements.\n \n \n \n   Number of positions available: One (1)\n \n \n \n   Duties: The functions of a member of the academic staff include, in varying proportions: a) teaching activities; b) scholarly activities evidenced by research, artistic or literary creation, or professional work and c) academic service activities.\n \n \n \n   Terms: Tenure-track position.\n \n \n \n   Wage: Assistant Professor salary scale commensurate according to APUO salary scale. Note: salary for higher ranks is proportional according to level and experience.\n \n \n \n   Benefits package: The University of Ottawa provides a complete compensation package, including long-term disability, basic group life insurance, supplementary health insurance, University of Ottawa Pension Plan, and optional life insurance.\n \n \n \n   Relocation expenses: The successful candidate may be eligible for reimbursement of relocation expenses in accordance with the University policy.\n \n \n \n   Location of work:\n   Faculty of Medicine, University of Ottawa\n   451 Smyth Road\n   Ottawa (Ontario) K1H 8M5\n \n \n \n   Skill requirements:\n \n \n   Education: PhD or MD/PhD\n \n \n   Work experience: Strong track record of teaching experience encompassing the following topics: anatomy, physiology, cellular biology, biochemistry, and innovative laboratory design. Teaching accomplishments, awards and accolades, and presentations at significant conferences demonstrate excellent teaching and a commitment to excellent pedagogical inquiry and research.\n   Language: Fluently bilingual (French & English)\n \n \n \n   Application deadline: July 30, 2023. Note: applications will continue to be accepted until the position is filled. Applications must be submitted electronically through the University of Ottawa Careers website.\n \n \n \n   The application package must include the submission of a teaching dossier, a strong teaching statement (1 page), sample syllabi, course materials, teaching evaluations, and two support letters from referees of high standing. The application must also include a description of current and future pedagogical research plans (2 pages).\n \n \n \n   Three confidential letters of reference should be sent directly to:\n \n \n   Katalin Toth, Interim Chair,\n \n \n   Department of Cellular and Molecular Medicine\n \n \n   Faculty of Medicine, University of Ottawa\n \n \n   451 Smyth Road\n   Ottawa (Ontario) K1H 8M5\n \n \n   Or by email: \n  \n   ktoth@uottawa.ca\n   subject line \"CMM – teaching\"\n \n \n \n   The University of Ottawa is committed to ensuring equity, diversity and inclusion in the scholarly and leadership environments of our students, staff, and faculty. Accordingly, we strongly encourage applications from Indigenous Peoples in Canada, visible minorities members (racialized persons), persons with disabilities, women, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse and inclusive communities. Candidates who wish to be considered as a member of one or more designated groups are asked to complete the \n  confidential \n  Self-Identiﬁcation Questionnaire, to be completed at the time of application.\n \n \n   According to government policy, all qualified candidates are invited to apply; however, preference will be given to Canadians and permanent residents. When submitting your application, please indicate if you are legally entitled to work in Canada.\n \n \n   The University of Ottawa provides accommodations for applicants with disabilities throughout the recruitment process. If you are invited to proceed in the selection process, please notify us of any accommodations that you require by contacting the Office of the Vice-Provost, Faculty Relations at 613-562-5958. Any information you send us will be handled respectfully and in complete confidence.\n \n \n   The University of Ottawa is proud of its 160-year tradition of bilingualism. Through its Official Languages and Bilingualism Institute, the University provides training to staff members and to their spouses in their second official language. \n  At the time of tenure, professors are expected to have the ability to function in a bilingual setting.\n \n \n \n   The University of Ottawa is committed to ensuring equity, diversity, and inclusion in the scholarly and leadership environments of our students, staff, and faculty. Accordingly, we strongly encourage applications from Indigenous Peoples in Canada, visible minorities members (racialized persons), persons with disabilities, women, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse, and inclusive communities. Candidates who wish to be considered as a member of one or more designated groups are asked to complete the confidential Self-Identification Questionnaire, to be completed at the time of application.\n \n \n \n   All qualified candidates are invited to apply; however, preference will be given to Canadians and permanent residents. When submitting your application, please indicate if you are legally entitled to work in Canada\n \n \n \n   The University of Ottawa provides accommodations for applicants with disabilities throughout the recruitment process. If you are invited to proceed in the selection process, please notify us of any accommodations that you require by contacting the Office of the Vice-Provost, Faculty Relations by email at \n  \n   vra.affairesprofessorales@uottawa.ca\n  . Any information you send us will be handled respectfully and in complete confidence.\n \n \n \n   The University of Ottawa is proud of its 160-year tradition of bilingualism. Through its Official Languages and Bilingualism Institute, the University provides training to staff members and to their spouses in their second official language.\n \n \n \n   Prior to May 1, 2022, the University required all students, faculty, staff, and visitors (including contractors) to be fully vaccinated against Covid-19 as defined in Policy 129 – Covid-19 Vaccination. This policy was suspended effective May 1, 2022 but may be reinstated at any point in the future depending on public health guidelines and the recommendations of experts."
}