{
    "id": "57068363882a3d73",
    "company": "The Anglican Diocese of Ottawa",
    "positionName": "Donor and Fundraising Coordinator",
    "jobType": [],
    "location": "71 Bronson Ave, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-17T18:52:28.452Z",
    "url": "https://www.indeed.ca/rc/clk?jk=57068363882a3d73&from=jasx&tk=1hcvfjcolkedt800&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "Be a Change Maker: Join the Anglican Diocese of Ottawa! We are seeking a dynamic and experienced Donor and Fundraising Coordinator to join our team. This role is pivotal in establishing and nurturing relationships with donors, identifying funding opportunities, and developing strategies to ensure sustainable funding.\nKey Responsibilities\nDonor Management: Develop and implement strategies for donor acquisition, retention, and appreciation.Manage and update donor database, ensuring accurate record-keeping of donations and communications.\nFundraising Strategy:Create and execute innovative fundraising strategies to meet and exceed revenue targets.Organize and coordinate fundraising events and campaigns.\nCommunication and Reporting:Develop communication materials for donors, including newsletters, email updates, and impact reports.Ensure timely and accurate reporting on fundraising activities and donor management.\nGrant Writing and Management:Identify, apply, and manage grant opportunities, ensuring compliance with guidelines and reporting requirements.\nVolunteer Coordination:Assist in recruiting and managing volunteers for fundraising events and activities.\nBudget Management:Monitor and manage the fundraising budget, ensuring effective use of resources.\nCommunity Engagement:Represent the organization in community events and forums to build visibility and support.\nQualifications\n\n Bachelor’s degree in Marketing, Communications, Nonprofit Management, or a related field.\n A minimum of 3 years of experience in fundraising and donor management.\n Proven track record of developing and executing successful fundraising strategies.\n Proficiency in Raiser’s Edge or similar CRM software for fund development management.\n Excellent communication and interpersonal skills.\n Strong organizational and event management skills.\n Ability to work flexibly in a team and independently.\n\nPerks & Benefits: We Value You\nBeyond a competitive salary, we offer comprehensive healthcare and dental coverage, and a defined benefit pension plan with generous employer contribution. We honour work-life balance with a generous compensation package that includes a 35-hour workweek and 3 weeks of vacation to start with.\nDon't just apply for a job, apply for a cause! Click on \"Apply for This Position\" and submit your application. We'll be reviewing applications as they come in, so don't delay!\nWhile all applications will be gratefully received, only individuals selected for further consideration will be contacted. The Anglican Diocese of Ottawa reserves the right to contact individuals and to arrange for interviews at any time.\nOur organization is committed to creating a diverse environment and is proud to be an equal-opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, age, veteran status, or disability. We will accommodate the needs of applicants under the Ontario Human Rights Code and the Accessibility for Ontarians with Disabilities Act (AODA). Please advise during the search process if you require accommodation by contacting us at hr@ottawa.anglican.ca\nJob Type: Full-time\nSalary: $32.00-$34.00 per hour\nExpected hours: 35 per week\nBenefits:\n\n Company pension\n Dental care\n Employee assistance program\n Extended health care\n Life insurance\n\nSchedule:\n\n Monday to Friday\n\nWork Location: In person"
}