{
    "id": "5caea33100ac26f4",
    "company": "Keysight Technologies",
    "positionName": "Repair and Calibration Service Technician - Test and Measurement",
    "jobType": [],
    "location": "350 Terry Fox Dr, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-18T05:11:53.580Z",
    "url": "https://www.indeed.ca/rc/clk?jk=5caea33100ac26f4&from=jasx&tk=1hkikfdo3kecu801&bb=WxOhatT4U5HJji5qaEXltMd23OP-kakfmqiPOANe3GOjeqb08GMFSdex60iuDieQR5wD0EEP-ze2084v8q60rCjXVmoDL55yEp-TB4eh-LM09rpvnfrdwg%3D%3D&xkcb=SoCC67M3FSgyYCQ9SB0PbzkdCdPP&vjs=3",
    "externalApplyLink": "https://cancareers-keysight.icims.com/jobs/13438/job?utm_source=indeed_integration&iis=Job%20Board&iisn=Indeed&indeed-apply-token=73a2d2b2a8d6d5c0a62696875eaebd669103652d3f0c2cd5445d3e66b1592b0f",
    "companyDescription": "",
    "description": "Overview:\n Keysight is on the forefront of technology innovation, delivering breakthroughs and trusted insights to the world's visionaries and innovators in electronic design, simulation, prototyping, test, manufacturing, and optimization. Our ~15,000 employees create world-class solutions in communications, 5G, automotive, energy, quantum, aerospace, defense, and semiconductor markets for customers in over 100 countries. Our technical solutions - and our methods for creating them - help connect and secure the world. Learn more about what we do and how we do it. \n\n Our powerful culture has led to us being independently recognized on Fortune 100's Best Companies List and we are \"Great Place to Work\" Certified. We're driven, collaborative, ethical, and curious, and we value all ideas, especially bold ones. And our culture extends far beyond our own walls. Our corporate social responsibility efforts support our communities, nurture the next generation of engineers, and promote environmental sustainability. \n\n At Keysight, Inclusion, Equity & Diversity is an integral part of our core values. We believe that when people feel a sense of belonging, they can be more creative, innovative, and thrive at all points in their careers. We believe everyone should be respected in the workplace and in their communities regardless of race, color, age, gender, sexual orientation, gender identity and expression, ethnicity, religion, disability, veteran status, national origin, or any protected class. We continuously challenge ourselves to grow in our understanding of inclusion by engaging in a wide variety of diversity programs, initiatives, employee network groups and mentoring/development. This is Keysight - People and Culture - YouTube \n\n \nResponsibilities:\n \nChosen candidate under moderate supervision, will:\n Work on service assignments with clearly defined objectives. \nPerform manual and automated calibration, adjustments, preventative maintenance, troubleshooting and repair of Keysight and other OEM Test & Measurement electronic test equipment at our Keysight service center and / or on-site directly at our customer's sites. ( ex: Oscilloscope, Spectrum Analyzer, Network Analyzer, DMM, RF Signal generator, EMI receiver, Antennas, light wave/optical instruments, etc ). \n\n Assist in maintaining the laboratory’s accreditation through participation in proficiency testing, quality measure assurance programs, and applicable training. Assist in maintaining our pool of production computers ( Operating system & HW/Software installation ) \n\n Establish and maintain close communication with customers to ensure we capture and meet customer expectation. \n\n Require ability and desire to learn system/application software \nRequire to be flexible to work overtime. \nRequire to be flexible to occasionally work week-ends and / or different shift. \nRequire to be flexible to travel approx... 30% to 50% of the time. \n\n \nQualifications:\n \nThis key role requires the following skills:\n A.E.C / D.E.C. ( College diploma ) in Electronics (Telecommunication) or equivalent. \n>10 years’ Experience in Field Customer Support of Test and Measurement instruments is an asset. \nMust have good RF/ Microwave fundamental knowledge. \n\n Must have strong verbal and written communication skills ( English ) to interface with customers and peers. \nDemonstrated initiative and drive to expand technical knowledge \nMust be capable to work in a changing priorities environment to meet strict performance metrics. \nAbility to produce detailed assessment reports and summaries using MS Office products \nMust have computer troubleshooting skills & Windows operating system advanced background. \nMust have Valid driver’s license and good driving record \nControlled goods and Secret Level Security Clearance will be required and is mandatory. \n\n Careers Privacy Statement \n\n ***Keysight is an Equal Opportunity Employer.*** \n\n Keysight Technologies Inc. is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other protected categories under all applicable laws."
}