{
    "id": "6ac3fb4d1b0fa79c",
    "company": "Walmart Canada",
    "positionName": "Directs Store Delivery Associate",
    "jobType": [],
    "location": "2210 Bank Street, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-07T02:03:35.913Z",
    "url": "https://www.indeed.ca/rc/clk?jk=6ac3fb4d1b0fa79c&from=jasx&tk=1hc6gclvdih64800&vjs=3",
    "externalApplyLink": "https://walmart.wd5.myworkdayjobs.com/en-US/WalmartExternal/job/Ottawa-ON/XMLNAME--CAN-Directs-Store-Delivery-Associate_R-1685343-1?codes=1-INDEED",
    "companyDescription": "",
    "description": "Position Summary... Co-ordinate and efficiently process direct and local merchandise for delivery to the salesfloor in order to ensure a positive shopping experience and drive customer loyalty. \n \n What you'll do... \n 1. Ensures high-ticket merchandise is properly secured in a designated location. \n 2. Processes direct and local shipments promptly, including OMNI merchandise, and alcohol and receiving of warehouse trailers. \n 3. Trains other DSD Associates to follow all receiving area processes. \n 4. Ensures a clean receiving area by preparing returns, claims, MTR'S for prompt shipment with all necessary documentation. \n 5. Follows and promotes safety rules for lifting procedures, box blades, pallet jacks, ladders etc. \n 6. Works closely with the Operations Manager, Office Support Associate to effectively correct any problems or discrepancies. \n 7. Safeguards backdoor and key controls to ensure compliance with Company guidelines. \n 8. Follows guidelines for cold chain compliance to ensure quality assurance including documenting all necessary information on the Receiving Temperature Log / Sure Check App. \n \n Minimum Qualifications... \n Outlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications. \n Age - 16 or older \n \n Preferred Qualifications... \n Outlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications. \n \n Walmart will accommodate the disability-related needs of applicants and associates as required by law. \n \n Primary Location… 2210 BANK ST, OTTAWA, ON K1V 1J5, Canada \n \n Are you currently a Walmart associate? \n Please login to your Workday account and use the Find Jobs report to apply for this job. \n \n  Find Jobs"
}