{
    "id": "6b6329ec80041dd9",
    "company": "Process Street",
    "positionName": "East Coast Account Executive (Remote) | No-Code SaaS | 100% Remote",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-20T05:08:42.901Z",
    "url": "https://www.indeed.ca/rc/clk?jk=6b6329ec80041dd9&from=jasx&tk=1hkik8vp5k633800&bb=3fcFSWL0Q64YUe5hx9GNdniP6d_1mG3DBsF3yEeMM7GdT8Fexp-NaHnlzxNsYZ7zMbDuwZWEvn8_T3Mh7Ag-JCiXNf5vpXYsGQ6vqYIjwJBhdrsPw6-Ikg%3D%3D&xkcb=SoCF67M3FSgsJ0AB1z0KbzkdCdPP&vjs=3",
    "externalApplyLink": "https://boards.greenhouse.io/processstreet/jobs/7104742002?gh_src=68c516592us",
    "companyDescription": "",
    "description": "Who we are \n  Process Street is a no-code workflow platform startup from San Francisco. We help our customers build, document, automate, and track recurring workflows. Our platform stores knowledge where the action happens, ensuring thorough and error-free execution of workflows that our global customers run their businesses on. We service over 3k customers around the world, such as Airbnb, Spotify, AstraZeneca, and Accenture, and are VC-backed by Accel, Salesforce, and Atlassian. \n  Our Mission \n  To make recurring work fun, fast, and faultless for teams everywhere. \n  Our Culture \n  Process Street was founded on a strong belief in the work-life benefits of a healthy, collaborative remote culture. We value flexibility because many of us are parents, travelers, or just creatives who aren't inspired by the construct of a mundane 9-to-5. Spread across 9 different time zones, we communicate asynchronously, work autonomously, and take real ownership of our work. We know human connections are what make teams strong, so we regularly do coffee chats, game-playing, story-telling, and more, to build strong relationships. \n  If you're entrepreneurial and seek an environment that values impact, ownership, and flexibility, we look forward to meeting you! \n  The Opportunity \n  As an Account Executive at Process Street, you'll be responsible for closing new logos and expanding our relationship with existing customers. We're looking for a self-driven, out-of-the-box thinker who's energized by taking the time to understand our customers and how Process Street can meet their workflow needs.\n  \n  We're building a consumerized workflow automation product to take on incumbents like MS Sharepoint - think \"Trello for form-based workflows.\" We primarily service the SMB market, but we're looking to move up to larger mid and enterprise deals and, with that looking to expand our sales team. \n  What You'll Do \n  \n  Convert inbound leads into opportunities \n  Unearth new sales opportunities through networking and turn them into long term partnerships \n  Present our tech to prospective clients \n  Remain in frequent contact with clients to understand their needs \n  Negotiate agreements \n  Keep records of sales and data up to date \n  \n About You \n  \n  You have 2+ years SaaS sales experience (SaaS experience is non-negotiable) \n  You are a 'Challenger' or Gap seller \n  You have a proven track record of sales target attainment \n  You have strong business acumen and experience driving deals forward \n  You adapt well, and you're a fast learner \n  You're eager to help implement processes and improve our system \n  You are wiling to work in Eastern or Central time \n  \n Our Benefits \n  \n  Unlimited PTO policy – Most take 3-4 weeks, plus their major holidays, AND a company-wide week off in December. \n  Annual company offsite – We get together as a whole company annually as well as encourage and sponsor small group meetups so that you can meet your teammates face to face around the world. \n  Social time – We know human connections are what make teams strong. We regularly do coffee chats, game-playing, story-telling, house tours (only if you're comfortable), and more to build connections. \n  Generous health insurance for US employees and their families. \n  Equity for all full-time roles. \n  \n Confidence can sometimes hold us back from applying for a job. But we'll let you in on a secret: there's no such thing as a 'perfect' candidate. Process Street is a place where everyone can grow. So however you identify and whatever background you bring with you, please apply if this is a role that would make you excited to come into work every day. \n  We are proud to be an equal opportunity employer. We are committed to equal opportunity regardless of race, color, ancestry, religion, gender, gender identity, genetic information, parental or pregnancy status, national origin, sexual orientation, age, citizenship, marital status, disability, or Veteran status."
}