{
    "id": "70fdccc205499084",
    "company": "Dynacare",
    "positionName": "Manager, Laboratory Operations",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-11-03T20:18:55.017Z",
    "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0CteEWC8UOe8di1Viq7t7vWxBuOVoI1Zb0qscJbkr2nD-C-nnwRu8o2YKgq3QcvygKpZM5TiqQINdFBEetrxmbD54ZnDMZuE2g889QtLnDq0lfQ0alv7sE3dq9o5aXFsJCsjVAg8WgOc1ZUnfdKNmLSTlfBGJHeR0xN4odnLvAFqZkm2WJkfW_rIEblQSwZ6p6HNfMWIy8p5i_YJWdqXTZ9SEf_QtSs7lGz-OMYIWLBU1KwmCfHyU3Ggzo3onmur9rqecxuN7ABva4BdjjAOb4t_t9-o6zpgISr1Mh8v7L7Mr07lbUkx2aiq1nEimpMb_naN9iTXfH5Smp1KA3wY6f4e1OqCudlRykE7JjuF9hL-A9B0-zCDpixDG6Mfl-3rSKSPmhCm4o8-oWqmpz3vpEiWqc2-PZ0C7vlohIXnYXIvRbPzi7WW7ae9YUhte2K9bWjCLkpdJAqxIB2mGqmj8REm2wBto_Yx8nHsTzILyI3S_7g9FXLRGeUqfM-AnfN9aOj06O4robqRFgG4rIvkDsKv5FVRABG7W7mAWOmRyNHWk9t-W0wj7kmkjkPXnnAKBD-nUPbqmRR8eazPY3zuD4y2V-n4fuf-Wvz1-yt7mOnCpkEnObKCGkEOsxqbk8ke45go_exeL_VRkbsjz5dGaOIPtURf24SYzZicsJWNycuRLzE26yhAe0pyixc-gkxkxk%3D&xkcb=SoA7-_M3HYijcxQu9p0IbzkdCdPP&p=2&fvj=1&vjs=3&jsa=1429&tk=1hgolb55kj463800&from=jasx&wvign=1",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "Dynacare is currently looking for a Manager, Laboratory Operations to join our team in Ottawa, Ontario.This is a permanent full-time role.The successful candidate will be accountable for the efficient and effective operation and management of the department at both administrative and technical levels. Primary functions include overall service and/or technical excellence, utilization of resources, budget implementation and controls, and on-going performance and development of staff.KEY RESPONSIBILITIES/ACCOUNTABILITIES\n\n Responsible for the scientific and technical functioning of the laboratory\n Ensure that appropriate methodology and equipment are in place\n Review quality control and proficiency test, recommending corrective action where appropriate\n Ensure review with Medical Director and QC Manager where applicable\n Review incomplete work and interprets difficult cases\n Responsible for ensuring all abnormal and STAT reports are handled as outlined in department guidelines\n Develop, modify, implement and communicate department related policies, procedures and manuals\n Provide assistance and counseling to employees, as required, on the interpretation and administration of department related policies and procedures\n Ensure updates are distributed, filed and appropriately posted for notification\n Identify, prioritize and develop annual department budget needs\n Responsible for financial accountability for departmental budget formulation and controls\n Monitor supplies and orders routine stock as required from stockroom and E-req.\n Oversee inventory activity and assisting in resolution of issues\n Responsible for the recruitment, selection, placement, performance management, counseling and selection for department positions\n To ensure each employee receives proper instruction and safety training for each job assigned\n Responsible for the operational functions of the department including scheduling, training and orientation of staff\n Develop, recommend and/or deliver training and development initiatives for all department staff\n Record and submit attendance sheets and submit timesheets to payroll, ensuring accuracy and timely submission\n Monitor compliance, collection, preparation, and analysis of shift or unit reports and statistics\n Delegate and monitor duties of staff and maintain facilities and equipment\n\nINTERNAL AND EXTERNAL RELATIONSHIPSDirect Reports\n\n Lab Assistant\n Clinical Laboratory Assistant\n Lab Assistant Specimen Processing\n Medical Laboratory Technologist\n Senior Medical Laboratory Technologist\n Technician\n\nInternal\n\n Interact, liaise and coordinate activities with Dynacare managers and staff\n Supervise and oversee the function of all staff on site and at off-site locations\n\nExternal\n\n On-going contact with patients, physicians, nursing homes, couriers and the general public\n Liaise with government officials on compliance and licensing issues, as required\n\n***KNOWLEDGE, EDUCATION AND EXPERIENCE*\n\n BSc- Bio Chemistry or certified MLT\n 7 to 10 years of previous managerial experience and demonstrated increased responsibility in a clinical environment demonstrating readiness for a management role\n\n***SKILLS AND ABILITIES*Technical Skills\n\n Ability to perform under pressure, manage multiple projects, respond to changing priorities and deadlines\n Strong problem-solving skills\n\nSocial Process Skills\n\n Ability to respond to employees and management needs often in stressful situations\n\n***DNA of an Ideal Dynacare Employee*I make a difference in people’s lives. I am a caring, collaborative team-player who is passionate about quality and continuous improvement.\n\n Caring - I demonstrate strong empathy and genuine concern for my colleagues, patients and customers.\n Collaborative Team Player - I know I play a key role in helping the Dynacare team achieve success. I am comfortable in a changing environment, and I can easily manage multiple priorities.\n Passion for Quality and Continuous Improvement - I am always looking to learn and solve problems. I am detailed oriented, adaptable and find ways to make things better.\n\nDynacare has been a “Top Employer” for many years and there is a reason why. We are a great place to work.At Dynacare, we’re proud to hire the best people. If you are looking for a meaningful career where you can support healthy lives with commitment and care – we would like to meet you. To apply for this position, you will be asked to submit your resume and complete the application process.If your qualifications and experience fit with this position, we will contact you to learn more. We offer competitive pay and great benefits, along with the opportunity to grow and thrive with a dynamic, successful company. We hope you will join us in our journey to become Canada’s health and wellness solutions leader.Dynacare is proud to be an equal opportunity employer committed to the attraction, selection, advancement and fair treatment of all individuals. We believe that our diversity is our strength so we employ a diverse workforce and respect the needs of all our employees.In accordance with the Ontario Human Rights Code, Accessibility for Ontarians with Disabilities Act and the Dynacare Accommodation Policy a request for accommodation will be accepted as part of the Dynacare hiring process.\nJob Type: Full-time"
}