{
    "id": "7cf9ec6ba420c4d2",
    "company": "Alio Health",
    "positionName": "Medical Science Liaison",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-01T20:09:16.801Z",
    "url": "https://www.indeed.ca/rc/clk?jk=7cf9ec6ba420c4d2&from=jasx&tk=1he3lkogbirpe800&vjs=3",
    "externalApplyLink": "https://aliohealth.bamboohr.com/careers/201?source=indeed&src=indeed&postedDate=2023-07-12",
    "companyDescription": "",
    "description": "Job Title: Medical Science Liaison \n  Date: July, 12, 2023 \n  Location: Ottawa, ON \n  Remote: No \n  Business Unit: Health \n  Department: Pharma Patient Solutions\n \n  The Medical Science Liaison (MSL) is a highly specialized professional who establishes and maintains relationships within the healthcare community. This role is essential in providing both broad and in-depth information to physicians, key opinion leaders (KOLs), researchers, and other stakeholders within the medical and scientific communities. The main goal of this role is to facilitate open and accurate communication between the healthcare professionals and the industry, with the aim of improving patient outcomes and advancing scientific knowledge.\n \n  Accountabilities\n \n  KOL Engagement: \n  \n  Identify, establish and nurture relationships with KOLs who are renowned experts and influencers in their fields. \n  Collaborate with KOLs to share scientific information, discuss research opportunities and seek their insights on emerging treatment options.\n \n  \n  \n  Scientific Communication: \n  \n  Translate complex scientific data into understandable and meaningful information for healthcare professionals. \n  Develop and deliver clinical presentations, lead educational sessions, and engage in one-on-one discussions to educate healthcare providers about the company’s products, therapeutic areas, and clinical trials.\n \n  \n  \n  Clinical Support: \n  \n  Provide clinical support by addressing medical inquiries, discussing treatment options, and assisting with the interpretation of clinical trial data. \n  Serve as a resource for healthcare professionals seeking guidance on appropriate patient selection, dosing, safety, and efficacy profiles. \n  Clinical Research Collaboration: \n  Collaborate with investigators, researchers, and academic institutions to facilitate clinical research initiatives. \n  Assist in identifying potential research sites, facilitating protocol development, and supporting the execution of clinical trials.\n \n  \n  \n  Market Intelligence: \n  \n  Gather and analyze scientific and market intelligence. \n  Monitor competitive environment, stay updated on industry trends, and provide feedback to internal teams regarding the evolving needs and perspectives of healthcare professionals.\n \n  \n  \n  Fulfil other duties as required. \n \n  \n Competencies: \n  \n  Established and active professional network within the healthcare community \n  Proven success bringing in healthcare business \n  3+ years of recent related experience in the healthcare industry \n  3+ years of Oncology experience \n  High level of scientific and business acumen \n  Ability to access decision makers \n  Evidence of achieving referral goals \n  Proven ability to develop and implement a sales and marketing plan \n  Ability to use a Customer Relationship Management Application \n  Excellent planning, organization and presentation skills are critical \n  Results oriented with personal responsibility for delivering on commitments \n  Demonstrate a high degree of professionalism and confidentiality.\n \n  \n  \n  Qualifications: \n  \n  Doctorate degree in biological sciences from an appropriately accredited institution; Medical Doctor, Registered Nurse, or Master of Science in Nursing \n  Minimum two (2) years of Medical Science Liaison experience.\n \n \n  Working Conditions and / or Job Requirements: \n  \n  Must possess mobility to work in an office environment and use standard office equipment, including a computer (finite movements such as typing), telephoning and other office functions; \n  Ability to lift and carry items weighing up to 30 pounds; \n  Must be flexible to work extended hours, including weekends and evenings, to support frequent local and regional/national travel to client sites or tradeshows for presentations, meetings and visits; and, \n  Must be open to travel. \n  Requires operation of vehicle in the performance of duties."
}