{
    "id": "8109cf36f7d9a98a",
    "company": "Lafarge Canada Inc",
    "positionName": "Quality Control Technician",
    "jobType": [],
    "location": "1651 Bearbrook Road, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-01T20:09:51.621Z",
    "url": "https://www.indeed.ca/rc/clk?jk=8109cf36f7d9a98a&from=jasx&tk=1hgol9m42jjhg800&vjs=3",
    "externalApplyLink": "https://cacareers-lafarge-na.icims.com/jobs/13923/job?utm_source=indeed_integration&iis=Job%20Board&iisn=Indeed&indeed-apply-token=73a2d2b2a8d6d5c0a62696875eaebd669103652d3f0c2cd5445d3e66b1592b0f",
    "companyDescription": "",
    "description": "Why work for Lafarge?:\n \n \n   As the global leader in innovative and sustainable building materials, we’re committed to shaping a \n  greener, \n  smarter and \n  healthier world. At Lafarge Canada Inc., \n  safety comes first, \n  collaboration matters and \n  diversity is celebrated with people who share our desire to continually \n  make our materials better.\n \n \n \n   Do you have the drive, the skills, and the passion to join us?\n \n  \n  Overview:\n \n \n   The QC Technician is responsible for safely implementing Quality Control for production and shipping of our products. The main objective of the technician is to ensure the quality and the consistency of the concrete, as well as to help solve any issues that arise and help deal with the situations immediately. \n Responsibilities:\n \n \n   Health & Safety\n \n \n   Work in a safe and effective manner following the Lafarge Safety Program and applicable legislation. Be directly involved in risk analysis necessary for lab and field activities, development and application of improvement plans in relation to Health & Safety and ergonomics.\n \n \n   \n \n \n  Support to Operations\n \n \n   Ensure the Quality Plan for our materials produced and shipped is applied across our local area. Make sure all testing results are entered in our QC software. Analyze the testing results and share them with the Operations teams to ensure our products comply with specifications. \n  Participate with Operation teams to conduct production adjustments needed to insure product conformance. \n  Insure all technical documentation is updated according to our Quality Plan\n \n \n \n   Technical Support and Quality Control\n \n \n   Testing of plastic concrete air, slump, temperature, molding of concrete cylinders. Maintain excellent relationships with Sales, Operations and Customer Support teams. \n  Provide Customer support by visiting customer job sites for testing and technical troubleshooting. \n  Assist in administrative activities and insure all documentation is updated in order to maintain our RMCAO Certification. \n  Support the Sales, Production or Administrative teams when necessary (report preparation, special projects or other special requests). \n  Participate in corrective/preventive action plans preparation and achievement to improve quality.\n \n \n \n   Relationships with Others\n \n \n   Reporting to the Quality Control Supervisor; the QC Technician is to work in conjunction with the plant, operation, and sales team, in an effort to aid in the production and delivery of a quality product that meets and or exceed the customer’s needs and report back to the Quality Supervisor.\n  Qualifications:\n \n \n   Education & Work Experience: \n \n \n  Secondary education with experience in construction. Post-secondary education in Civil technology, engineering, or equivalent or advanced students is a plus.\n \n \n \n   Knowledge & Skills:\n \n \n   The ideal candidate will have experience in the construction materials (aggregates, asphalt and concrete) industry. This is an entry level position that gives a good opportunity to build a solid career at Lafarge. \n  Should have excellent written and oral communication skills and capable of creating good relationships internally and externally with our customers.\n   Must also be able to work well as part of a team and independently.\n   Driven, proactive, high accountability, and self-motivated. \n  Good computer skills for Windows based software.\n   Driver License, minimum G2.\n \n \n \n   Work Environment:\n \n \n   Must be able to work in outdoor and indoor work environments in all weather.\n   Availability for shift work is required. Flexible hours may be required on occasion to meet the demands of our customers which will include overtime and weekend work.\n   Able to perform a variety of tasks, including moderate to heavy lifting, bending, reaching, carrying.\n   This role is will require the handling of cements, aggregates, concrete and lab equipment.\n  LafargeHolcim:\n \n \n   As we are reinventing the way the world builds, we need world-class talent to join our Lafarge Canada team: people who are \n  passionate, driven by \n  curiosity and keen to \n  grow, \n  learn, develop and \n  thrive in our high-performance culture.\n \n \n   Whatever you do, you will make a difference here. Because we know that your passion and curiosity are the natural resources the world needs.\n \n \n \n   We thank you for your interest. Only candidates selected for an interview will be contacted. Lafarge is committed to the principles of employment equity and encourages the applications from women, visible minorities, and persons with disabilities.\n \n \n \n   Lafarge Canada Inc. welcomes and encourages applications from people with disabilities. In Ontario, our organization/business is committed to fulfilling our requirements under the Accessibility for Ontarians with Disabilities Act. Accommodations are available on request for candidates taking part in all aspects of the selection process.\n \n \n \n   Lafarge Canada is committed to providing a safe environment for employees, customers, contractors and vendors. As such, in keeping with the requirements of our industry associations, partners, and clients across Canada, Lafarge Canada has implemented a COVID-19 vaccination policy intended to reduce the spread of COVID-19. As of October 1st, 2021, all new employees joining Lafarge Canada, subject to any requirement to accommodate pursuant to applicable human rights legislation, must be fully vaccinated against COVID-19."
}