{
    "id": "820067174b2dfd41",
    "company": "AWT Labels and Packaging",
    "positionName": "Manufacturing Equipment Operator (Roll to Roll Converting Press)",
    "jobType": [],
    "location": "AWT Labels and Packaging in Gloucester, ON",
    "salary": null,
    "postingDateParsed": "2024-01-16T05:14:33.300Z",
    "url": "https://www.indeed.ca/rc/clk?jk=820067174b2dfd41&from=jasx&tk=1hkikkt0b2bf3001&bb=yhJIT6P4TthyluDALQ78dh21R012Vd-4z7WX8hbhKbVxhzK-bF2miEnz_UbilBeW_ZW6BsDEE9Rb895tSyUcJwyDv-4R-YlPlal6eF8PXTzvbyZgN1k50Q%3D%3D&xkcb=SoAG67M3FShceOxytZ0HbzkdCdPP&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "AWT is a leading manufacturer of custom labels, flexible packaging, and precision converting solutions servicing Healthcare, Consumer Brand, and Technology clients worldwide. AWT employs nearly 630 associates and operates facilities in Minneapolis - MN (Headquarters), South Elgin - IL, Hauppauge - NY, Grand Blanc - MI, Anaheim - CA, Ottawa - Canada, Napa - CA, Winston-Salem, NC, Vaughan - Canada. AWT is the trusted partner for leading brands, delivering comprehensive, innovative, and sustainable solutions with exceptional quality, expertise, and responsiveness. More information about AWT can be found at www.awtlabelpack.com\nManufacturing Equipment Operator (Roll to Roll Converting Press)\nAWT Ottawa has an opening for permanent, full-time, Manufacturing Equipment Operator (Roll to Roll Converting Press).\nThe Manufacturing Equipment Operator, under the direction of the Production Supervisor, will operate a converting machine to manufacture high quality label and specialized converted products\nWe are looking for candidates who have mechanically inclined and are interested in being trained by AWT Ottawa to develop a career in the manufacturing industry. Eventually, an experienced Manufacturing Equipment Operator will contribute to the development of new and innovative products encompassing a wide range of different materials.\nWho you are:\n\n Mechanical mindset and eager to learn\n Skilled in performing shop math including fractions, percentages and precise measurements.\n Detailed oriented / problem solver\n Good communicator (verbal and written skills)\n Safety-first attitude\n Team player with good time management skills\n Ethical worker\n Experienced operating machinery\n Computer literate and generally comfortable with technology.\n Ability to stand for long periods of time in one area and dexterity\n Good vision abilities: close and distant vision, accurate color perception and peripheral vision\n Ability to obtain Controlled Goods Certification\n\nWhat are considered assets: \n\n Experienced operating press machinery\n Experience in the flexographic industry\n Knowledge of paper stocks, inks and related materials/techniques used in the printing industry.\n Familiar with basic hand tools and inspection equipment such as calipers both dial and digital\n\nWhat AWT Ottawa provides:\n\n Competitive compensation\n Comprehensive group benefits\n Paid Time off\n Training opportunities / Tuition refund\n The opportunity to learn and develop professionally with a diverse team in an inclusive organization where everyone can succeed based on merit.\n Open corporate culture anchored on integrity, teamwork, adaptability and responsibility.\n\nPrimary responsibilities\n\n Ensuring high standards of workmanship and efficiency running various products on a laser cutting machine.\n Perform job order review to ensure job requirements are known and understood.\n Setting up / adjusting the press for job runs and closely monitoring machines for signs of problems while ensuring output is meeting set specifications\n Monitoring product quality during production runs by checking it against drawings and established quality standards.\n Taking corrective measures when quality standards are not met and recommending measures to improve productivity, product quality, and safety.\n Troubleshooting and correcting most press operating problems.\n Completing accurately all related job paperwork.\n Ensuring outputs meet production schedules, safety and quality standards, as well as customer needs\n Performing routine press maintenance, safety checks, upkeep and cleaning.\n Maintaining acceptable productivity standards while minimizing raw material waste.\n Following manufacturing and processing procedures, setting machine or equipment controls, carrying out production and inspection processes as documented.\n Ensuring proper use of required personal protective equipment at all times.\n Maintaining a clean working area free from dirt and debris between tasks and at end of day\n Communicating with Supervisor, Lead Hand, Quality Assurance, as needed for any issue that arises during production.\n Assisting R&D and Production teams in researching and developing new applications.\n\nWe are an equal opportunity employer and welcome and encourage all applications. Accommodations are available on request for candidates taking part in all aspects of the selection process.\nJob Types: Full-time, Permanent\nBenefits:\n\n Dental care\n Disability insurance\n Employee assistance program\n Extended health care\n Life insurance\n On-site parking\n Paid time off\n RRSP match\n Tuition reimbursement\n Vision care\n\nSchedule:\n\n 8 hour shift\n Monday to Friday\n\nSupplemental pay types:\n\n Bonus pay\n\nApplication question(s):\n\n What is your shift availability? Options: Day, Afternoon, Night.\n\nAbility to Commute:\n\n Gloucester, ON K1T 3T7 (required)\n\nWork Location: In person"
}