{
    "id": "8371791d8e4db073",
    "company": "Eclaro Business Solutions Inc.",
    "positionName": "Service Desk Analyst Tier 2",
    "jobType": [],
    "location": "Eclaro Business Solutions Inc. in Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-16T18:52:51.440Z",
    "url": "https://www.indeed.ca/rc/clk?jk=8371791d8e4db073&from=jasx&tk=1hcvfn7eljiim800&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "Service Desk Analyst, Tier 2\nSummary:The role of the Service Desk Analyst, Tier 2, is to assist Company Associates who are experiencing any procedural or operating difficulty with the use of technology applications, products, or services specific to Client offices. This individual will work with Tier 2 and Tier 3 Engineers, Managers and Directors to resolve issues that escalate from the Tier 1 Service Desk. The Analyst is expected to be able to develop and implement solutions for the user based on their own research and any recommendations from higher level staff.\nEssential Duties and Responsibilities:Resolves Level 2 work orders. Escalates complex and/or high priority problems to the appropriate Manager for resolution while maintaining responsibility to update and close the original ticketProvide advanced desktop support for all Technology products and services. Support including answering questions, researching problems, in-depth troubleshooting, teaching/instructing Company Associates regarding software or hardware functionality, verifying resolution with Company Associates, and communicating policy where appropriateRecords required user and problem information in the Ticket System. Updates tickets with appropriate journal entries of activities, and closes tickets with resolutions entered upon completion of the jobEffectively, professionally, and respectfully represents all Technology staff members, teams, and their services to the users and Business ManagementWorks on projects as assigned by supervisorPerform onsite visits to offices within designated region\nEssential Knowledge, Skills, and/or Abilities:2+ years of experience working for a corporate level service deskCommunication Skillso Must have good command of the English language to provide effective phone, desk-side and email supporto This position requires handling confidential information in an appropriate mannero Interactions with Company Associates must be handled with diplomacy and tacto Individual must be able to gauge the user's technical ability and communicate with them in appropriate technical or non-technical languageDecision making/judgemento Self-motivated with excellent organizational and planning skills, including the ability to remain calm and manage time well in a fast-paced, ever-changing, team-oriented environmento Capable of working on multiple projects and/or assignments in unison while executing decision-making authority regarding procedures, plans, and scheduleso Although problem-solving guidelines may exist for some problems, situations may be encountered where procedures or instructions may need to be developed and documentedo The incumbent will work either on his or her own or with the larger technology team to resolve the issue and document the solutionMust be able to learn and support new and fast-changing technologies.\nEducation and/or Experience:College degree in a technical field or equivalent experience.\nCertificates, Licenses, Registration:None Required\nEqual Opportunity Employer:  E claro values diversity and does not discriminate based on Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.\nJob Types: Permanent, Full-time\nSalary: $28.00-$33.00 per hour\nExpected hours: 40 per week\nSchedule:\n\n 8 hour shift\n Day shift\n\nAbility to commute/relocate:\n\n Ottawa, ON K1A 0A1: reliably commute or plan to relocate before starting work (required)\n\nExperience:\n\n Help desk: 3 years (preferred)\n SharePoint: 3 years (preferred)\n\nLanguage:\n\n French (required)"
}