{
    "id": "83cab0578d8d2185",
    "company": "Ciena",
    "positionName": "Waveserver Lab Technician – New Grad",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-01T20:08:30.981Z",
    "url": "https://www.indeed.ca/rc/clk?jk=83cab0578d8d2185&from=jasx&tk=1hbkvt5cukf2u802&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=83cab0578d8d2185&atk=&xpse=SoDP67I3IDje3DyAkJ0LbzkdCdPP",
    "companyDescription": "",
    "description": "Ciena is committed to our people-first philosophy. Our teams enjoy a culture focused on prioritizing a personalized and flexible work environment that empowers an individual’s passions, growth, wellbeing and belonging. We’re a technology company that leads with our humanity—driving our business priorities alongside meaningful social, community, and societal impact. \n \n How You Will Contribute:\n \n  Requirements for telecommunications networks are constantly evolving, and our products also need to advance and scale to meet the needs of our customers while also delivering uniform and consistent user experiences.\n \n  As a Waveserver Lab Technician you will be hands on with our next generation optical network solutions in a dynamic team environment. You will work alongside experienced professionals to ensure the reliability and performance of projects that play critical roles in our network solutions and help build upon our innovative technology. You will also challenge yourself and others by bringing enthusiasm and fresh ideas to new challenges and leading by example.\n \n \n   You will be responsible for the installation, maintenance, and troubleshooting of optical network solutions\n   You will use a detail-oriented approach to service user tickets, maintain records of equipment and track new hardware orders and requests\n   You will assist in maintaining hardware and setups including cable management, labeling, and organization\n   You will be accountable for managing individual project priorities, assignments, and timelines.\n   You will participate in the full software development lifecycle, collaborating with multi-functional teams of developers, UX designers, quality assurance teams & release managers.\n \n \n  What Does Ciena Expect of You?\n \n   Initiative – You are a self-starter who works with limited direction and is committed to delivering against aggressive deadlines.\n   Agility – you are readily able to make key decisions and manage competing and ever-changing account priorities.\n \n \n   Communication expertise – the ability to influence and tailor your message and ideas to the audience to ensure understanding and buy in.\n   An ability to go ‘up and down the ladder’ – capable of seeing the big picture, but also understanding the importance of the details and analysis.\n   The flexibility to work independently and as part of a broader team – you thrive in a multi-disciplinary team environment, but are comfortable working independently as required.\n   Relationship builder – with an innate ability to influence, you can quickly develop trusted connections and get work done across multi sites.\n   A commitment to innovation – you keep abreast of the market and competitive developments and are always keen to formulate new ideas and problem solve.\n \n \n  The Must Haves:\n \n   College diploma in physical technology, electronics, or equivalent\n   Experience working with optical networking equipment\n   Knowledge of networking protocols such as TCP/IP, DNS, and DHCP\n   Strong organization skills and attention to detail\n   Must be in Ottawa or willing to relocate as this position is in person five days a week\n \n \n  Why Ciena:\n \n   We believe an inclusive, diverse, and barrier-free work environment makes for empowered and committed employees.\n   We recognize the importance of well-being and offer programs and benefits to support and sustain the mental and physical health of our employees and their families and provide a variety of paid family leave programs.\n   We are committed to employee development, offering tuition reimbursement, in-house learning, and mentorship opportunities.\n   We know that financial security is important. We offer competitive salaries and incentive programs, RSU’s (job level specific) and an employee share option purchase program.\n   We realize time away to recharge is non-negotiable. We offer unlimited paid time off!\n   Great work deserves recognition. We have a robust recognition program, with ongoing and enhanced awards for exemplary performance.\n \n \n  At Ciena, we are committed to building and fostering an environment in which our employees feel respected, valued, and heard. Ciena values the diversity of its workforce and respects its employees as individuals. We do not tolerate any form of discrimination.\n \n  If contacted in relation to a job opportunity, please advise Ciena of any accommodation measures you may require."
}