{
    "id": "89cf6e386848a373",
    "company": "Canadian Blood Services",
    "positionName": "Phlebotomist (Donor Care Associate)",
    "jobType": [],
    "location": "1575 Carling Avenue, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-20T05:08:02.800Z",
    "url": "https://www.indeed.ca/rc/clk?jk=89cf6e386848a373&from=jasx&tk=1hkik8vp5k633800&bb=3fcFSWL0Q64YUe5hx9GNdmRG8nzcBclfKBPXu60UPY2SyrpvuAm7PVB6XnxO1YUBz66fwur7rOah6SNhg_8kkGScqEyaf8jRcdWhO_p10Gi9vIQnVboGxQ%3D%3D&xkcb=SoAL67M3FSgsJ1gB1z0KbzkdCdPP&vjs=3",
    "externalApplyLink": "https://careers.blood.ca/job/Ottawa-Phlebotomist-%28Donor-Care-Associate%29-ON-K1Z-7M3/577523717/?feedId=335117&utm_source=Indeed&utm_campaign=CABloodServices_Indeed",
    "companyDescription": "",
    "description": "Job category: Laboratory and phlebotomy Job posting ID: 5467\n \n  Employment status: Regular part-time Position's anticipated start date: 2024-03-11 Possible schedule/FTE: .30\n \n  Classification: BT OPSEU 477 Salary/Rate of pay: 26.99\n \n  Application deadline: 2024-01-30  Application requirements:\n \n   Your up-to-date resume.\n   We recommend you save a copy of the job posting for reference throughout the recruitment process.\n \n \n  Do you currently work for Canadian Blood Services? All employees must apply via the internal career page.\n \n  Together, we can make all the difference in the lives of others.\n \n  Be part of a dynamic, collaborative and caring organization committed to saving and improving lives. Thousands of patients depend on us every day for reliable access to safe blood, plasma, stem cells and organs and tissues.\n \n  If you are looking for a rewarding experience with a values and mission-driven team, join Canada’s Lifeline and make a meaningful difference.\n \n  We acknowledge that the work of Canadian Blood Services spans many Territories and Treaty areas across the country, and we are grateful for the Traditional Knowledge Keepers and Elders who have guided us in this important work. We recognize the land and waters that have inspired our work and offer gratitude to those Indigenous peoples on whose territory we work, live and play.\n \n \n  \n   \n     About the role\n   \n   \n     Canadian Blood Services is looking for a Regular part-time Phlebotomist (Donor Care Associate) to join our dynamic Donor Centre team.\n    \n     The Donor Centre team is responsible for supporting Canadian Blood Services by collecting donor blood in a safe manner to enable safe products which save lives every day. In this role, you will perform phlebotomy in the collection process in accordance with health and safety standards. You will work face-to-face with our donors, team members and volunteers providing them with safe and quality service during each stage of the collection process.\n   \n  \n  \n   \n     Formula for success\n   \n   \n   \n     \n    \n      Leveraging your superb people skills and ability to communicate effectively with donors, you will conduct registration and confidential screening to determine eligibility and build and promote a positive donor experience.\n      Utilizing your excellent customer service skills, you will monitor donors for safety and comfort, provide post donation care and respect for donor privacy.\n      Drawing on your knowledge or experience in following procedures you will ensure safe processing and handling of blood products.\n      With your excellent interpersonal skills, you will work with others and assist in the collection of whole blood and apheresis blood components which save lives daily.\n      At mobile events within our communities, you will assist in setting up booths, tables, and other equipment to ensure donor clinics are properly set up for use.\n    \n   \n  \n  \n   \n     Desired education and skills\n   \n   \n   \n     \n    \n      Completion of high school.\n      Completion of accredited training program in phlebotomy or one-year related experience. An equivalent combination of education, training and experience may be considered.\n      Basic computer skills and the ability to learn new systems and programs. Previous knowledge of Microsoft Word and Outlook are considered assets.\n      A second language is considered an asset to support a positive donor experience.\n    \n   \n  \n  \n   \n     What we offer you\n   \n   \n   \n     \n    \n      Payment in lieu of vacation and holidays.\n      Defined benefit pension plan.\n      Employee discounts, wellness program, professional resources.\n    \n   \n  \n  \n   \n     What you can expect\n   \n   \n   \n     \n    \n      Shifts/hours will vary. You must be flexible to accommodate assigned shifts which are based on operational needs; length of shifts varies according to the event which takes place at Canadian Blood Services fixed and mobile donor centers. Shifts include days, evenings, weekends, and statutory holidays.\n      Travel will be required for mobile events in our communities, and transportation will be provided by Canadian Blood Services.\n      Physical requirements for the role include the ability to lift weights up to 10 kg (22 lbs.).\n    \n   \n  \n \n  Diversity and inclusion play a vital role in ensuring health equity for patients across Canada. We are committed to reflecting Canada’s population in our organization and fostering an environment where all employees can be their authentic selves, with equal opportunities to succeed and contribute.\n \n  Canadian Blood Services requires that all employees be fully vaccinated (COVID 19 vaccine doses as approved by Health Canada), subject to any medical or other human rights considerations. Persons who have been vaccinated outside of Canada must contact their local Public Health Unit in order to obtain a vaccine equivalency certificate.\n \n  If this role resonates with you, we encourage you to apply by providing your up-to-date resume. This could be your first step towards a meaningful and inspiring career. Come to work each day knowing that you save lives.\n \n  We thank all applicants for their interest. However, only those considered for an interview or those invited to participate in an assessment will be contacted. Applicants who require accommodation should discuss their needs with us."
}