{
    "id": "8cf2470481c352ce",
    "company": "THE SAFARILAND GROUP",
    "positionName": "Senior Human Resources Generalist",
    "jobType": [
        "Full-time"
    ],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-09T03:09:32.595Z",
    "url": "https://www.indeed.ca/rc/clk?jk=8cf2470481c352ce&from=jasx&tk=1hjm33n93k6rj800&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/applystart?jk=8cf2470481c352ce&from=vj&pos=top&mvj=0&spon=0&sjdu=o7sfz71MPdMgyiV0LZq0d4DDplm6SwWjHcxyoDIphKlVDk79DcNfuqIN0b1bp7JbxpYYl5hZCcRbJ0TjREdIQvHaNFnB4vfzfWDTXGyvdLxoIkU0IA5kT-N_Nj0AfL5jLyuLD3NWqMNc278RPgpSCvjBgl87_qXkGd27tiwsuaSmhOXUWHnPDNZWMhoMBb3Vw9_XINGINv7OnqX9-Wv1cg&vjfrom=serp&log=1&astse=d23ba698ac92adaf&assa=2173",
    "companyDescription": "",
    "description": "TOGETHER, WE SAVE LIVES \n\n Reporting to the HR Lead, Canada, the Senior HR Generalist is responsible for all areas within the HR field for a set group of employees. Key areas of responsibility include coordination of recruiting/new hires/terminations, training and development, safety, performance management, benefits administration, policy formation and interpretation, workers compensation, and compliance with various federal and provincial regulations. In addition, they will administer human resources policies and procedures, collects, and analyzes HR data and then makes recommendations to management and processes paperwork for functional area according to established procedures. \n\n \nResponsibilities:\n \n \n Serve as an HR relationship conduit for assigned businesses by proactively developing effective manager/employee relationships. \n Acts as the single point of contact for all employees and mangers for the delivery of effective Global and local HR programs and services \n Identifies legal requirements and government reporting regulations affecting human resources functions and ensures policies and procedures are in place. \n Lead full cycle recruitment process and work with leaders to ensure proper onboarding & orientation process. \n Coordinate, deliver and maintain training programs as it pertains to local business and global requirements. \n Partners, coaches, and counsel managers to develop skills/practices relating to HR: employee relations, engagement, performance management, disciplinary processes, career development, etc. \n Work with supervisors and managers during the termination process to exit the employee properly, ensure all necessary paperwork is completed and issued at termination; conducts exit interviews to determine reasons behind separations. \n Advise management in appropriate resolution of employee relations issues and be present during disciplinary meetings \n Partners with the broader HR team to develop policies, programs, processes and provides feedback on their effectiveness, relevance and value to the company’s operations. \n With the support of the HR Lead, Canada act as consultant and coach for managers and employees concerning organizational structures, organizational development, and implementation of change. \n Administer benefit programs, including annual open enrollment process - Maintain accurate records through all areas of HR \n Participates in health and safety committee and supports safety initiatives as needed including training initiatives. \n Provide management reports as required. \n Perform other related duties as assigned or requested by senior management \n Qualifications \n\n \n 7 years related experience, including professional level experience in all areas of Human Resources. \n Degree or diploma in Business with Human Resources coursework or equivalent; Certified Human Resources Professional designation or equivalent preferred \n Strong analytical and problem-solving skills, with a demonstrated ability to identify and implement effective solutions within established policies and identify and recommend potential policy amendments. \n Strong organizational skills: ability to prioritize and manage multiple tasks. \n Previous experience working on FCP (Federal Contractors Program) and Pay Equity Plans is required. \n A sound knowledge of general human resources principles and practices. \n Exceptional relationship-building skills, including the ability to develop, maintain, and strengthen partnerships with internal and external stakeholders. \n Demonstrated ability to get results through others – to influence without authority. \n Must have a demonstrated strong customer service orientation in order to provide exceptional service and continuous improvement on meeting and exceeding customer expectations . \n Effective change management skills. \n Strong consultation, coaching and negotiating skills. \n Excellent communication skills are required, including the abilities to listen, understand, write clearly and concisely, and demonstrate effective verbal delivery. \n Eligible for a Security Clearance is required. \n The Safariland Group believes in the benefits of a diverse workforce and is committed to equal opportunity and affirmative actions. We pride ourselves on hiring and developing the best people, without regard to age, sex, sexual orientation, gender identity, genetic characteristics, race, color, creed, religion, ethnicity, national origin, alienage, citizenship, disability, marital status, military status, pregnancy, or any other legally-recognized protected basis prohibited by applicable law. \n\n For those applicants with disabilities, if you require reasonable accommodation in searching for a job opening or submitting an application, please contact us by calling 888-469-6455. \n\n All employment decisions are solely based on the applicant's qualifications as they relate to the requirements of the position."
}