{
    "id": "8fa11fef857868f5",
    "company": "Western Quebec School Board",
    "positionName": "Agente ou Agent de service social- Remplacement à temps plein | Social Services Officer- Replacement Full Time",
    "jobType": [],
    "location": "Gatineau, QC",
    "salary": null,
    "postingDateParsed": "2024-01-19T05:10:30.798Z",
    "url": "https://www.indeed.ca/rc/clk?jk=8fa11fef857868f5&from=jasx&tk=1hkikdadhih1j800&bb=EhOb8wC-jg2wt5IuI5mDXZBarUx5ODm9NPvUN-IcfSRWWwyJnORM9yJRvY8LiUR8CdhTyDs3qJP8Qv79rtrYGGC1P9ZXqhyB-fTx1fc1i1s4ymA46WJBDA%3D%3D&xkcb=SoCR67M3FSg6inQ9SB0GbzkdCdPP&vjs=3",
    "externalApplyLink": "https://westernquebec.simplication.com/Applicant/jobposting/jobdetails.aspx?JOB_POSTING_ID=95c6b98d-d15b-417f-af92-80c61e6aa6d8&PAGE=1&locale=en&maf=0",
    "companyDescription": "",
    "description": "Agente ou Agent de service social \n\n Remplacement à temps plein - 35 heures par semaine \n\n Jusqu’au 31 janvier 2025 \n\n Département des services complémentaires \n\n À propos de la Commission scolaire Western Québec \n\n Western Québec est une commission scolaire anglophone dévouée au développement personnel et à la préparation professionnelle de ses élèves. Les enseignantes, enseignants et le personnel se vouent tous à l'excellence académique, et à un enseignement de qualité qui encourage le développement social, émotionnel et moral. Western Québec respecte et promeut les droits et les responsabilités de chaque individu tout en privilégiant un apprentissage axé sur l'élève dans un environnement sécuritaire et sain. Les parents et les communautés sont considérés comme des partenaires qui collaborent à l’enrichissement de nos programmes et l’atteinte d’objectifs. \n\n Les 31 écoles et centres d’enseignement aux adultes de Western Québec offrent l’enseignement de langue anglaise aux élèves admissibles sur un territoire immense et diversifié qui couvre les régions de l’Outaouais, de Pontiac et de l’Abitibi-Témiscamingue. Les différences culturelles sont mises en valeur et célébrées dans notre population étudiante par des programmes d’immersion française, des événements pour et par les Premières Nations, et par d’autres activités et initiatives étudiantes. \n\n Nature du travail \n\n L’emploi d’agente ou agent de service social comporte plus spécifiquement la prévention, la promotion, le dépistage, le soutien et l’intervention auprès des élèves et des groupes d’élèves qui vivent ou qui sont susceptibles de vivre des difficultés d’ordre affectif, familial, social, ou scolaire, dans le but de favoriser le développement optimal de l’élève et de rétablir son fonctionnement social en interaction avec son environnement. \n\n Quelques attributions caractéristiques \n\n L’agente ou l’agent de service social contribue au dépistage et à la reconnaissance des élèves vivant des difficultés, et ce, dans une optique de prévention et d’intervention; elle ou il planifie et effectue des entrevues, procède à des observations, recueille auprès des intervenantes et intervenants scolaires ou externes ou des parents des renseignements pertinents et participe à l'analyse des données et à l'identification de la nature de la problématique. \n\n Elle ou il participe avec l’équipe multidisciplinaire à l’élaboration, la réalisation et la révision du plan d’intervention de l’élève en tenant compte du contexte personnel, familial, scolaire et social pour l’aider à surmonter ses difficultés, à maintenir et à développer sa motivation scolaire; elle ou il collabore avec les autres membres de l’équipe à la concertation et la coordination des interventions, et à l’évaluation de l’atteinte des objectifs. \n\n Elle ou il conseille et soutient les enseignantes et enseignants et les autres intervenantes et intervenants scolaires afin de mieux répondre aux besoins de l’élève et à son encadrement scolaire pour lui permettre de poursuivre son cheminement et s’engager sur la voie de la réussite. \n\n Elle ou il effectue des rencontres de relation d’aide individuelle auprès de l’élève et des rencontres de groupe, assure le suivi de la relation d’aide auprès des parents; elle ou il peut diriger l’élève ou ses parents vers les ressources appropriées à la situation et aux besoins; elle ou il collabore avec les représentantes et représentants d’organismes partenaires. \n\n Elle ou il participe à l’élaboration, la promotion et l’animation de programmes de dépistage, de sensibilisation et de prévention sur des sujets reliés aux problématiques vécues par les jeunes. \n\n Elle ou il conseille le personnel d’encadrement, rédige des rapports d’expertise, d’évolution de la situation et des bilans et fait les recommandations appropriées pour soutenir la prise de décision. \n\n Elle ou il peut être appelé à intervenir pour aider à désamorcer des situations de crise ou d’urgence et proposer des pistes de solution. \n\n Elle ou il prépare et assure la mise à jour des dossiers selon les règles définies par la commission scolaire; elle ou il rédige des notes évolutives ou des rapports d’étape, de fin de processus et de suivi de ses interventions. \n\n Qualifications requises \n\n Diplôme universitaire terminal de premier cycle dans un champ de spécialisation approprié, notamment en service social. \n\n Autres exigences \n\n Capacité à travailler en collaboration avec les membres de l'équipe (DART et autres) pour soutenir, coordonner et préparer/présenter des sessions liées à la sensibilisation à la drogues et aux modes de vie/choix sains ; \n\n L'expérience et la formation antérieures en la matière constitueront un atout majeur dans les dossiers de la prévention de la drogue et des modes de vie/choix sains ; \n\n Connaissance des meilleures pratiques et des questions d'actualité liées à la prévention et à la sensibilisation aux drogues ; \n\n Capacité à développer de solides relations professionnelles au sein de l'école et avec des organismes extérieurs ; \n\n Capacité à défendre les intérêts des jeunes et à les conseiller sur les questions liées aux modes de vie sains et à la prévention de la drogue ; \n\n Une expérience connexe dans le processus d'orientation et le rôle avec les agences/services externes est fortement recommandée ; \n\n Des déplacements sont nécessaires pour soutenir les écoles de notre conseil scolaire - un véhicule personnel est nécessaire. \n\n Conditions de travail \n\n Le poste est régi par la convention collective entre le CPNCA et la FPPE (Fédération des professionnels de l'éducation du Québec). \n\n Salaire annuel de 49 456 $ à 87 626 $, en fonction des qualifications, de la scolarité et de l'expérience. \n\n \nVacances annuelles : 35 jours. \n\n Jours de congés sociaux. \n\n Régime de retraite. \n\n Assurances collectives. \n\n Programme d'aide aux employés. \n\n Équilibre entre vie professionnelle et vie privée (horaires flexibles). \n\n Comment postuler \n\n Les candidatures doivent être soumises par l'intermédiaire de Apply To Education https://westernquebec.ca/resources/careers/ \n\n Date limite pour postuler \n\n Le 25 janvier 2024, à 16h. \n\n Seuls les candidats retenus pour un entretien seront contactés. \n\n Nous, la commission scolaire de Western Quebec, reconnaissons que les terres sur lesquelles nous vivons, apprenons et travaillons sont le territoire traditionnel non cédé des peuples algonquins Anishinaabe. Nous les remercions de partager ces terres et nous nous engageons, en tant qu'organisation, en tant qu'éducateurs et en tant qu'individus, à entretenir une relation continue qui reconnaît et respecte les terres, les traditions et la culture du peuple Anishinaabe. \n\n La Commission scolaire Western Québec s'engage à bâtir une communauté éducative ayant pour objectif commun de réaliser le potentiel de tous nos élèves en cultivant un solide corps de soutien et l'excellence professionnelle, pédagogique et administrative. Nous encourageons donc les candidatures des Autochtones, ainsi que celles des autres groupes racialisés, des personnes vivant avec un handicap, des personnes de confession religieuse et des minorités de genre. En tant qu'organisation, nous nous efforçons d'embaucher des personnes qui reflètent les communautés que nous servons, et qui pratiquent l'amour de l'apprentissage tout au long de la vie, le travail d'équipe et l'éthique professionnelle la plus élevée. Nos efforts pour obtenir une main-d'œuvre diversifiée qui contribue à un environnement de travail culturellement sûr comprennent la mise en place de pratiques d'emploi proactives afin d'aborder les barrières systémiques et d'éliminer les obstacles à l'embauche et à la rétention de personnes qualifiées. \n\n Social Service Officer \n\n Replacement - Full Time - 35 hours per week \n\n To January 31, 2025 \n\n Complementary Services Department \n\n About the Western Québec School Board \n\n Western Québec is an English school board dedicated to developing lifelong learners who contribute to society and are prepared for their future. All teachers and staff are committed to academic excellence and the provision of quality education which encourages social, emotional and moral development. Western Québec respects and promotes the rights and responsibilities of every individual while maintaining a student-centred, safe and healthy learning environment. Parents and communities are valued as collaborative partners in enriching programs and achieving goals. \n\n Western Québec’s 31 schools and centres provide English-language education to eligible students over an immense and diverse territory which covers the Outaouais, Pontiac and Abitibi-Témiscamingue regions. Cultural differences are valued and celebrated within our student population through French-Immersion programs, First Nations events and student initiatives and activities. \n\n Nature of the Work \n\n The position of social service officer encompasses, in particular, responsibility for prevention, promotion, screening, support and intervention activities with students and groups of students experiencing or likely to experience emotional, family, social or school problems in order to foster the student's optimal development and restore his or her social functioning in interaction with his or her environment. \n\n \nSome characteristic duties:\n The social service officer contributes to the screening and identification of students experiencing problems, using an approach focussing on prevention and intervention; he or she plans and conducts interviews, makes observations, gathers pertinent information from school or external resources or parents and participates in analyzing data and in determining the nature of the problem. \n\n He or she works with a multidisciplinary team to draw up, implement and review a student’s individualized education plan, while taking into account the personal, family, school and social context to help him or her overcome his or her problems as well as to develop and maintain his or her motivation in school; he or she works with other team members to ensure concerted and coordinated interventions and assess the achievement of objectives. \n\n He or she provides advice and support to teachers and to other school resources to better meet the student’s needs and to provide necessary support and supervision to ensure the student’s progress and success in school. \n\n He or she conducts individual or group counselling sessions with students and ensures follow-up with parents; he or she may refer the student or his or her parents to resources appropriate to the situation and needs; he or she works with representatives of partner organizations. \n\n He or she participates in the preparation, promotion and delivery of screening, awareness-building and prevention programs on topics related to the problems experienced by youths. \n\n He or she advises management staff, prepares expertise, progress and end-of-process reports and formulates appropriate recommendations to support decision making. \n\n He or she may be called upon to help defuse crisis or emergency situations and to recommend solutions. \n\n He or she prepares and updates files according to the rules defined by the school board; he or she prepares progress notes or reports as well as end-of-process and follow-up reports on his or her interventions. \n\n Qualifications Required \n\n A bachelor's degree in an appropriate specialty, notably social work \n\n Other Requirements \n\n Ability to work collaboratively with team members (DART and other) to support, coordinate and prepare/present sessions related to drug awareness, healthy lifestyles/choices; \n\n Related, previous experience and training will be a strong asset in the dossiers of drug prevention, and healthy lifestyles/choices; \n\n Knowledge of best practices and current issues related to drug prevention/awareness; \n\n Ability to develop strong professional relationships within the school and with outside agencies; \n\n Ability to advocate for and advise youth on matters related to healthy lifestyles and drug prevention; \n\n Related experience in referral process and the role with outside agencies/services is strongly recommended; \n\n Travel is required to support schools within our school board – a personal vehicle is essential. \n\n Working Conditions \n\n The position is governed by the collective agreement between CPNCA and FPPE (Federation of Educational Professionals of Québec). \n\n Annual salary from $ 49,456, to $ 87,626, based on qualifications; schooling; experience. \n\n \nVacation: 35 days. \n\n Special leave days. \n\n Pension plan. \n\n Group insurance program. \n\n Employee assistance program. \n\n Work-life balance (flexible hours). \n\n How to Apply \n\n Applications must be submitted through Apply To Education https://westernquebec.ca/resources/careers/ \n\n Deadline to Apply \n\n January 25, 2024, 4:00 p.m. \n\n Only those candidates chosen for interviews will be contacted. \n\n We, the Western Quebec School Board, acknowledge that the lands upon which we live, learn, and work are the traditional unceded territory of the Algonquin Anishinaabe peoples. We thank them for sharing these lands and commit, as an organization, as educators and as individuals, to an ongoing relationship that recognizes and respects the lands, traditions, and culture of the Anishinaabe people. \n\n The Western Quebec School Board is committed to building an educational community with the common purpose to realize the potential of all our students by cultivating a strong corps of support, professional, teaching, and administrative excellence. We, therefore, encourage applications from Indigenous people, as well as from other racialized people groups, persons living with a disability, people of religious faith, and gender minorities. As an organization, we strive to hire individuals who reflect the communities we serve, and who embody and practice a love of life-long learning, teamwork, and the highest professional ethics. Our efforts to achieve a diverse workforce that contributes to a culturally safe working environment include establishing proactive employment practices to address systemic barriers and removing obstacles to hiring and retaining qualified people."
}