{
    "id": "9067c70c8c07f303",
    "company": "Saks Off 5th",
    "positionName": "Investigator, Asset Protection",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-19T05:09:05.314Z",
    "url": "https://www.indeed.ca/rc/clk?jk=9067c70c8c07f303&from=jasx&tk=1hkikb4a7k5qp800&bb=lTPy9GC8AEMesPUlCsHFKgPvpBMcSgnnCgTP_tIx6wm2UuGzoehtpuZWgavhUzEITDyTUz3ShgLkyQcr63P7XcEXDPmkFRVZWDVmBDlw9MowzuG3NP0obA%3D%3D&xkcb=SoAK67M3FSgjV4x1FB0HbzkdCdPP&vjs=3",
    "externalApplyLink": "https://www.careersatsaksoff5th.com/en/job/R-106439/investigator_asset_protection?src=JB-10060",
    "companyDescription": "",
    "description": "Location: Ottawa, Ontario, Canada\n    \n   \n    Category: Loss Prevention Group\n    \n  \n  \n   \n    Job Opened: January 18th, 2024 \n   \n   \n    Education: \n   \n  \n  \n   \n    Job Number: R-106439 \n   \n   \n    Job Type: regular \n   \n  \n  \n   \n    Remote: No \n   \n  \n \n \n  job description \n  Saks OFF 5TH is the premier luxury off-price destination. In its more than 100 stores in the U.S. and Canada, and online, at SaksOFF5TH.com, the company provides the best names in fashion at an incredible value through its merchandise authority, unparalleled brand access and seamless connection between ecommerce and stores.  What This Position Is All About:\n  \n   At Saks OFF 5TH, we are continuously inspired by the movement to create a safe and enjoyable experience for everyone. If you have a natural proclivity towards practicing safety and are enticed by an opportunity to create and maintain a safe space for others, then this is the right opportunity for you! We are looking for a safety-minded expert like yourself to provide a positive experience for our customers and associates.\n  \n   Discover your opportunity to become an expert in all aspects of Asset Protection at Saks OFF 5TH and play a vital part in maintaining our reputation as the premier luxury-value destination. Work with our teams to identify operational deficiencies and contribute to evolving our Asset Protection strategy. Develop and experience new ways to partner with our customer and associate groups to ensure a safe shopping and work experience for everyone.\n  \n   Who Are You:\n  \n    You clearly assign responsibility for tasks and decisions, set and communicate a clear vision, and drive positive outcomes through objectives and measures\n    Analytical thinker able to generate and share ideas while keeping a keen eye for detail\n    Natural problem-solver who contributes to a collaborative work environment that encourages creative thinking and innovation\n    You get things done by engaging in a high level of teamwork and being a diplomatic and direct communicator to get cooperation with little disruption\n    A transformative thinker who constantly looks at the big picture and demonstrates an exceptional ability to make decisions and work under pressure\n  \n  \n   You Also Have:\n  \n    High school diploma or equivalent\n    Must satisfy and maintain all licensing requirements (as required by state or local jurisdiction)\n    A valid region/market specific security license as per local government regulations\n    Proficiency in Microsoft Suite\n    Ability to speak to Asset Protection practices and happenings/trends during team and leadership meetings\n    Awareness of retail procedures, and criminal civil proceeding process is an asset\n    Aptitude and working knowledge of retail security and information systems, and productivity software\n    Flexibility to work evenings, weekends and public holidays\n  \n  \n   As The Asset Protection Investigator, You Will:\n  \n    Build awareness and inspire by performing as a role model and executing the Saks OFF 5TH customer experience\n    Actively engage in store-wide communication regarding Asset Protection best practices, training, new hire orientation, and safety and shortage meetings\n    Contribute to the development, implementation and execution of local shortage strategy, and audits as per company standards\n    Demonstrate your expertise by ensuring physical security standards are maintained and adjustments are initiated timely\n    Drive Asset Protection excellence by facilitating selling process through consistent adherence to policies and procedures that safeguard customers, associates and company assets\n    Detect and detain shoplifters and complete related documentation by applying the five stages of arrest\n    Identify and present opportunities for improving Asset Protection strategies to senior leadership by compiling reports using audit data, and ensure achievement of storewide shortage results below provision and company standard\n    Achieve targets of investigative performance by identifying and addressing internal and external theft exposures; complete accident investigations and general liability claims reports\n    Demonstrate a direct impact in high shortage departments and perform Asset Protection operational audits and internal self-audits in sensitive areas\n    Be available to respond to after-hours alarm calls and emergency situations\n    Efficiently complete tasks/special projects as assigned by store leadership\n  \n  \n   Your Life and Career at Saks OFF 5TH:\n  \n    Be part of an empowered, innovative team; work with an adventurous spirit and a customer-centric mindset; play a critical role in making decisions that will position us to win\n    Exposure to rewarding career advancement opportunities across different functions within our corporate offices, retail stores, photo studios, and distribution centers\n    A culture that promotes a flexible work environment\n    Benefits package for all eligible full-time employees (including medical, dental and vision)\n    An amazing employee discount and other exciting perks\n  \n  \n   #OFF5THAssetProtection\n  \n   Thank you for your interest with Saks OFF 5TH. We look forward to reviewing your application.\n  \n   Saks OFF 5TH provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Saks OFF 5TH complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.\n  \n   Saks OFF 5TH welcomes all applicants for this position. Should you be individually selected to participate in an assessment or selection process, accommodations are available upon request in relation to the materials or processes to be used.\n  \n   Your Life and Career at Saks OFF 5TH:\n  \n    Be part of an empowered, innovative team; work with an adventurous spirit and a customer-centric mindset; play a critical role in making decisions that will position us to win\n    Exposure to rewarding career advancement opportunities across different functions within our corporate offices, retail stores, photo studios, and distribution centers\n    A culture that promotes a flexible work environment\n    Benefits package for all eligible full-time employees (including medical, dental and vision)\n    An amazing employee discount and other exciting perks\n  \n  \n   Thank you for your interest with Saks OFF 5TH. We look forward to reviewing your application.\n  \n   We believe that our differences not only make us stronger, but also guide our evolution and future growth. All associates are expected to create an inclusive environment free from harassment, discrimination, and bullying.Together, we celebrate, advocate for, and learn from our colleagues, customers and communities to create the best environment to shop and work for all."
}