{
    "id": "92f69083d0b1658b",
    "company": "CIMA+",
    "positionName": "Senior Civil Engineering Technician – Bridges - Hybrid",
    "jobType": [
        "Permanent"
    ],
    "location": "Gatineau, QC",
    "salary": null,
    "postingDateParsed": "2024-01-24T12:18:50.160Z",
    "url": "https://www.indeed.ca/rc/clk?jk=92f69083d0b1658b&from=jasx&tk=1hl5dm5j5kc37800&bb=oevkGIDXh7gG1VwZljrf75zFWWgU0wWGl6gec1I539oFQho7kKUGczq7q6bZN_5ySaCacstYYnU7q24tF0YLd4ramoyPMSGNc19mva9F2zdxEm5AiIqX1g%3D%3D&xkcb=SoAn67M3FlTXbXRRp50JbzkdCdPP&vjs=3",
    "externalApplyLink": "https://jobs.smartrecruiters.com/CIMA2/743999962476742-senior-civil-engineering-technician-bridges-hybrid",
    "companyDescription": "With more than 30 offices across the country and over 2,600 employees, 60% of which share ownership in the company, CIMA+ is one of Canada’s largest private consulting engineering firms and a “Best Employer” according to the Kincentric survey. \r\n\r\nFor more than 30 years, our multidisciplinary teams have been offering clients a complete range of solutions in the building, energy and resources, municipal infrastructure, telecommunications and transportation sectors. We also offer a multitude of complementary services, including environmental and project management services. Innovative and integrated solutions that place people at the centre of engineering, reflect our values and our corporate culture.",
    "description": "Company Description\n  Welcome to a place where people are at the heart of everything we do.\n  Welcome to people with an inspiring vision and who seek stimulating challenges. At CIMA+, you’ll find a place where you’ll have many opportunities to learn and develop while working on engaging projects.\n  We are a firm 100% owned by its employees and we value a collaborative and entrepreneurial mindset. You will have the flexibility to manage your work on your own terms and define what work-life balance means to you.\n  When you join CIMA+, we welcome you to a place that you can call home.\n  Job Description\n  Mission\n  Come and join our team that specializes in bridges and engineering structures as a senior civil engineering technician. You will have the opportunity to share your knowledge and expertise in drafting and structural design with all members of our team.\n  We offer a flexible hybrid work arrangement that allows you to work from home and at our office in Gatineau or Ottawa.\n  Primary Responsibilities\n \n   Actively participate in the development of BIM/VDC processes in projects related to the construction and rehabilitation of bridges and engineering structures by working with a team of technicians, drafters and engineers\n   Create complete project mock-ups by modeling the elements of bridge or interchange project\n   Develop and prepare models and plans for engineering structures\n   Ensure interdepartmental coordination with the CAD teams and in compliance with the quality assurance system\n   Participate in the preparation of studies and technical reports\n   Participate in the training and mentoring of junior employees\n \n \n  Qualifications\n  \n \n   DEC in civil engineering or related discipline\n   10 years of experience in structures (bridges, engineering structures, buildings)\n   Safety training on construction sites (ASP card)\n   Proficiency using AutoCAD, BIM, Revit software\n \n  Contact Afifa Karah-Ali\n  #LI-Hybrid\n  Additional Information\n \n  Ethics and integrity are fundamental values at CIMA+, and we are looking for people who uphold these principles. We are committed to creating opportunities for all our talents to contribute to the firm’s success, develop and grow, regardless of cultural or other differences. We fully endorse employment equity principles and encourage women, visible minorities, indigenous peoples, and individuals with disabilities to apply for any position offered at CIMA+. Adaptation measures are provided upon request to facilitate participation in the recruitment process."
}