{
    "id": "987f415102cd542b",
    "company": "Intertek",
    "positionName": "FIPS Evaluator III - Ottawa, ON",
    "jobType": [
        "Full-time"
    ],
    "location": "200-1223 Michael St N, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-25T12:16:18.737Z",
    "url": "https://www.indeed.ca/rc/clk?jk=987f415102cd542b&from=jasx&tk=1hl5di2e1lllk800&bb=zpJiOyyz_0fgQiL3EewKgLRhUoliJVhZaUsgaGwBzOoAUAkUV-EhAQ0ftvjbkkX3jX_siv1vZXwuZN7kVQ4s30c_3u0hX3wXWocamms7LsYZZMapy39q-g%3D%3D&xkcb=SoCL67M3FlTHimWfyB0MbzkdCdPP&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=987f415102cd542b&bb=RqrPjIjP-lKbtWPUYl_uBqgPukvHIesFg5mTrCsac6xgw25QGF9c9jRdupoVKglQ&xkcb=SoCx67M3FlTE582NiR0LbzkdCdPP&xpse=SoBy67I3FlTEoh2ngZ0LbzkdCdPP",
    "companyDescription": "For more than 130 years, companies around the world have depended on Intertek to help ensure the quality and safety of their products, processes and systems.\r\n\r\nWe go beyond testing, inspecting and certifying products; we are a Total Quality Assurance provider to industries worldwide. Through our global network of state-of-the-art facilities and industry-leading technical expertise we provide innovative and bespoke Assurance, Testing, Inspection and Certification services to customers. We provide a systemic approach to supporting our customers’ Quality Assurance efforts in each of the areas of their operations including R&D, raw materials sourcing, components suppliers, manufacturing, transportation, distribution and retail channels, and consumer management.\r\n\r\nIntertek is an industry leader with more than 43,800 employees in 1,000 locations in over 100 countries. We deliver Total Quality Assurance expertise 24 hours a day, 7 days a week with our industry-winning processes and customer-centric culture. Whether your business is local or global, we can help to ensure that your products meet quality, health, environmental, safety, and social accountability standards for virtually any market around the world. We hold extensive global accreditations, recognitions, and agreements, and our knowledge of and expertise in overcoming regulatory, market, and supply chain hurdles is unrivalled.",
    "description": "Job Summary \n  \n  \n   Intertek EWA Canada, is searching for a FIPS Evaluator III - Ottawa, ON to join our Connected World team in our Ottawa, Ontario office. The FIPS Evaluator III - Ottawa, ON will be a part of the High Security Certification team that will lead a team of engineers to assess the compliance of cryptographic modules against the Federal Information Processing Standard Information Technology (FIPS) 140-3 and ISO 19790/24579 Security Evaluation standard. The FIPS Evaluator III - Ottawa, ON has mastery of the FIPS 140-3 certification process and is proficient with ACVP and ESV. The FIPS Evaluator III - Ottawa, ON acts as the Point of Contact for customers and NIST/CMVP in support of FIPS 140-3 certifications. The FIPS Evaluator III - Ottawa, ON regularly provides both individual and overall lab training and guidance. \n  \n  \n   Essential Job Duties and Responsibilities \n  \n  \n   \n    Lead FIPS 140-3 validations. \n    Lead CAVP algorithm testing using ACVP/ACVTS. \n    Lead customer Gap Analysis workshops and create related consulting documentation. \n    Project POC with NIST/CMVP and technical POC with customers. \n    Assist in the development and review of all test reports and required certification documentation. \n    Review/comment submission-related output from other engineers. \n    Provide technical assistance and mentorship to engineers. \n   \n  \n  \n   Essential Requirements and Qualifications \n  \n  \n   \n    Bachelor’s degree in computer science, information technology or a related field, or an equivalent combination of education, training, and experience. \n    Experience in leading at least five (5) full FIPS validations. \n    1.5 to 2 years of experience in FIPS algorithm testing (CAVP/ACVTS), operational testing, documentation creation (Security Policy, Validation Report) and source code reviews. \n    CVP, or ability to obtain CVP within 180 days of employment. \n    Ability to work well individually as well as in a team environment. \n    Positive attitude with excellent analytical and communication skills, both verbal and written. \n    Desire to learn new products and technologies. \n    Commitment to high standards of ethics, regulatory compliance, customer service and business integrity. \n   \n  \n \n \n  \n   \n    Hands-on user interface experience and command line fluency on Windows and Linux. \n    Hands-on experience using Wireshark. \n    Ability to read computer code in languages such as C, C++, Python, and/or Java. \n    Good understanding of Internet protocols, IPv4/6, SSH, TLS, HTTP/S, SNMP, IPSec, MacSec, and TCP/IP model. \n    Hands-on experience working with MS Office or equivalent. \n   \n  \n  \n   Other Essential Requirements and Qualifications \n  \n  \n   \n    Model Intertek’s 10X Energies at all times within the workplace, practicing business the right way. \n    Be aware of, and adhere to, safety practices and policies to ensure your own safety, as well as the safety of others who may be affected by your actions at work. \n    Ability to work in fast-paced, multi-tasking environment with shifting priorities and demanding deadlines. \n    Must be detailed-oriented and able to effectively prioritize and organize workload, with efficient time management. \n    Ability to communicate and interact effectively in verbal written and presentation formats. \n    Must possess the fundamental technical and administrative skills required to perform the job duties. \n    Must be customer focused and quality driven. \n    Ability to travel as business needs dictate. \n   \n  \n  \n   Preferred Requirements and Qualifications \n  \n  \n   \n    Ability to review Entropy Assessment Reports (SP800-90B analysis). \n    Master’s degree in computer science, information technology or a related field. \n    Hands-on experience working with MS Teams, Zoom, and Cisco WebEx. \n   \n   Our Value Proposition \n   We offer a salary and benefits package competitively placed within the local market, including medical, dental, vision, life, disability, RRSP with company match, generous vacation/sick time (PTO), tuition reimbursement and more. \n   Why Work at Intertek? \n   Intertek is a world leader in the $250 billion Quality Assurance market, with a proven, high-quality business model and a global network of customer-focused operations and highly engaged subject matter experts. At Intertek, we exercise our spirit of innovation, the passion of our people and our unmatched customer commitment to realize our purpose of making the world an ever better, safer, and more sustainable place for all. Learn more about Our History and What We Do . \n   A career with Intertek offers rewarding opportunities to help companies around the world develop products used safely by millions of people every day. Intertek is the trusted advisor to many of the world’s leading brands, companies, and governments, and has earned a reputation for accuracy, reliability, integrity, and technical competence. Working at Intertek means joining a global network of state-of-the-art facilities and passionate people who deliver superior customer service with a purpose of bringing quality, safety, and sustainability to life. \n   Intertek is committed to a safe work environment for our employees and clients. \n   Intertek believes that Our People are our strongest tool for success. We are an Equal Opportunity Employer and do not discriminate against applicants due to veteran status or on the basis of disability. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, or gender identity \n   This position outline is a general guideline and does not represent all encompassing details. The position assumes that the incumbent has both the mental and physical requirements to carry out the above defined duties. \n   Please apply online at www.intertek.com/careers"
}