{
    "id": "aaf025f41f0379e0",
    "company": "ACT Learning Centre",
    "positionName": "Classroom Facilitator",
    "jobType": [
        "Full-time"
    ],
    "location": "2713 Lancaster Road, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-26T12:13:40.986Z",
    "url": "https://www.indeed.ca/rc/clk?jk=aaf025f41f0379e0&from=jasx&tk=1hl5dd1pui7nm800&bb=NiGljfghLwyJxtbyZy8vsyNV3Ej1Xh-QP1DPCqFVNRWh-fQkJMAK8OHLfClXfoewOQdk66KZrj0WLvpMR27B24io1QiFsyloJTucV2gaFiVukEantu1fPg%3D%3D&xkcb=SoAl67M3FlS757AVJj0ObzkdCdPP&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "ACT is a an Ottawa autism therapy centre founded to provide evidence-based, innovative and leading-edge assessment and intervention for children, youth, and adults with autism spectrum disorder, developmental delays or developmental disabilities. Therapies are offered by ACT’s highly trained staff both in our clinic or in your home.",
    "description": "Job Posting: Classroom Facilitator\nMCCSS funded program: Entry to School\nJoin Our Team!\nACT Learning Centre is a leading-edge, dynamic, multidisciplinary practice in Ottawa. We are a multidisciplinary team of speech-language pathologists, occupational therapists, mental health consultants, board-certified behaviour analysts, communicative disorders assistants, occupational therapy assistants, early childhood educators and registered behaviour therapists providing exceptional services to children and youth with autism, or other developmental disorders/delays and their families.\nACT is the local provider of the cutting-edge, government-funded Entry to School Program, a school readiness program for children on the Autism Spectrum. The Entry to School Program is focused on helping children develop school-readiness skills in six key areas. (Communication, play, social interaction, functional routines, behaviour self-management, pre-academic learning and attention). The program consists of two parts, a group-based learning program for six months and upon completion of the first group-based part of the program, the children will proceed to the second part of the program which is transition support as they enter school. The program is delivered through a multidisciplinary model of service which includes a classroom team of early childhood educators, communicative disorder assistants, occupational therapy assistants and behavioural therapists. The classroom team (classroom facilitators) receive weekly consultation and coaching from a supervisory team, which consists of an Occupational Therapist, a Speech and Language Therapist and a Board-Certified Behavioural Analyst.\nWe are excited to announce the expansion of our Entry to School Program and are seeking a qualified candidate to work in the classroom as a Classroom Facilitator at the following location:\n2713 Lancaster Rd, Ottawa, ON\nKey Responsibilities\n· Prepare classroom environment for learners (includes environmental setup, use of visuals, equipment, toys, materials).\n· Implement and modify curriculum, as appropriate, for learners under the direction of the supervisory team.\n· Engage/interact with learners at their developmental level.\n· Collaborate with the supervisory team to share information on learners’ functional levels and areas of concern.\n· Support learners in all daily activities as needed. (i.e., self-care routines, transitions, and accessing learning opportunities).\n· Ensure a safe learning environment for learners – cleaning processes in place and followed.\n· Manage challenging behaviour with the support of the supervisory team’s recommendations.\n· Creatively problem-solve with the classroom team to support engagement, regulation, and access to classroom activities.\n· Actively participate in all activities throughout the 3-hour program, by leading activities and/or supporting the learners. Physical movement is required.\n· Bring forward clinical questions, concerns and/or areas of need for training to the site manager and supervisory team.\n· Participate in professional development opportunities.\n· During the 6-month transition portion of the program, classroom facilitators may be seconded to private practice for coverage in ABA, OTA and SLPA.\n· Because of the changing nature of the job and the job requirements, duties and responsibilities may be added or deleted from time to time.\nQualifications and Requirements of Employment\n· Minimum 1 year experience working with autistic children or youth.\n· A degree/diploma in Early Childhood Education, Communication Disorders Assistant (CDA), Occupational Therapy Disorders Assistant (OTA), Autism and behavioural science (ABA therapist) or related field (e.g., DSW, CYW, SSW) or a University Degree in child-related field of study\n· Knowledge of neurodiversity and neuro-affirming practices\n· Strong communication skills\n· Ability to work collaboratively with multidisciplinary team members.\n· Comfortable with technology, including video conferencing technology (training would be provided)\n· Ability to lift at least 30lbs, sit on the floor for extended periods of time and engage in unusual physical movement such as kneeling and crouching.\n· Ability to actively participate in programming with participants for up to three-hour intervals.\n· Satisfactory Vulnerable Sector Check\n· Proof of a completion of series of COVID-19 vaccinations\nWhy Work at ACT Learning Centre?\n· Opportunity to work in the MCCSS-funded Entry to School Program, a school readiness program funded under the OAP\n· Paid continuing education opportunities\n· Competitive salary and benefits package\n· Free Parking\nAll PPE is provided by ACT Learning Centre and COVID protocols are strictly adhered to. Proof of full vaccination for COVID-19 and its variants is a condition of hiring. Accommodation may be granted to those who have a legitimate medical exemption or other exemptions recognized under Ontario's Human Rights Code. Official documentation must be provided as evidence of vaccination status or exemption.\nACT Learning Centre is committed to creating a diverse environment and is proud to be an equal-opportunity employer. All qualified applicants will receive consideration for employment regardless of ethnicity, race, colour, religion, gender, gender identity or expression, sexual orientation, nation of origin, genetics, disability, age, or veteran status.\nACT Learning Centre complies with the Accessibility of Ontarians with Disabilities Act (AODA). Accommodations are available on request for candidates taking part in all aspects of the selection process.\nJob Type: Full-time\nBenefits:\n\n Dental care\n Extended health care\n Vision care\n\nSchedule:\n\n Monday to Friday\n\nExperience:\n\n working with autistic children and youth: 1 year (required)\n\nWork Location: In person"
}