{
    "id": "ae547c2e2a15f796",
    "company": "Lafarge Canada Inc",
    "positionName": "QC Technician",
    "jobType": [],
    "location": "5121 Hawthorne Rd, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-09-01T06:50:24.141Z",
    "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0AUSj4sjqAJYFmZDhQwD4zQDbNVBOynbLDW0uqNq4bxKDITBsgaboh9LaUx1isBORKVO7DpoOVaAH2E--oiEVHy4VtRzi5n-0sTyXQ6pgyrEtujmH-DvG1UGhHxR3aKABNwIyBi6kab7y2LvAkU_XYTjOmuWEgw_KLRq3UC-lfEmfmYBnr6OY1m0UCyTDGvHf4-NgYp0-xTtzuJuxBiZq4TdcV1d-YxO4uO-pofe-w6sXmqfC4urmrizmC0CKwgVAy_hP_AAUWnlPP-mY5RnDpATBrijGegMl5RaEtA5FImKVAS1ufdQmPNixlGC_P634V2SK_Y5wNC1kJ-dBaH967SCWv5ANrL2v7acqAw5j7mSCf39BVw8KW39JqlBrqBF5__hPwIcpb3fw0WVWDuDh4RVqH8Hx1Xkdn7cKcAQCGxNtQC6ZiUligA6XZlhjv7HwJw3EQn6z1aACI0JqzIShsZKmkv_djM4_SVScwQVfbuLMSL6WzB8rCmbhnXvDciFf_Z0KSZsIzdRMcLd2tXk44ov__NH_kXDV7vc8Kn8KbHBbFyDxR-6xvoZTAXL8pi8A6Qu2BoUynzcAKLNSSUb02eK0dhIaqBx7Rg1kY30l3jEDox70StTaPMO_2i_LYCEIYxZZndINO97PYSrLswxUNvrHwWyTkKh15FpCjB8qQ0PRpd4eLuK_0GUXHaHyp_v5482e7GHk3Z5rOSTE22gbEUSaxoiT06UNbroxBIcOwV4l55vp-fWnOkX-Y8elVJa3ja5UMtc0QjUQrOtLbxXann8gYDSE7W6xWdQ4fmMbKGobOl_5zAt83GLrPoFFVEDyUbNVFqEBszfcaVbsgVUEaiZHNHfwcbvQ4odT09vuJ8T2zpnFoIEtRBW8jx96aOrCTy232nSQkKOXN0pB1ESe0RxaUvd4Ahr2JkPOYPz6ZtlAR2V03IvE5q&xkcb=SoA_-_M3K1IMWWw4iJ0BbzkdCdPP&p=10&fvj=0&vjs=3&jsa=1834&tk=1hbl00rvqkp1k800&from=jasx&wvign=1",
    "externalApplyLink": "https://cacareers-lafarge-na.icims.com/jobs/18437/job?utm_source=indeed_integration&iis=Job%20Board&iisn=Indeed&indeed-apply-token=73a2d2b2a8d6d5c0a62696875eaebd669103652d3f0c2cd5445d3e66b1592b0f&mode=job&iis=Indeed&iisn=Indeed.com",
    "companyDescription": "",
    "description": "Why work for Lafarge?:\n \n \n   As the global leader in innovative and sustainable building materials, we’re committed to shaping a \n  greener, \n  smarter and \n  healthier world. At Lafarge Canada Inc., \n  safety comes first, \n  collaboration matters and \n  diversity is celebrated with people who share our desire to continually \n  make our materials better.\n \n \n \n   Do you have the drive, the skills, and the passion to join us?\n \n  \n  Overview:\n \n \n   Reporting to the Quality Control Manager, the QC Technician - Aggregates is responsible for safely implement Quality Control for production and shipping of our products. He makes sure our Quality Plan is respected across our sites in the NCR.\n  Responsibilities:\n \n \n   Health & Safety \n \n \n  Work in a safe and effective manner following the Lafarge Safety Program and applicable legislation. Be directly involved in risk analysis necessary for lab activities, development and application of improvement plans in relation to Health & Safety and ergonomics. Work efficiently and in collaboration with the different teams.\n \n \n   Support to Operations \n \n \n  Insure the Quality Plan is applied across NCR sites. Analyze results and share them with the Production Staff to insure products compliance with relevant Code, Standard and Specifications. Make sure all testing results are entered in our QC software. Participate with Production Staff to conduct production adjustments needed to insure product conformance. Insure all technical documentation is updated according to our Quality Plan. \n \n \n  Technical Support and Quality Control \n \n \n  Maintain excellent relationships with Sales, Production and Distribution Staffs. Provide Customer support by supplying technical documents and datasheets and/or by visiting customer job sites for technical troubleshooting. Perform administrative activities and insure all documentation is updated in order to maintain our CCIL Certification. Support the Sales, Production or Administrative Staffs when necessary (report preparation, special projects or other special requests). Participate in corrective/preventive action plans preparation and achievement to improve quality. \n \n \n  Physical Attributes \n \n \n  While performing the duties of this job, the employee is regularly required to use hands to finger, grasp, handle, or feel. The employee frequently is required to stand; walk; climb stairs & ladders; reach with hands and arms; talk, hear and smell. Infrequently the employee is required to work in awkward situations; balance; stoop, kneel or crouch. The employee must frequently lift and/or move up to 25 pounds, occasionally lift and/or move up to 50+ pounds. Specific vision abilities required by this job include close vision, color vision, peripheral vision, depth perception, and the ability to adjust focus. Employee must perform work outdoors in all weather conditions, and will work around moving mechanical parts and equipment. Various PPE will include safety boots, reflective clothing, safety glasses, gloves and hard hat. Additional PPE may be required depending upon tasks. \n \n \n  Relationship with Others \n \n \n  Reports to the EON & GMA Quality Control Manager Collaboration and Team work with other QC Technician Works closely with Production, Distribution, and Sales Staffs \n \n \n  Specific Accountabilities: \n \n \n  Safety \n  Product quality control and performance \n  Customer service and support \n  Troubleshooting \n  Implementation of best practices and quality control process \n  Quality Policies and Training \n \n \n  Dimensions: \n \n \n  Volume: 7 Million tons (3.5M production and 3.5M shipping) \n  Direct reports: None\n  Qualifications:\n \n \n   Education & Work Experience:\n \n \n   Post-secondary education in Civil engineering or equivalent\n   Experience in materials quality control (an advantage)\n \n \n   Knowledge & Skills:\n \n \n   Sound knowledge of OPSS, CSA and City of Ottawa standards.\n   Excellent knowledge of quality control tests and best construction practices at the job sites.\n   Fully valid Driver’s License Class G\n   Must also be able to work well as part of a team and independently\n   Good computer skills for Windows based software\n   Should have excellent written and oral communication skills and capable of creating good relationships internally and externally with our customers.\n   Motivated\n   Job Language: English (French an advantage)\n   Must be able to work in outdoor and indoor work environments.\n   Able to perform a variety of tasks, including moderate to heavy lifting.\n   This role is will require the handling of cements, aggregates, concrete and lab equipment.\n \n \n   Lominger Competencies:\n \n \n   Customer focus\n   Drive for results\n   Integrity and trust\n   Intellectual horsepower\n   Interpersonal savvy\n   Managing and measuring work\n   Process management\n  LafargeHolcim:\n \n \n   As we are reinventing the way the world builds, we need world-class talent to join our Lafarge Canada team: people who are \n  passionate, driven by \n  curiosity and keen to \n  grow, \n  learn, develop and \n  thrive in our high-performance culture.\n \n \n \n   Whatever you do, you will make a difference here. Because we know that your passion and curiosity are the natural resources the world needs.\n \n \n \n   We thank you for your interest. Only candidates selected for an interview will be contacted. Lafarge is committed to the principles of employment equity and encourages the applications from women, visible minorities, and persons with disabilities.\n \n \n \n   Lafarge Canada Inc. welcomes and encourages applications from people with disabilities. In Ontario, our organization/business is committed to fulfilling our requirements under the Accessibility for Ontarians with Disabilities Act. Accommodations are available on request for candidates taking part in all aspects of the selection process."
}