{
    "id": "b3b57bd6ed4a7922",
    "company": "Atria Retirement Canada - Crystal View Lodge",
    "positionName": "Kitchen Utility Worker",
    "jobType": [],
    "location": "Nepean, ON",
    "salary": null,
    "postingDateParsed": "2023-10-07T02:04:05.113Z",
    "url": "https://www.indeed.ca/rc/clk?jk=b3b57bd6ed4a7922&from=jasx&tk=1hc6gcllqltfi801&vjs=3",
    "externalApplyLink": "https://atriaretirementcanada-atria.icims.com/jobs/232422/job?utm_source=indeed_integration&iis=Job%20Board&iisn=Indeed&indeed-apply-token=73a2d2b2a8d6d5c0a62696875eaebd669103652d3f0c2cd5445d3e66b1592b0f",
    "companyDescription": "",
    "description": "Overview: \n \n   What’s the difference between a job and a meaningful, rewarding career? The people you serve. When you work at Atria, you have a front-row seat to the amazing life stories of the wisest people on earth. What’s more, you are part of an extraordinary company – one that’s investing in the future of senior living by investing in you. Don’t just do a job. Be part of an extraordinary life.\n \n \n \n   Atria is an equal opportunity employer committed to providing equal employment opportunities without regard to race, color, religion, sex (including pregnancy), sexual orientation, age, national origin, disability, genetic information, veteran status, or any other classification protected by applicable law. Atria will not tolerate harassment or discrimination based on any of these protected classifications.\n  Responsibilities: \n \n   The Kitchen Utility Worker assists and works in all areas of the kitchen and dining room.\n \n \n   Provide a high level of customer service and promote a restaurant style dining atmosphere.\n   Work closely with the Director of Culinary Services and/or Executive Director to keep residents satisfied with food and dining programs.\n   Assist with the preparation and execution of the Art of Atria Dining enhancement programs.\n   Maintain kitchen in a clean, safe, and sanitary condition at all times.\n   Adhere to cleaning schedules as assigned.\n   Ensure that food is properly stored.\n   Assist in dining room cleaning, bussing tables, setting tables, and assisting wait staff.\n   Adhere to Quality Enhancement standards and standard food safety practices.\n   Assists with preparation and execution of special events, banquets, and theme meals.\n   Will attend pre-meal stand up in kitchen prior to meal service.\n   May perform other duties as needed and/or assigned.\n  Qualifications: \n \n  Basic reading, writing, and mathematical skills.\n   Strong communication and teamwork skills."
}