{
    "id": "bb73cf87a7eea69a",
    "company": "Holiday Inn Ottawa East",
    "positionName": "Executive Housekeeper",
    "jobType": [],
    "location": "Holiday Inn Ottawa East in Gloucester, ON",
    "salary": null,
    "postingDateParsed": "2024-01-17T05:12:16.575Z",
    "url": "https://www.indeed.ca/rc/clk?jk=bb73cf87a7eea69a&from=jasx&tk=1hkikh137kp3h801&bb=MbdkWoTc0uPjBzci8Lm-JYWtgraImilcfxpcZZ42r67Jlw6j97VvgAE9gxXd2scXkqIw8BU4W-dQ6ZJF8_k-h6F09cM_W_gbur-WhVk4epYVCriSB3EEhA%3D%3D&xkcb=SoBN67M3FShL_WzU3h0ZbzkdCdPP&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "SCOPE AND GENERAL PURPOSE\nProvides supervision and direction for all Housekeeping activities of the hotel to ensure the highest levels of cleanliness and guest satisfaction are maintained. Responsible for the professional and cost effective running of the department achieving standards of cleanliness and guest care.MAIN DUTIES 1. Interview, hire, train, recommend performance evaluations, resolve problems, provide open communication and recommend discipline and/or termination when appropriate. 2. Provide clear direction in assigning and instructing housekeeping and laundry staff in details of work. 3. Plan, organize, and monitor staff activities to ensure compliance with quality assurance standards set by hotel, which requires continuous visual inspection of guest rooms and public space areas including restaurants, lounges, meeting rooms, etc. 4. Manage finances of housekeeping and laundry operations including budget and inventory controls. Analyze data and compile reports on expenditures, wages, labor, supplies etc. in relation to hotel financial forecasts and budget. Establish and maintain adequate supplies for efficient operation of department. 5. Distribute and delegate work load to guarantee maximum production and guest satisfaction with minimum outlay of expenses in terms of labor and materials. Monitor house count and make staffing adjustments accordingly. 6. Ensure proper usage of chemicals and cleaning supplies by monitoring usage, providing complete training for employees and ensuring proper labeling of hazardous supplies in accordance with hotel hazard communication program. 7. Be responsible for the cleaning of guest rooms ensuring through inspection that standards of cleanliness and guest comfort are maintained 8. Plan, organize and keep an accurate record by room/area of all deep cleaning carried out to ensure maximum cleanliness and logical work patterns as required by company policy. 9. Responsible for the efficient running of the laundry and cost effective use of all linen/terry within the property taking inventory on a regular basis and investigating stock losses as required by company policy. 10. Responsible for the handling of all guest laundry/cleaning of staff uniforms and handling of lost and found in accordance with property and company standard. 11. Liaise with Guest Services and Maintenance in regard to readiness of rooms with particular attention to guests’ special requirements and VIP rooms as required by Property policy. 12. Liaise with the General Manager regarding use of outside contractors for deep cleaning duties, ensuring work is checked and standards achieved as required by Property policy. 13. Ensure corridors, staff areas and public areas are cleaned to standards required by property policy. 14. Ensure the timely and accurate completion of housekeeping forms/reports following procedures required by company policy. 15. Plan and conduct staff meetings. Attend various other related meetings to obtain and disseminate pertinent information. 16. Evaluate condition of furniture, fixtures, decor, etc. Make recommendations and assist in the coordination of rehab projects. 17. Communicate both verbally and in writing to provide clear direction to staff. 18. Comply with attendance rules and be available to work on a regular basis. 19. Perform any other job related duties as assigned.\nREQUIRED SKILLS AND ABILITIES: Must have the ability to communicate in English. Self-starting personality with an even disposition. Maintain a professional appearance and manner at all times. Can communicate well with guests. Must be willing to “pitch-in” and help co- workers with their job duties and be a team player. Knowledge of basic sanitation requirements/controls and applications of relevant chemicals. Knowledge of policies applicable to housekeeping, especially those relating to safety and security of guest and hotel property. Basic mathematical skills to prepare moderately complex calculations for financial reporting. Supervisory skills to manage entire housekeeping operation. Ability to deal effectively with employees, vendors, contractors. Ability to coordinate and cooperate with other departments regarding housekeeping services/activities. Ability to stand, walk, bend, reach and move continuously to inspect rooms on all floors of the hotel. Ability to access and accurately input information using a moderately complex computer system. DEPARTMENT MANAGER RESPONSIBILITIES1. To be competent in the scheduling of staff and forecasting of revenues and expenses to achieve effective cost control as required by company policy.\n2. To achieve effective communication by briefing and debriefing staff, together with regular departmental meetings as required by company policy.\n3. To ensure full adherence to hygiene, health, safety and emergency procedures as required by law and company policy.\n4. To carry out any reasonable request.\n5. To ensure adequate supply of materials and equipment with adherence to the department budget through the Purchase Order System and inventory controls as required by company policy.\n6. To be responsible for hiring, orientation, training, appraisal and discipline of staff following procedures laid down by company policy.\n7. To ensure that standards of punctuality, staff appearance and dress are maintained at all times in line with property and company policy.\n8. To maintain a professional profile within the property accepting the responsibility of Manager on Duty as requested by the General Manager and achieving standards required by company policy.\n9. To generate team commitment to achievement of the company, property and department Mission Statements.\n10. To carry out the duties of a staff member or provide assistance as necessary to achieve required standards, productivity and guest care.\n11. To ensure all staff are competent in the safe and effective use of equipment/chemicals in accordance with manufacturer’s instructions.\n12. To be committed to guest satisfaction with any comments or complaints being actioned by following procedures laid down by property and company policy.\n13. To ensure compliance with company and house rules.\n14. To ensure adherence to procedures laid down in the Property Crisis Communication Plan in line with company policy.\n15. To contribute to the security of the building, company assets and guest/co-worker safety by ensuring full adherence to security procedures and proper handling of keys/cash by all department members in line with company policy.\n16. To complete month end and year end duties in line with company policy.\nJob Types: Full-time, Fixed term contractContract length: 8-12 months\nSalary: $45,000.00-$52,000.00 per year\nBenefits:\n\n Dental care\n Disability insurance\n Discounted or free food\n Extended health care\n Life insurance\n On-site parking\n Store discount\n Vision care\n\nSchedule:\n\n 8 hour shift\n Every Weekend\n Holidays\n Monday to Friday\n\nExperience:\n\n Cleaning: 5 years (preferred)\n\nWork Location: In person"
}