{
    "id": "bf37230bdd37fa87",
    "company": "Hydro Ottawa",
    "positionName": "Damage Prevention Inspector (Temporary)",
    "jobType": null,
    "location": "2711 Hunt Club Road, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-08T03:09:50.380Z",
    "url": "https://www.indeed.ca/rc/clk?jk=bf37230bdd37fa87&from=jasx&tk=1hjm3501uhbi2800&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/applystart?jk=bf37230bdd37fa87&from=vj&pos=top&mvj=0&spon=0&sjdu=o7sfz71MPdMgyiV0LZq0d4DDplm6SwWjHcxyoDIphKnbm20bQ5qb-0zZ5Fy351zYhIxjRikUe5W0abNHb_nbK8ow5KTT88VFF_ePWWWOHczZb_WnT61ZR0C-63HQPmGLGATF_nxO7hx5yvwfrihAWPBdd6P9xh9njHpYlJA_KDr1z_Vx3kpIO5616lcfAsbDw9_XINGINv7OnqX9-Wv1cg&vjfrom=serp&log=1&astse=78917326f8d7ba37&assa=9981",
    "companyDescription": "",
    "description": "Please Note: If you are a current Hydro Ottawa employee with access to Workday, apply to this job via the Workday application.\n  \n   Without you, we'd be in the dark.\n  \n   You enjoy working outside with your hands, on a team that collaborates to get things done. You love the changing and challenging problem-solving work of a Damage Prevention Inspector. Through your education and recent experience, you've developed the insight to see how a job will unfold and the best way to safely get it done. \n  \n  You're the kind of person who believes that what you do is more than just a job - and you're looking to be a part of a team that believes that, too.\n  \n   Hydro Ottawa is that team.\n  \n   JOB SUMMARY\n   The Damage Prevention Inspector oversees the contractor excavations in the areas of high voltage cables and other underground plant, and is an ambassador of Hydro Ottawa when dealing with customers, contractors and other external utilities.\n  \n   MAJOR RESPONSIBILITIES\n   The essential responsibilities of the job include but are not necessarily restricted to the following:\n  \n    Ensure that all Hydro Ottawa contractors work in accordance with the E&USA Rule Book & Safe Practice Guides: the Hydro Ottawa Work Protection Code, the Hydro Ottawa Standard Work Methods, ORCGA Best Practices, the Occupational Health & Safety Act, the Ontario Provincial Safety Construction and Industrial Regulations, and the Traffic Control Guidelines as required by Hydro Ottawa.\n    Supervise, monitor and observe excavations in the vicinity of direct buried high voltage cables and other underground plant and properly identify and assess the condition of cables, ducts, structures and equipment in the underground system.\n    Act as a liaison on behalf of Hydro Ottawa with other utilities, municipalities, property owners, excavators and other third parties as well as interact with all customers and contractors in a professional and courteous manner with emphasis on maintaining good public relations \n   Recognize the third party scope of the work and what needs to be done to protect the underground electrical distribution system and ensure that hydro duct structures, poles and plant are properly supported during excavations\n    Accurately locate underground cables and plant, using cable locating equipment, and issue detailed drawings as required. Responsible for all locates and associated activities within the boundaries of Hydro Ottawa Substations. \n   Assess hazardous situations and take the appropriate action to rectify such situations and ensure the safety of our customers as well as the general public by applying Work Protection, ORCGA and Safe Practice guidelines as required for contractors working in the vicinity of energized underground primary voltage cables, secondary voltage wires and fiber optics.\n    Respond to and investigate accident/incidents involving excavator cable dig-in's on Hydro Ottawa underground plant and report findings in writing to the supervisor\n    Apply for and surrender work protection permits and hold-offs as required.\n    Regularly perform quality assurance audits on Hydro Ottawa's cable locating contractor to ensure accuracy and quality of locates as predetermined by the Locate Alliance Consortium\n    Assist with restoration efforts by accurately locating defective electrical distribution cables and determine location of faulted equipment \n   Report and document any damages to Hydro Ottawa plant, underground and overhead systems.\n    Perform all work in accordance with Hydro Ottawa's construction and safety standards.\n    Provide visual and verbal instruction and ensure that customers and contractors understand the hazards associated with excavating in the vicinity of Hydro Ottawa underground plant. This may also include Public Awareness & Education meetings\n    Recommend new or improved methods and techniques to streamline safety, efficiency, accuracy, productivity and quality.\n    Operate and maintain company vehicles, stock and equipment as required.\n    Responsibility for recording time, and regulating material on underground maintenance projects.\n    Respond to emergency situations \n   Responsible for personal safety, organization, administration, record keeping and effective time management.\n    Perform other related duties as required.\n  \n  \n   EDUCATION AND EXPERIENCE\n  \n    Secondary school diploma.\n    Electric utility tradesperson or a minimum of 5 years' experience in related field preferably cable locations/underground cable work.\n    Certification in First Aid/CPR, Cable/Pipe Locating, Cable Testing & Fault Locating, WHMIS (Workplace Hazardous Materials Inventory System) and confined space entry considered an asset.\n  \n  \n   ADDITIONAL REQUIREMENTS\n  \n    English essential, both oral and written\n    Bilingual (English/French) considered an asset\n    Valid driver's license - Class G\n  \n  \n   The terms and conditions of employment for this position are governed by the collective agreement between Hydro Ottawa Limited and IBEW Local 636.\n  \n   Hydro Ottawa offers a Hybrid Work Model. This hybrid work program is position specific, the details of the hybrid model will be discussed with successful candidates.\n  \n   Location: Ottawa, ON\n   Pay Range Minimum: $28.37\n   Pay Range Maximum: $43.59\n  \n   Posting End Date (if applicable): January 19, 2024\n   Hydro Ottawa is committed to establishing a qualified workforce that reflects the diverse population it serves and we encourage applications from all qualified individuals. We are also committed to preventing and removing barriers to employment for people with disabilities, and we invite you to inform us should you have any accessibility or accommodation needs. \n  \n  Applicants must be legally entitled to work in Canada."
}