{
    "id": "c3dd004a1dda5e30",
    "company": "CIMA+",
    "positionName": "Team Leader - Biologist - Hybrid",
    "jobType": [
        "Permanent"
    ],
    "location": "Gatineau, QC",
    "salary": null,
    "postingDateParsed": "2024-01-24T12:17:02.130Z",
    "url": "https://www.indeed.ca/rc/clk?jk=c3dd004a1dda5e30&from=jasx&tk=1hl5djsk1h7hv800&bb=xjPBkK6OIlrxY1Te1w3p5eP58NzvWVtEEGNmE3fTJkWAfi8ntrhombZgzSQR1qQiDRC5imSMM1rJU0wUpt8P4eRGnk9i3Ni2sPrS2XjfDt7Vq_-cT916XA%3D%3D&xkcb=SoDu67M3FlTATHzAAx0FbzkdCdPP&vjs=3",
    "externalApplyLink": "https://jobs.smartrecruiters.com/CIMA2/743999962511090-team-leader-biologist-hybrid",
    "companyDescription": "With more than 30 offices across the country and over 2,600 employees, 60% of which share ownership in the company, CIMA+ is one of Canada’s largest private consulting engineering firms and a “Best Employer” according to the Kincentric survey. \r\n\r\nFor more than 30 years, our multidisciplinary teams have been offering clients a complete range of solutions in the building, energy and resources, municipal infrastructure, telecommunications and transportation sectors. We also offer a multitude of complementary services, including environmental and project management services. Innovative and integrated solutions that place people at the centre of engineering, reflect our values and our corporate culture.",
    "description": "Company Description\n  Welcome to a place where people are at the heart of everything we do.\n  Welcome to people with an inspiring vision and who seek stimulating challenges. At CIMA+, you’ll find a place where you’ll have many opportunities to learn and develop while working on engaging projects.\n  We are a firm 100% owned by its employees and we value a collaborative and entrepreneurial mindset. You will have the flexibility to manage your work on your own terms and define what work-life balance means to you.\n  When you join CIMA+, we welcome you to a place that you can call home.\n  Job Description\n  Mission \n Reporting to the Regional Director – Environment, the Team Leader’s mandate is to develop and ensure the profitability of services related to the characterization of natural environments through the sound management of human and material resources. You will collaborate with the existing team on a daily basis with a view to supporting its growth.\n  Primary Responsibilities\n \n   Manage financial and material resources for the team\n   Manage human resources for the team: Take part in the hiring and training of personnel, work distribution, performance assessment, approval of time sheets, etc.\n   Maintain harmonious relationships with existing clients and take part in business development for the activity sector\n   Provide coordination and supervision services, and ensure that Company policies, standards and procedures are respected, especially in the areas of Health and Safety, Ethics and Quality Assurance\n   Oversee the execution and management of projects within the related area of expertise\n   Prepare and supervise professional services proposals\n   Take part in preparing project specifications, prepare expert reports and draft / revise technical reports\n   Collaborate with members of the CIMA+ Environment team across Canada and with other areas of expertise\n \n  \n  Qualifications\n  \n \n   Bachelor of Science or degree in a relevant field\n   10 years of relevant experience in ecological studies and environmental authorizations\n   Leadership skills and ability to mobilize a team\n   Thorough and meticulous, with an analytical spirit and ability to work as part of a team\n   Experience in team management, quality control and budget monitoring\n   Strong command of the French language, spoken and written\n \n  Contact Hamid Farahani\n  #LI-Hybrid\n  Additional Information\n \n  Ethics and integrity are fundamental values at CIMA+, and we are looking for people who uphold these principles. We are committed to creating opportunities for all our talents to contribute to the firm’s success, develop and grow, regardless of cultural or other differences. We fully endorse employment equity principles and encourage women, visible minorities, indigenous peoples, and individuals with disabilities to apply for any position offered at CIMA+. Adaptation measures are provided upon request to facilitate participation in the recruitment process."
}