{
    "id": "c49456da6b2eda42",
    "company": "Walmart Canada",
    "positionName": "Food Assistant Manager",
    "jobType": [],
    "location": "640 Boul Maloney O, Gatineau, QC",
    "salary": null,
    "postingDateParsed": "2023-10-13T18:54:57.845Z",
    "url": "https://www.indeed.ca/rc/clk?jk=c49456da6b2eda42&from=jasx&tk=1hcvfr1frj4hv800&vjs=3",
    "externalApplyLink": "https://walmart.wd5.myworkdayjobs.com/en-US/WalmartExternal/job/Gatineau-QC/Food-Assistant-Manager_R-1685611?codes=1-INDEED",
    "companyDescription": "",
    "description": "Position Summary... To support the Store Manager and manage store operations according to Company guidelines and lead Associates to ensure friendly, helpful service and drive profitable store sales. \n \n What you'll do... \n 1. As a member of the Store Management Team drives profitable sales through achievement of sales and profit goals, budget management and sales forecasts. Proactively analyzes and utilizes sales/financial reports, economic trends and community needs to identify and respond to market changes while controlling expenditures. Communicates sales results associates and guides interpretation of results \n 2. Creates, with the balance of the Management Team, operational plans; prioritizes, delegates and provides clear direction to Managers and Associates. Ensures optimal store conditions through effective merchandise presentation, accurate and competitive pricing and store standards within Company policies and guidelines. Implements new store programs according to Company direction, while evaluating effectiveness to achieve successful results specifically related to the (Front End or Back End or Fresh or Operations - specific area that the incumbent will oversee). An Assistant Manager is cross-trained to work proficiently in all areas of the Store when needed. \n 3. Executes and monitors asset protection and safety controls; maintains quality assurance standards; oversees safety and operational reviews while ensuring compliance with Walmart policies and procedures and with established safety, security, sales, financial and record keeping procedures and practices. Anticipates and proactively responds to compliance issues, including Total Loss/general controls. \n 4. Serves Customers as an ambassador for their store by greeting customers, seeking their feedback and ensuring customer needs, complaints, and issues are resolved within Company guidelines to create a positive shopping experience. As a member of management, models, enforces, and provides direction to associates on friendly and helpful customer service approaches and techniques \n 5. Supports store initiatives to serve the community by participating in and supporting community events and developing relationships with key community groups. Participates in company-sponsored programs, events, and sustainability efforts for associates and customers to emphasize the store’s role as an integral part of the community. \n 6. Leads Associates by conducting regular store meetings and communicating operational direction and initiatives with a focus on the OMNI and the Total Store. Drives engagement, recognizes and rewards accomplishments and provides opportunities for professional growth. Develops all associates and identifies high-potential associates, providing training and development to increase capability. \n 7. Demonstrates Company values by holding Associates accountable through timely, honest, specific and respectful performance feedback and corrective and disciplinary action. Builds and manages relationships with supporting functions within the store and district (e.g. District HR Managers, etc.). \n 8. Complies to all Company standards and procedures when handling all merchandise, including but not limited to: alcohol, ammunition, narcotics, and high-ticket. Ensures appropriate cash controls, handling as much as $250,000 per day. \n \n Minimum Qualifications... \n Outlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications. \n Age - 16 or older \n \n Preferred Qualifications... \n Outlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications. \n \n Walmart will accommodate the disability-related needs of applicants and associates as required by law. \n \n Primary Location… 640 BLVD MALONEY W, GATINEAU, QC J8T 8K7, Canada \n \n Are you currently a Walmart associate? \n Please login to your Workday account and use the Find Jobs report to apply for this job. \n \n  Find Jobs"
}