{
    "id": "c607a1168c6e70f0",
    "company": "CBI HEALTH",
    "positionName": "Physiotherapist",
    "jobType": [
        "Full-time"
    ],
    "location": "99 Kakulu Road, Kanata, ON",
    "salary": null,
    "postingDateParsed": "2024-01-26T12:15:23.054Z",
    "url": "https://www.indeed.ca/rc/clk?jk=c607a1168c6e70f0&from=jasx&tk=1hl5dg16dk7ek800&bb=tMKIoX8lf2spUOlVC2NDMAX8VKrw0IQDq_3WPiVP7z3wZARNt6H-Fpo3PxAFjEI1Qdvry5d0OBl1kzCZovUYk-jVQuGPa79Nu9JlNULYY225wEOG89x8nQ%3D%3D&xkcb=SoBN67M3FlTP8hgNR70SbzkdCdPP&vjs=3",
    "externalApplyLink": "https://recruiting.ultipro.ca/CBI5000CBHIG/JobBoard/5ed9b0b5-33c5-df47-591e-ac6551779695/OpportunityDetail?opportunityId=f5010f4b-7ade-476d-9921-f94fe2e7b587&postingId=214b39b6-8e94-4a3e-b652-2d28a4779de8",
    "companyDescription": "We want to help you do what you do best. At CBI Health, our extensive national network is here to help you increase your local impact. By joining our care team, you’ll receive the independence and experienced support structure you need to provide life-changing care for your clients and their families. And while you do that, our team of over 13,000 healthcare professionals has your back!\r\n\r\nFor millions of Canadians, CBI Health is where better begins. We are Canada’s leading community healthcare provider, reliably delivering innovative Rehabilitation and Home Health care programs that help our clients achieve their health goals. With 250+ locations in more than 800 communities, people are at the heart of what we do. Every day, all across the country, our team members work together to make a meaningful difference in our clients’ lives and help shape healthcare for the better. \r\nLearn more about CBI Health.\r\n\r\nCompany Mission/Culture\r\nPeople are at the heart of what we do. Together, we serve local clients and communities by delivering nationally supported Rehabilitation and Home Health services. We also serve every member of our team by helping them achieve their health career goals through meaningful work and impactful outcomes.\r\n\r\nOur Purpose, Promise, and Values are what inform and guide this mission. These essential elements are at the heart of the decisions we make, the programs we implement, and the strategies we develop. Across the country, the CBI Health team is committed to delivering on Our Purpose, keeping Our Promise, and living Our Values in every community we serve.\r\n\r\nOur Purpose: The health and well-being of Canadians is at the heart of what we do. Every day, we make a meaningful difference in people’s lives by supporting them in achieving their goals. Together, we shape healthcare for the better. \r\n\r\nOur Promise: For our clients, we promise to always:  \r\nTreat you with dignity, respect and kindness \r\nUnderstand you, your goals and what matters most \r\nEngage, motivate, and inspire you on your health journey \r\nBring together our knowledge, expertise and experience to deliver the best care \r\nEarn and appreciate the trust you place in us \r\n\r\nOur Values:\r\nHeart – We are passionate about making a positive difference \r\nRespect – We accept and value everyone \r\nReliability – We do what we say we will do \r\nTeamwork – We work well together and support each other \r\nInnovation – We are committed to learning, improving and growing.\r\n \r\nLearn more about the CBI Health culture.\r\n\r\nDiversity Programs and Initiatives: CBI Health continually strives to be an inclusive organization and create a respectful work environment where everyone feels included and valued. Diversity in our workplace allows us to share and implement different perspectives, which we believe inevitably leads to better internal and external outcomes. Accepting and valuing everyone, part of Our Values, ensures that the CBI Health culture is strong, enhances the well-being of all team members, and allows us to effectively work together to fulfill Our Purpose: shaping healthcare for the better. \r\n\r\nOur employee-led Diversity, Equity and Inclusion (DEI) Committee is now in its third year running and continues to make great progress in developing meaningful initiatives to help team members feel safe and accepted as their authentic selves. Creating impactful new DEI initiatives and enhancing existing initiatives will remain a CBI Health priority moving forward.\r\n\r\nAwards: CBI Health is proud to be a national leader in the field of community healthcare. We are regularly recognized for our exemplary Rehabilitation and Home Health expertise, as well as our commitment to industry-recognized organizational best practices. ",
    "description": "Physiotherapist, $5,000 Signing Bonus! – Kanata, ON \n  CBI Health is Canada’s leading community healthcare provider, and our passionate team is at the heart of what we do. Every day, our 13,000 staff make a meaningful difference in our clients’ lives as we live the core values that define us: heart, respect, reliability, teamwork and innovation. Along with mentoring and continuous learning opportunities to help advance your career, we are building a culture of inspiration, recognition and celebration for the meaningful work our team does every day, all across the country. Join CBI Health and find where your better begins. \n  About this opportunity \n  Are you looking for a company that supports innovative, evidence-based approaches to rehabilitation? Then CBI Health has a great opportunity for you to join our interdisciplinary team! As a Physiotherapist at our Kanata health centres, you’ll have all the tools and resources you need to grow your practice and develop your skills. Through the support of our leadership, you’ll continuously set and reach new goals. After all, our commitment to excellence goes beyond the way we serve our communities. We’ll empower you to enrich lives and achieve amazing results by doing what you do best. \n  Take an inside look at what you’ll do each day \n \n  Work with clients to develop and implement individualized treatment plans, directed towards maintaining and enhancing their physical abilities, lifestyle and well-being \n  Be responsible for managing and prioritizing clinical caseloads, and for the coordination and delivery of therapeutic services \n  Participate in a collaborative care model providing holistic, comprehensive care to meet the needs of clients \n  Promote positive relationships between clients, team members, funders and the community \n \n What you need to be successful \n \n  You are a graduate of a recognized School of Physiotherapy \n  Registration in good standing with the College of Physiotherapists of Ontario \n  Passion about your profession and committed to ongoing professional development \n  A strong client-centered approach \n \n What CBI Health offers you \n \n  Continuous learning and skills development, including management opportunities \n  Training and mentoring from a national network of experts \n  Competitive compensation with comprehensive benefits and rewards package, including group health, dental and vision benefits, paid 100% by the employer \n  Excellent administrative support, so you can focus on your patients \n  Flexible hours, which allow work-life balance and focus on quality of life \n  A signing bonus of $5,000! \n  \n About Us \n  For millions of Canadians, CBI Health is where better begins. We are Canada’s leading community healthcare provider, reliably delivering innovative rehabilitation and home care programs that help our clients achieve their health goals. With 250+ locations and supporting more than 800 communities, people are at the heart of what we do. Every day, all across the country, our 13,000 staff work together to make a meaningful difference in our clients’ lives and help shape healthcare for the better. Learn more at cbihealth.ca. \n  CBI Health is proud to be recognized by Deloitte as one of Canada’s Best Managed Companies for the 15th year in a row. A huge thank you to all our team members, whose dedication, passion, and innovation have enabled us to achieve this recognition year after year. \n  CBI Health is committed to providing a diverse, equitable, and inclusive workplace where everyone feels safe and accepted as their authentic selves. We actively seek qualified candidates who share our commitment to equity and inclusion and contribute to the diversification of ideas and perspectives that help us innovate and provide the best possible care to our clients. \n We are committed to fostering a positive experience for all Indigenous applicants whether you’re First Nations (status or non-status), Inuit or Metis and welcome applications from all individuals regardless of race, colour, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or any other characteristics that make each of us different. \n  In accordance with the Ontario Human Rights Code, Accessibility for Ontarians with Disabilities Act and CBI Policies on Accommodation, a request for accommodation will be accepted as part of our hiring process. Please inform your recruiter if you have any accommodation requests. \n  #NREHAB"
}