{
    "id": "c68fca4cfb7f32d8",
    "company": "GeoScan Subsurface Surveys",
    "positionName": "Concrete Scanning/Coring Technician, Trainee",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-07T02:03:01.200Z",
    "url": "https://www.indeed.ca/rc/clk?jk=c68fca4cfb7f32d8&from=jasx&tk=1hc6garcoih7o800&vjs=3",
    "externalApplyLink": "https://geoscan.bamboohr.com/careers/135?source=indeed&src=indeed&postedDate=2023-10-05",
    "companyDescription": "",
    "description": "As one of Xradar’s Concrete Scanning/Coring Technician Trainee, you will have the opportunity to gain experience and grow your career in construction. This is a mentally and physically fulfilling role where you’ll never face the same challenges twice. At Xradar, achieving excellence while enjoying the benefits of a great work/life balance goes hand-in-hand!\n  \n  \n  As an Xradar Concrete Scanning/Coring Technician Trainee, your day-to-day responsibilities may include: \n  \n  Utilizing GPR with Xradar’s technology to locate and map the position of post-tension cables, rebar, and electrical conduits located in concrete \n  Employing drilling techniques to make holes and openings in concrete structures \n  Exposure to fieldwork – you’ll get to know our city intimately by visiting a wide range of construction projects \n  Preparation of job sites and equipment set up, as well as necessary clean-up and maintenance of tools \n  Completion of job summary reports for client review \n  Assistance and development within concrete engineering surveys \n  Interpreting technical marks in concrete slabs to make holes and openings within concrete structures \n  Site preparation, maintenance, and clean-up \n  Equipment set up and maintenance \n  Following all health and safety protocols\n \n  \n  \n  On your resume, we will be looking for the following: \n  \n  At least 1 year of experience working in a labour or construction role \n  Valid class G Drivers’ License to use company vehicles as necessary \n  Strong computer skills and experience in AutoCAD and GPS is a significant asset \n  Experience in geophysical surveys, land surveying, or geomatics is an asset\n \n  \n  \n  During the interview process, we will be looking for: \n  \n  How you demonstrate our shared value set of excellence (pushing yourself to be the very best), innovation (your ability to try new things and be okay with failing), community (how you give to your community, either micro or macro) and honesty (how you own your mistakes, even if it might mean you don’t always look as good as you hoped!) \n  Exceptional interpersonal skills: your ability to communicate to all levels of an organization with a positive, proactive attitude. This includes understanding how to read a room and meet the needs of the team! \n  Examples of excellent problem-solving, critical thinking, and analytical skills through asking good questions and completing solid analysis \n  Examples of your ability to work independently and autonomously, as well as collaboratively across several teams \n  Knowledge or interest in learning concrete construction methods\n \n  \n  \n  Why Xradar? \n  \n  A commitment to individuals who are dedicated to building a career by providing a structured training program \n  Customizable benefits package including medical, dental, vision care, and RRSP options \n  Paid sick days to care for you or your immediate family \n  Structured training program where you’ll become familiarized with the industry methodologies \n  Company holidays: we go camping in the summer and skiing in the winter! \n  Opportunity to become an employee-owner after 12 months of employment\n \n  \n  \n  Commitment to Diversity, Inclusion and Equality:\n  \n  \n  Xradar is strongly committed to equal opportunities in employment. We believe in building an environment that is inclusive and supportive for all individuals regardless of ancestry, race, colour, religion (including religious dress) or creed, national, ethnic or social origin, including caste, sex, sexual orientation or gender identity or expression, genetic information, age, disability, military or veteran status, medical condition, marital status, citizenship status, or other protected categories as provided by human rights legislation. Our goal is to build an organization that supports diversity inside out!\n  \n  \n  To Apply\n  \n  \n  Please submit your resume and cover letter online (ideally, in one document!). While we thank all candidates who apply, only those deemed qualified by the hiring manager will be contacted.\n  \n  \n  About Xradar\n  \n  \n  Xradar is one of the largest and most experienced providers of Ground Penetrating (GPR) services in Canada and is a rapidly growing company with offices across Canada. Our main line of work involves Concrete Scanning, Concrete Core Drilling, Ground Penetrating Radar (GPR) Surveys, Utility Locating and Shallow Geophysical Surveys. We are a COR certified company with strict safe work environment procedures.\n  \n  \n  Our greatest strength is our people, a team of remarkably talented, vibrant, and encouraging individuals. As a growing business, we encourage new ideas and promote career development within the company. Xradar is proud to be 100% employee-owned."
}