{
    "id": "c871dc1f902ae7a3",
    "company": "Definity Financial Corporation",
    "positionName": "Sr Catastrophic Claims Representative NEW",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-20T05:09:26.029Z",
    "url": "https://www.indeed.ca/rc/clk?jk=c871dc1f902ae7a3&from=jasx&tk=1hkikb4a7k5qp800&bb=lTPy9GC8AEMesPUlCsHFKlS_LsaJ2ODsUA2afYShzEM7y1f3QVFME71PEM2ymolRpxq3I4NiEckOkq6K3EVHvFTXthdJ5UUzw-a2sG4rIxGTuw9hSE0Y1A%3D%3D&xkcb=SoDZ67M3FSgjV4x1FB0ObzkdCdPP&vjs=3",
    "externalApplyLink": "https://careers.definityfinancial.com/jobs/13849321-sr-catastrophic-claims-representative?source=Indeed",
    "companyDescription": "",
    "description": "Job ID : 7167 Category : Claims Brand : Definity Regular/Temporary : Regular Fulltime/Parttime : Full Time Location : Ottawa, Canada Posting Range : $55,800 - $102,800\n  \n  \n  \n   \n     \n   \n  \n \n \n  Definity includes some of Canada’s most long-standing and innovative insurance brands, including Economical Insurance, Sonnet Insurance, Family Insurance Solutions, and Petline Insurance. With strong roots that date back to 1871, we’ve grown to become a digital leader in the insurance industry. We’re proud to help our clients and communities adapt and thrive in a world of constant change. \n   Our promise to you: It’s better here. Why? Because we CARE, and we provide an employee experience that’s collaborative, ambitious, rewarding, and empowering. \n   Our ambition is to be one of Canada’s leading and most innovative P&C insurers. Come be a part of our journey, and love what you do. \n   Definity offers a flexible, hybrid work experience where employees work from the office and virtually depending on the type of work they are doing and who they are working with. Leaders partner with their teams to find the right balance of on-site and remote work that best meets the needs of their teams, colleagues, brokers and customers, while ensuring collaboration, teamwork and accountability for goals. \n  \n  Reporting to the Team Leader CAT the successful candidate is accountable for adjusting files to ensure investigation, evaluation, and the settlement of moderate to complex first party Personal and Commercial claims as per Economical Catastrophe claims standards. The successful candidate will also provide guidance, on the job training, technical direction, coaching and mentoring to Claim Professionals relative to estimates, vendor management and complex structural commercial building damage large losses. \n   What can you expect from this role? \n   \n   Deploy approved Economical loss cost control programs and technology to investigate, negotiate and settle moderate to complex personal and commercial claims as assigned. Adjusts files to ensure that full investigation of loss site has occurred in person or through use of Economical quantification programs. \n   Develops and records information pertaining to the claim and/or coverage, documenting notes in the appropriate system(s) and driving the claim towards final disposition. \n   Responds to written and telephone inquiries and new claim assignments promptly as per Economical guidelines. \n   Reviews and interprets policy wordings, acts, regulations, legislation, and contracts to assess impact on coverage. Reviews claim evidence, statements, photos, and investigative documentation to assist in identifying subrogation opportunities or identifying potential third-party liability exposure. Identifies and processes all salvage. Retains and directs appropriate vendors & experts within corporate guidelines. \n   Provides oversite and quality assurance on outsourced quantification assignments. Quantifies large loss Complex Commercial Lines structural damage claims as a member of the Quantification Team in support of the Structural Damage Quantification Protocol nationally. \n   Subject matter expert on building code and by-law issues as they relate to loss cost quantifications and works closely with national Vendors on programs, pricing, and protocols. \n   Supports regional adjusting function while not deployed on CAT by working catastrophe clean up and backfilling teammates. Supports national appraisal function while not deployed on CAT by completing reinspection’s, managing exceptions through the Contractor Connection program, completes large loss appraisals and tasks on behalf of region partners. \n   Writing denial letters, Reservations of Rights and other complex correspondence when required. Maintaining an effective diary system to ensure proactive claim file management and disposition. \n   \n  What you bring to this role? \n   \n   University degree or a college diploma (specified field) or the CIP designation and a minimum of 2 years as a loss adjuster or appraiser. \n   Demonstrated ability to complete scopes of repair for up to moderately complex losses \n   Understanding of Provincial and National Building Codes along with a solid understanding of residential and commercial construction terminology, techniques, and best practices. \n   Experience with estimating software platforms including Xactware. \n   Experience with and ability to read and understand blueprints and CADD drawings \n   Proficient in MS Word and Excel \n   Strong verbal and written communication skills and ability to work autonomously \n   Professional, friendly, courteous in all interactions, flexible, and ability to remain calm while under pressure \n   Ability to travel to sites across Canada with little notice \n   The typical CAT day is 7AM to 7PM 6 or 7 days per week depending on the event and the response required. \n   \n  Salary range is $ $54,800 - $100,800 \n   Actual salary for the role may vary depending on work location of the successful candidate and other factors including but not limited to, skills, education, experience, working conditions and the local labour market. In addition to base pay,eligible employees may participate various incentive plans which are paid out at the discretion of the company and subject to individual and company performance. \n  We also take potential into consideration. If you don’t have this exact experience, but you know you have what it takes, be sure to give us more insight through your application and cover letter.\n   Go ahead and expect a lot — you deserve it, and we’ve got it:\n  \n    Hybrid work schedule for most roles\n    Company share ownership program\n    Pension and savings programs, with company-matched RRSP contributions\n    Paid volunteer days and company matching on charitable donations\n    Educational resources, tuition assistance, and paid time off to study for exams\n    Focus on inclusion with employee groups, support for gender affirmation surgery, access to BIPOC counsellors, access to programs for working parents\n    Wellness and recognition programs\n    Discounts on products and services\n  \n   Our inclusive work environment welcomes diversity and supports accessibility. If you require accommodation at any time during the recruitment process, please let us know by contacting: accessibility@definity.com\n   Background checks This role requires successful clearance of a background check (including criminal checks and leadership references).\n   #LI-Hybrid"
}