{
    "id": "c929f3dd0f171a8c",
    "company": "Black & McDonald Limited",
    "positionName": "FACILITY SUPERVISOR, FMO",
    "jobType": [
        "Full-time"
    ],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-09T03:09:35.276Z",
    "url": "https://www.indeed.ca/rc/clk?jk=c929f3dd0f171a8c&from=jasx&tk=1hjm33n93k6rj800&vjs=3",
    "externalApplyLink": "https://black-mcdonald-limited.breezy.hr/p/4d4f9262a12c01-facility-supervisor-fmo?source=indeed&source=indeed&ittk=54HFJNM6NI",
    "companyDescription": "",
    "description": "BUILD YOUR CAREER AT BLACK & MCDONALD \n Black & McDonald is an integrated, multi‑trade service provider that safely delivers high-quality construction, facilities management, and technical solutions. We are a family-owned and family-run company that employs thousands of highly skilled and talented professionals across North America. With 100 + years of diverse market experience, we are a forward‑thinking organization with a strong track record of delivering operational excellence and customer-focused solutions that stand the test of time.\n  ABOUT THIS CAREER OPPORTUNITY\n  \n Black & McDonald's Ottawa team is growing! If you are committed and collaborative professional looking to contribute to a hard-working, innovative team, this opportunity is for you. \n The Facility Supervisor is located in Ottawa, Ontario and typically reports directly to the Operation Manager. The Facility Supervisor will be responsible for overseeing site and trade workers, including all aspects of building or facility maintenance in accordance with contract specifications. \n Duties and responsibilities include, but are not limited to: \n \n  Schedule, supervise, and monitor onsite staff and subcontracted personnel as needed to accomplish tasks in accordance with contract requirements.\n   Interface with internal and external customers ensuring effective communication regarding status and priority of work.\n   Manage site co-ordination for facility projects construction/renovation commencement, completion dates, contractor, consultant site visits, staff relocation, and equipment relocation. \n  Coordinate ordering and stocking materials and supplies in accordance with contract specifications.\n   Oversee and provide support as necessary to administrative staff in the day-to-day processing of related contract paperwork such as Work Orders, Invoices, Proposals, and Purchase Orders\n   Review invoicing based on contract type, terms and conditions.\n   Oversee facility service calls and dispatching of appropriate staff to meet client needs.\n   Ensure all facility operation and equipment maintenance manuals are available and up to date. \n  Review and approve all expenditures for materials, equipment, tools, supplies, and subcontracts.\n   Produce monthly reports related to facility maintenance and operating budgets. \n  Assist with the implementation of Facility policies and procedures. \n  Recommend and oversee training requirements for FMO employees. \n \n \n  Ensure all required environmental, health, and safety programs are implemented as per Health & Safety Plan\n  \n \n  Perform periodic facility inspections as necessary.\n   Ensure quality assurance inspections are completed as per Quality Assurance Plan\n  \n COMPETENCY REQUIREMENTS \n \n  Change Orientation\n   Bilingual in French & English \n  Communicates Effectively \n  Customer Focus\n   Problem Solving and Innovation \n \n EDUCATION REQUIREMENTS \n \n  Trade qualification and/or technical diploma (or equivalent facility experience and knowledge)\n  \n WORK EXPERIENCE REQUIREMENTS \n \n  3 - 5 years of experience in a supervisory role with a strong focus on facility and business process\n  \n \n  SKILLS, ABILITIES, AND OTHER REQUIREMENTS \n \n \n  Must be able to hold and maintain a Secret security clearance.\n   Experience with building materials and systems \n  Competency in basic computer skills, including Microsoft Office applications.\n   Knowledge of Contract Management\n   Knowledge of Local and National electrical, building and fire codes \n \n We welcome and encourage applications from persons with disabilities.  Accommodations are available upon request. \n If you are an existing Black & McDonald employee, please notify your supervisor  of your interest and intent to apply before applying. \n Apply to this Career Opportunity (https://black-mcdonald-limited.breezy.hr/p/69fa098bca1201-facility-supervisor) Explore all opportunities at Black & McDonald (https://black-mcdonald-limited.breezy.hr/)"
}