{
    "id": "ca5459e85ec5c20a",
    "company": "Stantec",
    "positionName": "Senior Energy Modeler",
    "jobType": [],
    "location": "3001331 Clyde Avenue, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-19T05:10:46.567Z",
    "url": "https://www.indeed.ca/rc/clk?jk=ca5459e85ec5c20a&from=jasx&tk=1hkikdavvii12803&bb=Z_xYV__n_sQAK0ynFsc1Li7M1_yYyOipBCiqyTiMm338eyQ9MtY-NLLvlu5TrdYXqShb-LEYIZI8oGAI0FXqxfepwvoafpXcKnoCromhJ-I81iQgKO0WNw%3D%3D&xkcb=SoDh67M3FSg6uFQ22p0ebzkdCdPP&vjs=3",
    "externalApplyLink": "https://stantec.jobs/ottawa-on/senior-energy-modeler/E74E114C6C574AB3B9C8BBEE9B4A84CB/job/?vs=1554&utm_source=Indeed-DE&utm_medium=Job%20Aggregator&utm_campaign=Indeed",
    "companyDescription": "",
    "description": "Senior Energy Modeler - ( 2400009G ) \n Description \n Stantec Buildings is on a mission to become the world’s leading integrated design practice. Our architects, engineers, interior designers, sustainability specialists, and technologists are passionate about the power of design. We take an innovative, collaborative approach to projects, sharing a common belief that sustainable design for the built environment can make the world a better place for future generations. Join us and design your place with Stantec. \n Within the Buildings Engineering Practice Area, the Sustainability and Building Performance team provides consulting services in support of high quality and high performance projects, including energy modeling, performance engineering, and energy management services. The service areas reflect the interconnected systems-based nature of sustainability, Building Performance Simulation, Energy Audits, Measurement & Verification services and support for Building Condition Assessments. This is where great people and great ideas truly make a difference. \n Your Opportunity \n Stantec is currently seeking a self-motivated engineer with specialized senior level expertise in sustainable design, energy efficiency, and building energy simulation. The successful candidate will work in collaboration with peers to provide technical leadership within Stantec’s Sustainability and Building Performance team in Ottawa, and will be responsible for winning, managing, and delivering simulation assignments, mentoring and developing energy modeling staff, and working with leadership to grow Stantec’s sustainability practice. \n The qualified candidate will have considerable background in energy-efficient system design and simulation, energy analysis studies, and energy management & incentive programs. A sound knowledge of HVAC and lighting systems, building control systems, building envelope design, energy conservation measures, greenhouse gas emission, and building energy simulation programs is expected. Exceptional communication skills, the ability to provide excellent client service and a commitment to sustainable design are essential for this position. \n Your Key responsibilities \n \n  Manage and deliver building performance and simulation assignments (whole building energy modeling, natural ventilation design, thermal comfort, CFD etc.), and greenhouse gas emissions analysis. \n  Prepare energy models in support of Green Rating documentation and/or performance related modeling. \n  Undertake economic analysis of energy and carbon conservation measures include lifecycle cost analysis (LCCA). \n  Mentor and develop junior energy modeling staff. \n  Identify strategies and solutions, for clients that improve energy performance, indoor air quality, and thermal comfort. \n  Write and lead technical reports. \n  Prepare and deliver presentations to clients and/or design teams. \n  Support on business development. \n  Prepare NECB Performance Compliance Path documentation for Building Permit submissions. \n  Perform energy audits and consulting support for BOMA BESt, NEET, TAME, CaGBC ZCB Standard, etc. \n \n Qualifications \n Your Capabilities and Credentials \n \n  Strong background in energy-efficient system design and simulation, daylighting, Green Building Certifications, energy analysis studies, and energy management & incentive programs. \n  Knowledge in helping clients achieve goals for energy reduction, green energy adoptions, or GHG reduction, including progress toward Net Zero goals or Science Based Targets. \n  Sound knowledge of HVAC and lighting systems, building control systems, energy conservation measures, greenhouse gas emission, and building physics. \n  Eligibility for PEO membership as an EIT or P.Eng. \n  BEMP, CEM credentials considered assets. \n  Strong verbal and written communication skills and an ability to provide excellent client service. \n  A commitment to sustainable design is essential for this position. \n  Strong professional verbal and written communication skills -ability to communicate in a timely manner appropriate with clients and building design team members. \n  Peer review work completed by sustainability team members prior to submissions. \n  Ability to manage projects. \n  Eligibility for the Canadian federal government reliability clearance. \n \n Education and Experience \n \n  Degree in Mechanical Engineering or related field. \n  8 years of experience in energy-efficient system design and simulation. \n  Experience in conducting ASHRAE levels I, II, and III energy audits. \n  Experience with simulation software: IES is a must. \n  Ability to assist mechanical engineers/designers with load calculation to right-size mechanical systems. \n  Experience with eQUEST, RETScreen, TRNSYS, EE4, and/or EnergyPlus considered an asset. \n  Experience with thermal comfort analysis, CFD (for natural ventilation and displacement ventilation), daylight simulation, life-cycle cost analysis, and/or existing building auditing preferred. \n \n Typical office environment working with computers. Field work may include exposure to the elements including inclement weather. \n This description is not a comprehensive listing of activities, duties or responsibilities that may be required of the employee and other duties, responsibilities and activities may be assigned or may be changed at any time with or without notice. \n Stantec is a place where the best and brightest come to build on each other's talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best. \n Benefits Summary: Regular full-time and part-time employees will have access to health, dental, and vision plans, a well-being program, health care spending account, wellness spending accounts, group registered retirement savings plan, employee stock purchase program, group tax-free savings account, life and accidental death & dismemberment (AD&D) insurance, short-term/long-term disability plans, emergency travel benefits, tuition reimbursement, professional membership fee coverage, and paid time off. \n Temporary/casual employees will have access to group registered retirement savings plan, employee stock purchase program, and group tax-free savings account. \n The benefits information listed above may not apply to union positions because benefits for such positions are governed by applicable collective bargaining agreements. \n Primary Location : Canada-Ontario-Ottawa \n Organization : BC-1633 Buildings-CA Ottawa \n Employee Status : Regular \n Job Level : Individual Contributor \n Travel : Yes, 10 % of the Time \n Schedule : Full-time \n Job Posting : Jan 18, 2024, 2:47:41 PM \n Req ID: 2400009G \n Stantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans"
}