{
    "id": "cac3f47690611ed5",
    "company": "Merrick & Company",
    "positionName": "Commissioning Specialist",
    "jobType": [
        "Full-time"
    ],
    "location": "580 Terry Fox Drive, Kanata, ON",
    "salary": null,
    "postingDateParsed": "2024-01-04T03:14:17.778Z",
    "url": "https://www.indeed.ca/rc/clk?jk=cac3f47690611ed5&from=jasx&tk=1hjm3d03vjrq0800&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/applystart?jk=cac3f47690611ed5&from=vj&pos=top&mvj=0&spon=0&sjdu=o7sfz71MPdMgyiV0LZq0d4DDplm6SwWjHcxyoDIphKl6AaOuQdBskW1RpEMU7Unh65JlyLLWPf7xT1TWqhI3GVCWi31x8smkwXocGYa7rIRgsMb8_FRTC35i52N1QIB0uL6VLVJJLUmQG1k5VPZGBj643_PqQ5lfBab7J74CDT2MxocybQLUp7CXkYy-sZh9w9_XINGINv7OnqX9-Wv1cg&vjfrom=serp&log=1&astse=bc52207dfdab2e31&assa=7009",
    "companyDescription": "",
    "description": "Overview: \n  Merrick & Company is seeking an experienced Commissioning Specialist – laboratories and critical facilities for a position in the Continental United States (CONUS). The candidate will have excellent client interface skills and working with a variety of project stakeholders from client and users, facility OM groups, to general contractor and equipment vendors. The candidate will be given the opportunity to grow into a leadership position with the Cx team and Merrick organization.\n  Job Description:\n  Coordinate, perform and oversee detailed field commissioning services, assessments, and studies for all types of facilities/systems including the following: laboratories, nuclear spaces, hospitals, clean rooms. Generate commissioning plans; write commissioning specifications; develop commissioning installation checklists and functional test procedures; verify and validate commissioned systems controls and equipment; document commissioning process, develop final commissioning report, and develop systems manuals.\n  Requirements:\n \n   Demonstrated Project Management experience.\n   Frequent travel to project/client locations is required.\n   Must have at least five (5) years or more experience in the commissioning, de-commissioning, testing and/or evaluation of these systems:\n   \n     Heating, Ventilating, Air Conditioning, and Refrigeration (HVAC&R) Systems (mechanical and passive) and associated controls\n     Interior and exterior lighting, daylighting and shading controls including automatic controls and occupancy sensors\n     Plumbing and domestic hot water systems\n     Domestic and process water pumping and mixing systems\n     New EMCS/UMCS/SCADA/Fire Protection systems into existing systems\n   \n \n  Optional experience/qualifications:\n \n   An Engineering or Technical Degree from an accredited institution.\n   LEED/Green Globes/Guiding Principles Compliance\n   Experience with construction administration\n   Experience with:\n   \n     Laboratory facilities and systems.\n     Utility Metering Systems; water and energy measurement devices\n     Electrical distribution systems and associated controls to include, but not limited to, switchgear, UPS systems, transfer switches, and power distribution units\n     Emergency/back-up power systems\n     Security and communication systems\n     Building envelope including thermal and moisture integrity and observe air tightness testing in particular areas or perform laboratory testing.\n   \n   Ability to present in a conference environment.\n \n  Qualifications:\n \n   Be ambitious and flexible; have a talent for efficiency and process improvement; and have an attitude to succeed.\n   Be a self-starter and independently motivated individual.\n   Must be able to work as a member of a close team and be able to work independently as necessary.\n   Have good organizational and planning skills with the ability to direct a team through the execution of the commissioning process.\n   Have strong verbal and written communication skills.\n   Experience coordinating with owners and contractors, as well as the ability to lead project meetings are necessary skills.\n   Can generate accurate, detailed reports.\n   Can read and understand building drawings, specifications, and submittals.\n   Have knowledge of controls systems and control sequences.\n   Be proficient in the use of computers and Microsoft Office products (Word, Excel, Power Point).\n   Maintain a current passport for international travel.\n   Achieve commissioning certification under ACG and/or BCA within the first three years of engagement.\n \n  Work Location:\n \n   Location is flexible within the CONUS and Merrick office locations.\n   Ability to travel to project/client locations located in the US and internationally.\n   The worker is subject to hazards includes a variety of physical conditions including proximity to moving mechanical parts, moving vehicles, electrical currents, working on scaffolding and high places.\n   Potential activities in high heat or chemical environments.\n   The worker frequently is in close quarters, crawl spaces, shafts, below grade confined spaces, small, enclosed rooms, and other areas which could cause claustrophobia.\n \n  Physical Requirements:\n \n   Physically mobile in and around construction sites and facilities\n   Able to climb ladders\n   Mobile crawling in and around mechanical space with piping and ductwork\n   Ability to carry test instruments and equipment\n   Lift 50 pounds\n   The job requires the ability to sit for extended periods at a computer workstation.\n   The job requires the ability to perform work in a laboratory environment.\n   The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.\n   Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n \n  Additional Information\n \n   Apply online only. No e-mail, hard copy or third-party resumes accepted.\n   Merrick & Company offers a competitive compensation and benefits package which includes RRSP, and unique work-life benefits.\n   We recognize the importance of developing top talent from within, our employees have access to a wide range of internal and external training and coaching programs and are rewarded for their achievements through excellent benefits and competitive salaries.\n   Merrick & Company is an Equal Opportunity Employer, including disability/vets."
}