{
    "id": "cade7fbb138358ea",
    "company": "University of Ottawa",
    "positionName": "Professeure adjointe ou Professeur adjoint (sciences biomédicales)",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-01T20:09:09.324Z",
    "url": "https://www.indeed.ca/rc/clk?jk=cade7fbb138358ea&from=jasx&tk=1hgol9m42jjhg800&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/applystart?jk=cade7fbb138358ea&from=vj&pos=top&mvj=0&spon=0&sjdu=o7sfz71MPdMgyiV0LZq0d4DDplm6SwWjHcxyoDIphKlclNB31rQjofKLrcnz9GJVkN0wkll9wDHc3mnStM4Hmg&vjfrom=serp&astse=48536ddb0057c1a0&assa=8955",
    "companyDescription": "",
    "description": "Famille d’emplois :\n \n \n   Cadres universitaires et corps professoral\n \n \n   Affiliation syndicale:\n \n \n   APUO\n \n \n \n   Faculté ou département :\n \n \n   MCM Corps professoral\n \n \n \n   Campus :\n \n \n   Campus principal\n \n \n \n   Date d’affichage :\n \n \n   juin 30, 2023\n \n \n \n   Date de clôture :\n \n \n   Note: Les candidatures seront acceptées jusqu'à 23h59 le jour avant la date de fin de publication de cet affichage d'emploi\n \n \n \n   Poste de professeure adjointe ou agrégée ou de professeur adjoint ou agrégé\n \n \n \n   La Faculté de médecine de l'Université d'Ottawa sollicite des candidatures pour un poste de menant à la permanence au Département de médecine cellulaire et moléculaire. Le poste en enseignement et innovation pédagogique portera sur les domaines suivants : l'anatomie, la physiologie, la pharmacologie, la biochimie médicale ainsi que l'élaboration et la mise en œuvre de cours de laboratoire dans le domaine des sciences biomédicales. L'enseignement nécessitera une connaissance active du français.\n \n \n \n   L'Université d'Ottawa est l'une des universités canadiennes les plus actives en matière de recherche, et elle bénéficie d’un financement annuel de plus de 340 millions de dollars dans ce domaine. L'Université est située sur le territoire non cédé du peuple Anishinabé-algonquin, au cœur du campus de recherche et d'éducation en santé d'Ottawa. Avec ses \n  \n   instituts de recherche affiliés\n  , la Faculté de médecine se classe régulièrement parmi les meilleures facultés de médecine au Canada en ce qui concerne l’impact et l'intensité de la recherche.\n \n \n \n   Le Département de médecine cellulaire et moléculaire comprend plus de 100 membres du corps professoral, présente une atmosphère de recherche dynamique abordant des questions fondamentales de la recherche biomédicale fondamentale avec des liens étroits avec la recherche translationnelle et clinique. Le candidat retenu devra également établir et maintenir un programme vigoureux de recherche indépendant financé par des sources externes et contribuer aux programmes d'enseignement de premier cycle et des cycles supérieurs.\n \n \n \n   Titre du poste : Professeure adjointe ou professeur adjoint. L’accès au rang supérieur de professeure agrégée ou de professeur agrégé ne sera envisagé que si la personne retenue démontre le niveau d’expérience et les réalisations appropriées.\n \n \n \n   Nombre de postes disponibles : Un (1)\n \n \n \n   Fonctions : Les fonctions d'un membre du corps professoral comprennent, dans des proportions variables : a) de l'enseignement ; b) des activités savantes attestées par la recherche, la création artistique ou littéraire, ou le travail professionnel et c) les activités de service à la communauté universitaire.\n \n \n \n   Mandats : Poste menant à la permanence.\n \n \n \n   Salaire : Le salaire sera calculé conformément aux articles de la convention collective de l’APUO. Remarque : le salaire des rangs supérieurs est proportionnel à l’échelon et à l’expérience.\n \n \n \n   Avantages sociaux : L'Université d'Ottawa offre un ensemble complet d’indemnisation qui comprend une invalidité de longue durée, une assurance-vie collective de base, une assurance-maladie complémentaire, un régime de retraite de l'Université d'Ottawa et une assurance-vie facultative.\n \n \n \n   Frais de déménagement : La candidature retenue pourra être admissible au remboursement des frais de réinstallation, conformément aux règlements de l'Université.\n \n \n \n   Lieu de travail :\n \n \n   Faculté de médecine, Université d'Ottawa\n \n \n   451, chemin Smyth\n \n \n   Ottawa (Ontario) K1H 8M5\n \n \n \n   Compétences requises :\n \n \n \n  Formation : PhD ou MD/PhD\n  Expérience de travail : Expérience d'enseignement dans les domaines suivants : anatomie, physiologie, biologie cellulaire, biochimie et conception de laboratoire innovante. Les réalisations en enseignement, les prix et distinctions et les présentations lors de conférences importantes démontrent l'excellence de l'enseignement et un engagement envers une excellente recherche pédagogique.\n  Langues : Parfaitement bilingue (français et anglais)\n \n \n \n   Date limite de candidature : 30 juillet 2023. Remarque : les candidatures continueront d'être acceptées jusqu'à ce que le poste soit pourvu.\n \n \n \n   Les candidatures doivent être soumises par voie électronique via le site Web des carrières académiques de l'université d'Ottawa.\n \n \n \n   Le dossier de candidature doit comprendre : le dossier d'enseignement, une déclaration d'enseignement (1 page), exemple de plans de cours, du matériel pédagogique, des évaluations d'enseignement. La demande doit également comprendre une description des plans de recherche pédagogique actuels et futurs (2 pages).\n \n \n \n   Trois lettres de recommandation confidentielles doivent être envoyées directement à l'adresse suivante :\n \n \n \n   Katalin Tóth, Directrice intérimaire,\n \n \n   Département de Médecine cellulaire et moléculaire,\n \n \n   Faculté de médecine, Université d'Ottawa\n \n \n   451, chemin Smyth\n \n \n   Ottawa (Ontario) K1H 8M5\n \n \n \n   Ou par courriel : \n  \n   ktoth@uottawa.ca\n  , sujet \"Enseignement MCM\"\n \n \n \n   L’Université d’Ottawa s’est engagée à offrir à sa communauté un milieu de leadership et de savoir qui prône l’équité, la diversité et l’inclusion. Nous encourageons donc vivement les Autochtones du Canada, les membres de minorités visibles (personnes racialisées), les personnes en situation de handicap et les femmes, au même titre que toutes les personnes qualifiées possédant les compétences et les connaissances nécessaires pour travailler de manière constructive avec des communautés où règnent l’équité, la diversité et l’inclusion, à poser leur candidature. Les personnes qui appartiennent à au moins un de ces groupes sont invitées à remplir le questionnaire \n  d’auto-identification confidentiel lorsqu’elles\n   soumettent leur candidature.\n \n \n \n   Toutes les personnes qualifiées sont invitées à postuler; la priorité sera toutefois accordée à celles qui ont la citoyenneté canadienne ou la résidence permanente. Au moment de soumettre votre candidature, veuillez préciser si vous avez l’autorisation de travailler au Canada. Tout au long du processus de recrutement, l’Université d’Ottawa offrira des mesures d’adaptation aux personnes candidates ayant un handicap. Si nous vous invitons à poursuivre les étapes du processus de sélection, veuillez nous aviser de toute mesure d’adaptation dont vous avez besoin en écrivant au Cabinet de la vice-provost aux affaires professorales à \n  \n   vra.affairesprofessorales@uOttawa.ca\n  \n  . Toutes les informations reçues seront traitées de manière confidentielle.\n \n \n \n   L’Université d’Ottawa est fière de sa tradition de bilinguisme, vieille de plus de 160 ans. Par l’entremise de son Institut des langues officielles et du bilinguisme, l’Université offre aux membres de son personnel, ainsi qu’à leur conjointe ou conjoint, les moyens de devenir bilingue.\n \n \n \n   Avant le 1er mai 2022, en vertu du Règlement 129 – Vaccination contre la COVID-19, les membres de la population étudiante, du corps professoral et du personnel de soutien et les personnes en visite à l’Université (y compris les entrepreneurs) étaient tenus d’être vaccinés. Ce règlement a été suspendu le 1er mai 2022, mais pourrait être remis en vigueur à tout moment en fonction des directives de la santé publique et des recommandations des spécialistes.\n \n \n \n   L’Université d’Ottawa s’est engagée à offrir à sa communauté un milieu de leadership et de savoir qui prône l’équité, la diversité et l’inclusion. Nous encourageons donc vivement les Autochtones du Canada, les membres de minorités visibles (personnes racialisées), les personnes en situation de handicap et les femmes, au même titre que toutes les personnes qualifiées possédant les compétences et les connaissances nécessaires pour travailler de manière constructive avec des communautés où règnent l’équité, la diversité et l’inclusion, à poser leur candidature. Les personnes qui appartiennent à au moins un de ces groupes sont invitées à remplir le questionnaire d’auto-identification confidentiel lorsqu’elles soumettent leur candidature.\n \n \n \n   Toutes les personnes qualifiées sont invitées à postuler; la priorité sera toutefois accordée à celles qui ont la citoyenneté canadienne ou la résidence permanente. Au moment de soumettre votre candidature, veuillez préciser si vous avez l’autorisation de travailler au Canada.\n \n \n \n   Tout au long du processus de recrutement, l’Université d’Ottawa offrira des mesures d’adaptation aux personnes candidates ayant un handicap. Si nous vous invitons à poursuivre les étapes du processus de sélection, veuillez nous aviser de toute mesure d’adaptation dont vous avez besoin en écrivant au Cabinet de la vice-provost aux affaires professorales à \n  \n   vra.affairesprofessorales@uOttawa.ca\n  . Toutes les informations reçues seront traitées de manière confidentielle.\n \n \n \n   L’Université d’Ottawa est fière de sa tradition de bilinguisme, vieille de plus de 160 ans. Par l’entremise de son Institut des langues officielles et du bilinguisme, l’Université offre aux membres de son personnel, ainsi qu’à leur conjointe ou conjoint, les moyens de devenir bilingue.\n \n \n \n   Avant le 1er mai 2022, en vertu du Règlement 129 – Vaccination contre la COVID-19, les membres de la population étudiante, du corps professoral et du personnel de soutien et les personnes en visite à l’Université (y compris les entrepreneurs) étaient tenus d’être vaccinés. Ce règlement a été suspendu le 1er mai 2022, mais pourrait être remis en vigueur à tout moment en fonction des directives de la santé publique et des recommandations des spécialistes."
}