{
    "id": "cfef9b45e0120121",
    "company": "Tokyo Smoke",
    "positionName": "Budtender",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-13T18:55:17.417Z",
    "url": "https://www.indeed.ca/rc/clk?jk=cfef9b45e0120121&from=jasx&tk=1hcvfr1frj4hv800&vjs=3",
    "externalApplyLink": "https://recruiting.ultipro.ca/ALB5000ALBT/JobBoard/a5843871-4bf2-4616-b157-cd55b63a807e/OpportunityDetail?opportunityId=7d038c4d-82cf-4ae5-84a8-a2cc1bc6e5cb&postingId=524e3609-588b-4c21-b081-6ea7f0c68047",
    "companyDescription": "",
    "description": "Reporting to the Store Manager, the Educator is our greatest brand ambassador and a key role within our organization. The Educator is exceptional at creating intentional customer experiences and creating community by developing authentic relationships with our customers. Our Educator are thoughtful, curious, good people that ensure the organization’s success by imparting cannabis wisdom and achieving sales goals. \n  The Educator seeks information, knowledge and feedback. You understand customer service and ask great questions to uncover customer intentions in order to provide a personalized shopping experience. You demonstrate high levels of integrity and personal responsibility. The Educator's super power is creating elevated experiences. Some would call you a trailblazer - you aren’t afraid of taking risks or dealing with ambiguity. Recognizing that we operate in a burgeoning industry, you see the immense value in our retail locations as billboards for the brand and take pride in acting as a brand ambassador inside and outside the store to ensure company success within the recreational cannabis landscape. \n  Responsibilities \n  \n  Create intentional experiences for customers by building authentic relationships and appropriately determining needs \n  Successfully drive sales by educating on the brand and products \n  Demonstrate a high level of cannabis knowledge and curate experiences that go above and beyond expectations \n  Successfully achieve sales goals and business metrics \n  Seek opportunities to contribute to and improve business results on a daily basis \n  Support with inventory management and practice proper section ownership to ensure customers have access to the right stock to drive sales \n  Support with completing all tasks and duties within the store architecture, as assigned \n  Adhere to all company training and operational standards and procedures (education, merchandising, cleanliness, security, checklists etc.) \n  Ensure you are aware of all company communication, rollouts, directives and procedures \n  Abide by all company policies and programs, ensuring compliance \n  Adhere to all legislative requirements of cannabis retailers, including federal, provincial and municipal legislation \n  Complete tasks as assigned by the Store Manager, Assistant Store Manager and Key Leaders \n  \n Qualifications \n  \n  Minimum 1-3 years customer service experience, retail is preferred \n  Proven ability to drive positive customer experiences that build loyalty and deliver measurable results \n  Ability to manage competing priorities in a fast-paced environment \n  Strong verbal and written communication skills and excellent organizational skills \n  You are passionate about cannabis and are excited to bring it to market for recreational purposes \n  You are open to feedback and coaching \n  You demonstrate high levels of integrity and personal responsibility \n  You are trustworthy and customer-oriented \n  Bonus points if you’ve worked in a regulated environment before \n  \n Requirements \n  \n  Minimum age 19 years old or age as specified by the provincial government \n  Able to lift boxes 5-30 lbs \n  Must be flexible with hours of work and be comfortable with ever changing duties \n  Can Sell certification required \n  Criminal background check required \n  \n Tokyo Smoke welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process."
}