{
    "id": "d2550197ced40f5c",
    "company": "BWX Technologies",
    "positionName": "Quality Control Technician",
    "jobType": [],
    "location": "447 March Road, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-09-05T22:42:02.703Z",
    "url": "https://www.indeed.ca/rc/clk?jk=d2550197ced40f5c&from=jasx&tk=1hbkvuh1oj32s803&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=d2550197ced40f5c&atk=&xpse=SoDs67I3KaQAQJyAtZ0LbzkdCdPP",
    "companyDescription": "",
    "description": "BWXT Medical Ltd. provides its customers, who conduct life-saving medical procedures for patients around the world, the benefit of decades of experience in the development, manufacturing, packaging and delivery of medical isotopes and radiopharmaceuticals. Headquartered in Kanata, Ontario, BWXT Medical Ltd. employs over 300 highly-skilled people in Kanata and Vancouver, British Columbia. BWXT Medical Ltd. is part of the BWXT nuclear power segment (NPG) of BWX Technologies, Inc.\n  \n  \n \n \n  BWXT Medical Ltd., is hiring an \n  Quality Control Technician who has at least 2-years experience in chemistry and microbiology. This position is located at our production facility in Kanata, ON.\n  \n \n \n  Job Summary:\n  \n \n  Reporting to the Manager, Quality Assurance, the Quality Control Technician will perform quality control analyses of raw materials to finished product. \n  \n \n \n  Responsibilities:\n  \n \n  \n   \n    Perform quality control analysis of raw materials and final product.\n    \n  \n   \n    Perform routine monitoring of controlled systems and facilities.\n    \n  \n   \n    Perform specific administrative duties such as maintaining accurate records of observations, results and data evaluations. \n   \n  \n   \n    Follow ongoing production processes for conformance to operating procedures, product specification, GMP regulations and ISO standards.\n    \n \n \n \n  Qualifications:\n  \n \n  \n   \n    Technologist Diploma (3 yrs) or B.Sc. in a science discipline plus 2-5 years of relevant experience in chemistry or microbiology.\n    \n  \n   \n    Must possess excellent communication skills - both oral and written.\n    \n  \n   \n    Must possess excellent interpersonal skills.\n    \n  \n   \n    Must be able to perform in a team environment and be a dedicated team player. \n   \n  \n   \n    Must be able to work a variety of shifts as per the collective agreement, which includes regular scheduled weekend shifts.\n    \n \n \n \n  Other:\n  \n \n  This position is classified as a Nuclear Energy Worker. \n \n \n Why join BWXT Medical? \n \n  \n   \n    Work within the growing and exciting nuclear medicine industry as well as with highly skilled employees.\n    \n  \n   \n    Competitive salaries.\n    \n  \n   \n    Company match pension plan.\n    \n  \n   \n    Comprehensive health and dental benefits.\n    \n  \n   \n    Education Reimbursement Program.\n    \n  \n   \n    Life insurance.\n    \n  \n   \n    Collaborative work environment... and so much more!\n    \n \n \n BWXT Medical Ltd. embraces diversity of thought, values individuality, encourages new perspectives and provides equal opportunity in employment for all qualified employees and applicants without regard to race, national or ethnic origin, colour, religion, age, sex, sexual orientation, marital status, family status, disability, a conviction for which a pardon has been granted or a record suspended or any other category protected by federal law."
}