{
    "id": "dc624af204beb21d",
    "company": "Nordion",
    "positionName": "Product Manager",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-06T02:05:06.822Z",
    "url": "https://www.indeed.ca/rc/clk?jk=dc624af204beb21d&from=jasx&tk=1hc6geptqk7pr800&vjs=3",
    "externalApplyLink": "https://eftx.fa.us6.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1007/requisitions/preview/11890?source=Indeed.com",
    "companyDescription": "",
    "description": "In this role, reporting to the Director, Business Development & Strategic Supply, the Product Manager will be responsible for identifying new products and services to enhance Nordion’s value proposition for its Cobalt-60 and Production Irradiator customers, leveraging Nordion’s world-class capabilities in sealed source production and distribution, irradiator design and specialized software development. Over time, the role will be expanded to include products and services outside the core business, with a focus on strategic growth. The successful candidate will have strong overall business acumen, solid technical capabilities and a drive to position the company for long-term growth. \n Key Responsibilities \n \n  · Gather Voice of Customer (VOC) feedback, user requirements and broad market requirements \n \n \n  · Perform market research to establish market size, gaps and analyze the competitive landscape \n \n \n  · Establish product and services roadmaps, that consider and stage the introduction of new technologies and features, including the key elements of a new digital feature set. \n \n \n  · Develop Market Requirements Documents and Product Requirements Documents and help to prioritize such requirements. \n \n \n  · Build comprehensive business cases, including P&L and CapEx components \n \n \n  · Work with Engineering, Project Management, Commercial Operations and other key stakeholders to deliver new products and services \n \n \n  · Identify and execute on technology and other partnership opportunities related to new products and services \n \n \n  · Establish a New Product Introduction plan for each product and service \n \n \n  · Work with Marketing to develop a marketing plan and content to promote new products and services \n \n \n  · Act as a Product Evangelist for Nordion’s technology and services \n \n \n  · Work with the Strategic Growth Manager to support growth initiatives outside the core business \n \n Qualifications \n \n  · Normally a graduate engineering or other technical degree as well as an MBA \n \n \n  · Minimum 5 years experience in Product Management. Some strategic planning experience would be beneficial. \n \n \n  · Experience in a capital equipment manufacturing or a service industry would be an asset \n \n \n  · Familiarity with the gamma processing, pharmaceutical development or medical device sterilization industry would be an asset\n   \n \n \n  \n Skills and Competencies \n \n  · exceptional ability to think strategically, critically and creatively \n \n \n  · ability to identify opportunities and successfully pursue them \n \n \n  · able to leverage best practices to develop new processes \n \n \n  · ability to grasp unfamiliar technical concepts quickly \n \n \n  · experience interacting with a wide variety of internal and external stakeholders \n \n \n  · skill in synthesizing large amounts of data and information \n \n \n  · experience in establishing and managing partnerships \n \n \n  · can communicate effectively on technical and commercial basis at various levels in the organization \n \n \n  · ability to excel in a self-directed work team environment \n \n \n  · experience building detailed business cases \n \n \n  · strong interpersonal skills \n \n \n  · collaboration \n \n \n  · analytical skills \n \n \n  · proficient in Excel, PowerPoint, Microsoft Project, SharePoint, etc\n   \n \n \n Additional Requirements \n \n  · Occasional (10-20%) travel required, some international\n   \n \n \n  \n The successful candidate will exhibit uncompromising integrity and commitment to upholding corporate values. \n · Customer Focus – We are driven to fulfill our customers’ needs with the highest quality and care \n · People – We value our people who are part of a global team that is diverse, respectful, passionate and collaborative \n · Integrity – We are honest, reliable and accountable in everything we do \n · Safety – We are uncompromising in our commitment to health and well-being \n · Excellence – We exceed the expectations of our stakeholders and continue to improve and innovate in everything we do \n Nordion requires pre-employment screening to be accepted as cleared prior to start date. Background verification may include the possibility of FBI fingerprinting. \n We are committed to building a workplace that supports diversity and inclusiveness. We promote employment equity and encourage candidates to indicate voluntarily on their application if they are a woman, Aboriginal person, a person with a disability or a member of a visibility minority group. \n Thank you for your interest in our company, but only those applicants in consideration will be contacted. Please continue to visit our website for new opportunities."
}