{
    "id": "e0f3d21f39b0acde",
    "company": "LifeLabs",
    "positionName": "Medical Lab Assistant- Part Time",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-25T20:06:25.081Z",
    "url": "https://www.indeed.ca/rc/clk?jk=e0f3d21f39b0acde&from=jasx&tk=1he3lftbdk7tt800&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=e0f3d21f39b0acde&atk=&xpse=SoCK67I3IDjOcJSKHR0LbzkdCdPP",
    "companyDescription": "",
    "description": "LifeLabs is the largest community diagnostics laboratory in Canada, serving the healthcare needs of Canadians for over 50 years. Our team members are truly centred around our customers, and we know that behind every lab requisition, sample being tested, or investment in technology is an individual and their family counting on us. \n Consistently named one of Canada's Best Employers by Forbes, LifeLabs has also been recognized for having an award-winning Mental Health Program from Benefits Canada. The passion and commitment of over 6,000 diverse and innovative team members unites and motivates us to ensure our customers receive high quality tests and results that they can trust. Agile, customer-centred, caring and teamwork: we live these values every day in what we do to support our customers and healthcare providers, driving forward our vision of empowering a healthier you.\n  Make a difference – join the LifeLabs team today!\n  Looking for an interesting job where you can make a difference? Look no further. LifeLabs Medical Laboratory Services is a proud Canadian company with over 50 years’ experience. We provide laboratory testing services that help healthcare providers diagnose, treat, monitor and prevent disease in patients. LifeLabs is currently looking for a Medical Lab Assistant to join our team in Ottawa, ON.\n \n  As a Medical Lab Assistant you will play a key role in the testing and diagnostic process for a wide range of patients. This is a Part Time opportunity with up to 20 hours/week. LifeLabs also provides first aid training, continuing education opportunities, and excellent opportunities for career growth and advancement.\n \n  In this role you will:\n  \n \n \n   Unpack and sort a wide variety of incoming specimens received from sources including physicians, clinics, hospitals, and mobile LifeLabs technicians.\n   Confirm the accuracy of all patient information on requisitions and specimen samples, resolve any problems or inaccuracies prior to testing, and perform required data entry.\n   Prepare, sort & separate specimens for technical analysis.\n   Respond to client inquiries & work in cooperation with the logistics department\n   Train and orient new team members.\n   Perform weekly and monthly maintenance of laboratory equipment.\n   Conduct all work in full compliance with all laboratory safety and security policies and regulations.\n \n \n  The right person for this role is an organized and detail-oriented individual with good problem solving and customer service skills. Some key qualities include: flexibility, accountability, and attention to detail. Other requirements include:\n  \n \n \n   Successful completion or graduation from a recognized Medical Lab Assistant (MLA) program is an asset.\n   Ability to work in a fast-paced environment. Candidate must be detail oriented with the ability to focus, prioritize and multi-task.\n   Data entry and computer skills.\n   Committed to remaining current with company practices, training, policies & procedures\n   Prior experience in laboratory operations or medical terminology an asset.\n   Works well in a team environment.\n   Ability to communicate with other internal & external departments.\n   Ability to maintain the strictest standards of patient privacy and confidentiality.\n \n \n  We are looking for passionate individuals who share in the importance of our values: Caring, Customer Driven, Agile and One Team, and can live these values with us every day.\n \n  Grow your career with LifeLabs. Apply today.\n  At LifeLabs, we strive to create an inclusive and equitable workplace where our team members and the communities we serve feel accepted, valued, and respected.\n  In accordance with LifeLabs’ Accessibility Policy, the Accessibility for Ontarians with Disabilities Act, and the Ontario Human Rights Code, accommodations are available by request for candidates taking part in all aspects of the recruitment and selection process. For a confidential inquiry or to request an accommodation, please contact your recruiter or email careers@lifelabs.com. \n LifeLabs is committed to providing a safe environment for our employees, customers, and the communities we serve. We have been a leader throughout the COVID-19 pandemic regarding health and safety measures and have always put our employees and customers at the center of every decision that we make. As an organization in the health care sector, we believe the COVID vaccination adds a layer of protection that complements the extensive and necessary health and safety protocols that we have taken to date. With this in mind, we currently require all LifeLabs employees, contractors, students and volunteers to be fully vaccinated. \n LifeLabs operates under a distributed workforce model, where employee flexibility is a key priority. Further information will be provided during the interview process on what this means for employees."
}