{
    "id": "e466792d5da987c5",
    "company": "Accreditation Canada",
    "positionName": "Consultant Technologist, IQMH",
    "jobType": [
        "Permanent",
        "Full-time"
    ],
    "location": "1150 Cyrville Road, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-26T12:13:17.075Z",
    "url": "https://www.indeed.ca/rc/clk?jk=e466792d5da987c5&from=jasx&tk=1hl5dcuan2fci002&bb=meFSaZ2jpWfCb2DCBnnuQOJa5vCxtfI6S6SNSyIxkHQMhlIlO0oPQro-5nWlOxsjsBWK0kNq7TankIKnEJO0rN33L09oymXA5mfJOx8uBGGD--7tQQvW6A%3D%3D&xkcb=SoC267M3FlS8FtXIwZ0NbzkdCdPP&vjs=3",
    "externalApplyLink": "https://can232.dayforcehcm.com/CandidatePortal/en-US/healthstandards/Posting/View/876",
    "companyDescription": "Accreditation Canada delivers a wide range of high-impact assessment programs for health and social service organizations, powered by HSO, and customized to local needs. Accreditation Canada works with more than 900 expert peer surveyors with extensive health care and social services experience and trained in Accreditation Canada’s customized, continuous assessment program.",
    "description": "Terms: Full-time permanent \n  \n  \n   Salary: Commensurate with experience\n   \n  \n    Location: Ottawa (Hybrid Work Model) | Montreal (Hybrid Work Model) | Toronto (Hybrid Work Model) | Possibility of Remote\n  \n   \n   \n   \n  \n  \n   ABOUT THE ROLE:\n   \n  \n    The Consultant Technologist is a member of IQMH’s Proficiency Testing team. The Consultant Technologist is responsible for planning, designing, preparing, and coordinating IQMH’s proficiency testing models (Chemistry, Cytogenetics, Cytopathology, Hematology, Microbiology, Pathology, Point of Care Testing, and Transfusion Medicine). The Consultant Technologist analyzes statistical data from participating laboratories and presents summarized data, technical reports, and discordant findings investigations to the Scientific Committees for discussion, follow-up corrective actions, and committee comments.\n  \n   \n   \n  \n    Main Responsibilities:\n  \n   \n   \n   \n   Aligning PT activities with the ISO/IEC 17043 standard, the CT plans, designs, develops, validates, coordinates survey materials, and manages the delivery of PT surveys to participating laboratories in collaboration with Scientific Committees. \n   Utilizing various software tools (QView™ Office, QView™ Client, Paradigm), the CT develops and analyzes data and organizes the information in reports (Patterns of Practice, Survey Comments) to be reviewed at Scientific Committee meetings. \n   Plans, prepares reports, coordinates, and assists in the facilitation of PT meetings (Scientific Committee meetings, PT Survey Planning and Professional Advisory Committee (PAC) meetings, and internal/external audits). \n   Continuously monitors and manages the electronic documentation of participating laboratories' performance. \n   Collaborates with Scientific Committees to influence laboratory practices through publications and communications (abstracts, posters, consensus practice recommendations, educational outreach, and professional development courses). \n   Collaborates with and provides direction and support to internal and external clients. \n   Assist and possibly lead the delivery of additional PT programs defining program scope, goals, and deliverables.\n  \n   \n   \n  \n    Must Have Qualifications:\n   \n   \n   Medical Laboratory Technologist (MLT) obtained from an accredited Medical Laboratory Technology program. \n   Successful completion of the MLT certification exam provided by the Canadian Society of Medical Laboratory Science. \n   A member in good standing with CMLTO. \n   6 to 9 years as a general medical laboratory technologist with significant chemistry experience in a medical laboratory setting. \n   Ability to apply technical expertise to existing programs leading quality improvement initiatives. \n   Strong communication and meeting facilitation skills. \n   Strong customer service and client engagement skills \n   Strong skills with Microsoft 365 Office (especially Word and Excel)\n  \n   \n   \n  \n    Desired Qualifications:\n  \n   \n   \n   \n   Knowledge and understanding of quality control practice and associated statistics. \n   A good understanding and application of quality management systems and cause analysis. \n   Familiarity with risk management and contingency planning. \n   Strong project management skills\n  \n   \n   \n  \n    WHAT YOU CAN EXPECT:\n  \n   \n   \n  \n    In Your First 30-90 Days:\n  \n   \n  \n    \n  \n  \n   Complete our orientation program with other new hires to learn about HSO, our values of trust, inclusion, collaboration, innovation and learning, and our mission of quality improvement in healthcare and social services. \n   Set your performance and learning objectives for the year in collaboration with your people manager. \n   Meet regularly with your people manager to discuss your learning progression and alignment for your accountabilities. \n   Take on assigned initiatives or projects for your role.\n  \n   \n   \n  \n    What We Can Offer \n   To You\n  \n   \n   \n   \n   Hybrid work model. \n   Competitive compensation and benefits, including a defined benefit pension plan. \n   Time off programs, including office shutdown during last week of December. \n   Professional development support. \n   A culture that measures and values psychological safety, inclusion and engagement.\n  \n   \n   \n  \n    WHO WE ARE AND WHAT WE DO:\n   \n   Health Standards Organization (HSO) and our affiliates Accreditation Canada (AC) and the Institute for Quality Management in Healthcare (IQMH) are global, not-for-profit organizations. Together, we develop standards and deliver assessment programs and quality improvement solutions that have been adopted in over 12,000 locations across five continents. Our people-centered programs and services have been setting the bar for quality across the health ecosystem for 65 years. \n  Join us toward a future that will lead to “Safer Care and A Healthier World.” Let’s follow a mission together, where we “empower and enable people around the world to continuously improve quality of care.” \n   HSO is committed to fostering a culture of inclusion, diversity, equity and access, where all employees feel respected and valued and have an equal opportunity to achieve success. We encourage applications from Indigenous Peoples, people from diverse races, ethnicities and/or religions, persons with disabilities, people from gender diverse communities and/or people with intersectional identities. Please let us know how we can support you throughout the recruiting process, including through the provision of accommodations on request. \n   We are also proud to have been named as one of the Top 100 National Capital Region’s Top Employers in 2022 and 2023. \n \n \n  \n   \n    We are equal opportunity employer and are committed to the principles of Employment Equity. We encourage qualified applications from all genders, including visible minorities, Indigenous Peoples, and persons with disabilities. We thank all applicants for their interest; only those selected for an interview will be contacted. Accommodations are available on request for candidates taking part in all aspects of the selection process. To request accommodation, please email HR at HumanResources@healthstandards.org. For any queries related to recruitment please email at recruitment@healthstandards.org."
}