{
    "id": "e5b7c8b1c41955c3",
    "company": "Architecture49",
    "positionName": "Conservation Architect",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-18T05:11:20.696Z",
    "url": "https://www.indeed.ca/rc/clk?jk=e5b7c8b1c41955c3&from=jasx&tk=1hkikfdo3kecu801&bb=WxOhatT4U5HJji5qaEXltAWCd0ZCyRVwr6dLDaTW0U2zum3zs4PxIcLWzS5OgoZnBaoNWGrmxCoDymbmzJ9F_Y7H_KzXklEygrahFn-YOHUUBZuvlTLwiQ%3D%3D&xkcb=SoDM67M3FSgyYCQ9SB0FbzkdCdPP&vjs=3",
    "externalApplyLink": "https://emit.fa.ca3.oraclecloud.com/hcmUI/CandidateExperience/fr-CA/sites/CX_1004/job/53011?source=Indeed.ca",
    "companyDescription": "",
    "description": "Architecture49 is seeking a Conservation Architect to join our CENTRUS Centre Block Rehabilitation team located in downtown Ottawa. As a Conservation Architect you will be actively involved in progressing the heritage design scope and applying internationally recognized conservation best practices to advance design solutions in a multi-disciplinary environment. \n The Centre Block Rehabilitation Project is a complex long-term heritage renovation, rehabilitation, and rejuvenation project of national interest within the Parliamentary Precinct. Over the next several years, Centre Block will be extensively renovated to repair, upgrade and replace various crucial components of the building, influencing the way the Parliament works for the next 100 years. \n Architecture49 is a growing firm with promising career opportunities. Our offices, situated from coast to coast across Canada, serve distinct regions each with a local focus and sector specialties. We seek meaningful projects where we can build on our expertise and impact the communities in which we work. \n What we value… \n \n  Community Minded - Community aspirations are at the center of our work. We are committed to community stakeholder input on our projects to ensure our solutions are authentic to the values of each unique community in which we practice and contribute towards. \n  Environmental Responsibility – We are committed to operating our practice and delivering our projects within an environmentally considered framework. Our corporate operations will commit to reduce environmental impact. Our projects will define design strategies to reduce their environmental footprint and improve the health of their occupants. \n  Inclusion and Diversity – We are committed to providing a diverse and inclusive workplace where staff can work and thrive within an environment of safety, equity, and transparency. We care about building an inclusive culture that values individuals, our differences, flexibility, and work-life integration. \n  Design Excellence - We are committed to advanced design processes and outcomes, underpinned by our commitment to research-based solutions, use of advanced tools and technology, and continued training to staff. \n  Client-Centric - Our clients’ project goals and objectives are at the core of our design process. We are dedicated to understanding their value system, to garner their trust in our abilities, and to ensure we apply leading knowledge to advance their vision of their project. \n  Engagement & Collaboration - We believe in collaboration and accountability at all levels, with our clients and our teams. We follow through on our commitments and take personal ownership of our results. We are committed to shared values of engagement and inspiration built upon a foundation of equity, safety and belonging. \n \n A day in the life… \n The ideal candidate will assume, under the supervision of the Project Manager, the following responsibilities: \n \n  Preparation and coordination of construction/contract documents. \n  Participate in the coordination/management of internal and external consultants, and other stakeholders: execute coordination meetings, communicate directly with Project Manager, keep the team focused on required tasks, maintain design intent for the specific project. \n  Conduct heritage/conservation surveys and studies. \n  Report writing. \n  Conduct quality assurance and quality control on all project documents for compliance with office standards, client, stakeholder, and authorities' requirements. \n  Site review, supervision and follow-up during construction. \n  Other interesting challenges. \n \n What you’ll bring to A49… \n \n  University degree Architecture and specialised training and experience in Heritage Conservation. \n  5 years’ experience in Heritage Conservation. \n  Licensed in Ontario or have the ability to be licensed. \n  Proficient in Revit, and MS Office Suite. \n  Strong interpersonal skills – motivating, influencing the team to meet or exceed goals in a positive manner. \n  Experience working in multidisciplinary teams. \n  Ability to manage multiple files simultaneously. \n  Ability to work with autonomy, initiative, and rigour. \n  Knowledge of current codes and regulations. \n  Strong written and verbal communication skills in English. \n  Proficiency in French an asset (written and spoken) \n \n What we offer… \n \n  Permanent position of 37.5 hours. \n  Flexible schedule and hybrid work. \n  Competitive salary. \n  Flexible leave days. \n  Customizable comprehensive group insurance plan. \n  Telemedicine (24/7 access). \n  Group RRSP program. \n  Share purchase plan. \n  Reimbursement of professional dues. \n  Support for professional development and continuing education."
}