{
    "id": "e947ac2583801482",
    "company": "Perley-Robertson, Hill & McDougall",
    "positionName": "Bilingual Legal Assistant – Litigation",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-17T18:51:41.058Z",
    "url": "https://www.indeed.ca/rc/clk?jk=e947ac2583801482&from=jasx&tk=1hcvfkunqk7dc802&vjs=3",
    "externalApplyLink": "https://perlaw.ca/career/bilingual-legal-assistant-2/",
    "companyDescription": "",
    "description": "Posted: October 16, 2023 \n  The Bilingual Legal Assistant provides administrative support within a professional legal environment. The Bilingual Legal Assistant is responsible for coordinating a variety of administrative procedures to ensure a high standard of quality and client service. \n \n Key Responsibities \n \n  Preparation of correspondence and legal documentation including extensive editing and quality assurance \n  Preparation of pleadings to be filed with various courts. \n  Coordinate external and internal communication including mail, e-mail, fax and telephone calls \n  Address client inquiries as required \n  Develop and maintain strong working relationships with clients and various components of the legal system \n  Maintain client files \n  Daily preparation of dockets \n  Preparation of accounts \n  Coordinate and schedule meetings, conference calls and maintain agenda \n  Assist with other projects and support other departments as required \n \n \n Qualifications \n \n  Completed post-Secondary education in Office Administration – Legal, or Law Clerk diploma from a recognized post-secondary institute or suitable combination of education and litigation related experience \n  Minimum two years of law office experience in litigation \n  Good knowledge of Rules of Civil Procedure \n  Strong working knowledge of PC desktop tools such as word processing, spreadsheets, presentations, e-mail \n  Strong verbal and written communication skills \n  Strong interpersonal skills and professional presentation \n \n \n Skills Required \n \n  Ability to plan, organize and prioritize job tasks in order to meet tight deadlines \n  Ability to respond effectively and professionally to changes in schedules and priorities \n  Ability to ensure consistent attention to details \n  Ability to work independently within a team environment \n  Ability to exercise discretion when dealing with sensitive information \n  A positive, supportive and professional attitude \n  \n Interested applicants should apply in confidence to [email protected]."
}