{
    "id": "f1b09b83351a9731",
    "company": "GEMTEC Consulting Engineers and Scientists Limited.",
    "positionName": "Civil Laboratory Technician/ Technologist (23051)",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-09-01T06:50:43.180Z",
    "url": "https://www.indeed.ca/rc/clk?jk=f1b09b83351a9731&from=jasx&tk=1hbl00rvqkp1k800&vjs=3",
    "externalApplyLink": "https://gemtec.bamboohr.com/careers/109?source=indeed&src=indeed&postedDate=2023-07-06",
    "companyDescription": "",
    "description": "GEMTEC is a growing firm with offices throughout Atlantic Canada and Ontario, and we are looking for a motivated and skilled Lab Technician/Technologist to join our Team. GEMTEC management understands that creative, talented employees are assets, and that investing in employee development is an investment in our firm. We strive to have employees that are multi-faceted and versatile with a variety of skills.\n \n  We currently have an opening for a Laboratory Technician/Technologist in our Ottawa office.\n  \n  \n  The successful candidate will have the following:\n \n  Educational & Experience Requirements: \n  \n  College level diploma is considered an asset. \n  Experience with laboratory test procedures for soil, asphalt, concrete and aggregate considered an asset but not necessary as training will be provided. \n  Ability to work independently as well as part of a team. \n  Ability to meet tight deadlines and work well under pressure. \n  Strong multi-tasking, organization, and planning skills. \n  Proficient with Microsoft Office. \n  Maintain a clean working environment. \n  Possess ability to lift 30-50lbs on a daily basis.\n \n  \n  \n  Main Duties: \n  \n  Laboratory testing of aggregates, soil, concrete, and asphalt. \n  Various office, laboratory, and field tasks related to materials testing, geotechnical engineering, and environmental engineering. \n  Record test data and prepare factual reports, summaries, data sheets or graphs for interpretation of test results. \n  Performing other related duties as required. \n  Following all company Health, Safety and Environmental policies.\n \n  \n  \n  Other: \n  \n  Contract Position. \n  Providing proof of full vaccination against COVID-19 may be a condition of employment. Exceptions to this requirement will be considered on a case-by-case basis in relation to local health guidelines and/or client requirements/regulations.\n \n  \n  \n  Interested individuals, click here to apply: https://gemtec.bamboohr.com/careers/109\n \n  Thank you for taking the time to consider GEMTEC. Only candidates proceeding to the next phase of the application process will be contacted at this time. We encourage you to connect with us on LinkedIn, even if this opportunity isn’t for you, the next one might be!\n \n  Should you be selected for an interview and require accommodation of any kind, please kindly help us understand how we can help."
}