{
    "id": "f1d48cd6eeca388e",
    "company": "Stantec",
    "positionName": "Junior Electrical Technologist",
    "jobType": [],
    "location": "3001331 Clyde Avenue, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-17T18:53:44.205Z",
    "url": "https://www.indeed.ca/rc/clk?jk=f1d48cd6eeca388e&from=jasx&tk=1hcvfkunqk7dc802&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=f1d48cd6eeca388e&atk=&xpse=SoDh67I3JfXq2xQY6R0LbzkdCdPP",
    "companyDescription": "",
    "description": "Junior Electrical Technologist - ( 2300047J ) \n Description \n Stantec Buildings is on a mission to become the world’s leading integrated design practice. Our architects, engineers, interior designers, sustainability specialists, and technologists are passionate about the power of design. We take an innovative, collaborative approach to projects, sharing a common belief that sustainable design for the built environment can make the world a better place for future generations. Join us and design your place with Stantec. \n Your Opportunity \n An opportunity exists in Stantec's Ottawa, ON office for a highly motivated Junior Electrical Technologist to join our multidisciplinary team. In this role you will be working within an electrical engineering team towards the design and execution of projects ranging in size and complexity, with a focus on municipal, federal, industrial, healthcare, commercial and educational projects. \n Your Key Responsibilities \n As the successful candidate, your responsibilities may include but are not limited to: \n \n  Assist in the design of building related electrical systems including power distribution, lighting, communications, fire alarm and life safety systems across Canada using applicable codes, standards, and reference materials. \n  Prepare contract drawings, schematics, schedules, details, and sketches from conceptual design through to construction. \n  Produce aspects of electrical design and drawings in REVIT MEP, as well as in AutoCAD. \n  Review equipment selections, perform preliminary engineering calculations, and develop preliminary designs. \n  Facilitate and ensure the quality of the project deliverables. \n  Follow production guidelines and project standards to Stantec and Client drafting guidelines. \n  Perform field surveys for drawing developments, site reviews and as recorded drawings. \n  Communicate with other team members and become familiar with Stantec standards to complete assignments and projects in a timely manner as required by the Project Manager, Discipline Lead or Supervisor. \n \n Qualifications \n Your Capabilities and Credentials \n \n  Proficiency in Autodesk AutoCAD drafting and designing electrical project documents is required, Autodesk Revit® is preferred. \n  Knowledge and familiarity with National Building Codes, Canadian Electrical Code (CEC) and the Ontario Electrical Safety Code (OESC). \n  Excellent verbal and written skills to communicate effectively with colleagues and staff; a “team player” approach. \n  Self-motivated and self-starter with a strong work ethic. \n  Good time management skills and able to work in a fast-paced environment. \n  Eager to learn with strong listening, critical thinking, and problem-solving skills. \n  Ability to work in French is considered an asset. \n \n Education and Experience \n \n  Certificate or diploma in an engineering technology program. \n  Preference for a minimum of 1 year of design experience in a consulting engineering environment with strong knowledge and experience with building electrical systems. \n \n This description is not a comprehensive listing of activities, duties, or responsibilities that may be required of the employee, and other duties, responsibilities, and activities may be assigned or may be changed at any time with or without notice. \n Stantec is a place where the best and brightest come to build on each others' talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best. #DesignYourPlace \n Benefits Summary: Regular full-time and part-time employees will have access to health, dental, and vision plans, a well-being program, health care spending account, wellness spending accounts, group registered retirement savings plan, employee stock purchase program, group tax-free savings account, life and accidental death & dismemberment (AD&D) insurance, short-term/long-term disability plans, emergency travel benefits, tuition reimbursement, professional membership fee coverage, and paid time off. \n Temporary/casual employees will have access to group registered retirement savings plan, employee stock purchase program, and group tax-free savings account. \n The benefits information listed above may not apply to union positions because benefits for such positions are governed by applicable collective bargaining agreements. \n Primary Location : Canada-Ontario-Ottawa \n Organization : BC-1633 Buildings-CA Ottawa \n Employee Status : Regular \n Job Level : Individual Contributor \n Travel : Yes, 10 % of the Time \n Schedule : Full-time \n Job Posting : Oct 16, 2023, 1:35:23 PM \n Req ID: 2300047J \n Stantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans"
}