{
    "id": "f9f2cbd3e4fe99e0",
    "company": "Canadian Blood Services",
    "positionName": "Senior Epidemiologist",
    "jobType": [],
    "location": "1800 Alta Vista Drive, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-14T18:54:36.203Z",
    "url": "https://www.indeed.ca/rc/clk?jk=f9f2cbd3e4fe99e0&from=jasx&tk=1hcvfpdfukoko804&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=f9f2cbd3e4fe99e0&atk=&xpse=SoBW67I3JfXkg8SU3p0LbzkdCdPP",
    "companyDescription": "",
    "description": "Please Note: We work in a hybrid environment. The successful candidate will be working out of the 1800 Alta Vista Drive, Ottawa Ontario office for a minimum of 40% of the time to ensure we continue to meet the needs of our donors, our staff and our communities. Candidates in Ottawa or interested in relocating to Ottawa are encouraged to apply. Candidates with less experience are encouraged to apply and will be considered for other levels within our Epidemiology and Surveillance Group.\n \n  Job category: Innovation, research and science Job posting ID: 4527\n \n  Employment status: Regular full-time\n  Classification: PTS/MGT/IT B Salary/Rate of pay: $125,000 - $141,000\n \n  Application deadline: 2023-10-27\n \n  Do you currently work for Canadian Blood Services? All employees must apply via the internal career page.\n \n  Somewhere in Canada there’s a life you can save.\n \n  Be part of a dynamic, collaborative and caring organization committed to saving and improving the lives of Canadians. Thousands of Canadians depend on us every day for reliable access to blood, plasma, stem cells and organs and tissues.\n \n  Join Canada’s Lifeline and make a meaningful difference every day.\n \n  About The Role:  Canadian Blood Services is looking for a Regular Full-Time Senior Epidemiologist to join our Medical Affairs and Innovation Epidemiology & Surveillance Team. The work of an Epidemiologist is integral to Canadian Blood Services' role as Canada’s Lifeline. In this role, you will participate in the planning and designing of epidemiologic evaluations, providing advice and be responsible for data collection and management to support transfusion research activities.  Key Responsibilities Include:\n \n   Plans and designs research projects.\n   Prepares and maintains standard research protocols.\n   Develops study materials (e.g., develop and test questionnaires).\n   Conducts statistical analysis and provides interpretation of epidemiologic studies.\n   Responsible for the supervision of Research Associates and Research Assistants.\n   Maintains affiliations to a university and assists with Departmental supervision of graduate students and participation in meetings.\n   Participates in the peer-review process by reviewing grants and manuscripts.\n   Compiles information regarding new issues in transfusion epidemiology to support research and ongoing operations and to develop areas of research.\n   Prepares written reports and manuscripts.\n \n   Education, Training and Experience:\n \n   PhD in Epidemiology or related field.\n   At least 6 years of related experience.\n   Experience in a public health or pharmaceutical setting is an asset.\n \n \n  Demonstrated Knowledge, Skills and Abilities:\n \n   Publications in scientific journals.\n   Sound technical skills in statistical and epidemiological software.\n   Must be an effective team player.\n   Strong time management skills are essential.\n   Strong communication skills are essential.\n   Excellent writing skills are essential.\n \n   Benefits:\n \n   Competitive base salary range.\n   Annual Performance Award up to 10%.\n   4 weeks’ vacation to start.\n   Comprehensive extended health and benefits.\n   Defined Benefits Pension Plan.\n   Employee discounts, wellness programs and professional advancement opportunities.\n \n  Diversity and inclusion play a vital role in ensuring health equity for patients across Canada. We are committed to reflecting Canada’s population in our organization and fostering an environment where all employees can be their authentic selves, with equal opportunities to succeed and contribute.\n \n  Canadian Blood Services requires that all employees be fully vaccinated (COVID 19 vaccine doses as approved by Health Canada), subject to any medical or other human rights considerations. Persons who have been vaccinated outside of Canada must contact their local Public Health Unit in order to obtain a vaccine equivalency certificate.\n \n  If this role resonates with you, we encourage you to apply! This could be your first step towards a meaningful and inspiring career. Come to work each day knowing that you save lives.\n \n  We thank all applicants for their interest. However, only those considered for an interview or those invited to participate in an assessment (such as testing) will be contacted. Applicants who require accommodation should discuss their needs with us."
}