{
    "id": "fb7aa1c98f72866d",
    "company": "Eaton",
    "positionName": "Power Systems Engineering Specialist (Expert)",
    "jobType": null,
    "location": "26-2615 Lancaster Road, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-07T03:11:54.764Z",
    "url": "https://www.indeed.ca/rc/clk?jk=fb7aa1c98f72866d&from=jasx&tk=1hjm37mkfk628803&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/applystart?jk=fb7aa1c98f72866d&from=vj&pos=top&mvj=0&spon=0&sjdu=o7sfz71MPdMgyiV0LZq0d4DDplm6SwWjHcxyoDIphKncximS0Axs3rxWJuekWrS6fWwMDJaf-Gbuo0G-Vt4UT3nzOvf9_AmL3yiZm-iK9fdffyxsrz-HhqmEI0UX2uo9IU04G1ea6Gsor6376DSn9a2CZbRqXQXuiBWD1o7g6OMbwLZZa8SC-7EkUTR-fhyrw9_XINGINv7OnqX9-Wv1cg&vjfrom=serp&log=1&astse=aa9f74809d2005dc&assa=3332",
    "companyDescription": "",
    "description": "Eaton’s Electrical Engineering and Services Division is hiring a Power Systems Engineering Specialist (Expert) to join our team. This position will be located ideally out of our Milton, Ontario facility, but could also be located in one of our other Service centers throughout Canada.\n \n  \n   \n     What you’ll do: \n   \n   \n     The primary purpose of this position is to provide power systems expertise and applied engineering. The subject matter expert will provide technical consultation for customers in the areas of power systems studies, power quality analysis, substation design and training.  Eaton's Electrical Services & Systems team offers a comprehensive portfolio of services tailored for every stage of a power system’s life cycle—whether it’s design, build, or support. Our services integrate and optimize the elements of a power system to make sure it’s aligned with business goals. We can help keep your power system safe, efficient, reliable, and up-to-date.\n    \n      Eaton has the largest and most experienced team of power system engineers in the industry, with industry-standard software and advanced modeling and analysis capabilities at their fingertips. This team brings extensive skills and experiences to power system analysis and design. Active participation in technical societies such as IEEE and collaboration with a variety of utilities and industries ensures that our engineers are knowledgeable about today’s cutting edge engineering techniques. We assist customers at every stage of the power system: from substation and distribution system design to renewable energy and smart grid engineering, from safety and reliability-focused studies to power quality and grounding related audits and analyses.\n      \n      \n     In this function you will:\n      \n     \n      Provide applied engineering and technical consultation for customers in the areas of power systems studies, power quality analysis, substation design and training.\n      Self-management of assigned projects and job cost accountability to perform work within budgeted cost estimates.\n      Interpret specs and customer inquiries and design technical proposals and pricing for customers\n      Provide technical solutions to customers that may involve equipment design or upgrades, testing of equipment, solutions relating to increase safety, reliability, or efficiency\n      Ability to run major studies and projects unassisted\n      Mentor other engineers, as applicable\n     \n    \n   \n  \n  \n   \n     Qualifications: \n   \n   \n    \n      Basic (Required) Qualifications:\n      \n     \n      Bachelor's degree in Electrical Engineering\n      P.Eng. License\n      Minimum of 8 years of work experience in the electrical industry\n      Minimum of 5 years of work experience power systems\n      Legally authorized to work in the Canada without company sponsorship\n      \n      \n     Preferred Qualifications:\n      \n     \n      Bachelor Degree focused in electrical power systems or PHD\n      IEEE Senior Membership\n      Active in Local IEEE\n      Technical Paper Authorship\n      Active in Standards Development\n      Experience with protective relays is highly desirable\n      Experience using Power System modelling packages like SKM, ETAP, EazyPower, CYME etc\n      Advanced experience in multi-function protection relays setting files and logic files.\n      Experience in the following areas:\n      Short-Circuit Analysis, LV/MV Coordination\n      Arc Flash studies and mitigations\n      Ground grid design (sub stations)\n      Experience in testing, troubleshooting, evaluating, and servicing electrical distribution and control systems is highly desirable\n      Experience performing power quality measurements, troubleshooting, and analysis is highly desirable\n      Power Quality Measurements and Analysis\n      Harmonic Analysis\n      PLC / Automation\n      Alternate Energy\n      Knowledge of engineering standards including CSA, NEC, NESC, IEEE and ANSI\n      Design of Distribution System, Substation and Protection & Control\n     \n    \n   \n  \n  \n   \n     Skills: \n   \n   \n    \n     Customer Focus\n     Problem Solving\n     Action Oriented\n    \n   \n  \n \n  We are committed to ensuring equal employment opportunities for job applicants and employees. Our recruitment processes use balanced selection criteria and avoid unlawful discrimination against applicants on the basis of their age, colour, disability, marital status, national origin, gender, gender identity, genetic information, race or racial origin, religion, sexual orientation or any other status protected or required by law."
}