{
    "id": "396c1a4303f522e5",
    "company": "MicroDental Laboratories",
    "positionName": "Dental Lab Technician-Metal Finisher",
    "jobType": [],
    "location": "1956 Robertson Rd, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-09-12T22:42:15.215Z",
    "url": "https://www.indeed.ca/rc/clk?jk=396c1a4303f522e5&from=jasx&tk=1hbkvuh1oj32s803&vjs=3",
    "externalApplyLink": null,
    "job_info_group": {
        "extracted_phone_numbers": [],
        "extracted_links": [
            "HTTP/HTTPS Links",
            "General Links",
            "WWW Links",
            "TLDs"
        ],
        "extracted_emails": [],
        "extracted_location_data": [
            "ON Canada",
            "North America",
            "Ottawa"
        ],
        "extracted_dates": [
            "1 year",
            "5+ years",
            "120 days",
            "Friday",
            "Monday"
        ],
        "extracted_languages": [],
        "extracted_laws": [],
        "extracted_norps": [],
        "extracted_orgs": [
            "well organized Metal Finisher",
            "both MicroDental Laboratories",
            "MicroDental Laboratories",
            "fixed prosthodontics Primary Responsibilities & Skills",
            "our Centers",
            "Legendary Customer Care",
            "High School diploma or equivalent required MicroDental Laboratories",
            "Modern Dental Laboratory USA"
        ],
        "extracted_persons": [],
        "extracted_products": [],
        "extracted_money": [],
        "processed_text": "class rapidly grow global company strong benefit package great long term stability . operate location . focus Quality devoted build strong lasting relationship dentist team . determined high energy join team . qualified relevant eligible sign bonus Computer aid Design continuous employment . Company offer excellent compensation plan benefit include medical dental vacation holiday flexible working hour career advancement opportunitie Investments late technology exclusively focus cosmetic implant digital design prepare metal surface bond porcelain create artificial tooth small hand tool . remove excess metal porcelain polish surface prosthesis framework polishing machine . wax contour finish gold crown sit comfortably large bridge frame ensure proper seating rock Wax spew invest metal framework divest metal cast ring duty assign require qualification knowledge dental lab product material terminology technique prefer previous relevant field good productive mindset skillset Background foreknowledge dental implant high level attention detail exceptional quality standard strong communication skill excellent hand eye coordination utilize magnification goggle extended period Team player willingness learn responsibility Equal Affirmative Action employer . recruit qualified applicant regard race color religion gender age ethnic national origin veteran status physical mental genetic information sexual orientation preference gender identity marital status citizenship status . type benefit dental care extended health care Paid vision care schedule hour shift supplemental pay type sign bonus commute relocate k2h 5b9 reliably commute plan relocate start prefer application question salary expectation dental laboratory preferred location person"
    },
    "companyDescription": "",
    "description": "MicroDental Laboratories is a world-class, rapidly growing, global company with strong benefit packages and great long-term stability. We operate in over 25 locations in North America as both MicroDental Laboratories and Modern Dental Laboratory USA. With our focus on Quality, Value, and Legendary Customer Care, our Centers are devoted to building strong and lasting relationships with our dentists and their team members. We are looking for a determined, high energy, well organized Metal Finisher to join our team in Ottawa, ON Canada.\n*Qualified candidates with 5+ years of relevant experience are eligible for a sign on bonus of $1000 CAD, after 120 days of continuous employment.*\nOur Company has the following to offer:\n\n Excellent compensation plan with benefits including medical, dental, vacation and holidays\n Flexible working hours\n Career advancement opportunities\n Investments in the latest technology\n Exclusively focused in cosmetic, implant and digital design for fixed prosthodontics\n\nPrimary Responsibilities & Skills:\n\n Prepare metal surfaces for bonding with porcelain to create artificial teeth, using small hand tools.\n Remove excess metal or porcelain, and polish surfaces of prostheses or frameworks, using polishing machines.\n Have the ability to wax, contour, and finish gold crowns\n Can sit and comfortably work on large bridge frame to ensuring proper seating and no rocking\n Wax, spew and invest metal frameworks\n Divest metal from cast rings\n All other duties as assigned or as otherwise required\n\nQualifications:\n\n Knowledge of dental lab products, materials, terminology, and techniques preferred\n Previous experience in relevant field with a good productive mindset and skillset\n Background or foreknowledge of dental implants\n High level of attention to detail with exceptional quality standards\n Strong communication skills\n Excellent hand/eye coordination\n Ability to utilize magnification goggles for extended periods of time\n Team player is a must with a willingness to learn new responsibilities\n High School diploma or equivalent required\n\nMicroDental Laboratories and Modern Dental Laboratory USA are proud to be an Equal Opportunity/Affirmative Action employer. We recruit qualified applicants without regard to race, color, religion, gender, age, ethnic or national origin, veteran status, physical or mental disability, genetic information, sexual orientation or preference, gender identity, marital status, or citizenship status.\nJob Type: Full-time\nBenefits:\n\n Dental care\n Extended health care\n Paid time off\n Vision care\n\nSchedule:\n\n 8 hour shift\n Monday to Friday\n\nSupplemental pay types:\n\n Signing bonus\n\nAbility to commute/relocate:\n\n Ottawa, ON K2H 5B9: reliably commute or plan to relocate before starting work (preferred)\n\nApplication question(s):\n\n What are your salary expectations?\n\nExperience:\n\n dental laboratory: 1 year (preferred)\n\nWork Location: In person"
}