{
    "id": "0e76ddb2704081d9",
    "companyDescription": "",
    "description": "Description Medical laboratory technologists conduct medical laboratory tests, experiments and analyses to assist in the diagnosis, treatment, monitoring and prevention of disease. They are employed in medical laboratories in hospitals, blood banks, community and private clinics, research facilities and post-secondary educational institutions. Medical laboratory technologists who are supervisors are included in this unit group.\n  Job duties\n  \n \n  Set up, operate and maintain laboratory equipment \n  Conduct and interpret chemical analyses of blood, urine, and cerebrospinal and other body fluids \n  Study blood cells and other tissues to determine their relation to various physiological and pathological conditions \n  Prepare tissue sections for microscopic examinations using techniques to demonstrate special cellular tissue elements or other characteristics \n  Perform and interpret blood group, type and compatibility tests for transfusion purposes \n  Validate, document and report test results \n  Establish procedures for the analysis of specimens and for medical laboratory experiments \n  Conduct quality control assessment of testing techniques \n  May supervise and train other medical laboratory technical staff, students and helpers \n  May assist pathologists during autopsies.",
    "preprocessed_description": "Description Medical laboratory technologists conduct medical laboratory tests, experiments and analyses to assist in the diagnosis, treatment, monitoring and prevention of disease. They are employed in medical laboratories in hospitals, blood banks, community and private clinics, research facilities and post-secondary educational institutions. Medical laboratory technologists who are supervisors are included in this unit group. Job duties Set up, operate and maintain laboratory equipment Conduct and interpret chemical analyses of blood, urine, and cerebrospinal and other body fluids Study blood cells and other tissues to determine their relation to various physiological and pathological conditions Prepare tissue sections for microscopic examinations using techniques to demonstrate special cellular tissue elements or other characteristics Perform and interpret blood group, type and compatibility tests for transfusion purposes Validate, document and report test results Establish procedures for the analysis of specimens and for medical laboratory experiments Conduct quality control assessment of testing techniques May supervise and train other medical laboratory technical staff, students and helpers May assist pathologists during autopsies.",
    "processed_description": "Description medical laboratory technologist conduct medical laboratory test experiment analysis assist diagnosis treatment monitoring prevention disease . employ medical laboratory hospital blood bank community private clinic research facility post secondary educational institution . medical laboratory technologist supervisor include unit group . duty set operate maintain laboratory equipment Conduct interpret chemical analysis blood urine cerebrospinal body fluid study blood cell tissue determine relation physiological pathological condition prepare tissue microscopic examination technique demonstrate special cellular tissue element characteristic perform interpret blood group type compatibility test transfusion purpose document report test result procedure analysis specimen medical laboratory experiment conduct quality control assessment testing technique supervise train medical laboratory technical staff student helper assist pathologist autopsy .",
    "results_group": {
        "extracted_noun_chunks": [
            "medical laboratory test experiment analysis",
            "relation physiological pathological condition",
            "special cellular tissue element",
            "unit group",
            "medical laboratory hospital blood bank community private clinic research facility post secondary educational institution",
            "medical laboratory technologist supervisor",
            "train medical laboratory technical staff student helper",
            "Description medical laboratory technologist",
            "laboratory equipment Conduct",
            "quality control assessment testing technique",
            "diagnosis treatment monitoring prevention disease",
            "chemical analysis blood urine cerebrospinal body fluid study blood cell tissue",
            "pathologist autopsy",
            "tissue microscopic examination technique",
            "blood group type compatibility test transfusion purpose document report test result procedure analysis specimen medical laboratory experiment",
            "duty set operate"
        ],
        "combined_lemmatized_tokens": "Description medical laboratory technologist conduct medical laboratory test experiment analysis assist diagnosis treatment monitoring prevention disease . employ medical laboratory hospital blood bank community private clinic research facility post secondary educational institution . medical laboratory technologist supervisor include unit group . duty set operate maintain laboratory equipment Conduct interpret chemical analysis blood urine cerebrospinal body fluid study blood cell tissue determine relation physiological pathological condition prepare tissue microscopic examination technique demonstrate special cellular tissue element characteristic perform interpret blood group type compatibility test transfusion purpose document report test result procedure analysis specimen medical laboratory experiment conduct quality control assessment testing technique supervise train medical laboratory technical staff student helper assist pathologist autopsy ."
    }
}