{
    "id": "a416d20ba7abf8b8",
    "company": "Aramark",
    "positionName": "Data Entry Clerk - Finance",
    "jobType": [
        "Full-time"
    ],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-27T12:14:37.174Z",
    "url": "https://www.indeed.ca/rc/clk?jk=a416d20ba7abf8b8&from=jasx&tk=1hl5db43ij458800&bb=KvwRMHBYecBH_BhsdnvHhug2Dzm7THgbc4cWmaTGRftHPhFykzJUaUYewljHtF06X2DsA14d6Eu7WfgEtX2OdcjvqKO_3alkkV5yRvxI5oFP9xG2YcbtVA%3D%3D&xkcb=SoDI67M3FlSjXfRcgp0PbzkdCdPP&vjs=3",
    "externalApplyLink": "https://aramarkcareers.com/Canada/job/Ottawa-Data-Entry-Clerk-Finance-ON-K1S-5B6/1124537500/?feedId=339900&utm_source=Indeed&utm_campaign=Aramark_Indeed&jobPipeline=Indeed",
    "job_info_group": {
        "extracted_phone_numbers": [],
        "extracted_links": [
            "HTTP/HTTPS Links",
            "General Links",
            "WWW Links",
            "TLDs"
        ],
        "extracted_emails": [],
        "extracted_location_data": [],
        "extracted_dates": [
            "3 months"
        ],
        "extracted_languages": [],
        "extracted_laws": [],
        "extracted_norps": [],
        "extracted_orgs": [
            "the Finance Department",
            "Aramark Scholarship Program",
            "Twitter",
            "Facebook",
            "Instagram",
            "Aramark",
            "Employee Referral Program Training"
        ],
        "extracted_persons": [],
        "extracted_products": [],
        "extracted_money": [],
        "processed_text": "description report Finance Manager Data Entry Clerk responsible assist datum entry . offer Health Dental benefit employment employee Meal program allow eat discount price Employee Stock Purchase plan program development Position advancement opportunitie employee recognition program include service award strong focus safe healthy environment diverse inclusive workforce scholarship dependent employee Weekly Inventory Count datum entry Daily Sales data entry entering supplier invoice accounting system organize productivity report data entry duty require management filing scan organizing paperwork Previous Data Entry fast accurate keyboarding skill adhere confidentiality sensitive information independently minimal supervision strong organizational skill detail orient proficiency basic computer program Willingness learn upgrade skill Accommodations applicant request select position complete pass Criminal Background check . Aramark mission root service unite purpose strive great thing partner community planet . employee enjoy equal employment free participate aspect company . discriminate basis race color religion national origin age sex gender pregnancy sexual orientation gender identity genetic information military status protect veteran status characteristic protect applicable law . Aramark people proudly serve guest food facility uniform service country . root service unite purpose strive great thing partner community planet . career develop talent fuel passion empower professional growth . matter pursue challenge sense belong great place focus help reach potential . learn connect ."
    },
    "companyDescription": "We are a leading global provider of food, facilities and uniform services to education, healthcare, business and industry, and sports, leisure and corrections clients. Our core market is North America, which is supplemented by an additional 20-country footprint serving many of the fastest-growing global geographies.\r\n\r\nThrough our established brand, broad geographic presence and approximately 270,000 employees, we anchor our business in our partnerships with thousands of clients. Through these partnerships, we serve millions of consumers including students, patients, employees, sports fans and guests worldwide.\r\n\r\nThe scope and range of our services are evidenced by the following:\r\n\r\nWe provide services to 89% of the Fortune 500\r\nWe serve over 500 million meals annually to approximately 5 million students at colleges, universities, and K-12 schools\r\nWe service over 2,000 healthcare facilities, collectively representing over 75 million patient days annually\r\nWe cater to approximately 100 million sports fans annually through our partnerships with 149 professional and collegiate teams\r\nWe put over 2 million people in uniforms each day\r\nWe operate in 22 countries in North America, Europe, Asia and South America",
    "description": "Job Description\n  \n  \n    Reporting to the Finance Manager, the Data Entry Clerk will be responsible for assisting the Finance Department with data entry.\n  \n \n \n  \n    What We Offer\n  \n  \n   \n     Health and Dental benefits after 3 months of employment for full-time employees\n     Meal program allows you to eat at a discounted price\n     Employee Stock Purchase plan program\n     Employee Referral Program\n     Training and development\n     Position advancement opportunities\n     Employee recognition programs including service awards\n     Strong focus on a safe and healthy work environment\n     Diverse and inclusive workforce\n     Aramark Scholarship Program which gives scholarship opportunities for dependents of full-time employees \n   \n  \n \n \n  \n    About the Job\n  \n  \n   \n     Weekly Inventory Count data entry\n     Daily Sales data entry\n     Entering supplier invoices to accounting system\n     Organizing productivity reports\n     Other data entry duties required by management\n     Filing, scanning and organizing paperwork\n   \n  \n \n \n  \n    About You\n  \n  \n   \n     Previous Data Entry experience\n     Fast and accurate keyboarding skills\n     Ability to adhere to confidentiality when working with sensitive information\n     Ability to work independently and minimal supervision\n     Strong organizational skills and detail oriented\n     Proficiency in basic computer program\n     Willingness to learn and upgrade skills as needed\n     Accommodations for job applicants with disabilities are available upon request\n   \n    The selected candidate for this position will need to complete and successfully pass a Criminal Background Check.\n  \n \n \n  \n    About Aramark\n  \n  \n    Our Mission\n    Rooted in service and united by our purpose, we strive to do great things for each other, our partners, our communities, and our planet.\n   \n    At Aramark, we believe that every employee should enjoy equal employment opportunity and be free to participate in all aspects of the company. We do not discriminate on the basis of race, color, religion, national origin, age, sex, gender, pregnancy, disability, sexual orientation, gender identity, genetic information, military status, protected veteran status or other characteristics protected by applicable law.\n   \n    About Aramark\n    The people of Aramark proudly serve millions of guests every day through food, facilities, and uniform services in 19 countries around the world. Rooted in service and united by our purpose, we strive to do great things for each other, our partners, our communities, and our planet. We believe a career should develop your talents, fuel your passions, and empower your professional growth. So, no matter what you're pursuing - a new challenge, a sense of belonging, or just a great place to work - our focus is helping you reach your full potential. Learn more about working here at http://www.aramarkcareers.com or connect with us on Facebook, Instagram and Twitter."
}