{
    "id": "7e0b52d91edfe15d",
    "companyDescription": "",
    "description": "Compensation Pay Range:\n  $29.35-$36.05\n \n \n   Job Description:\n \n \n   Please Note: If you are a current CHEO employee with access to Workday, please apply to this posting via the Workday application as an internal applicant using the Jobs Hub.\n \n \n \n   To successfully apply for this position, please submit your application by 11:59 pm the day before the advertised closing date in the posting to ensure your application is received.\n \n \n \n   POSITION SUMMARY\n \n \n   The Administrative Coordinator coordinates the provision of administrative and clerical support while ensuring confidentiality and efficient conduct of business through the office. The Administrative Coordinator provides administrative support to the Director of the Regional Genetics Program, the Chief of the Department of Genetics and the Program Director of the Genetics Residency Program\n \n \n \n   MAIN RESPONSIBILITIES\n \n \n  \n   \n     Oversee work of other support staff as well as provide input into their performance appraisals and manage their schedules, coverage plans and vacation requests\n   \n  \n   \n     Coordinate the process related to recruitment/selection, performance appraisal and attendance enhancement including all relevant HR documentation\n   \n  \n   \n     Enter staff rotations and hours into StaffRight system (including requests for leave, vacation, sick time, professional development, etc.)\n   \n  \n   \n     Be aware of the Collective Agreements of the different Unions\n   \n  \n   \n     Prepare documentation for expense requests, professional development travel claims including ensuring all relevant signatures are obtained\n   \n  \n   \n     Process mileage claims for PSU staff\n   \n  \n   \n     Prepare requisitions\n   \n  \n   \n     Type/transcribe correspondence and format electronically based reports and correspondence; prepare spreadsheets; prepare presentations in PowerPoint, prepare documents for review.\n   \n  \n   \n     Prepare and send responses on routine correspondence; collate information and draft updates to reports and other documents;\n   \n  \n   \n     Review correspondence and/or reports for Director Signature and ensure appropriate grammar, completeness and accuracy.\n   \n  \n   \n     Analyse and prioritize incoming mail and documents, distribute appropriately.\n   \n  \n   \n     Receive and screen incoming calls, assess the urgency of calls, provide information as required to the caller, or refer the caller to the appropriate person.\n   \n  \n   \n     Prepare draft agendas for meetings, transcribe and distribute minutes. Ensure appropriate follow up action on items as required.\n   \n  \n   \n     Maintain calendar and schedule meetings, appointments and/or events; prepare necessary documentation for meetings, appointments and/or events; reschedule meetings, appointments or events based on availability to avoid conflict with competing and changing priorities.\n   \n  \n   \n     Make arrangements for meetings; schedule board and conference rooms, arrange or confirm attendance, prepare material and co-ordinate catering.\n   \n  \n   \n     Make travel and hotel arrangements for staff and visitor (e.g. visiting speakers, and prepare travel claims as required.\n   \n  \n   \n     Establish, develop and maintain various internal office support systems such as electronic databases, tracking systems, filing systems, monthly reports, BF systems, and confidential files.\n   \n  \n   \n     Supervise the ordering of office supplies as required\n   \n  \n   \n     Act as Program Administrator for the Genetics Residency Program.\n   \n  \n   \n     Maintain and update the Genetics pages on CHEOnet\n   \n  \n   \n     Act as the liaison for updates to the Genetics information posted on the CHEO website\n   \n  \n   \n     Perform other duties as assigned.\n   \n \n \n \n   QUALIFICATIONS\n \n \n  \n   \n     Criminal Records Check (Essential)\n   \n  \n   \n     College Diploma in Office Administration and/or University Degree. (Experience and formal training combined with demonstrated performance and ability may substitute for stipulated academic requirements.) (Essential)\n   \n  \n   \n     Minimum of three (3) years of relevant experience including experience in a more responsible administrative assistant role, including office management functions and/or previous supervisory experience. (Essential)\n   \n  \n   \n     Comprehensive use of software including word processing, spreadsheet, presentation, electronic mail. (Essential)\n   \n  \n   \n     Take accurate notes or minutes of meetings and transcribe to final product. (Essential)\n   \n  \n   \n     Use a voicemail system, photocopier, fax machine and scanner (Essential)\n   \n  \n   \n     Take steps to ensure timely completion of tasks by adjusting priorities as required. (Essential)\n   \n  \n   \n     Adapt to changes to meet organizational requirements. (Essential)\n   \n  \n   \n     Communicate effectively and concisely, both orally and in writing. (Essential)\n   \n  \n   \n     Research, collate, analyze and/or summarize information (Essential)\n   \n  \n   \n     Work independently (Essential)\n   \n  \n   \n     Deal effectively with internal and external customers (Essential)\n   \n  \n   \n     Exercise sound judgement, discretion and a high degree of confidentiality. (Essential)\n   \n  \n   \n     Bilingualism (French / English) (Preferred)\n   \n \n \n \n   Effective March 29, 2021, CHEO will conduct a more comprehensive pre-screening and evaluation process. This process may include more varied and multidimensional testing such as a written test, practical exam, or other assessment. All candidates who meet the essential and preferred qualifications may be tested.\n \n \n \n   CHEO values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants.\n \n \n \n   Should you require accommodation during any phase in the recruitment process, please contact Human Resources at \n  \n   jobs@cheo.on.ca\n  . All information received in relation to accommodation will be kept confidential and will be handled in compliance with the Accessibility for Ontarians with Disabilities Act.\n \n \n \n   We thank all those who apply, however, only those to be interviewed will be contacted.\n \n \n   Bilingualism (French/English) will be validated by a language proficiency assessment conducted by a third party provider. Candidates will be required to meet the minimum linguistic profile prior to the date of hire.\n \n \n \n   CHEO is committed to providing a safe environment for staff, patients, and visitors. Consistent with that commitment, all applicants must be fully vaccinated against COVID-19 to be considered for any staff or volunteer opportunities. Applicants are also strongly encouraged to receive their COVID-19 booster shots when eligible to protect against the spread of COVID-19. Upon hiring, presentation of government issued documentation confirming full vaccination must be provided, or presentation of supporting documentation of a valid medical contraindication or other reasonable consideration pursuant to the Ontario Human Rights Code..\n \n \n \n   Veuillez noter : si vous êtes actuellement un employé du CHEO ayant accès à Workday, veuillez postuler à cette offre via l'application Workday en tant que candidat interne.\n \n \n \n   Veuillez noter : pour postuler avec succès à ce poste, veuillez soumettre votre candidature avant 23 h 59 la veille de la date de clôture annoncée dans l'affichage pour vous assurer que votre candidature est reçue.\n \n \n \n   RÉSUMÉ DES FONCTIONS\n \n \n   Le ou la titulaire devra coordonner la prestation des services de soutien à l’administration et au secrétariat; veiller à ce que les fonctions administratives du bureau soient effectuées avec efficacité et confidentialité; agir à titre de soutien administratif pour la directrice du Programme régional de génétique, la chef du Service de génétique et la directrice du programme de résidence en génétique.\n \n \n \n   RESPONSABILITÉS PRINCIPALES\n \n \n  \n   \n     Superviser le travail des autres membres du personnel de soutien, contribuer à l’évaluation de leur rendement et gérer leur emploi du temps, les plans de remplacement et les demandes de vacances ;\n   \n  \n   \n     Coordonner le processus lié au recrutement/à la sélection, à l’évaluation du rendement et à l’amélioration de l’assiduité, y compris toute la documentation pertinente des RH ;\n   \n  \n   \n     Saisir les rotations et les heures du personnel dans le système StaffRight (notamment les demandes de congés, de vacances, de congés de maladie, de perfectionnement professionnel, etc.) ;\n   \n  \n   \n     Être au fait des conventions collectives des différents syndicats.\n   \n  \n   \n     Préparer les réquisitions pour les demandes de dépenses du personnel, les demandes de remboursement pour dépense de voyage dans le cadre de la formation continue et obtenir les signatures requises.\n   \n  \n   \n     Procéder aux demandes de remboursement de kilométrage pour le personnel de l’Unité.\n   \n  \n   \n     Préparer les réquisitions.\n   \n  \n   \n     Taper/transcrire la correspondance et mettre sous format électronique approprié les rapports et la correspondance; préparer les feuilles de calculs; préparer les présentations en Powerpoint, préparer les documents aux fins de révision.\n   \n  \n   \n     Préparer et envoyer les réponses à la correspondance de routine; colliger les renseignements et rédiger l’ébauche des mises à jour des rapports et d’autres documents.\n   \n  \n   \n     Revoir la correspondance et/ou les rapports avant de les donner à signer à la directrice et veiller à la correction grammaticale des textes. Vérifier s’ils sont complets et exacts.\n   \n  \n   \n     Analyser et décider de la priorité du courrier et des documents et les distribuer à qui de droit.\n   \n  \n   \n     Répondre aux appels téléphoniques et les filtrer en évaluant leur degré d’urgence, en donnant les renseignements demandés ou en les aiguillant vers la personne concernée.\n   \n  \n   \n     Préparer les ordres du jour provisoires des réunions, puis prendre des notes, rédiger et distribuer les procès-verbaux. Veiller à ce que les suivis soient dûment effectués.\n   \n  \n   \n     Tenir à jour le calendrier et l’horaire des réunions, des rendez-vous et des événements spéciaux; préparer la documentation nécessaire pour les réunions, rendez-vous et événements divers; changer les horaires en fonction des disponibilités des participants et afin d’éviter les conflits avec d’autres priorités ou en fonction des changements de priorités.\n   \n  \n   \n     Organiser des réunions, réserver des salles de réunion et de conférence, inviter et inscrire les participants, confirmer leur présence, préparer des documents et coordonner les services de restauration.\n   \n  \n   \n     Organiser les déplacements et réserver les chambres d’hôtel pour le personnel ; préparer les demandes de remboursement des dépenses selon les besoins.\n   \n  \n   \n     Établir, développer et entretenir divers systèmes internes de soutien du bureau tels que des bases de données, des systèmes de suivi, des systèmes de classement des dossiers, des rapports mensuels, des systèmes de rappel ainsi que des dossiers confidentiels.\n   \n  \n   \n     Superviser les commandes de fournitures de bureau selon les besoins.\n   \n  \n   \n     Administrer le programme de résidence en génétique.\n   \n  \n   \n     Tenir à jour les pages de CHEONet relatives à la génétique.\n   \n  \n   \n     Agir à titre de liaison pour les mises à jour de l’information sur la génétique affichées sur le site web du CHEO.\n   \n  \n   \n     Accomplir d’autres tâches à la demande de la superviseure.\n   \n \n \n \n   QUALIFICATIONS\n \n \n  \n   \n     Vérification du casier judiciaire (VCJ) (Essentiel)\n   \n  \n   \n     Diplôme en administration de bureau et/ou diplôme universitaire. On envisagera d’accepter un degré d’expérience et de formation officielle alliés à des capacités et un rendement manifestes au lieu des études exigées ci-contre. (Essentiel)\n   \n  \n   \n     Avoir une expérience pertinente d’au moins trois (3) années, notamment à assumer de plus en plus de responsabilités comme adjoint administratif, y compris des fonctions de gestion de bureau et/ou une expérience antérieure en supervision. (Essentiel)\n   \n  \n   \n     Maîtrise de logiciels, y compris traitement de texte, tableur, présentation et courrier électronique. (Essentiel)\n   \n  \n   \n     Prendre des notes précises ou rédiger des procès-verbaux de réunions et les transcrire sous forme de produit final. (Essentiel)\n   \n  \n   \n     Utiliser un système de messagerie vocale, une photocopieuse, un télécopieur et un numériseur (Essentiel)\n   \n  \n   \n     Prendre des mesures pour assurer l’accomplissement des tâches en temps opportun en ajustant les priorités selon les besoins (Essentiel)\n   \n  \n   \n     S’adapter aux changements pour répondre aux exigences de l’organisation (Essentiel)\n   \n  \n   \n     Communiquer de manière efficace et concise, à l’oral comme à l’écrit (Essentiel)\n   \n  \n   \n     Rechercher, rassembler, analyser et/ou résumer des informations (Essentiel)\n   \n  \n   \n     Travailler de manière autonome (Essentiel)\n   \n  \n   \n     Bilinguisme (français et anglais) (Préférable)\n   \n \n \n \n   À partir du 29 mars 2021, CHEO mènera un processus de présélection et d'évaluation plus complet. Ce processus peut comprendre des tests plus variés et multidimensionnels tels qu'un test écrit, un examen pratique ou une autre évaluation. Tous les candidats qui satisfont aux qualifications essentielles et préférées peuvent être testés.\n \n \n \n   CHEO valorise la diversité et est un employeur qui souscrit au principe de l’égalité d’accès. Nous nous sommes engagés à fournir un environnement de travail inclusif et sans obstacle, en commençant par le processus d’embauche et nous sommes heureux de recevoir des demandes provenant de tous les candidats qualifiés.\n \n \n   Si vous avez besoin de mesures d’adaptation pendant une phase du processus de recrutement, veuillez communiquer avec les Ressources humaines à \n  \n   jobs@cheo.on.ca\n  . Tous les renseignements reçus concernant les mesures d’adaptation resteront confidentiels et seront traités conformément à la \n  Loi sur l’accessibilité pour les personnes handicapées de l’Ontario.\n \n \n   Nous remercions toutes les personnes qui posent leur candidature; toutefois, nous ne communiquerons qu’avec celles qui seront convoquées à une entrevue.\n \n \n   La validation du bilinguisme (français-anglais) se fera au moyen d’une évaluation des compétences linguistiques menée par un fournisseur externe. Les candidats devront satisfaire au profil linguistique minimum de leur poste avant la date d’embauche.\n \n \n \n   CHEO s’engage à offrir un environnement sécuritaire au personnel, aux patients et aux visiteurs. Conformément à cet engagement, tous les candidats doivent être entièrement vaccinés contre la COVID-19 pour être considérés comme des candidats pour tout emploi de personnel ou de bénévole. Les candidats sont également fortement encouragés à recevoir leurs doses de rappel contre la COVID-19 lorsqu’ils sont admissibles pour éviter la propagation de COVID-19. Lors de l’embauche, la présentation de documents gouvernementaux confirmant la vaccination complète doit être fournie, ou la présentation de documents justificatifs d’une contre-indication médicale valide ou d’une autre considération raisonnable en vertu du Code des droits de la personne de l’Ontario.\n \n \n \n   CHEO values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants.\n \n \n \n   Should you require accommodation during any phase in the recruitment process, please contact Human Resources at jobs@cheo.on.ca. All information received in relation to accommodation will be kept confidential and will be handled in compliance with the Accessibility for Ontarians with Disabilities Act.\n \n \n \n   We thank all those who apply, however, only those to be interviewed will be contacted.\n \n \n \n   Job Posting End Date (if applicable):\n  January 8, 2024",
    "preprocessed_description": "Compensation Pay Range: $29.35-$36.05 Job Description: Please Note: If you are a current CHEO employee with access to Workday, please apply to this posting via the Workday application as an internal applicant using the Jobs Hub. To successfully apply for this position, please submit your application by 11:59 pm the day before the advertised closing date in the posting to ensure your application is received. POSITION SUMMARY The Administrative Coordinator coordinates the provision of administrative and clerical support while ensuring confidentiality and efficient conduct of business through the office. The Administrative Coordinator provides administrative support to the Director of the Regional Genetics Program, the Chief of the Department of Genetics and the Program Director of the Genetics Residency Program MAIN RESPONSIBILITIES Oversee work of other support staff as well as provide input into their performance appraisals and manage their schedules, coverage plans and vacation requests Coordinate the process related to recruitment/selection, performance appraisal and attendance enhancement including all relevant Human Resources documentation Enter staff rotations and hours into StaffRight system (including requests for leave, vacation, sick time, professional development, etc.) Be aware of the Collective Agreements of the different Unions Prepare documentation for expense requests, professional development travel claims including ensuring all relevant signatures are obtained Process mileage claims for PSU staff Prepare requisitions Type/transcribe correspondence and format electronically based reports and correspondence; prepare spreadsheets; prepare presentations in PowerPoint, prepare documents for review. Prepare and send responses on routine correspondence; collate information and draft updates to reports and other documents; Review correspondence and/or reports for Director Signature and ensure appropriate grammar, completeness and accuracy. Analyse and prioritize incoming mail and documents, distribute appropriately. Receive and screen incoming calls, assess the urgency of calls, provide information as required to the caller, or refer the caller to the appropriate person. Prepare draft agendas for meetings, transcribe and distribute minutes. Ensure appropriate follow up action on items as required. Maintain calendar and schedule meetings, appointments and/or events; prepare necessary documentation for meetings, appointments and/or events; reschedule meetings, appointments or events based on availability to avoid conflict with competing and changing priorities. Make arrangements for meetings; schedule board and conference rooms, arrange or confirm attendance, prepare material and co-ordinate catering. Make travel and hotel arrangements for staff and visitor (e.g. visiting speakers, and prepare travel claims as required. Establish, develop and maintain various internal office support systems such as electronic databases, tracking systems, filing systems, monthly reports, BF systems, and confidential files. Supervise the ordering of office supplies as required Act as Program Administrator for the Genetics Residency Program. Maintain and update the Genetics pages on CHEOnet Act as the liaison for updates to the Genetics information posted on the CHEO website Perform other duties as assigned. QUALIFICATIONS Criminal Records Check (Essential) College Diploma in Office Administration and/or University Degree. (Experience and formal training combined with demonstrated performance and ability may substitute for stipulated academic requirements.) (Essential) Minimum of three (3) years of relevant experience including experience in a more responsible administrative assistant role, including office management functions and/or previous supervisory experience. (Essential) Comprehensive use of software including word processing, spreadsheet, presentation, electronic mail. (Essential) Take accurate notes or minutes of meetings and transcribe to final product. (Essential) Use a voicemail system, photocopier, fax machine and scanner (Essential) Take steps to ensure timely completion of tasks by adjusting priorities as required. (Essential) Adapt to changes to meet organizational requirements. (Essential) Communicate effectively and concisely, both orally and in writing. (Essential) Research, collate, analyze and/or summarize information (Essential) Work independently (Essential) Deal effectively with internal and external customers (Essential) Exercise sound judgement, discretion and a high degree of confidentiality. (Essential) Bilingualism (French / English) (Preferred) Effective March 29, 2021, CHEO will conduct a more comprehensive pre-screening and evaluation process. This process may include more varied and multidimensional testing such as a written test, practical exam, or other assessment. All candidates who meet the essential and preferred qualifications may be tested. CHEO values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants. Should you require accommodation during any phase in the recruitment process, please contact Human Resources at jobs@cheo.on.ca . All information received in relation to accommodation will be kept confidential and will be handled in compliance with the Accessibility for Ontarians with Disabilities Act. We thank all those who apply, however, only those to be interviewed will be contacted. Bilingualism (French/English) will be validated by a language proficiency assessment conducted by a third party provider. Candidates will be required to meet the minimum linguistic profile prior to the date of hire. CHEO is committed to providing a safe environment for staff, patients, and visitors. Consistent with that commitment, all applicants must be fully vaccinated against COVID-19 to be considered for any staff or volunteer opportunities. Applicants are also strongly encouraged to receive their COVID-19 booster shots when eligible to protect against the spread of COVID-19. Upon hiring, presentation of government issued documentation confirming full vaccination must be provided, or presentation of supporting documentation of a valid medical contraindication or other reasonable consideration pursuant to the Ontario Human Rights Code.. Veuillez noter : si vous êtes actuellement un employé du CHEO ayant accès à Workday, veuillez postuler à cette offre via l'application Workday en tant que candidat interne. Veuillez noter : pour postuler avec succès à ce poste, veuillez soumettre votre candidature avant 23 h 59 la veille de la date de clôture annoncée dans l'affichage pour vous assurer que votre candidature est reçue. RÉSUMÉ DES FONCTIONS Le ou la titulaire devra coordonner la prestation des services de soutien à l'administration et au secrétariat; veiller à ce que les fonctions administratives du bureau soient effectuées avec efficacité et confidentialité; agir à titre de soutien administratif pour la directrice du Programme régional de génétique, la chef du Service de génétique et la directrice du programme de résidence en génétique. RESPONSABILITÉS PRINCIPALES Superviser le travail des autres membres du personnel de soutien, contribuer à l'évaluation de leur rendement et gérer leur emploi du temps, les plans de remplacement et les demandes de vacances ; Coordonner le processus lié au recrutement/à la sélection, à l'évaluation du rendement et à l'amélioration de l'assiduité, y compris toute la documentation pertinente des RH ; Saisir les rotations et les heures du personnel dans le système StaffRight (notamment les demandes de congés, de vacances, de congés de maladie, de perfectionnement professionnel, etc.) ; Être au fait des conventions collectives des différents syndicats. Préparer les réquisitions pour les demandes de dépenses du personnel, les demandes de remboursement pour dépense de voyage dans le cadre de la formation continue et obtenir les signatures requises. Procéder aux demandes de remboursement de kilométrage pour le personnel de l'Unité. Préparer les réquisitions. Taper/transcrire la correspondance et mettre sous format électronique approprié les rapports et la correspondance; préparer les feuilles de calculs; préparer les présentations en Powerpoint, préparer les documents aux fins de révision. Préparer et envoyer les réponses à la correspondance de routine; colliger les renseignements et rédiger l'ébauche des mises à jour des rapports et d'autres documents. Revoir la correspondance et/ou les rapports avant de les donner à signer à la directrice et veiller à la correction grammaticale des textes. Vérifier s'ils sont complets et exacts. Analyser et décider de la priorité du courrier et des documents et les distribuer à qui de droit. Répondre aux appels téléphoniques et les filtrer en évaluant leur degré d'urgence, en donnant les renseignements demandés ou en les aiguillant vers la personne concernée. Préparer les ordres du jour provisoires des réunions, puis prendre des notes, rédiger et distribuer les procès-verbaux. Veiller à ce que les suivis soient dûment effectués. Tenir à jour le calendrier et l'horaire des réunions, des rendez-vous et des événements spéciaux; préparer la documentation nécessaire pour les réunions, rendez-vous et événements divers; changer les horaires en fonction des disponibilités des participants et afin d'éviter les conflits avec d'autres priorités ou en fonction des changements de priorités. Organiser des réunions, réserver des salles de réunion et de conférence, inviter et inscrire les participants, confirmer leur présence, préparer des documents et coordonner les services de restauration. Organiser les déplacements et réserver les chambres d'hôtel pour le personnel ; préparer les demandes de remboursement des dépenses selon les besoins. Établir, développer et entretenir divers systèmes internes de soutien du bureau tels que des bases de données, des systèmes de suivi, des systèmes de classement des dossiers, des rapports mensuels, des systèmes de rappel ainsi que des dossiers confidentiels. Superviser les commandes de fournitures de bureau selon les besoins. Administrer le programme de résidence en génétique. Tenir à jour les pages de CHEONet relatives à la génétique. Agir à titre de liaison pour les mises à jour de l'information sur la génétique affichées sur le site web du CHEO. Accomplir d'autres tâches à la demande de la superviseure. QUALIFICATIONS Vérification du casier judiciaire (VCJ) (Essentiel) Diplôme en administration de bureau et/ou diplôme universitaire. On envisagera d'accepter un degré d'expérience et de formation officielle alliés à des capacités et un rendement manifestes au lieu des études exigées ci-contre. (Essentiel) Avoir une expérience pertinente d'au moins trois (3) années, notamment à assumer de plus en plus de responsabilités comme adjoint administratif, y compris des fonctions de gestion de bureau et/ou une expérience antérieure en supervision. (Essentiel) Maîtrise de logiciels, y compris traitement de texte, tableur, présentation et courrier électronique. (Essentiel) Prendre des notes précises ou rédiger des procès-verbaux de réunions et les transcrire sous forme de produit final. (Essentiel) Utiliser un système de messagerie vocale, une photocopieuse, un télécopieur et un numériseur (Essentiel) Prendre des mesures pour assurer l'accomplissement des tâches en temps opportun en ajustant les priorités selon les besoins (Essentiel) S'adapter aux changements pour répondre aux exigences de l'organisation (Essentiel) Communiquer de manière efficace et concise, à l'oral comme à l'écrit (Essentiel) Rechercher, rassembler, analyser et/ou résumer des informations (Essentiel) Travailler de manière autonome (Essentiel) Bilinguisme (français et anglais) (Préférable) À partir du 29 mars 2021, CHEO mènera un processus de présélection et d'évaluation plus complet. Ce processus peut comprendre des tests plus variés et multidimensionnels tels qu'un test écrit, un examen pratique ou une autre évaluation. Tous les candidats qui satisfont aux qualifications essentielles et préférées peuvent être testés. CHEO valorise la diversité et est un employeur qui souscrit au principe de l'égalité d'accès. Nous nous sommes engagés à fournir un environnement de travail inclusif et sans obstacle, en commençant par le processus d'embauche et nous sommes heureux de recevoir des demandes provenant de tous les candidats qualifiés. Si vous avez besoin de mesures d'adaptation pendant une phase du processus de recrutement, veuillez communiquer avec les Ressources humaines à jobs@cheo.on.ca . Tous les renseignements reçus concernant les mesures d'adaptation resteront confidentiels et seront traités conformément à la Loi sur l'accessibilité pour les personnes handicapées de l'Ontario. Nous remercions toutes les personnes qui posent leur candidature; toutefois, nous ne communiquerons qu'avec celles qui seront convoquées à une entrevue. La validation du bilinguisme (français-anglais) se fera au moyen d'une évaluation des compétences linguistiques menée par un fournisseur externe. Les candidats devront satisfaire au profil linguistique minimum de leur poste avant la date d'embauche. CHEO s'engage à offrir un environnement sécuritaire au personnel, aux patients et aux visiteurs. Conformément à cet engagement, tous les candidats doivent être entièrement vaccinés contre la COVID-19 pour être considérés comme des candidats pour tout emploi de personnel ou de bénévole. Les candidats sont également fortement encouragés à recevoir leurs doses de rappel contre la COVID-19 lorsqu'ils sont admissibles pour éviter la propagation de COVID-19. Lors de l'embauche, la présentation de documents gouvernementaux confirmant la vaccination complète doit être fournie, ou la présentation de documents justificatifs d'une contre-indication médicale valide ou d'une autre considération raisonnable en vertu du Code des droits de la personne de l'Ontario. CHEO values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants. Should you require accommodation during any phase in the recruitment process, please contact Human Resources at jobs@cheo.on.ca. All information received in relation to accommodation will be kept confidential and will be handled in compliance with the Accessibility for Ontarians with Disabilities Act. We thank all those who apply, however, only those to be interviewed will be contacted. Job Posting End Date (if applicable): January 8, 2024",
    "processed_description": "compensation pay Range description note current CHEO employee access apply posting Workday application internal applicant . apply position submit application advertise closing posting ensure application receive . position SUMMARY Administrative Coordinator coordinate provision administrative clerical support ensure confidentiality efficient conduct business office . Administrative Coordinator provide administrative support Director Chief Program Director Genetics Residency Program MAIN responsibility oversee support staff provide input performance appraisal manage schedule coverage plan vacation request coordinate process relate recruitment selection performance appraisal attendance enhancement include relevant Human Resources documentation enter staff rotation StaffRight system include request leave vacation sick professional development . aware documentation expense request professional development travel claim include ensure relevant signature process mileage claim PSU staff prepare requisition type transcribe correspondence format electronically base report correspondence prepare spreadsheet prepare presentation prepare document review . prepare send response routine correspondence collate information draft update report document review correspondence report Director Signature ensure appropriate grammar completeness accuracy . analyse prioritize incoming mail document distribute appropriately . receive screen incoming assess urgency provide information require caller refer caller appropriate person . prepare draft agenda meeting transcribe distribute minute . ensure appropriate follow action item require . maintain calendar schedule meeting appointment event prepare documentation meeting appointment event reschedule meeting appointment event base availability avoid conflict compete change priority . arrangement meeting schedule board conference room arrange confirm attendance prepare material ordinate catering . travel hotel arrangement staff visitor e.g. visit speaker prepare travel claim require . Establish develop maintain internal office support system electronic database tracking system file system monthly report confidential file . supervise ordering office supply . maintain update Genetics cheonet liaison update Genetics information post CHEO website perform duty assign . qualifications Criminal Records Check Essential College Diploma . formal training combine demonstrate performance substitute stipulate academic requirement . Essential minimum relevant include responsible administrative assistant role include office management function previous supervisory . essential comprehensive software include word processing spreadsheet presentation electronic mail . essential accurate note meeting transcribe final product . essential voicemail system photocopier fax machine scanner essential step ensure timely completion task adjust priority require . essential adapt change meet organizational requirement . essential Communicate effectively concisely orally writing . collate analyze summarize information essential independently essential deal effectively internal external customer essential exercise sound judgement discretion high degree confidentiality . Essential Bilingualism preferred effective conduct comprehensive pre screening evaluation process . process include varied multidimensional testing write test practical exam assessment . meet essential prefer qualification test . CHEO diversity equal employer . committed provide inclusive barrier free environment start hiring process interest qualified applicant . require accommodation phase recruitment process contact . information receive relation accommodation confidential handle compliance . apply interview contact . Bilingualism validate language proficiency assessment conduct party provider . require meet minimum linguistic profile prior hire . CHEO commit provide safe environment staff patient visitor . consistent commitment applicant fully vaccinate covid consider staff volunteer . applicant encourage receive covid booster shot eligible protect spread covid . hiring presentation government issue documentation confirm vaccination provide presentation support documentation valid medical contraindication reasonable consideration pursuant .. noter cette offre tant candidat interne . Veuillez noter pour veuillez soumettre votre candidature avant . DES fonction prestation des services soutien l'administration au secretariat confidentialite administratif pour directrice du programme residence genetique . responsabilites PRINCIPALES travail soutien contribuer l'evaluation leur rendement gerer leur emploi du temps les plan remplacement les demande vacance selection saisir les rotation les heures du personnel dans vacance . collective des syndicat . pour les demandes depenses du personnel les demandes remboursement pour continue obtenir les signature requise . Proceder aux demand remboursement kilometrage pour personnel l'Unite . Preparer les requisition . taper transcrire correspondance mettre sous format electronique approprie les rapports correspondance preparer les document aux fins revision . Preparer envoyer les reponse correspondance routine colliger les renseignements rediger l'ebauche des mise jour des rapports d'autres document . Revoir correspondance les rapport avant les donner signer directrice veiller correction des textes . sont complet exacts . Analyser des document les distribuer . repondre aux appels telephoniques les filtrer evaluant leur degre d'urgence . puis prendre des notes rediger distribuer les proces verbaux . Veiller ce les suivis soient dument effectues . Tenir jour calendrier l'horaire des reunions des rendez vous des evenement speciaux les reunion rendez vous evenement diver changer les horaire fonction des disponibilites des participant afin d'eviter les conflits . Organiser des reunions reserver des salles reunion conference inviter inscrire les participant confirmer leur presence preparer des documents coordonner les services restauration . . tel des basis des systemes suivi . . genetique . CHEONet relative . titre liaison pour les mise jour l'information sur genetique affichees sur site web du CHEO . demande superviseure . qualification VCJ Essentiel Diplome administration bureau diplome universitaire . envisagera d'accepter degre d'experience formation officielle allies exigees ci contre . Essentiel Avoir une pertinente d'au annees responsabilites comme adjoint administratif compris des fonction gestion bureau une anterieure supervision . Essentiel Maitrise logiciels compris traitement texte tableur presentation courrier electronique . Essentiel Prendre des notes precises les transcrire sous forme produit final . Essentiel Utiliser systeme messagerie vocale numeriseur Essentiel Prendre des mesures pour assurer l'accomplissement des tache temp opportun Essentiel s'adapter aux changement pour concise l'oral comme l'ecrit Essentiel Rechercher rassembler analyser resumer des information Essentiel Travailler maniere autonome Essentiel Bilinguisme francais anglais CHEO menera processus preselection d'evaluation complet . Ce processus peut comprendre des test varie multidimensionnels tel qu'un test ecrit examen pratique une autre evaluation . Tous les candidats satisfont aux qualifications essentielles testes . CHEO valorise diversite est employeur souscrit au principe l'egalite d'acces . nous nous sommes engages fournir environnement travail inclusif sans obstacle commencant par nous provenant tous les candidats qualifie . Si vous avez besoin mesures d'adaptation pendant une phase du processus recrutement humaine . Tous les renseignements recus concernant les mesures d'adaptation resteront seront traites conformement Loi sur l'accessibilite pour . nous remercion tout les personnes posent leur candidature toutefois nous ne communiquerons qu'avec celles seront convoquees une entrevue . francais anglais se fera evaluation des competences linguistiques externe . Les candidats . personnel aux patient aux visiteur . Conformement cet engagement tous les candidats doivent etre entierement vaccines contre COVID pour etre consideres comme des candidats pour . candidats recevoir leurs doses rappel contre COVID admissible pour eviter propagation covid . confirmant vaccination complete raisonnable . CHEO diversity equal employer . committed provide inclusive barrier free environment start hiring process interest qualified applicant . require accommodation phase recruitment process contact . information receive relation accommodation confidential handle compliance . apply interview contact . posting applicable",
    "results_group": {
        "extracted_noun_chunks": [
            "noter cette offre tant candidat interne",
            "candidats recevoir leurs doses rappel contre COVID",
            "concise l'oral comme l'ecrit Essentiel Rechercher rassembler analyser resumer des information Essentiel Travailler maniere autonome Essentiel Bilinguisme francais anglais CHEO",
            "calendar schedule meeting appointment event",
            "relevant Human Resources documentation",
            "final product",
            "office supply",
            "duty assign",
            "recruitment selection performance appraisal attendance enhancement",
            "schedule coverage plan vacation request coordinate process",
            "interview contact",
            "essential comprehensive software",
            "rediger distribuer les proces verbaux",
            "des fonction gestion bureau",
            "qualified applicant",
            "travel claim",
            "DES fonction prestation des services soutien l'administration au secretariat confidentialite administratif",
            "reasonable consideration",
            "response",
            "tel des basis des systemes suivi",
            "aware documentation expense",
            "internal office support system electronic database tracking system file system monthly report confidential file",
            "superviseure",
            "Veuillez noter",
            "appropriate follow action item",
            "document aux fins revision",
            "applicant",
            "nous nous sommes",
            "Si vous avez besoin mesures d'adaptation pendant",
            "provision administrative clerical support",
            "staff rotation StaffRight system",
            "spreadsheet",
            "vaccination",
            "collate analyze",
            "affichees sur site web du CHEO",
            "urgency",
            "position submit application advertise closing posting",
            "Proceder aux demand remboursement kilometrage",
            "Organiser des reunions",
            "Essentiel s'adapter aux changement",
            "d'acces",
            "incoming mail document",
            "Essentiel Maitrise logiciels compris",
            "les filtrer evaluant leur degre d'urgence",
            "current CHEO employee access",
            "personnel",
            "attendance",
            "covid",
            "des documents coordonner les services restauration",
            "party provider",
            "compliance",
            "les demandes depenses du personnel les demandes remboursement pour",
            "Essential minimum relevant",
            "titre liaison",
            "request leave vacation sick professional development",
            "phase du processus recrutement",
            "CHEONet relative",
            "word",
            "Ce processus peut comprendre des test",
            "essential accurate note meeting",
            "valorise diversite est employeur souscrit au principe l'egalite",
            "distribute minute",
            "safe environment staff patient visitor",
            "anterieure supervision",
            "inclusive barrier free environment",
            "travail soutien contribuer l'evaluation leur rendement gerer leur emploi du temps les plan remplacement les demande vacance selection saisir les rotation les heures du personnel",
            "academic requirement",
            "covid booster",
            "varied multidimensional testing write test practical exam assessment",
            "document review",
            "Genetics information post CHEO website",
            "Essential Bilingualism",
            "appropriate grammar completeness accuracy",
            "presentation government issue documentation",
            "language proficiency assessment",
            "essential Communicate",
            "SUMMARY Administrative Coordinator",
            "essential prefer qualification test",
            "speaker",
            "eviter propagation covid",
            "francais anglais se",
            "Bilingualism",
            "Tous les renseignements recus concernant les mesures d'adaptation resteront seront traites",
            "presentation",
            "Workday application internal applicant",
            "eligible protect",
            "timely completion task",
            "COVID pour etre consideres comme des candidats",
            "assurer l'accomplissement des tache temp",
            "les mise jour l'information",
            "directrice du programme residence genetique",
            "allies exigees ci contre",
            "approprie les rapports correspondance",
            "material",
            "electronic mail",
            "caller",
            "fournir environnement travail inclusif sans obstacle commencant par nous provenant tous les candidats qualifie",
            "les reunion rendez vous evenement diver changer les horaire fonction des disponibilites des participant afin d'eviter les conflits",
            "traitement texte tableur presentation courrier electronique",
            "conflict compete change priority",
            "Loi sur l'accessibilite pour",
            "collective des syndicat",
            "minimum linguistic profile",
            "obtenir les signature requise",
            "consistent commitment applicant",
            "CHEO",
            "relation accommodation",
            "taper transcrire correspondance mettre sous format",
            "organizational requirement",
            "Range description",
            "requisition type transcribe correspondence format",
            "Essentiel Prendre des notes",
            "puis prendre des notes",
            "screen incoming",
            "documentation meeting appointment event reschedule meeting appointment event base availability",
            "confidentiality efficient conduct business office",
            "essential adapt change",
            "application",
            "sont complet exacts",
            "information",
            "repondre aux appels telephoniques",
            "accommodation phase recruitment process contact",
            "electronically base report correspondence",
            "evaluation process",
            "veuillez soumettre votre candidature avant",
            "draft agenda meeting",
            "Preparer les requisition",
            "support staff",
            "performance substitute",
            "travel hotel arrangement staff visitor",
            "administrative support Director Chief Program Director Genetics Residency Program MAIN responsibility",
            "aux visiteur",
            "PSU staff",
            "process interest",
            "position",
            "office management function",
            "responsabilites PRINCIPALES",
            "arrangement meeting schedule board conference room",
            "Les candidats",
            "patient",
            "essential independently essential deal effectively internal external customer essential exercise sound judgement discretion high degree confidentiality",
            "Tous les candidats satisfont aux qualifications essentielles testes",
            "Analyser des document les distribuer",
            "leur presence",
            "input performance appraisal",
            "Preparer envoyer les reponse correspondance routine colliger les renseignements rediger l'ebauche des mise jour des rapports d'autres document",
            "priority require",
            "responsible administrative assistant role",
            "previous supervisory",
            "diversity equal employer",
            "qualifications",
            "Administrative Coordinator",
            "conference inviter inscrire les participant",
            "caller appropriate person",
            "test ecrit examen pratique une autre evaluation",
            "essential voicemail system photocopier fax machine scanner essential step",
            "Veiller ce les suivis soient dument effectues",
            "menera processus preselection d'evaluation",
            "routine correspondence collate information draft update report document review correspondence report Director Signature",
            "process",
            "Tenir jour calendrier l'horaire des reunions des rendez vous des evenement speciaux",
            "nous remercion tout les personnes posent leur candidature toutefois nous ne communiquerons qu'avec celles seront convoquees une entrevue",
            "Revoir correspondance les rapport avant les donner signer directrice veiller correction des textes",
            "fera evaluation des competences linguistiques",
            "vacance",
            "qualification VCJ Essentiel Diplome administration bureau",
            "spreadsheet presentation",
            "genetique",
            "professional development travel claim",
            "sur genetique"
        ],
        "combined_lemmatized_tokens": "compensation pay Range description note current CHEO employee access apply posting Workday application internal applicant . apply position submit application advertise closing posting ensure application receive . position SUMMARY Administrative Coordinator coordinate provision administrative clerical support ensure confidentiality efficient conduct business office . Administrative Coordinator provide administrative support Director Chief Program Director Genetics Residency Program MAIN responsibility oversee support staff provide input performance appraisal manage schedule coverage plan vacation request coordinate process relate recruitment selection performance appraisal attendance enhancement include relevant Human Resources documentation enter staff rotation StaffRight system include request leave vacation sick professional development . aware documentation expense request professional development travel claim include ensure relevant signature process mileage claim PSU staff prepare requisition type transcribe correspondence format electronically base report correspondence prepare spreadsheet prepare presentation prepare document review . prepare send response routine correspondence collate information draft update report document review correspondence report Director Signature ensure appropriate grammar completeness accuracy . analyse prioritize incoming mail document distribute appropriately . receive screen incoming assess urgency provide information require caller refer caller appropriate person . prepare draft agenda meeting transcribe distribute minute . ensure appropriate follow action item require . maintain calendar schedule meeting appointment event prepare documentation meeting appointment event reschedule meeting appointment event base availability avoid conflict compete change priority . arrangement meeting schedule board conference room arrange confirm attendance prepare material ordinate catering . travel hotel arrangement staff visitor e.g. visit speaker prepare travel claim require . Establish develop maintain internal office support system electronic database tracking system file system monthly report confidential file . supervise ordering office supply . maintain update Genetics cheonet liaison update Genetics information post CHEO website perform duty assign . qualifications Criminal Records Check Essential College Diploma . formal training combine demonstrate performance substitute stipulate academic requirement . Essential minimum relevant include responsible administrative assistant role include office management function previous supervisory . essential comprehensive software include word processing spreadsheet presentation electronic mail . essential accurate note meeting transcribe final product . essential voicemail system photocopier fax machine scanner essential step ensure timely completion task adjust priority require . essential adapt change meet organizational requirement . essential Communicate effectively concisely orally writing . collate analyze summarize information essential independently essential deal effectively internal external customer essential exercise sound judgement discretion high degree confidentiality . Essential Bilingualism preferred effective conduct comprehensive pre screening evaluation process . process include varied multidimensional testing write test practical exam assessment . meet essential prefer qualification test . CHEO diversity equal employer . committed provide inclusive barrier free environment start hiring process interest qualified applicant . require accommodation phase recruitment process contact . information receive relation accommodation confidential handle compliance . apply interview contact . Bilingualism validate language proficiency assessment conduct party provider . require meet minimum linguistic profile prior hire . CHEO commit provide safe environment staff patient visitor . consistent commitment applicant fully vaccinate covid consider staff volunteer . applicant encourage receive covid booster shot eligible protect spread covid . hiring presentation government issue documentation confirm vaccination provide presentation support documentation valid medical contraindication reasonable consideration pursuant .. noter cette offre tant candidat interne . Veuillez noter pour veuillez soumettre votre candidature avant . DES fonction prestation des services soutien l'administration au secretariat confidentialite administratif pour directrice du programme residence genetique . responsabilites PRINCIPALES travail soutien contribuer l'evaluation leur rendement gerer leur emploi du temps les plan remplacement les demande vacance selection saisir les rotation les heures du personnel dans vacance . collective des syndicat . pour les demandes depenses du personnel les demandes remboursement pour continue obtenir les signature requise . Proceder aux demand remboursement kilometrage pour personnel l'Unite . Preparer les requisition . taper transcrire correspondance mettre sous format electronique approprie les rapports correspondance preparer les document aux fins revision . Preparer envoyer les reponse correspondance routine colliger les renseignements rediger l'ebauche des mise jour des rapports d'autres document . Revoir correspondance les rapport avant les donner signer directrice veiller correction des textes . sont complet exacts . Analyser des document les distribuer . repondre aux appels telephoniques les filtrer evaluant leur degre d'urgence . puis prendre des notes rediger distribuer les proces verbaux . Veiller ce les suivis soient dument effectues . Tenir jour calendrier l'horaire des reunions des rendez vous des evenement speciaux les reunion rendez vous evenement diver changer les horaire fonction des disponibilites des participant afin d'eviter les conflits . Organiser des reunions reserver des salles reunion conference inviter inscrire les participant confirmer leur presence preparer des documents coordonner les services restauration . . tel des basis des systemes suivi . . genetique . CHEONet relative . titre liaison pour les mise jour l'information sur genetique affichees sur site web du CHEO . demande superviseure . qualification VCJ Essentiel Diplome administration bureau diplome universitaire . envisagera d'accepter degre d'experience formation officielle allies exigees ci contre . Essentiel Avoir une pertinente d'au annees responsabilites comme adjoint administratif compris des fonction gestion bureau une anterieure supervision . Essentiel Maitrise logiciels compris traitement texte tableur presentation courrier electronique . Essentiel Prendre des notes precises les transcrire sous forme produit final . Essentiel Utiliser systeme messagerie vocale numeriseur Essentiel Prendre des mesures pour assurer l'accomplissement des tache temp opportun Essentiel s'adapter aux changement pour concise l'oral comme l'ecrit Essentiel Rechercher rassembler analyser resumer des information Essentiel Travailler maniere autonome Essentiel Bilinguisme francais anglais CHEO menera processus preselection d'evaluation complet . Ce processus peut comprendre des test varie multidimensionnels tel qu'un test ecrit examen pratique une autre evaluation . Tous les candidats satisfont aux qualifications essentielles testes . CHEO valorise diversite est employeur souscrit au principe l'egalite d'acces . nous nous sommes engages fournir environnement travail inclusif sans obstacle commencant par nous provenant tous les candidats qualifie . Si vous avez besoin mesures d'adaptation pendant une phase du processus recrutement humaine . Tous les renseignements recus concernant les mesures d'adaptation resteront seront traites conformement Loi sur l'accessibilite pour . nous remercion tout les personnes posent leur candidature toutefois nous ne communiquerons qu'avec celles seront convoquees une entrevue . francais anglais se fera evaluation des competences linguistiques externe . Les candidats . personnel aux patient aux visiteur . Conformement cet engagement tous les candidats doivent etre entierement vaccines contre COVID pour etre consideres comme des candidats pour . candidats recevoir leurs doses rappel contre COVID admissible pour eviter propagation covid . confirmant vaccination complete raisonnable . CHEO diversity equal employer . committed provide inclusive barrier free environment start hiring process interest qualified applicant . require accommodation phase recruitment process contact . information receive relation accommodation confidential handle compliance . apply interview contact . posting applicable"
    }
}