{
    "id": "4c0d1dcfdfa90da6",
    "company": "Stantec",
    "positionName": "Construction Site Inspector",
    "jobType": [],
    "location": "3001331 Clyde Avenue, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-18T05:11:41.463Z",
    "url": "https://www.indeed.ca/rc/clk?jk=4c0d1dcfdfa90da6&from=jasx&tk=1hkikfdo3kecu801&bb=WxOhatT4U5HJji5qaEXltOLfU0EaXtZlfgkpZ7DRpS80VC95ZgbOivagAx_Aq5lEwbcpCjZ9FLh-OVfloZXO0SJFs-ykG4GxcGG1HVH7gNG0pBR_eMfRdA%3D%3D&xkcb=SoAf67M3FSgyYCQ9SB0MbzkdCdPP&vjs=3",
    "externalApplyLink": "https://stantec.jobs/ottawa-on/construction-site-inspector/A0C2E55B61DE403AA35906C170273383/job/?vs=1554&utm_source=Indeed-DE&utm_medium=Job%20Aggregator&utm_campaign=Indeed",
    "companyDescription": "",
    "description": "Construction Site Inspector - ( 2400006A ) \n Description \n We create great places and the connections that get people and goods moving—whether by car, bus, train, plane, or their own two feet. Working within the context of the communities we serve, we provide planning, engineering, and infrastructure management services that fit the needs of our clients and improve the overall transportation experience. Join our team and help us keep communities connected. \n Your Opportunity \n Stantec’s Transportation Team provides planning, design and construction administration services for roadway, highway, transit/rail, bridge and related projects. We are currently seeking a self-motivated Construction Site Inspector to conduct field work to complement our Ottawa transportation team on projects in the City of Ottawa. This position will work on transportation\\municipal infrastructure engineering projects that may include site inspection and construction contract management of municipal roads. \n Imagine being part of a dynamic team that designs innovative solutions for our diverse set of clients. The Construction Site Inspector will work under close supervision of a Contract Administrator to develop skills in civil works related to roadway design construction, on-site field review and inspections and contract documents. The ideal candidate has the ability to solve complex problems using sound professional judgement, creativity, and innovation including effective coordination of internal and external constituents, demonstrated experience on various construction projects, effective meeting facilitation skills and strong knowledge of regulatory requirements. \n Your Key Responsibilities \n As a Construction Site Inspector in our Ottawa Transportation Group, you will be responsible for assisting project managers, project engineers and construction administrators in the following areas: \n \n  Actively participate on the project engineering team to complete inspections and assist with contract administration duties on municipal infrastructure construction projects. \n  Provide on-site construction inspection and quality assurance inspections services for municipal, transportation, and structural, projects to ensure compliance with contract documents. \n  Provide ongoing communications with the contractor, the contract administrator, the owner and other relevant stakeholders regarding construction progress, deficiencies, complaints, and other daily activities. \n  Interpret requirements and details of contract drawings and specifications. \n  Monitor and record contract work including preparing daily diaries and processing project progress claims and change orders. \n  Obtain and record field information of construction details for the development of as-built drawings. \n  Work under the direction of the Senior Engineer, or Contract Administrator. \n  Quantity measurements for preparation of payment certifications. \n  Daily reporting and participation in construction meetings. \n  Completion of construction as-builts. \n  Liaison with local residents affected by construction projects. \n  Liaising with contractors and other stakeholders. \n \n Qualifications \n Your Capabilities and Credentials \n \n  Prior experience working on City of Ottawa municipal infrastructure projects or MTO projects. \n  Thorough understanding of sewer, watermain, and road construction materials, methods, and processes. \n  Thorough understanding of construction survey layout. \n  Thorough understanding of current traffic control regulations and Book 7. \n  Thorough understanding of Ontario Provincial Standards and Specifications (OPSS) for Municipal projects. \n  Knowledge of sewer, watermain, and road construction materials, methods, and processes. \n  The ability to survey using GPS is considered an asset. \n  Strong interpersonal and communication skills. \n  Ability to work well in a team environment. \n  Able to work on weekends, nights, shift work, additional hours as required. \n  Proficiency with MS Office. \n  A valid Ontario driver's license and access to a reliable vehicle. \n \n Education and Experience \n \n  A post secondary diploma or degree in Civil Engineering or Civil Engineering Technology / Technician or equivalent is an asset. \n  Designation as determined by OACETT as a Road Construction Senior Inspector (rcsi) or Road Construction Junior Inspector (rcji) is an asset. \n  5 years of site inspection experience. \n \n Candidate will work primarily in the field on construction sites undertaking construction inspection for roadway contract projects within the City of Ottawa. \n This description is not a comprehensive listing of activities, duties or responsibilities that may be required of the employee and other duties, responsibilities and activities may be assigned or may be changed at any time with or without notice. \n Stantec is a place where the best and brightest come to build on each other's talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best. \n Benefits Summary: Regular full-time and part-time employees will have access to health, dental, and vision plans, a well-being program, health care spending account, wellness spending accounts, group registered retirement savings plan, employee stock purchase program, group tax-free savings account, life and accidental death & dismemberment (AD&D) insurance, short-term/long-term disability plans, emergency travel benefits, tuition reimbursement, professional membership fee coverage, and paid time off. \n Temporary/casual employees will have access to group registered retirement savings plan, employee stock purchase program, and group tax-free savings account. \n The benefits information listed above may not apply to union positions because benefits for such positions are governed by applicable collective bargaining agreements. \n Primary Location : Canada-Ontario-Ottawa \n Organization : BC-1636 Transpt-CA Ontario East & Atlantic \n Employee Status : Regular \n Job Level : Individual Contributor \n Travel : Yes, 25 % of the Time \n Schedule : Full-time \n Job Posting : Jan 17, 2024, 9:28:23 AM \n Req ID: 2400006A \n Stantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans"
}