{
    "id": "83c13675e21a6970",
    "company": "Isologic Innovative Radiopharmaceuticals",
    "positionName": "Delivery Driver (Radiopharmaceutical) - Full time",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-07T02:03:39.321Z",
    "url": "https://www.indeed.ca/rc/clk?jk=83c13675e21a6970&from=jasx&tk=1hc6gclvdih64800&vjs=3",
    "externalApplyLink": null,
    "job_info_group": {
        "extracted_phone_numbers": [
            " 613-761-5370",
            "613-761-5370"
        ],
        "extracted_links": [
            "HTTP/HTTPS Links",
            "General Links",
            "WWW Links",
            "TLDs"
        ],
        "extracted_emails": [],
        "extracted_location_data": [],
        "extracted_dates": [],
        "extracted_languages": [],
        "extracted_laws": [],
        "extracted_norps": [],
        "extracted_orgs": [
            "RRSP",
            "Isologic Innovative Radiopharmaceuticals",
            "CDA Job Types: Permanent"
        ],
        "extracted_persons": [
            "Georgina Avila",
            "Curriculum Vitae"
        ],
        "extracted_products": [],
        "extracted_money": [
            {
                "amount": "20.00",
                "noun_phrases": []
            }
        ],
        "processed_text": "industry leader preparation delivery nuclear medicine position courier driver . Customer Delivery Associate delivery driver support pharmacy operation handle packaging deliver radiopharmaceutical . KEY responsibility ESSENTIAL FUNCTIONS Delivery pharmaceutical medical test company vehicle uniform provide assist task require laboratory position short long distance REQUIRED qualification valid driver's license clean abstract shift stagger start early accommodate shift change base business lift pound previous delivery drive handling transport pharmaceutical radioactive material asset . training provide pay . interested position send Facility Manager . equal employer . select interview contact . salary hour benefit dental care insurance Employee assistance program extended health care Life insurance site parking match vision care schedule shift supplemental pay type overtime pay covid consideration health safety employee priority measure track employee symptom wear mask social distancing lab common area follow reduce risk contract virus . location road"
    },
    "companyDescription": "",
    "description": "Isologic Innovative Radiopharmaceuticals, the industry leader in preparation and delivery of nuclear medicines, has an immediate position available as a full time courier driver.\nAs a Customer Delivery Associate (delivery driver), you will support pharmacy operations by handling, packaging and delivering radiopharmaceuticals.\nKEY RESPONSIBILITIES/ESSENTIAL FUNCTIONS\n\n Delivery of pharmaceuticals and medical tests using company vehicles (uniform provided)\n Assist with tasks required in the laboratory\n Full-time position\n Short and long distance runs available\n\nREQUIRED QUALIFICATIONS\n\n Valid G driver’s license and clean abstract\n Ability to work shifts that have staggered start times beginning as early as 4am through 8am\n Ability to accommodate shift changes based on business needs\n Ability to lift 50 pounds\n\nPrevious delivery driving experience and/or handling and transporting pharmaceuticals or radioactive materials would be an asset. All training will be provided and paid for by Isologic Innovative Radiopharmaceuticals.\nIf you are interested in this position, please send you CV as quickly as possible ou please call Georgina Avila, Facility Manager, at 613-761-5370.\nWe are an equal opportunity employer. Only those selected for an interview will be contacted.\n#CDA\nJob Types: Permanent, Full-time\nSalary: $20.00 per hour\nBenefits:\n\n Dental care\n Disability insurance\n Employee assistance program\n Extended health care\n Life insurance\n On-site parking\n RRSP match\n Vision care\n\nSchedule:\n\n 8 hour shift\n\nSupplemental pay types:\n\n Overtime pay\n\nCOVID-19 considerations:Health and safety of our employees is a priority and measures to track employee symptoms and wearing masks and social distancing in the lab as well as in the common areas are being followed to reduce the risk of contracting the virus.\nWork Location: On the road"
}