{
    "id": "c96504ea7fc0988e",
    "company": "Merrick & Company",
    "positionName": "Architect III",
    "jobType": [
        "Full-time"
    ],
    "location": "580 Terry Fox Drive, Kanata, ON",
    "salary": null,
    "postingDateParsed": "2024-01-06T03:12:44.248Z",
    "url": "https://www.indeed.ca/rc/clk?jk=c96504ea7fc0988e&from=jasx&tk=1hjm39h30jroo800&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/applystart?jk=c96504ea7fc0988e&from=vj&pos=top&mvj=0&spon=0&sjdu=o7sfz71MPdMgyiV0LZq0d4DDplm6SwWjHcxyoDIphKm4A0bXAsj-D8VVjDLXWT7naS7Vkd4T5oCvxaHEHbWJfZu6dA8If-lNgGjatAXn0P4ZJI_uTczwm4gC3dsEtp31Vb45GxqCObhTpYWN33_Ah5SinkMDLctViHU0V7xl9VPXUjDEoU0ewLxN6Hr1twlyw9_XINGINv7OnqX9-Wv1cg&vjfrom=serp&astse=990f30e0ee2e4cba&assa=3901",
    "companyDescription": "",
    "description": "Overview: \n  Merrick & Company is seeking an experienced Life Sciences Laboratory Planner / Architect to lead the architectural design of projects as part of a multi-disciplinary team. This person will be located in our Ottawa, Ontario Canada office. Client projects for this position require Canadian Citizenship.\n  Merrick is an internationally known multi-office and multi-discipline firm consisting of a diverse, dedicated and talented staff which has achieved design excellence throughout its 60+ years of existence. With offices worldwide, Merrick and Company has been ranked as one of the top 100 design firms by Engineering News Record. Merrick provides personalized services to various clients throughout the world.\n  Candidates that have a desire for personal and professional growth, a well-defined understanding of design and construction document processes, and adaptability for short term and long-term projects in an environment that requires a blend of creativity and high technical skills. Successful candidates must be self-starting, motivated, innovative, articulate, self-disciplined, and confident in a demanding, exciting, and fast-paced environment. This position requires a competent laboratory planner / architect who will be responsible for all phases of architectural production and BIM for a variety of Life Sciences projects ranging from programming through construction administration. This includes interpreting, organizing, executing, and coordinating the design and production effort for one or more large or complex projects.\n  Job Description \n We are looking for lab planner / architectural candidates with experience in all aspects of life science and containment laboratory design for government, academic, and private clients\n \n   Licensure as an Architect in [United States or Canada] is strongly preferred.\n   If the candidate is not currently licensed, they must demonstrate a plan and ability to obtain licensure within two years of joining Merrick.\n   Candidate shall be experienced in all aspects of life science architectural practice including planning, programming, schematic design, production of construction documents (drawings and specifications), and construction administration.\n   Be responsible for handling major design decisions, involving spatial, aesthetic elements, detailing of materials and coordination of engineered building systems.\n   Must be able to manage architectural projects and demonstrate skills in a multi-disciplinary team environment.\n   Must be willing to work in a design team environment, including directing and mentoring the work of junior architects and designers, and delegating work as required.\n   Perform building code reviews and writes reports such as feasibility studies, condition reports and recommendations.\n   Will ensure internal communication and coordination of design efforts occurs.\n   Will coordinate all support activities required to complete all design efforts and quality assurance processes.\n   Work with other disciplines to ensure accuracy of the package, meet schedule, and budget commitments and meet expectations for attendance and punctuality.\n   Meet with clients to prepare and/or validate proposed scope of work.\n   Responsible for project cost control.\n \n  Required Experience \n \n  Seven (7) years minimum experience as a Life Science Laboratory Planner / Architect.\n   Registered architect in the United States or Canada, if not currently registered, must be able to demonstrate how they will become registered within two years of hire\n   Skilled written and verbal communication with demonstrated proposal and report writing experience\n   Strong problem solving skills. This role requires an individual capable of applying a wide range of knowledge of architectural principles and practices among multiple clients and projects\n   Ability to facilitate and support design charrettes\n   Experience in all phases of design, with track record of completed, successful projects\n   Proficient working in Revit, AutoCAD, 3D modeling programs (Sketch Up & Revit preferred) and Adobe Creative Suite\n   Skilled in MS Office, Adobe Acrobat, and PowerPoint\n   Local candidates preferred\n   Client projects for this position require U.S. or Canadian Citizenship \n  Client projects for this position requires the ability and willingness to obtain U.S. and/or Canadian government security clearances\n \n  Required knowledge, skills, and abilities \n \n  Life Science and/or Containment Laboratory project experience preferred\n   Ability to visually communicate concepts to Clients\n   Demonstrated ability to effectively create presentations and communicate concepts to clients and associates using various software applications.\n   Ability to communicate clearly and concisely, both verbally and in writing\n   Ability to work effectively within a collaborative team environment\n   Ability to complete tasks with accuracy and with strong attention to detail\n   Ability to consistently meet deadlines, completing tasks as previously defined\n   Ability to travel as needed\n   Ability to write and edit specifications\n \n  Job Specific Responsibilities \n \n  Attending client meetings and making presentations to clients\n   Leading design and development of projects\n   Perform Code Reviews\n   Redline projects\n   Create and manage schedule and budgets for projects\n   Mentor junior staff and oversee their professional development \n \n Physical Requirements\n \n   The job requires the ability to sit for extended periods at a computer workstation.\n   Ability to perform site and field visits to review existing electrical systems and observe construction\n   Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n   The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.\n \n  Additional information\n \n   Apply online only. No e-mail, hard copy or third-party resumes accepted.\n   Merrick & Company offers a competitive compensation and benefits package which includes; RRSP, unique work-life benefits, continuing education and training through the Merrick Learning Institute. We recognize the importance of developing top talent from within, our employees have access to a wide range of internal and external training as well as coaching and peer mentoring programs.\n   We recognize the importance of developing top talent from within, our employees have access to a wide range of internal and external training and coaching programs and are rewarded for their achievements through excellent benefits and competitive salaries.\n   An Equal Opportunity Employer, including disability/vets."
}