{
    "id": "afe5cc641b5f5fef",
    "company": "Rimkus Consulting Group Canada",
    "positionName": "Mechanical Engineer",
    "jobType": [],
    "location": "38 Antares Drive, Nepean, ON",
    "salary": null,
    "postingDateParsed": "2024-01-20T05:08:43.876Z",
    "url": "https://www.indeed.ca/rc/clk?jk=afe5cc641b5f5fef&from=jasx&tk=1hkik8vp5k633800&bb=3fcFSWL0Q64YUe5hx9GNdu8cfa_cOMTm_0maKB1s10AG85nON0vhaUBq6xbhw6CDpsKl4JWlVYxQJYeQSGv6ibZZNxbpq1Svvd07mQ-QDSBVKKnckQ9iDw%3D%3D&xkcb=SoAY67M3FSgsJ0AB1z0JbzkdCdPP&vjs=3",
    "externalApplyLink": null,
    "job_info_group": {
        "extracted_phone_numbers": [],
        "extracted_links": [
            "HTTP/HTTPS Links",
            "General Links",
            "WWW Links",
            "TLDs"
        ],
        "extracted_emails": [],
        "extracted_location_data": [
            "Ontario",
            "Nepean",
            "Rimkus",
            "Summary Rimkus"
        ],
        "extracted_dates": [
            "8 years",
            "Monday"
        ],
        "extracted_languages": [
            "English"
        ],
        "extracted_laws": [],
        "extracted_norps": [
            "not required French"
        ],
        "extracted_orgs": [
            "quality assurance testing Review",
            "employer-matching RRSP",
            "Vision care Flexible Language Requirement",
            "required Requirements & Qualifications Bachelor's",
            "an experienced Mechanical Engineer",
            "Mechanical Engineering",
            "Major Duties & Responsibilities Apply"
        ],
        "extracted_persons": [
            "P. Eng"
        ],
        "extracted_products": [],
        "extracted_money": [
            {
                "amount": "80,000.00-$99,000.00",
                "noun_phrases": []
            }
        ],
        "processed_text": "currently seek broad design residential commercial HVAC system . general knowledge energy modelling residential construction asset . return talent effort offer employee competitive benefit package – include medical dental vision life insurance insurance flexible schedule advancement . technical knowledge design hvac plumbing system exist building assist client extend life cycle MEP system establish maintenance operation procedure complete diligence assessment exist mechanical system perform energy audits exist storm system roofing project site drainage rehabilitation Design modification exist storm system meet roof drainage requirement support client's commissioning retro commission effort manage project simultaneously detail orient assign duty task degree P.Eng . license license additional province Minimum relevant write verbal skill excellent proficiency AutoCAD Microsoft Office Suite possess maintain valid driver's license personal vehicle attend site effectively independently team environment demonstrate willingness flexible adaptable change priority motivating multi task maintain strong attention detail business integrity professionalism physical carry ladder safely height power tool equipment investigation require evening weekend instruct management vehicle suitable carry ladder tool apply note submission review consider interview contact . equal employer . accommodation applicant select interview . indeed2 type permanent salary benefit dental care insurance Extended health care Life insurance RRSP match require Schedule hour shift Friday Weekends education Bachelor Degree preferred mechanical engineering require Licence Certification . require class Licence require location hybrid remote 7V2"
    },
    "companyDescription": "",
    "description": "Summary\nRimkus is currently seeking an experienced Mechanical Engineer with broad experience in the design of residential and commercial HVAC systems. A general experience and knowledge with energy modelling for residential construction would be an asset.\nIn return for your talent and effort, we offer our full-time employees a competitive benefits package – including medical, dental, vision, life insurance, disability insurance, employer-matching RRSP, a flexible work schedule and opportunities for advancement.\nMajor Duties & Responsibilities\n\n Apply technical knowledge to design HVAC and plumbing systems for new and existing buildings\n Assist clients in extending the life cycle of their MEP systems by establishing maintenance and operations procedures\n Complete due diligence assessments of existing mechanical systems\n Perform energy audits and quality assurance testing\n Review of existing storm systems as part of re-roofing projects and site drainage rehabilitation\n Design modifications to existing storm systems to meet roof drainage requirements\n Support our client’s commissioning and retro-commissioning efforts\n Manage several projects simultaneously and be detail oriented\n Other assigned duties and tasks, as required\n\nRequirements & Qualifications\n\n Bachelor’s degree in Mechanical Engineering with P.Eng. license in Ontario, with the ability to become licensed in additional provinces\n Minimum 8 years of relevant experience\n Written and verbal English skills must be excellent\n Proficiency with AutoCAD and Microsoft Office Suite\n Must possess and maintain valid driver’s license and personal vehicle for attending work sites\n Ability to work effectively both independently and in a team environment\n Demonstrated willingness to be flexible and adaptable to changing priorities\n Self-motivating and ability to multi-task while maintaining a strong attention to detail\n Ability to act with business integrity and professionalism\n Physical ability to carry ladders and work safely from heights\n Ability to use power tools and equipment for investigation work\n Flexible work hours are required for evenings and weekends when instructed by management\n Must have vehicle suitable for carrying ladders and tools\n\nHow to Apply\nNote that while all submissions will be reviewed, only those that are to be considered for an interview will be contacted.\nRimkus is an equal opportunity employer. Accommodation is available for applicants selected for an interview.\n#Indeed2\nJob Types: Full-time, Permanent\nSalary: $80,000.00-$99,000.00 per year\nBenefits:\n\n Dental care\n Disability insurance\n Extended health care\n Life insurance\n RRSP match\n Vision care\n\nFlexible Language Requirement:\n\n English not required\n French not required\n\nSchedule:\n\n 8 hour shift\n Monday to Friday\n Weekends as needed\n\nEducation:\n\n Bachelor's Degree (preferred)\n\nExperience:\n\n Mechanical engineering: 8 years (required)\n\nLicence/Certification:\n\n P. Eng. (required)\n Class G Licence (required)\n\nWork Location: Hybrid remote in Nepean, ON K2E 7V2"
}