{
    "id": "14fdcadae30d502d",
    "company": "COREL CORPORATION USA",
    "positionName": "BI Engineer",
    "jobType": [
        "Full-time"
    ],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-04T03:14:12.562Z",
    "url": "https://www.indeed.ca/rc/clk?jk=14fdcadae30d502d&from=jasx&tk=1hjm3d03vjrq0800&vjs=3",
    "externalApplyLink": "https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html?cid=1cc465ff-d8d9-4507-a995-318f570f237f&ccId=19000101_000001&jobId=507740&source=IN&lang=en_US&ittk=TTVNTIMXYR",
    "companyDescription": "",
    "description": "Push the boundaries of tech. In your sweatpants.\n   We’re looking for an experienced BI Engineer to help us change the way the world works. Here, you’ll have the opportunity to be creative with your data modelling while having strong engagement with a small yet key team of internal stakeholders.\n   The top creative and technical minds could work anywhere. So why are so many of them choosing Alludo? Here are three reasons:\n  \n    This is the moment. It’s an exciting time at Alludo, with new leadership, a refreshed brand (you probably know us as Corel!), and a whole new approach to changing the way the world works. We’re at the forefront of a movement, and we want you to ride this wave with us.\n    We want you to be you. Too often, companies tell you about their culture and then expect you to fit it. Our culture is built from the people who work here. We want you to feel safe to be who you are, take risks, and show us what you’ve got.\n    It’s your world. We know you have a life. We want to be part of it, but not all of it. At Alludo, we’re serious about empowering people to work when, how, and where they want. Couch? Sweatpants? Cool with us. We believe that happy employees mean happy customers. That’s why we hire amazing people and get out of their way.\n  \n   Sound good so far? Awesome. Let’s talk more about the BI Engineer role and see if we’re destined to be together.\n   As a BI Engineer, you will:\n  \n    Be hands-on building data models and processes\n    Independently craft and drive data solutions. This includes leading discussions around business KPIs, their measurement plans, data requirements and reporting with key stakeholders\n    Direct and lead visualization and flexible storytelling in dashboards.\n    Build a reporting suite to tell the story of business trends, patterns, and outliers through rich visualizations.\n    Build and enforce common design patterns to increase report reusability, readability and standardization\n    Be able to work independently, identify dependencies to unblock projects, and craft courses of action to complete projects.\n    Manage multiple complex projects, identifying dependencies and working on parallel tracks independently\n    Create data models that are flexible enough to accommodate anticipated future use cases / requirements\n    Work in partnership with Data Engineering to build data pipelines to support your data models and ensure data quality throughout processing, automation, and modeling\n    Ability to deep dive into advanced analyses, providing robust models tied to business objectives and outcomes, and being able to derive meaningful conclusions from it\n    Proactively fix issues as found to support data accuracy and consistency in reports\n  \n   What YOU Bring to the Table:\n  \n    7+ years of professional experience demonstrating career progression and increase complexity of work\n    5+ years of experience in building reporting and dashboarding solutions using tools such as Tableau, Sigma, Looker, Superset, PowerBI, etc.\n    3+ years of experience working in business intelligence, data analytics, data engineering or a similar role\n    2+ years of experience with data modeling tools such as DBT or Coalesce\n    Ability to think strategically, analyze and interpret market and consumer information. Business background is a plus.\n    Adept in creating dashboards that invite data exploration and conform to data visualization best practices\n    Accomplished in data modeling and building processes to support data accuracy and consistency\n    Experience working with and expert with at least one of Snowflake, Redshift, PostgreSQL, and/or other DBMS platforms\n    Excellent communication skills and experience working with technical and non-technical teams\n    Proven record of using data to solve for complex use cases and going beyond stated requirements to answer the next layer of what-if questions\n  \n   US:\n  \n    Alludo is an award-winning solution that has millions of users and decades of innovation under our belts.\n    We offer a fully remote workspace. There is no pressure to work in an office whatsoever.\n    Hours are flexible! You’ve worked hard to build your life, and we don’t want you to give it up for work.\n    Our team is growing fast, and there’s a ton of energy and a lot of really smart, motivated, fun people ready to welcome you in.\n  \n   What are you waiting for? Apply now! We can’t wait to meet you.\n   (FYI, we’re lucky to have a lot of interest and we so appreciate your application, though please note that we’ll only contact you if you’ve been selected for an interview.)\n   About Alludo\n   Alludo is a beloved and trusted industry titan fueled by make-everything-easier flexibility. With a nearly 40-year legacy of innovation, we understand where you've been, and we're uniquely equipped to get you where you want to be. Our comprehensive collection of creative, collaborative, and productivity solutions propel your teams on their journey. From meeting your deadlines to realizing your dreams, Alludo empowers all you do.\n   Our products enable millions of connected knowledge workers around the world to do great work faster. Our success is driven by an unwavering commitment to deliver a broad portfolio of innovative applications – including CorelDRAW®, MindManager®, Parallels®, and WinZip® – to inspire users and help them achieve their goals.\n   It is our policy and practice to offer equal employment opportunities to all qualified applicants and employees without regard to race, color, age, religion, national origin, sex, political affiliation, sexual orientation, marital status, disability, veteran status, genetics, or any other protected characteristic.\n   Alludo is committed to an inclusive, barrier-free recruitment and selection process and work environment. If you are contacted for a job opportunity, please advise us of any accommodation that are required. Appropriate accommodation will be provided upon request as required by Federal and Provincial regulations and Company Policy. Any information received relating to accommodation will be treated as confidential."
}