{
    "id": "b6a7124c2d57c716",
    "company": "Spiderwort Inc.",
    "positionName": "Lead Scientist (Scientist III)",
    "jobType": [],
    "location": "801 Aviation Parkway, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-11-20T20:13:31.279Z",
    "url": "https://www.indeed.ca/rc/clk?jk=b6a7124c2d57c716&from=jasx&tk=1hgol0erci16u800&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "Lead Scientist (Scientist III)\nSpiderwort Inc. – Ottawa, ON\nSpiderwort is developing a platform of novel plant-derived biomaterials to address several tissue engineering applications in regenerative medicine. We are building an interdisciplinary team of experts who are passionate about bringing medical biomaterials to the clinic in order to dramatically impact human health and well-being.\nReporting to the Chief Scientific Officer and working as part of our R&D team, the Lead Scientist will manage a small team and deliver on the following responsibilities:\nPrimary Responsibilities:\n· Plan, research and lead the development of novel plant-based biomaterial formulations to support Spiderwort’s business strategy.\n\n Collaborate with the CSO, other team leads and scientific staff to develop, manage and ensure research plans and results are documented and updated on an ongoing basis. This includes risk identification/mitigation and contingency planning.\n Actively participate in building effective and motivated teams who possess a strong degree of trust and rapport amongst all members.\n Proactively manage assigned projects to ensure overall project objectives are attained including schedules, budget and quality.\n Prepare, write, maintain and coordinate research plans and internal reporting.\n Perform and/or oversee synthetic chemistry, analytical chemistry, spectroscopy, mechanical testing, molecular & cellular biology to internally assess the composition of prototypes.\n Train, mentor and lead the day-to-day activities of assigned research scientists and technicians.\n Manage and participate in cell culture and in vivo studies.\n You will play an active hands-on role in the labs and at the bench, performing measurements, conducting experiments, working collaboratively with assigned research scientists and technicians.\n Ensure that GLP, QA/QC processes & workplace health and safety policies are followed.\n Ensure products comply with all appropriate regulatory requirements.\n Liaise with regulatory agencies in Canada and the USA to ensure that all processes and products comply with local and national laws.\n Coordinate with third-party CROs and partners to perform arm's-length testing and validation studies.\n Communicate results (presentations and/or reports) internally, to regulatory agencies, and/or to external partners and collaborators. Strong English language skills (written and spoken) are required.\n Perform literature reviews and drafts scientific publications and grant proposals.\n Provides scientific support and expert knowledge of products to customers and research collaborators\n Other assignments as may be required.\n\nEssential Qualifications:\n· Industry experience in medical device (Class III) manufacturing, tissue engineering, regenerative medicine, biotechnology, biochemistry, or similar related sciences field. A background in spinal cord injury, neuroscience, neuroregeneration and biomaterials is a highly sought after asset.\n· Minimum BSc in an appropriate discipline. Non-academic industry experience is a priority.\n\n 5+ years of industry research and development experience in the medical devices field, including responsibility for leading teams of research scientists and technicians.\n Team player, ability to collaborate broadly, outstanding communication and relationship building skills, possess a personal leadership philosophy.\n Strong interpersonal skills and leadership abilities will be required to be successful in this role.\n Deep understanding and practical experience with ISO13485 and ISO10993 regulatory standards.\n Experience working to ensure compliance with cGMP/GLP/QA standards and protocols.\n Ability to integrate and interpret data from multiple sources along with excellent scientific writing skills.\n\n· Proven ability to plan and manage multiple projects while ensuring deadlines and milestones are attained.\nWhat we offer:\n· An opportunity to contribute to changing the lives of patients with few to no medical treatment options currently available to them and working with some of the most passionate experts from different fields.\n· Career growth potential. Spiderwort is an early stage, venture backed company that is growing. We are seeking team members who have the interest and characteristics that will allow them to advance in their career as the company grows.\n· Opportunity to participate in our employee stock option plan.\nAccommodations will be provided in all parts of the hiring process relating to any specialty requirements. Applicants should make their needs known in advance.\nThe successful candidate will be required, prior to the start of employment, to complete online organizational training, provide a Criminal Record Check, and provide a piece of government-issued photo identification.\nJob Type: Full-time\nBenefits:\n\n Dental care\n Extended health care\n Life insurance\n Paid time off\n Stock options\n Vision care\n\nSchedule:\n\n Monday to Friday\n\nAbility to commute/relocate:\n\n Ottawa, ON: reliably commute or plan to relocate before starting work (required)\n\nEducation:\n\n Bachelor's Degree (preferred)\n\nWork Location: In person"
}