{
    "id": "de88c686be13809d",
    "company": "Bank of Canada",
    "positionName": "Communication Channel Specialist",
    "jobType": [],
    "location": "234 Wellington St, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-17T05:13:12.925Z",
    "url": "https://www.indeed.ca/rc/clk?jk=de88c686be13809d&from=jasx&tk=1hkikipjiii32800&bb=g3LG73kDIG2DKbipZ3VbGLRMuR1605F6Jh9XWLC988HrVcGPnjD28i8QKHLMsGn71JyR_cs5XnPo6p0ww1ZlFHOsr4DrBI0ezeH0OfAc-szEA4p9S8GGUg%3D%3D&xkcb=SoA367M3FShE7dQ2y50NbzkdCdPP&vjs=3",
    "externalApplyLink": "https://careers.bankofcanada.ca/job/Ottawa-%28Downtown%29-Communication-Channel-Specialist-ON/575166617/?feedId=255617&utm_source=Indeed&utm_campaign=BoC_Indeed&jobPipeline=Indeed",
    "companyDescription": "",
    "description": "Communication Channel Specialist\n   Take a central role\n   The Bank of Canada has a vision to be a leading central bank—dynamic, engaged and trusted—committed to a better Canada. No other employer in the country offers you the unique opportunity to work at the very center of Canada’s economy, in an organization with significant impact on the economic and financial well-being of all Canadians. You will be challenged, energized and motivated to excel in our environment.\n   Building on the principles that have always guided us – excellence, integrity and respect – we strive to be forward-looking and innovative, to welcome people with diverse perspectives and talents, and to earn trust by living up to our commitments and by clearly explaining the intent of our policies and actions.\n   With our defined-benefit pension plan, benefits, and high flexibility for work life balance - find out more about why we are annually ranked as one of Canada's top employers: Working Here - Bank of Canada\n  \n   Find out more about the next steps in our Recruitment process.\n \n \n  What you will do The Customer Channel Specialist contributes to the Unclaimed Properties Office (UPO) by developing and implementing channel strategies that promote the effective use of customer facing channels that allows Canadians to access information and tools relative to unclaimed properties and to enable the adjudication of unclaimed property claims.\n \n  In addition, you will:\n \n   Prepare and maintain a Customer Channel Strategy /Communications plan that builds towards stabilization of the operations and a positive customer experience. You will contribute your advice on the planning, execution and evaluation of channel management activities and assist in the development of these activities.\n   Develop and refine customer-facing content - website, telephony call tree, forms, template letters, and operational statements – consistent with UPO’s objectives –, to support operational effectiveness and outreach activities etc. Facilitate annual review of channels – interactions, efficacy, content improvements, process changes, reporting requirements to maintain consistency and quality assurance throughout different channels, aligning with business and Bank best practices.\n   Conduct data analytics in collaboration with Information Management Analyst to understand customer behaviours, product and channel effectiveness. Use data from qualitative and quantitative research to improve customer experience and customer channels to respond to gaps in content and communications. Support the development and maintenance of the Customer Channel dashboards in collaboration with the Information contribute to the development and use of measurement tools, and other forms of analysis to better understand the needs of target audiences.\n   Understand business processes associated with customer interactions and identify areas for continuous improvement within the UPO customer channels and platforms.\n   \n     Define project requirement based on channel performance analysis.\n     Assess outcomes against defined metrics, investigate variances, and prepare recommendations to revise channel content and/or approach to meet corporate and business objectives.\n   \n   Facilitate relationship with internal Communication Department or advertisement Agency, as required to meeting awareness objectives.\n   Assess impacts on channels when operationalizing policy changes and onboarding new product. Act as liaison between UPO and internal Bank stakeholders when changes and policies impact customer channels (i.e. Accessibility)\n \n \n  What you need to succeed This position requires experience managing a multi-channel operation (telephony, web and other platforms), experience developing and implementing a chat bot solution/capability as well as experience managing government channel platforms\n \n  Your education and experience The position requires a bachelor’s degree in communications or a related discipline, with a minimum of five years of relevant work experience in an analytical or project management position with relationship management and communications or an equivalent combination of education and experience may be considered.\n \n  What you need to know\n \n   Language requirement: English and French essential (bilingual) with a minimum starting level of functional (level 4) in second official language. Training may be provided to help reach the required level of fully functional (level 5) in second official language.\n   Priority will be given to Canadian citizens and permanent residents\n   Security level required: Be eligible to obtain Reliability\n   Relocation assistance may be provided, if required\n   Please save a copy of the job poster. Once the closing date has passed, it will no longer be available.\n \n \n  Hybrid Work Model #LI-Hybrid\n  The Bank offers work arrangements that provide employees with flexibility, enable high-performing teams, and support an excellent workplace culture. Most employees can telework from home for a substantial part of each month as part of the Bank`s hybrid work model, and they are expected on site at the Bank location a minimum of eight days per month to help build connections between colleagues. You must live in Canada, and within reasonable commuting distance of the office.\n  \n What you can expect from us This is a great opportunity to join a leading organization and be part of a high-performing team. We offer a competitive compensation and benefits package designed to meet your needs at every stage of your life and career. For more information on key benefits please visit A great deal to consider.\n  \n \n \n   Salaries are based on qualifications and experience and typically range from $83,500 to $98,235 (job grade 16)\n   Depending on performance, you may be eligible for performance pay. The first tier of performance pay is for successfully meeting expectation, at 5 to 7% of your base salary. The Bank offers performance pay for those who exceed expectations (10% of your base salary).. Exceptional performers who far exceed expectations may be eligible for higher performance pay.\n   Flexible and comprehensive benefits so you can choose the level of health and dental coverage that meets your needs\n   Extra vacation days (up to five each year) that you can purchase to add to your vacation entitlement\n   Option to join the indexed, defined-benefit pension plan after 24 consecutive months of service #LI-POS\n \n \n  We wish to thank all applicants for their interest and effort in applying for this position. Only candidates selected for interviews will be contacted.T"
}