{
    "id": "b77ed175ba4c2587",
    "companyDescription": "",
    "description": "C'est chez nous que les professionnels sont les plus productifs et les plus heureux au travail. Voilà l'unique objectif d'ADP. Parce que tout ce que nous faisons tourne autour des gens. En commençant par les nôtres. Nous sommes ouverts aux nouvelles idées. Celles de personnes qui voient grand et qui exigent davantage de leur carrière. Des personnes qui aspirent à un travail épanouissant et à une vie de famille en synergie avec leurs besoins\n  . \n  \n  \n Les services complets d'ADP:\n  \n  ADP Canada et ADP Comprehensive Services aux États-Unis se sont associées pour lancer au Canada une entreprise d'impartition des processus d'affaires au cours de l'exercice 2015. Cette entreprise tire avantage du modèle commercial d'ADP Comprehensive Services, l'organisation qui connaît la croissance la plus rapide en matière de comptes principaux. Si vous désirez contribuer à la progression d'un nouveau modèle d'affaires et participer aux processus de développement, et êtes en quête d'une excellente occasion de croissance, cette offre d'emploi pourrait vous intéresser.\n  \n  \n Sommaire du poste:\n  \n  ADP est à la recherche d'un \n spécialiste du traitement de la paie. Le titulaire de ce poste aidera les clients à tirer profit des solutions exceptionnelles d'ADP en matière de paie, de sorte qu'ils puissent se concentrer sur ce qui compte le plus pour eux : la croissance de leur entreprise.\n  \n  \n Responsabilités:\n  \n \n  Assumer la responsabilité et l'imputabilité relativement à la fonction de traitement et de vérification de la paie, et ce, pour plusieurs clients. \n  Prioriser et traiter la paie des clients qui lui attribués en suivant le processus en place. \n  Effectuer promptement la mise à jour complète et précise des dossiers des clients et de leurs employés en temps réel. \n  Tenir à jour des notes complètes et précises relatives aux profils des clients et leurs instructions pour le traitement de leur paie. \n  Auditer la paie des clients selon le calendrier de fin d'année et effectuer toutes les remises aux tiers avant les dates d'échéance établies, transmettre les données électroniquement et générer les relevés pour ces clients. \n  Utiliser tous les outils et processus internes afin d'optimiser la productivité et assurer l'excellence du service; recommander les meilleures pratiques aux clients. \n  Recevoir des appels de clients (clients attribués ou autres). \n  Effectuer les vérifications trimestrielles et de fin d'exercice, notamment la conciliation de fin d'année, les ajustements et la distribution des feuillets T4/R1. \n  Fournir aux clients les renseignements essentiels et exacts selon la réglementation en vigueur à propos de la paie, notamment la déclaration de revenus. Utiliser les diverses bases de données, les ressources documentaires, de même que les sites Web appropriés pour trouver les réponses et solutions appropriées aux problèmes des clients. \n  Travailler en collaboration avec l'équipe de soutien technique interne et les différents centres de d'ADP, au besoin, afin de trouver une solution. \n \n \n  Travailler à l'amélioration continue relativement aux produits, aux problèmes, aux processus et aux procédures en communiquant ses observations et suggestions et ainsi, accroître l'efficacité. \n  Maintenir son titre auprès de l'ACP (Association canadienne de la paie) et participer à toutes les formations exigées par le service et mettre en application ses apprentissages dans le cadre de ses fonctions. \n \n  \n Qualifications requises:\n  \n \n  Minimum deux années d'expérience en traitement de la paie \n  Deux années d'expérience administrative en service à la clientèle/RH \n  Connaissance des produits d'ADP, un atout \n  Bonne maîtrise de MS Office (Word/Excel) et Internet requise \n  Compétences supérieures en service à la clientèle, à l'écrit et à l'oral, et bonnes compétences en écoute active. \n  Excellentes compétences en communication \n  Capacité à collaborer et à travailler efficacement au sein d'équipes interfonctionnelles \n  Excellentes compétences en gestion du temps et aptitude à respecter les échéances \n  Très bonne maitrise du français et de l'anglais \n \n  \n Scolarité:\n  \n \n  Baccalauréat/certificat, un atout, ou l'équivalent en matière d'expérience administrative en service à la clientèle/RH. \n  Certification de l'ACP (Association Canadienne de la Paie) : un atout \n \n  \n  NOTE À L'INTENTION DES CANDIDATS:\n  \n  Veuillez prendre note que toute offre d'emploi est conditionnelle à une vérification des antécédents, y compris la vérification du casier judiciaire.\n  \n  Nous créons une façon de travailler plus efficace, afin que vous puissiez atteindre vos objectifs. Fréquemment désignée comme l'une des \" sociétés les plus admirées \" par le magazine FORTUNE®, et reconnue par DiversityInc® comme l'une des 50 meilleures entreprises en matière de diversité, ADP collabore avec plus de 740 000 entreprises à l'échelle mondiale afin d'aider leurs employés à travailler plus intelligemment, à relever de nouveaux défis et à déployer leur talent. \" Axer le développement sur les personnes \" signifie que nous créons des plateformes qui transformeront le monde du travail, nous permettant ensemble de découvrir d'infinies possibilités.\n  \n  At ADP, we believe that diversity fuels innovation. ADP is committed to equal employment opportunities regardless of race, color, genetic information, creed, religion, sex, sexual orientation, gender identity, lawful alien status, national origin, age, marital status, or protected veteran status. We support an inclusive workplace where associates excel based on personal merit, qualifications, experience, ability, and job performance.",
    "preprocessed_description": "C'est chez nous que les professionnels sont les plus productifs et les plus heureux au travail. Voilà l'unique objectif d'ADP. Parce que tout ce que nous faisons tourne autour des gens. En commençant par les nôtres. Nous sommes ouverts aux nouvelles idées. Celles de personnes qui voient grand et qui exigent davantage de leur carrière. Des personnes qui aspirent à un travail épanouissant et à une vie de famille en synergie avec leurs besoins . Les services complets d'ADP: ADP Canada et ADP Comprehensive Services aux États-Unis se sont associées pour lancer au Canada une entreprise d'impartition des processus d'affaires au cours de l'exercice 2015. Cette entreprise tire avantage du modèle commercial d'ADP Comprehensive Services, l'organisation qui connaît la croissance la plus rapide en matière de comptes principaux. Si vous désirez contribuer à la progression d'un nouveau modèle d'affaires et participer aux processus de développement, et êtes en quête d'une excellente occasion de croissance, cette offre d'emploi pourrait vous intéresser. Sommaire du poste: ADP est à la recherche d'un spécialiste du traitement de la paie. Le titulaire de ce poste aidera les clients à tirer profit des solutions exceptionnelles d'ADP en matière de paie, de sorte qu'ils puissent se concentrer sur ce qui compte le plus pour eux : la croissance de leur entreprise. Responsabilités: Assumer la responsabilité et l'imputabilité relativement à la fonction de traitement et de vérification de la paie, et ce, pour plusieurs clients. Prioriser et traiter la paie des clients qui lui attribués en suivant le processus en place. Effectuer promptement la mise à jour complète et précise des dossiers des clients et de leurs employés en temps réel. Tenir à jour des notes complètes et précises relatives aux profils des clients et leurs instructions pour le traitement de leur paie. Auditer la paie des clients selon le calendrier de fin d'année et effectuer toutes les remises aux tiers avant les dates d'échéance établies, transmettre les données électroniquement et générer les relevés pour ces clients. Utiliser tous les outils et processus internes afin d'optimiser la productivité et assurer l'excellence du service; recommander les meilleures pratiques aux clients. Recevoir des appels de clients (clients attribués ou autres). Effectuer les vérifications trimestrielles et de fin d'exercice, notamment la conciliation de fin d'année, les ajustements et la distribution des feuillets T4/R1. Fournir aux clients les renseignements essentiels et exacts selon la réglementation en vigueur à propos de la paie, notamment la déclaration de revenus. Utiliser les diverses bases de données, les ressources documentaires, de même que les sites Web appropriés pour trouver les réponses et solutions appropriées aux problèmes des clients. Travailler en collaboration avec l'équipe de soutien technique interne et les différents centres de d'ADP, au besoin, afin de trouver une solution. Travailler à l'amélioration continue relativement aux produits, aux problèmes, aux processus et aux procédures en communiquant ses observations et suggestions et ainsi, accroître l'efficacité. Maintenir son titre auprès de l'ACP (Association canadienne de la paie) et participer à toutes les formations exigées par le service et mettre en application ses apprentissages dans le cadre de ses fonctions. Qualifications requises: Minimum deux années d'expérience en traitement de la paie Deux années d'expérience administrative en service à la clientèle/RH Connaissance des produits d'ADP, un atout Bonne maîtrise de MS Office (Word/Excel) et Internet requise Compétences supérieures en service à la clientèle, à l'écrit et à l'oral, et bonnes compétences en écoute active. Excellentes compétences en communication Capacité à collaborer et à travailler efficacement au sein d'équipes interfonctionnelles Excellentes compétences en gestion du temps et aptitude à respecter les échéances Très bonne maitrise du français et de l'anglais Scolarité: Baccalauréat/certificat, un atout, ou l'équivalent en matière d'expérience administrative en service à la clientèle/RH. Certification de l'ACP (Association Canadienne de la Paie) : un atout NOTE À L'INTENTION DES CANDIDATS: Veuillez prendre note que toute offre d'emploi est conditionnelle à une vérification des antécédents, y compris la vérification du casier judiciaire. Nous créons une façon de travailler plus efficace, afin que vous puissiez atteindre vos objectifs. Fréquemment désignée comme l'une des \" sociétés les plus admirées \" par le magazine FORTUNE®, et reconnue par DiversityInc® comme l'une des 50 meilleures entreprises en matière de diversité, ADP collabore avec plus de 740 000 entreprises à l'échelle mondiale afin d'aider leurs employés à travailler plus intelligemment, à relever de nouveaux défis et à déployer leur talent. \" Axer le développement sur les personnes \" signifie que nous créons des plateformes qui transformeront le monde du travail, nous permettant ensemble de découvrir d'infinies possibilités. At ADP, we believe that diversity fuels innovation. ADP is committed to equal employment opportunities regardless of race, color, genetic information, creed, religion, sex, sexual orientation, gender identity, lawful alien status, national origin, age, marital status, or protected veteran status. We support an inclusive workplace where associates excel based on personal merit, qualifications, experience, ability, and job performance.",
    "processed_description": "nous les professionnel sont les travail . . Parce tout ce nous faison tourne autour des gen . commencant par les notre . Nous sommes ouverts aux nouvelles idees . Celles personnes voient grand exigent davantage leur carriere . travail epanouissant une vie famille . Les services complet d'adp ADP Comprehensive Services aux Etats Unis se sont pour lancer au cours l'exercice . l'organisation connait croissance rapide matiere comptes principaux . progression d'un nouveau modele d'affaires participer aux processus developpement etes excellente occasion croissance cette offre dthemploi pourrait vous interesser . . titulaire ce poste aidera les client tirer profit des solution exceptionnelle d'adp matiere paie sorte qu'ils puissent se concentrer pour eux croissance leur entreprise . Assumer responsabilite l'imputabilite relativement fonction traitement verification paie ce pour plusieurs client . Prioriser traiter paie des clients place . mise jour complete precise des dossiers des client leurs employes temps reel . precises relative aux profils des client leurs instruction pour traitement leur paie . Auditer paie des clients selon calendrier fin d'annee effectuer tout les remises aux tier avant les d'echeance etablie transmettre les donnees electroniquement generer les releves pour ces client . Utiliser tous les outil processus internes afin d'optimiser productivite assurer l'excellence du service . Recevoir des appels client client . Effectuer les verifications notamment conciliation fin d'annee les ajustements distribution des feuillets T4 R1 . client les renseignement essentiels exacts vigueur notamment declaration revenus . Utiliser les diverses basis donnees meme les site Web appropries pour trouver les reponse solution appropriees aux problemes des client . travailler collaboration technique interne les centre d'ADP solution . Travailler l'amelioration continue relativement aux produit aux processus aux procedures communiquant ses observation suggestion ainsi accroitre l'efficacite . Maintenir son titre aupres l'ACP Association canadienne paie participer toute les formation exigees par service mettre application . qualification requise Minimum deux annees d'experience traitement paie Deux annees d'experience administrative service atout Word Excel Internet requise Competences superieures service clientele l'oral bonnes competences ecoute active . Excellentes competence communication travailler efficacement au interfonctionnelles Excellentes competence gestion du temps aptitude respecter les echeance Tres bonne maitrise du francais l'anglais Scolarite Baccalaureat certificat matiere d'experience administrative service RH . Certification l'acp Association Canadienne Paie atout NOTE l'intention DES CANDIDATS note toute offre dthemploi est conditionnelle une verification . nous creon une facon travailler efficace afin vous puissiez atteindre vos objectifs . comme societes les reconnue par comme l'une des meilleure entreprise entreprise l'echelle mondiale afin d'aider leurs employes travailler intelligemment relever nouveaux defis deployer leur talent . Axer developpement sur les personnes signifie nous creon des plateformes transformeront monde du travail nous permettant ensemble decouvrir d'infinies possibilites . diversity fuel innovation . committed equal employment race color genetic information creed religion sex sexual orientation gender identity lawful alien status national origin age marital status protect veteran status . support inclusive workplace associate excel base personal merit qualification performance .",
    "results_group": {
        "extracted_noun_chunks": [
            "administrative service RH",
            "communication travailler efficacement",
            "Prioriser traiter paie des clients",
            "precise des dossiers des client leurs employes temps reel",
            "Recevoir des appels client client",
            "vie famille",
            "transformeront monde du travail nous permettant ensemble decouvrir d'infinies possibilites",
            "nous les professionnel sont les travail",
            "communiquant ses observation suggestion",
            "committed equal employment race color genetic information",
            "les formation exigees par service mettre application",
            "Effectuer les verifications notamment conciliation fin d'annee les",
            "ajustements distribution des feuillets T4 R1",
            "diversity fuel innovation",
            "leur carriere",
            "d'experience administrative service",
            "interfonctionnelles Excellentes competence gestion",
            "progression d'un nouveau modele d'affaires participer",
            "trouver les reponse solution",
            "travail epanouissant",
            "concentrer",
            "relative aux profils des client",
            "processus developpement",
            "procedures",
            "age marital status",
            "client les renseignement",
            "son",
            "l'excellence du service",
            "matiere paie sorte qu'ils puissent se",
            "toute offre dthemploi est conditionnelle une verification",
            "religion sex sexual orientation",
            "relativement",
            "profit des solution",
            "Travailler l'amelioration",
            "d'adp",
            "veteran status",
            "Les services",
            "qualification requise Minimum deux annees d'experience traitement paie Deux annees",
            "gender identity lawful alien status national origin",
            "travailler collaboration technique interne les centre d'ADP solution",
            "Utiliser tous les outil processus internes afin d'optimiser productivite assurer",
            "processus",
            "titulaire ce poste aidera les client tirer",
            "Auditer paie des clients selon calendrier fin d'annee effectuer tout les remises aux tier avant les d'echeance etablie transmettre les donnees electroniquement generer les releves",
            "jour complete",
            "ces client",
            "problemes des client",
            "facon travailler efficace",
            "Celles personnes voient grand exigent davantage",
            "commencant par",
            "precises",
            "d'adp ADP Comprehensive Services aux Etats Unis se",
            "Certification l'acp Association Canadienne Paie",
            "temps",
            "Word Excel Internet requise Competences superieures service clientele",
            "excellente occasion croissance cette offre dthemploi pourrait vous interesser .",
            "intelligemment relever nouveaux defis deployer",
            "l'organisation",
            "entreprise l'echelle mondiale afin d'aider leurs employes travailler",
            "Utiliser les diverses",
            "eux croissance leur entreprise",
            "Excellentes",
            "les notre",
            "lancer au cours l'exercice",
            "inclusive workplace associate excel base personal merit qualification performance",
            "NOTE l'intention DES CANDIDATS",
            "Assumer responsabilite l'imputabilite relativement fonction traitement verification paie ce pour plusieurs client",
            "Parce tout ce nous faison",
            "Nous sommes ouverts aux nouvelles idees",
            "leur talent",
            "leurs instruction"
        ],
        "combined_lemmatized_tokens": "nous les professionnel sont les travail . . Parce tout ce nous faison tourne autour des gen . commencant par les notre . Nous sommes ouverts aux nouvelles idees . Celles personnes voient grand exigent davantage leur carriere . travail epanouissant une vie famille . Les services complet d'adp ADP Comprehensive Services aux Etats Unis se sont pour lancer au cours l'exercice . l'organisation connait croissance rapide matiere comptes principaux . progression d'un nouveau modele d'affaires participer aux processus developpement etes excellente occasion croissance cette offre dthemploi pourrait vous interesser . . titulaire ce poste aidera les client tirer profit des solution exceptionnelle d'adp matiere paie sorte qu'ils puissent se concentrer pour eux croissance leur entreprise . Assumer responsabilite l'imputabilite relativement fonction traitement verification paie ce pour plusieurs client . Prioriser traiter paie des clients place . mise jour complete precise des dossiers des client leurs employes temps reel . precises relative aux profils des client leurs instruction pour traitement leur paie . Auditer paie des clients selon calendrier fin d'annee effectuer tout les remises aux tier avant les d'echeance etablie transmettre les donnees electroniquement generer les releves pour ces client . Utiliser tous les outil processus internes afin d'optimiser productivite assurer l'excellence du service . Recevoir des appels client client . Effectuer les verifications notamment conciliation fin d'annee les ajustements distribution des feuillets T4 R1 . client les renseignement essentiels exacts vigueur notamment declaration revenus . Utiliser les diverses basis donnees meme les site Web appropries pour trouver les reponse solution appropriees aux problemes des client . travailler collaboration technique interne les centre d'ADP solution . Travailler l'amelioration continue relativement aux produit aux processus aux procedures communiquant ses observation suggestion ainsi accroitre l'efficacite . Maintenir son titre aupres l'ACP Association canadienne paie participer toute les formation exigees par service mettre application . qualification requise Minimum deux annees d'experience traitement paie Deux annees d'experience administrative service atout Word Excel Internet requise Competences superieures service clientele l'oral bonnes competences ecoute active . Excellentes competence communication travailler efficacement au interfonctionnelles Excellentes competence gestion du temps aptitude respecter les echeance Tres bonne maitrise du francais l'anglais Scolarite Baccalaureat certificat matiere d'experience administrative service RH . Certification l'acp Association Canadienne Paie atout NOTE l'intention DES CANDIDATS note toute offre dthemploi est conditionnelle une verification . nous creon une facon travailler efficace afin vous puissiez atteindre vos objectifs . comme societes les reconnue par comme l'une des meilleure entreprise entreprise l'echelle mondiale afin d'aider leurs employes travailler intelligemment relever nouveaux defis deployer leur talent . Axer developpement sur les personnes signifie nous creon des plateformes transformeront monde du travail nous permettant ensemble decouvrir d'infinies possibilites . diversity fuel innovation . committed equal employment race color genetic information creed religion sex sexual orientation gender identity lawful alien status national origin age marital status protect veteran status . support inclusive workplace associate excel base personal merit qualification performance ."
    }
}