{
    "id": "54efc7c63d979fac",
    "companyDescription": "",
    "description": "Compensation Pay Range:\n  $31.09-$37.77\n \n \n   Job Description:\n \n \n   Please Note: If you are a current CHEO employee with access to Workday, please apply to this posting via the Workday application as an internal applicant.\n \n \n \n   To successfully apply for this position, please submit your application by 11:59 pm the day before the advertised closing date in the posting to ensure your application is received.\n \n \n \n   POSITION SUMMARY\n \n \n   The Pharmacy Department at CHEO operates 24 hours daily, 7 days a week. Pharmacy technicians are expected to work day, evening, weekend and night shifts.\n \n \n \n   JOB DESCRIPTION\n \n \n   Under a pharmacist’s supervision the Pharmacy Technician:\n \n \n   Performs all the tasks defined in the NAPRA Standards Practice for Pharmacy Technician practice from the Ontario College of Pharmacists (OCP).\n   Keep up to date and follows workflow processes of the pharmacy department and the Hospital based on pharmacy standards and regulatory requirements\n   Maintains accurate computerized patient profiles\n   Dispenses, verify and deliver inpatient and outpatient prescriptions\n   Distributes and maintains inventory of all pharmaceuticals, i.e. formulary, non-formulary, controlled substances, SAP, drug studies.\n   Maintains stock of pharmaceuticals, labels, containers, and other supplies within the pharmacy work areas\n   Records and reports any shortages of pharmaceuticals or supplies on the appropriate order list and to the pharmacy buyer\n   Maintains stock of pharmaceuticals and supplies on the clinical wards and ambulatory clinics as required\n   Maintains non-expired pharmaceuticals availability and participation in the rotation of stocks in the pharmacy and on the clinical wards and ambulatory clinics.\n   Prioritize, initiate and complete the Patients Best Possible Medication History and highlight any discrepancies to the pharmacist\n   Keeps work areas clean, organized, and functional\n   Maintains equipment and automation in good working condition, problem solves as appropriate and reports issues to appropriate pharmacy personnel\n   Reports product defects, i.e. labelling issues, product discoloration or deterioration, precipitate, contamination, etc. to pharmacist and complete the incident report\n   Reports medication errors to pharmacist and complete the incident report\n   Maintains records of pharmacy related activities and participate in the statistical reports for the Pharmacy Department\n   Participates in the pharmacy technician work rotation fulfilling the responsibilities and tasks of each assigned area including weekend and night shifts\n   Participates in staff and pharmacy technician meetings, departmental planning and communication activities, and special project assignments as required\n   Participates in the training and orientation of new personnel in technical aspects of the Pharmacy Department\n   Participates in departmental quality assurance activities\n   Works cooperatively with all colleagues, promoting and maintaining harmonious inter and intra departmental relationships\n   Maintains professional conduct and standards in all aspects of his/her work and when interacting with hospital staff and the public\n   Cover Kid Care Pharmacy as required\n   Performs other duties as assigned\n \n \n \n   QUALIFICATIONS\n \n \n   Criminal Record Check (Essential)\n   Graduate of an accredited college Pharmacy Technician Program (Essential)\n   Licensed as a Pharmacy Technician with the Ontario College of Pharmacists (Essential)\n   Minimum of two (2) years related experience (Preferred)\n   Sterile compounding experience (Preferred)\n   Non-sterile compounding experience (Preferred)\n   Bilingual (English/French) (Preferred)\n   Maintains competency on all equipment and automation (Essential)\n   Maintains sterile and non-sterile certifications yearly (Essential)\n \n \n \n  \n   Please note you will be represented by the Ontario Public Service Employees Union (OPSEU).\n  \n \n \n \n  \n    CHEO is committed to providing a safe environment for staff, patients, and visitors. Consistent with that commitment, all applicants must be fully vaccinated against COVID-19 to be considered for any staff or volunteer opportunities. Applicants are also strongly encouraged to receive their COVID-19 booster shots when eligible to protect against the spread of COVID-19. Upon hiring, presentation of government issued documentation confirming full vaccination must be provided, or presentation of supporting documentation of a valid medical contraindication or other reasonable consideration pursuant to the Ontario Human Rights Code.\n  \n \n \n \n  \n    Effective March 29, 2021, CHEO will conduct a more comprehensive pre-screening and evaluation process. This process may include more varied and multidimensional testing such as a written test, practical exam, or other assessment. All candidates who meet the essential and preferred qualifications may be tested. All OPSEU members shall be granted an interview upon passing the pre-screening. Pre-screening might include testing.\n  \n \n \n \n  \n    CHEO values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants.\n  \n \n \n \n  \n    Should you require accommodation during any phase in the recruitment process, please contact Human Resources at jobs@cheo.on.ca. All information received in relation to accommodation will be kept confidential and will be handled in compliance with the Accessibility for Ontarians with Disabilities Act.\n  \n \n \n \n  \n    We thank all those who apply, however, only those to be interviewed will be contacted.\n  \n \n \n \n   Veuillez noter : Si vous êtes un employé actuel de CHEO et que vous avez accès à Workday, veuillez postuler à cette offre par l’entremise de l’application Workday à titre de candidat interne.\n \n \n   Pour postuler avec succès à ce poste, veuillez soumettre votre candidature avant 23 h 59 le jour précédant la date de clôture annoncée dans l’annonce afin de vous assurer que votre candidature sera bien reçue.\n \n \n \n   RÉSUMÉ DES FONCTIONS\n \n \n   Le Service de la pharmacie du CHEO ne s’arrête jamais. Les techniciens et techniciennes en pharmacie doivent accepter de travailler la journée, le soir, les weekends et la nuit.\n \n \n \n   DESCRIPTION DES TÂCHES\n \n \n   Le technicien ou la technicienne en pharmacie relève du pharmacien et accomplit les tâches suivantes :\n \n \n   Exécuter toutes les tâches définies dans le Modèle de normes des techniciens en pharmacie du Canada de NAPRA et du Ontario College of Pharmacists (OCP).\n   Se tenir informé et suivre les politiques et procédures du Département de pharmacie et de l’Hôpital basés sur les standards professionnels de la pharmacies et les réglementations en vigueuresTenir à jour le profil électronique exact de chaque patient.\n   Préparer, vérifier et livrer les médicaments d’ordonnance aux patients hospitalisés et ambulatoires.\n   § Distribuer tous les produits pharmaceutiques et tenir l’inventaire à jourincluant les médicaments qui figurent ou non au formulaire, les stupéfiants, substances ciblées et contrôllées, les médicaments d’urgence, les médicaments du Programme d’Accès Spéciale de Santé Canada, les médicaments d’essais cliniques.\n   Maintenirdes stocks de produits pharmaceutiques, des étiquettes et desautres fournitures dans les lieux de travail du Département de pharmacie.\n   Inscrire les produits et les fournitures pharmaceutiques manquants sur la liste de commande désignée et les signaler à le(la) technicien(ne) en pharmacie assignéeà l’approvisionnement.\n   Approvisionner es stocks de produits pharmaceutiques et de fournitures dans les services cliniques et ambulatoires de l’Hôpital en fonction de leurs besoins.\n   S’assurer que les produits pharmaceutiques disponibles à la pharmacie et sur les étages cliniques et ambulatoires sont non-expirés et participer à la rotation des stocks\n   Prioriser, débuter et compléter les histoires médicamenteuses des patients et informer rapidement le pharmacien de toutes divergences pour que celui-ci puisse les réconcilier.\n   Assurer la propreté, l’ordre et la fonctionnalité des lieux de travail.\n   Tenir les équipements et les dispositifs automatiques en bon état de fonctionnement; résoudre les problèmes dans la mesure du possible et signaler les problèmes aux membres du personnel concernés.\n   Signaler au pharmacien les défauts des produits tels que le mauvais étiquetage, la décoloration, la détérioration, les dépôts ou la contamination d’un produit et remplir le rapport d’incident\n   Signaler les erreurs de médication au pharmacien et remplir le rapport d’incident\n   Mettre à jour les dossiers d’activités liées à la pharmacie et participer à la compilation des statistiques du Département de Pharmacie\n   Participer aux différents rôles des techniciens en pharmacie en assumant les responsabilités et en exécutant les tâches de chaque section, ce qui inclue la rotation des horaires et d quarts de weekend et de nuit.\n   Participer aux réunions du personnel et des techniciens du Département de pharmacie, aux activités de planification et de communication du Département ainsi qu’à l’exécution de projets spéciaux au besoin.\n   Participer à la formation et à l’orientation des nouveaux employés en leur montrant les aspects techniques du Département de pharmacie.\n   Participer aux activités d’assurance de la qualité du Département.\n   Collaborer avec tous les collègues afin de favoriser et d’entretenir des relations harmonieuses dans le Département de pharmacie et avec les autres services de l’Hôpital.\n   Remplacer les collègues dans la pharmacie KidCare selon les besoins\n   Accomplir d’autres tâches à la demande du superviseur.\n \n \n \n   QUALIFICATIONS\n \n \n   Vérification du casier judiciaire (Essentiel)\n   Diplôme de technicien en pharmacie d’un collègue accrédité (Essentiel)\n   Agrément de technicien en pharmacie de l’Ordre des pharmaciens de l’Ontario (Essentiel)\n   Expérience pertinente d’au moins deux (2) ans (Préférable)\n   Expérience de la préparation d’articles stériles (Préférable)\n   Expérience de la préparation d’articles non stériles (Préférable)\n   Bilinguisme (français et anglais) (Préférable)\n   Maintenir à jour ses connaissances et assurer le bon fonctionnement de tous les équipements et de tous les dispositifs automatiques (Essentiel)\n   Réussir la certification annuelle pour les préparations stériles et non-stériles (Essentiel)\n \n \n \n  \n   Veuillez noter que vous serez représenté(e) par le syndicat des employés de la fonction publique de l’Ontario (SEFPO).\n  \n \n \n \n  \n    CHEO s’engage à offrir un environnement sécuritaire au personnel, aux patients et aux visiteurs. Conformément à cet engagement, tous les candidats doivent être entièrement vaccinés contre la COVID-19 pour être considérés comme des candidats pour tout emploi de personnel ou de bénévole. Les candidats sont également fortement encouragés à recevoir leurs doses de rappel contre la COVID-19 lorsqu’ils sont admissibles pour éviter la propagation de COVID-19. Lors de l’embauche, la présentation de documents gouvernementaux confirmant la vaccination complète doit être fournie, ou la présentation de documents justificatifs d’une contre-indication médicale valide ou d’une autre considération raisonnable en vertu du Code des droits de la personne de l’Ontario.\n    \n    À partir du 29 mars 2021, CHEO mènera un processus de présélection et d'évaluation plus complet. Ce processus peut comprendre des tests plus variés et multidimensionnels tels qu'un test écrit, un examen pratique ou une autre évaluation. Tous les candidats qui satisfont aux qualifications essentielles et préférées peuvent être testés. Tous les membres de OPSEU serront accorder une entrevue après avoir passé la présélection. La présélection peut comprendre des tests.\n  \n \n \n \n  \n    CHEO valorise la diversité et est un employeur qui souscrit au principe de l’égalité d’accès. Nous nous sommes engagés à fournir un environnement de travail inclusif et sans obstacle, en commençant par le processus d’embauche et nous sommes heureux de recevoir des demandes provenant de tous les candidats qualifiés.\n  \n \n \n \n  \n    Si vous avez besoin de mesures d’adaptation pendant une phase du processus de recrutement, veuillez communiquer avec les Ressources humaines à jobs@cheo.on.ca. Tous les renseignements reçus concernant les mesures d’adaptation resteront confidentiels et seront traités conformément à la Loi sur l’accessibilité pour les personnes handicapées de l’Ontario.\n  \n \n \n \n  \n    Nous remercions toutes les personnes qui posent leur candidature; toutefois, nous ne communiquerons qu’avec celles qui seront convoquées à une entrevue.\n  \n \n \n \n   Please note you will be represented by the Ontario Public Service Employees Union (OPSEU).\n \n \n \n   CHEO values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants.\n \n \n \n   Should you require accommodation during any phase in the recruitment process, please contact Human Resources at jobs@cheo.on.ca. All information received in relation to accommodation will be kept confidential and will be handled in compliance with the Accessibility for Ontarians with Disabilities Act.\n \n \n \n   We thank all those who apply, however, only those to be interviewed will be contacted.\n \n \n \n   Job Posting End Date (if applicable):\n  January 19, 2024",
    "preprocessed_description": "Compensation Pay Range: $31.09-$37.77 Job Description: Please Note: If you are a current CHEO employee with access to Workday, please apply to this posting via the Workday application as an internal applicant. To successfully apply for this position, please submit your application by 11:59 pm the day before the advertised closing date in the posting to ensure your application is received. POSITION SUMMARY The Pharmacy Department at CHEO operates 24 hours daily, 7 days a week. Pharmacy technicians are expected to work day, evening, weekend and night shifts. JOB DESCRIPTION Under a pharmacist's supervision the Pharmacy Technician: Performs all the tasks defined in the NAPRA Standards Practice for Pharmacy Technician practice from the Ontario College of Pharmacists (OCP). Keep up to date and follows workflow processes of the pharmacy department and the Hospital based on pharmacy standards and regulatory requirements Maintains accurate computerized patient profiles Dispenses, verify and deliver inpatient and outpatient prescriptions Distributes and maintains inventory of all pharmaceuticals, i.e. formulary, non-formulary, controlled substances, System Application Products, drug studies. Maintains stock of pharmaceuticals, labels, containers, and other supplies within the pharmacy work areas Records and reports any shortages of pharmaceuticals or supplies on the appropriate order list and to the pharmacy buyer Maintains stock of pharmaceuticals and supplies on the clinical wards and ambulatory clinics as required Maintains non-expired pharmaceuticals availability and participation in the rotation of stocks in the pharmacy and on the clinical wards and ambulatory clinics. Prioritize, initiate and complete the Patients Best Possible Medication History and highlight any discrepancies to the pharmacist Keeps work areas clean, organized, and functional Maintains equipment and automation in good working condition, problem solves as appropriate and reports issues to appropriate pharmacy personnel Reports product defects, i.e. labelling issues, product discoloration or deterioration, precipitate, contamination, etc. to pharmacist and complete the incident report Reports medication errors to pharmacist and complete the incident report Maintains records of pharmacy related activities and participate in the statistical reports for the Pharmacy Department Participates in the pharmacy technician work rotation fulfilling the responsibilities and tasks of each assigned area including weekend and night shifts Participates in staff and pharmacy technician meetings, departmental planning and communication activities, and special project assignments as required Participates in the training and orientation of new personnel in technical aspects of the Pharmacy Department Participates in departmental quality assurance activities Works cooperatively with all colleagues, promoting and maintaining harmonious inter and intra departmental relationships Maintains professional conduct and standards in all aspects of his/her work and when interacting with hospital staff and the public Cover Kid Care Pharmacy as required Performs other duties as assigned QUALIFICATIONS Criminal Record Check (Essential) Graduate of an accredited college Pharmacy Technician Program (Essential) Licensed as a Pharmacy Technician with the Ontario College of Pharmacists (Essential) Minimum of two (2) years related experience (Preferred) Sterile compounding experience (Preferred) Non-sterile compounding experience (Preferred) Bilingual (English/French) (Preferred) Maintains competency on all equipment and automation (Essential) Maintains sterile and non-sterile certifications yearly (Essential) Please note you will be represented by the Ontario Public Service Employees Union (OPSEU). CHEO is committed to providing a safe environment for staff, patients, and visitors. Consistent with that commitment, all applicants must be fully vaccinated against COVID-19 to be considered for any staff or volunteer opportunities. Applicants are also strongly encouraged to receive their COVID-19 booster shots when eligible to protect against the spread of COVID-19. Upon hiring, presentation of government issued documentation confirming full vaccination must be provided, or presentation of supporting documentation of a valid medical contraindication or other reasonable consideration pursuant to the Ontario Human Rights Code. Effective March 29, 2021, CHEO will conduct a more comprehensive pre-screening and evaluation process. This process may include more varied and multidimensional testing such as a written test, practical exam, or other assessment. All candidates who meet the essential and preferred qualifications may be tested. All OPSEU members shall be granted an interview upon passing the pre-screening. Pre-screening might include testing. CHEO values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants. Should you require accommodation during any phase in the recruitment process, please contact Human Resources at jobs@cheo.on.ca. All information received in relation to accommodation will be kept confidential and will be handled in compliance with the Accessibility for Ontarians with Disabilities Act. We thank all those who apply, however, only those to be interviewed will be contacted. Veuillez noter : Si vous êtes un employé actuel de CHEO et que vous avez accès à Workday, veuillez postuler à cette offre par l'entremise de l'application Workday à titre de candidat interne. Pour postuler avec succès à ce poste, veuillez soumettre votre candidature avant 23 h 59 le jour précédant la date de clôture annoncée dans l'annonce afin de vous assurer que votre candidature sera bien reçue. RÉSUMÉ DES FONCTIONS Le Service de la pharmacie du CHEO ne s'arrête jamais. Les techniciens et techniciennes en pharmacie doivent accepter de travailler la journée, le soir, les weekends et la nuit. DESCRIPTION DES TÂCHES Le technicien ou la technicienne en pharmacie relève du pharmacien et accomplit les tâches suivantes : Exécuter toutes les tâches définies dans le Modèle de normes des techniciens en pharmacie du Canada de NAPRA et du Ontario College of Pharmacists (OCP). Se tenir informé et suivre les politiques et procédures du Département de pharmacie et de l'Hôpital basés sur les standards professionnels de la pharmacies et les réglementations en vigueuresTenir à jour le profil électronique exact de chaque patient. Préparer, vérifier et livrer les médicaments d'ordonnance aux patients hospitalisés et ambulatoires. § Distribuer tous les produits pharmaceutiques et tenir l'inventaire à jourincluant les médicaments qui figurent ou non au formulaire, les stupéfiants, substances ciblées et contrôllées, les médicaments d'urgence, les médicaments du Programme d'Accès Spéciale de Santé Canada, les médicaments d'essais cliniques. Maintenirdes stocks de produits pharmaceutiques, des étiquettes et desautres fournitures dans les lieux de travail du Département de pharmacie. Inscrire les produits et les fournitures pharmaceutiques manquants sur la liste de commande désignée et les signaler à le(la) technicien(ne) en pharmacie assignéeà l'approvisionnement. Approvisionner es stocks de produits pharmaceutiques et de fournitures dans les services cliniques et ambulatoires de l'Hôpital en fonction de leurs besoins. S'assurer que les produits pharmaceutiques disponibles à la pharmacie et sur les étages cliniques et ambulatoires sont non-expirés et participer à la rotation des stocks Prioriser, débuter et compléter les histoires médicamenteuses des patients et informer rapidement le pharmacien de toutes divergences pour que celui-ci puisse les réconcilier. Assurer la propreté, l'ordre et la fonctionnalité des lieux de travail. Tenir les équipements et les dispositifs automatiques en bon état de fonctionnement; résoudre les problèmes dans la mesure du possible et signaler les problèmes aux membres du personnel concernés. Signaler au pharmacien les défauts des produits tels que le mauvais étiquetage, la décoloration, la détérioration, les dépôts ou la contamination d'un produit et remplir le rapport d'incident Signaler les erreurs de médication au pharmacien et remplir le rapport d'incident Mettre à jour les dossiers d'activités liées à la pharmacie et participer à la compilation des statistiques du Département de Pharmacie Participer aux différents rôles des techniciens en pharmacie en assumant les responsabilités et en exécutant les tâches de chaque section, ce qui inclue la rotation des horaires et d quarts de weekend et de nuit. Participer aux réunions du personnel et des techniciens du Département de pharmacie, aux activités de planification et de communication du Département ainsi qu'à l'exécution de projets spéciaux au besoin. Participer à la formation et à l'orientation des nouveaux employés en leur montrant les aspects techniques du Département de pharmacie. Participer aux activités d'assurance de la qualité du Département. Collaborer avec tous les collègues afin de favoriser et d'entretenir des relations harmonieuses dans le Département de pharmacie et avec les autres services de l'Hôpital. Remplacer les collègues dans la pharmacie KidCare selon les besoins Accomplir d'autres tâches à la demande du superviseur. QUALIFICATIONS Vérification du casier judiciaire (Essentiel) Diplôme de technicien en pharmacie d'un collègue accrédité (Essentiel) Agrément de technicien en pharmacie de l'Ordre des pharmaciens de l'Ontario (Essentiel) Expérience pertinente d'au moins deux (2) ans (Préférable) Expérience de la préparation d'articles stériles (Préférable) Expérience de la préparation d'articles non stériles (Préférable) Bilinguisme (français et anglais) (Préférable) Maintenir à jour ses connaissances et assurer le bon fonctionnement de tous les équipements et de tous les dispositifs automatiques (Essentiel) Réussir la certification annuelle pour les préparations stériles et non-stériles (Essentiel) Veuillez noter que vous serez représenté(e) par le syndicat des employés de la fonction publique de l'Ontario (SEFPO). CHEO s'engage à offrir un environnement sécuritaire au personnel, aux patients et aux visiteurs. Conformément à cet engagement, tous les candidats doivent être entièrement vaccinés contre la COVID-19 pour être considérés comme des candidats pour tout emploi de personnel ou de bénévole. Les candidats sont également fortement encouragés à recevoir leurs doses de rappel contre la COVID-19 lorsqu'ils sont admissibles pour éviter la propagation de COVID-19. Lors de l'embauche, la présentation de documents gouvernementaux confirmant la vaccination complète doit être fournie, ou la présentation de documents justificatifs d'une contre-indication médicale valide ou d'une autre considération raisonnable en vertu du Code des droits de la personne de l'Ontario. À partir du 29 mars 2021, CHEO mènera un processus de présélection et d'évaluation plus complet. Ce processus peut comprendre des tests plus variés et multidimensionnels tels qu'un test écrit, un examen pratique ou une autre évaluation. Tous les candidats qui satisfont aux qualifications essentielles et préférées peuvent être testés. Tous les membres de OPSEU serront accorder une entrevue après avoir passé la présélection. La présélection peut comprendre des tests. CHEO valorise la diversité et est un employeur qui souscrit au principe de l'égalité d'accès. Nous nous sommes engagés à fournir un environnement de travail inclusif et sans obstacle, en commençant par le processus d'embauche et nous sommes heureux de recevoir des demandes provenant de tous les candidats qualifiés. Si vous avez besoin de mesures d'adaptation pendant une phase du processus de recrutement, veuillez communiquer avec les Ressources humaines à jobs@cheo.on.ca. Tous les renseignements reçus concernant les mesures d'adaptation resteront confidentiels et seront traités conformément à la Loi sur l'accessibilité pour les personnes handicapées de l'Ontario. Nous remercions toutes les personnes qui posent leur candidature; toutefois, nous ne communiquerons qu'avec celles qui seront convoquées à une entrevue. Please note you will be represented by the Ontario Public Service Employees Union (OPSEU). CHEO values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants. Should you require accommodation during any phase in the recruitment process, please contact Human Resources at jobs@cheo.on.ca. All information received in relation to accommodation will be kept confidential and will be handled in compliance with the Accessibility for Ontarians with Disabilities Act. We thank all those who apply, however, only those to be interviewed will be contacted. Job Posting End Date (if applicable): January 19, 2024",
    "processed_description": "compensation pay Range description note current CHEO employee access apply posting Workday application internal applicant . apply position submit application advertise closing posting ensure application receive . position SUMMARY operate week . pharmacy technician expect evening weekend night shift . description pharmacist's supervision perform task define practice OCP . follow workflow process pharmacy department base pharmacy standard regulatory requirement maintain verify deliver maintain inventory pharmaceutical i.e. formulary formulary control substance System Application Products drug study . maintain stock pharmaceutical label container supply pharmacy area report shortage pharmaceutical supply appropriate order list pharmacy buyer maintain stock pharmaceutical supply clinical ward ambulatory clinic require maintain expired pharmaceutical availability participation rotation stock pharmacy clinical ward ambulatory clinic . prioritize initiate complete highlight discrepancy pharmacist area clean organize functional maintain equipment automation good working condition problem solve appropriate report issue appropriate pharmacy personnel report product defect i.e. labelling issue product discoloration deterioration precipitate contamination . pharmacist complete incident report report medication error pharmacist complete incident report maintain record pharmacy relate activity participate statistical report pharmacy technician rotation fulfil responsibility task assign area include weekend night shift Participates staff pharmacy technician meeting departmental planning communication activity special project assignment require Participates training orientation personnel technical aspect departmental quality assurance activity cooperatively colleague promote maintain harmonious inter intra departmental relationship maintain professional conduct standard aspect interact hospital staff require perform duty assign qualifications Criminal Record Check Essential graduate Essential license relate preferred sterile compounding preferred sterile compound preferred English French preferred maintain competency equipment automation Essential maintain sterile sterile certification yearly essential note represent OPSEU . CHEO commit provide safe environment staff patient visitor . consistent commitment applicant fully vaccinate covid consider staff volunteer . applicant encourage receive covid booster shot eligible protect spread covid . hiring presentation government issue documentation confirm vaccination provide presentation support documentation valid medical contraindication reasonable consideration pursuant . effective conduct comprehensive pre screening evaluation process . process include varied multidimensional testing write test practical exam assessment . meet essential prefer qualification test . OPSEU grant interview pass pre screening . pre screening include testing . CHEO diversity equal employer . committed provide inclusive barrier free environment start hiring process interest qualified applicant . require accommodation phase recruitment process contact . information receive relation accommodation confidential handle compliance . apply interview contact . Veuillez noter employe actuel CHEO vous avez acces Workday cette offre par l'entremise l'application Workday titre candidat interne . pour postuler veuillez soumettre votre candidature avant . . Les technicien techniciennes pharmacie doivent accepter travailler journee . description DES accomplit les tache suivantes tout les tache definies dans Modele normes des technicien OCP . Se tenir informe suivre les politiques procedures du Departement pharmacie l'Hopital bases sur les standard professionnel pharmacy les reglementation vigueurestenir jour profil electronique exact chaque patient . verifier livrer les medicaments d'ordonnance aux patient hospitalises ambulatoire . § Distribuer tous les produits pharmaceutique tenir l'inventaire jourincluant les medicaments figurent au formulaire les stupefiants substance ciblees controllees les medicament d'urgence les medicaments d'essais clinique . stock produits pharmaceutique desautre fourniture dans les lieux travail du Departement pharmacie . Inscrire les produits les fourniture pharmaceutique manquants sur liste commande designee les signaler technicien ne pharmacie assigneea l'approvisionnement . Approvisionner es stock produits pharmaceutique fourniture dans les services cliniques . les produits pharmaceutique disponible les etage participer debuter completer les histoires medicamenteuses des patients informer rapidement pharmacien toutes divergence pour . l'ordre fonctionnalite des lieux travail . les dispositifs automatiques bon etat fonctionnement signaler les problemes aux membres du personnel concernes . Signaler au pharmacien les defauts des produit tel mauvais etiquetage les produit remplir rapport participer compilation des statistique du Departement Pharmacie Participer aux role des technicien pharmacie rotation des horaires quart weekend nuit . Participer aux reunions du personnel des technicien du Departement pharmacie projets . Participer formation l'orientation des nouveaux employes leur montrant les aspect technique du Departement pharmacie . Participer aux activites d'assurance qualite du Departement . favoriser d'entretenir des relation dans pharmacie avec les autres services l'Hopital . demande du superviseur . qualification Essentiel Diplome technicien pharmacie d'un collegue accredite Essentiel Agrement technicien pharmacie l'Ordre des Essentiel deux ans preparation d'article sterile preparation d'article sterile Bilinguisme francais anglais Maintenir jour ses connaissance assurer bon fonctionnement tous les equipement tous les dispositifs automatique Essentiel Reussir pour les preparation sterile steriles Essentiel Veuillez noter vous serez represente SEFPO . personnel aux patient aux visiteur . Conformement cet engagement tous les candidats doivent etre entierement vaccines contre COVID pour etre consideres comme des candidats pour . candidats recevoir leurs doses rappel contre COVID admissible pour eviter propagation covid . confirmant vaccination complete raisonnable . partir du mars CHEO menera processus preselection d'evaluation complet . Ce processus peut comprendre des test varie multidimensionnels tel qu'un test ecrit examen pratique une autre evaluation . Tous les candidats satisfont aux qualifications essentielles testes . Tous les membres OPSEU serront une entrevue apres avoir passe preselection . preselection peut comprendre des test . employeur souscrit au principe l'egalite d'acces . nous nous sommes engages fournir environnement travail inclusif sans obstacle commencant par nous provenant tous les candidats qualifie . Si vous avez besoin mesures d'adaptation pendant une phase du processus recrutement humaine . Tous les renseignements recus concernant les mesures d'adaptation resteront seront traites conformement Loi sur l'accessibilite pour . nous remercion tout les personnes posent leur candidature toutefois nous ne communiquerons qu'avec celles seront convoquees une entrevue . note represent OPSEU . CHEO diversity equal employer . committed provide inclusive barrier free environment start hiring process interest qualified applicant . require accommodation phase recruitment process contact . information receive relation accommodation confidential handle compliance . apply interview contact . posting applicable",
    "results_group": {
        "extracted_noun_chunks": [
            "quart weekend nuit",
            "perform duty assign qualifications",
            "candidats recevoir leurs doses rappel contre COVID",
            "qualite du Departement",
            "Les technicien techniciennes pharmacie doivent accepter travailler journee",
            "postuler veuillez soumettre votre candidature avant",
            "interview contact",
            "du Departement pharmacie",
            "qualified applicant",
            "reasonable consideration",
            "reunions",
            "partir du mars CHEO menera processus preselection d'evaluation",
            "favoriser d'entretenir des relation dans pharmacie avec les autres",
            "les produits pharmaceutique",
            "entrevue apres avoir passe preselection",
            "qualification Essentiel Diplome technicien pharmacie d'un collegue accredite Essentiel Agrement technicien pharmacie",
            "services l'Hopital",
            "applicant",
            "histoires",
            "formation",
            "nous nous sommes",
            "Si vous avez besoin mesures d'adaptation pendant",
            "vaccination",
            "Approvisionner es stock produits pharmaceutique fourniture",
            "departmental planning communication activity special project assignment",
            "position submit application advertise closing posting",
            "OPSEU grant interview",
            "role des technicien pharmacie rotation des horaires",
            "Signaler au pharmacien les defauts des produit tel mauvais etiquetage les produit remplir rapport participer compilation des statistique du Departement Pharmacie Participer",
            "pre screening",
            "du superviseur",
            "d'acces",
            "weekend night shift Participates staff pharmacy technician",
            "activity",
            "current CHEO employee access",
            "personnel",
            "professional conduct standard aspect",
            "hospital staff",
            "statistical report pharmacy technician rotation fulfil",
            "covid",
            "Criminal Record",
            "demande",
            "compliance",
            "Essential graduate Essential license",
            "preselection peut comprendre des test",
            "position SUMMARY",
            "sterile sterile certification yearly essential note",
            "stock produits pharmaceutique desautre fourniture",
            "competency equipment automation",
            "expired pharmaceutical availability participation rotation stock pharmacy clinical ward ambulatory clinic",
            "phase du processus recrutement",
            "stock pharmaceutical supply clinical ward ambulatory clinic",
            "Ce processus peut comprendre des test",
            "testing",
            "safe environment staff patient visitor",
            "pharmacy technician",
            "inclusive barrier free environment",
            "jour ses connaissance assurer bon fonctionnement tous les equipement tous les dispositifs automatique Essentiel Reussir",
            "covid booster",
            "workflow process pharmacy department base pharmacy standard regulatory requirement",
            "varied multidimensional testing write test practical exam assessment",
            "l'ordre fonctionnalite des lieux travail",
            "les services cliniques",
            "employeur souscrit au principe l'egalite",
            "presentation government issue documentation",
            "essential prefer qualification test",
            "les dispositifs automatiques bon etat fonctionnement signaler les problemes aux membres du personnel concernes",
            "eviter propagation covid",
            "Tous les renseignements recus concernant les mesures d'adaptation resteront seront traites",
            "CHEO diversity equal employer",
            "Workday application internal applicant",
            "equipment automation",
            "eligible protect",
            "contamination",
            "COVID pour etre consideres comme des candidats",
            "note",
            "fournir environnement travail inclusif sans obstacle commencant par nous provenant tous les candidats qualifie",
            "Inscrire les produits les fourniture pharmaceutique manquants sur liste commande designee les signaler technicien ne pharmacie assigneea l'approvisionnement",
            "harmonious inter intra departmental relationship",
            "Loi sur l'accessibilite pour",
            "complete highlight discrepancy",
            "evening weekend night shift",
            "inventory pharmaceutical i.e. formulary formulary control substance System Application Products drug study",
            "task",
            "consistent commitment applicant",
            "CHEO",
            "relation accommodation",
            "Range description",
            "Participer aux activites",
            "responsibility task assign area",
            "Distribuer tous les produits pharmaceutique tenir l'inventaire jourincluant les medicaments figurent au formulaire les stupefiants substance ciblees controllees les medicament d'urgence les medicaments d'essais clinique",
            "pharmacist complete incident report report medication error pharmacist complete incident report",
            "application",
            "Veuillez noter employe",
            "information",
            "accommodation phase recruitment process contact",
            "evaluation process",
            "effective conduct",
            "preparation sterile steriles Essentiel Veuillez",
            "practice OCP",
            "aux visiteur",
            "patient",
            "process interest",
            "Tous les candidats satisfont aux qualifications essentielles testes",
            "les etage participer debuter",
            "Modele normes des technicien OCP",
            "diversity equal employer",
            "pharmaceutical supply",
            "les lieux travail du Departement pharmacie",
            "Participates training orientation personnel technical aspect departmental quality assurance activity cooperatively colleague",
            "CHEO vous avez",
            "OPSEU",
            "test ecrit examen pratique une autre evaluation",
            "noter vous serez represente SEFPO",
            "DES accomplit les tache suivantes",
            "process",
            "appropriate report issue appropriate pharmacy personnel report product defect",
            "nous remercion tout les personnes posent leur candidature toutefois nous ne communiquerons qu'avec celles seront convoquees une entrevue",
            "record pharmacy",
            "Workday cette offre par l'entremise l'application Workday titre candidat interne",
            "l'Ordre des Essentiel deux ans preparation",
            "Essential",
            "description pharmacist's supervision"
        ],
        "combined_lemmatized_tokens": "compensation pay Range description note current CHEO employee access apply posting Workday application internal applicant . apply position submit application advertise closing posting ensure application receive . position SUMMARY operate week . pharmacy technician expect evening weekend night shift . description pharmacist's supervision perform task define practice OCP . follow workflow process pharmacy department base pharmacy standard regulatory requirement maintain verify deliver maintain inventory pharmaceutical i.e. formulary formulary control substance System Application Products drug study . maintain stock pharmaceutical label container supply pharmacy area report shortage pharmaceutical supply appropriate order list pharmacy buyer maintain stock pharmaceutical supply clinical ward ambulatory clinic require maintain expired pharmaceutical availability participation rotation stock pharmacy clinical ward ambulatory clinic . prioritize initiate complete highlight discrepancy pharmacist area clean organize functional maintain equipment automation good working condition problem solve appropriate report issue appropriate pharmacy personnel report product defect i.e. labelling issue product discoloration deterioration precipitate contamination . pharmacist complete incident report report medication error pharmacist complete incident report maintain record pharmacy relate activity participate statistical report pharmacy technician rotation fulfil responsibility task assign area include weekend night shift Participates staff pharmacy technician meeting departmental planning communication activity special project assignment require Participates training orientation personnel technical aspect departmental quality assurance activity cooperatively colleague promote maintain harmonious inter intra departmental relationship maintain professional conduct standard aspect interact hospital staff require perform duty assign qualifications Criminal Record Check Essential graduate Essential license relate preferred sterile compounding preferred sterile compound preferred English French preferred maintain competency equipment automation Essential maintain sterile sterile certification yearly essential note represent OPSEU . CHEO commit provide safe environment staff patient visitor . consistent commitment applicant fully vaccinate covid consider staff volunteer . applicant encourage receive covid booster shot eligible protect spread covid . hiring presentation government issue documentation confirm vaccination provide presentation support documentation valid medical contraindication reasonable consideration pursuant . effective conduct comprehensive pre screening evaluation process . process include varied multidimensional testing write test practical exam assessment . meet essential prefer qualification test . OPSEU grant interview pass pre screening . pre screening include testing . CHEO diversity equal employer . committed provide inclusive barrier free environment start hiring process interest qualified applicant . require accommodation phase recruitment process contact . information receive relation accommodation confidential handle compliance . apply interview contact . Veuillez noter employe actuel CHEO vous avez acces Workday cette offre par l'entremise l'application Workday titre candidat interne . pour postuler veuillez soumettre votre candidature avant . . Les technicien techniciennes pharmacie doivent accepter travailler journee . description DES accomplit les tache suivantes tout les tache definies dans Modele normes des technicien OCP . Se tenir informe suivre les politiques procedures du Departement pharmacie l'Hopital bases sur les standard professionnel pharmacy les reglementation vigueurestenir jour profil electronique exact chaque patient . verifier livrer les medicaments d'ordonnance aux patient hospitalises ambulatoire . § Distribuer tous les produits pharmaceutique tenir l'inventaire jourincluant les medicaments figurent au formulaire les stupefiants substance ciblees controllees les medicament d'urgence les medicaments d'essais clinique . stock produits pharmaceutique desautre fourniture dans les lieux travail du Departement pharmacie . Inscrire les produits les fourniture pharmaceutique manquants sur liste commande designee les signaler technicien ne pharmacie assigneea l'approvisionnement . Approvisionner es stock produits pharmaceutique fourniture dans les services cliniques . les produits pharmaceutique disponible les etage participer debuter completer les histoires medicamenteuses des patients informer rapidement pharmacien toutes divergence pour . l'ordre fonctionnalite des lieux travail . les dispositifs automatiques bon etat fonctionnement signaler les problemes aux membres du personnel concernes . Signaler au pharmacien les defauts des produit tel mauvais etiquetage les produit remplir rapport participer compilation des statistique du Departement Pharmacie Participer aux role des technicien pharmacie rotation des horaires quart weekend nuit . Participer aux reunions du personnel des technicien du Departement pharmacie projets . Participer formation l'orientation des nouveaux employes leur montrant les aspect technique du Departement pharmacie . Participer aux activites d'assurance qualite du Departement . favoriser d'entretenir des relation dans pharmacie avec les autres services l'Hopital . demande du superviseur . qualification Essentiel Diplome technicien pharmacie d'un collegue accredite Essentiel Agrement technicien pharmacie l'Ordre des Essentiel deux ans preparation d'article sterile preparation d'article sterile Bilinguisme francais anglais Maintenir jour ses connaissance assurer bon fonctionnement tous les equipement tous les dispositifs automatique Essentiel Reussir pour les preparation sterile steriles Essentiel Veuillez noter vous serez represente SEFPO . personnel aux patient aux visiteur . Conformement cet engagement tous les candidats doivent etre entierement vaccines contre COVID pour etre consideres comme des candidats pour . candidats recevoir leurs doses rappel contre COVID admissible pour eviter propagation covid . confirmant vaccination complete raisonnable . partir du mars CHEO menera processus preselection d'evaluation complet . Ce processus peut comprendre des test varie multidimensionnels tel qu'un test ecrit examen pratique une autre evaluation . Tous les candidats satisfont aux qualifications essentielles testes . Tous les membres OPSEU serront une entrevue apres avoir passe preselection . preselection peut comprendre des test . employeur souscrit au principe l'egalite d'acces . nous nous sommes engages fournir environnement travail inclusif sans obstacle commencant par nous provenant tous les candidats qualifie . Si vous avez besoin mesures d'adaptation pendant une phase du processus recrutement humaine . Tous les renseignements recus concernant les mesures d'adaptation resteront seront traites conformement Loi sur l'accessibilite pour . nous remercion tout les personnes posent leur candidature toutefois nous ne communiquerons qu'avec celles seront convoquees une entrevue . note represent OPSEU . CHEO diversity equal employer . committed provide inclusive barrier free environment start hiring process interest qualified applicant . require accommodation phase recruitment process contact . information receive relation accommodation confidential handle compliance . apply interview contact . posting applicable"
    }
}