{
    "id": "e16983cc8e2cdb17",
    "companyDescription": "L'Université d'Ottawa, également connue sous le nom de uOttawa, est une institution bilingue dynamique et vibrante située au cœur de la ville de la capitale du Canada, Ottawa. Avec plus de 40 000 étudiants inscrits dans une grande variété de programmes, uOttawa est l'une des plus grandes et des plus diversifiées universités du pays.\r\n\r\nÀ uOttawa, nous sommes fiers de notre engagement envers l'excellence dans l'enseignement, la recherche et l'engagement communautaire. Nos membres du corps professoral sont des leaders dans leurs domaines, et nos étudiants bénéficient de petites tailles de classe, d'une attention personnalisée et d'opportunités d'apprentissage pratique.\r\n\r\nEn tant qu'employeur, uOttawa s'engage à fournir un environnement de travail favorable et inclusif qui valorise la diversité, l'équité et l'inclusion. Nous offrons des salaires et des avantages compétitifs, des opportunités de développement professionnel et de promotion de carrière, ainsi qu'une gamme de programmes et services de bien-être pour les employés.\r\n\r\nQue vous cherchiez à rejoindre notre corps professoral en tant que chercheur ou enseignant, ou à travailler dans l'un de nos rôles administratifs ou de soutien, uOttawa offre un environnement de travail dynamique et enrichissant où vous pouvez faire une réelle différence dans la vie de nos étudiants, de notre communauté et du monde entier.\r\n\r\n\r\n____________________________________________________________________\r\n\r\n\r\nThe University of Ottawa, also known as uOttawa, is a dynamic and vibrant bilingual institution located in the heart of Canada's capital city, Ottawa. With over 40,000 students enrolled in a wide variety of programs, uOttawa is one of the largest and most diverse universities in the country.\r\n\r\nAt uOttawa, we pride ourselves on our commitment to excellence in teaching, research, and community engagement. Our faculty members are leaders in their fields, and our students benefit from small class sizes, personalized attention, and hands-on learning opportunities.\r\n\r\nAs an employer, uOttawa is committed to providing a supportive and inclusive workplace environment that values diversity, equity, and inclusion. We offer competitive salaries and benefits, opportunities for professional development and career advancement, and a range of employee wellness programs and services.\r\n\r\nWhether you are looking to join our faculty as a researcher or teacher, or to work in one of our administrative or support roles, uOttawa offers a dynamic and rewarding work environment where you can make a real difference in the lives of our students, our community, and the world at large.\r\n",
    "description": "Job Family:\n  Academic Leadership and Faculty\n \n   Union affiliation:\n \n  APUO\n \n \n   Faculty/Department:\n  Department of Earth and Environmental Sciences_FT\n \n \n   Campus:\n  Main Campus\n \n \n   Date Posted:\n  janvier 23, 2024\n \n \n   Closing Date:\n  février 24, 2024\n \n   Note: Applications will be accepted until 11:59 PM on the day prior to the Posting End Date above\n \n \n \n   The \n  \n   University of Ottawa\n   and its \n  \n   Faculty of Science\n   invites applications for a Tier 1 Canada Research Chair in Accelerator Mass Spectrometry (AMS) with applications related to Quaternary science, which may include paleoecology, paleolimnology, paleoclimatology, carbon cycling, and modern surface processes.\n \n \n \n   The successful candidate will work in the \n  \n   Department of Earth and Environmental Sciences\n   and should be an established researcher who have received widespread recognition for their sustained accomplishments in applying radiotracers and isotopes to investigate knowledge gaps in Quaternary science. This position will involve strategic long-term collaboration with, and use of, the \n  \n   André E. Lalonde AMS Laboratory\n   and other geochemical facilities including the \n  \n   Ján Veizer Stable Isotope Laboratory\n   hosted within University of Ottawa. The AEL AMS Lab is a Canadian National Laboratory, which hosts unique instrumentation including a MICADAS (2022) and a recently upgraded 3MV AMS (2023) along with a world-class sample preparation facility for radiocarbon and actinides analyses. The candidate will have extensive analytical experience in AMS techniques and a long-term research vision for incorporating AMS technology in their research program.\n \n \n \n   Analytical laboratories on campus include microbeam (SEM, TEM, EMPA), X-ray (SCXRD, PXRD, XRF, Micro-CT), and geochemical (LA-ICP-MS, ICP-ES, ICP-OES) facilities, and noble gas and stable isotope instrumentation. The University of Ottawa is recognized nationally and internationally as one of the best universities in the country and the largest bilingual university in the world.\n \n \n \n   Tier 1 Chairs, tenable for seven years and renewable once, are for outstanding researchers acknowledged by their peers as world leaders in their fields. For each Tier 1 Chair, the institution receives $200,000 annually for seven years. Nominees for Tier 1 Chair positions must be full professors or associate professors who are expected to be promoted to the full professor level within one or two years of the nomination. Alternatively, if they come from outside the academic sector, nominees must possess the necessary qualifications to be appointed at these levels. New CRC nominees are also eligible for infrastructure support from the \n  \n   Canada Foundation for Innovation\n   (CFI) to help acquire state-of-the-art equipment essential to their work.\n \n \n \n   Standard hiring:\n \n \n   The University of Ottawa is committed to ensuring equity, diversity and inclusion in the scholarly and leadership environments of our students, staff, and faculty. Accordingly, we strongly encourage applications from skilled and experienced members of the four designated groups (such as Indigenous peoples, racialized individuals, persons with disabilities, women and gender equity-seeking groups, as defined in the CRC Program \n  \n   method for establishing equity targets\n   and the \n  \n   Employment Equity Act\n  ), as well as from all qualified candidates with the skills and knowledge to productively implement equity measures that ensure and retain diverse teams and promote inclusive practices for research team members. All candidates are asked to complete the confidential self-identification form during the application process online (Employment Equity Questionnaire). Internal candidates are not eligible.\n \n \n \n   Skills requirements:\n \n \n  \n   \n     Education: PhD in Earth Sciences, Geology, or Environmental Sciences.\n   \n  \n   \n     Required Qualifications: Outstanding independent research achievements in the CRC’s identified area(s) and proof of interdisciplinary collaborations, a solid record with respect to teaching and training of students at the graduate level, strong record of external research funding, excellent communication skills in either English or French. Passive knowledge of the other official language in Canada is a requirement for tenure. English-French bilingualism is an asset.\n   \n \n \n \n   Duties:\n \n \n   The responsibilities include: 1) teaching across the broad spectrum of Earth and environmental sciences; 2) supervision of BSc, MSc and PhD students; 3) maintaining a strong track record of attracting research funding, 4) preparing large grant applications and overseeing their implementation to ensure funding requirements are met and infrastructure is maintained (the 6-year cycle of the Major Science Initiative funding for the AEL-AMS was successfully renewed in 2023), and 5) promoting a competitive publication record demonstrating impactful scientific contributions.\n \n \n \n   Rank and salary:\n \n \n   Regular tenure-track academic appointment in the Faculty of Science. The salary range for a full professor is $118,864 to $207,511 (based on the May 1, 2023, scale of the collective agreement between APUO and the University of Ottawa). Salaries are competitive and commensurate with qualifications and experience.\n \n \n \n   Benefits package:\n \n \n   The University of Ottawa provides a complete benefits package which includes long term disability, basic group life insurance, supplementary health insurance, University of Ottawa Pension Plan and optional life insurance, as well as relocation expenses.\n \n \n \n   Location of work:\n \n \n   Department of Earth & Environmental Sciences, Faculty of Science, University of Ottawa, 150 Louis Pasteur Pvt., Ottawa, Ontario K1N 6N5 Canada\n \n \n \n   Application Package:\n \n \n  \n   \n     A cover letter outlining qualifications (up to 2 pages);\n   \n  \n   \n     An up-to-date curriculum vitae (Please include any personal circumstances and/or career interruptions such as parental or sick leaves that may have impacted your research trajectory. These will be taken into consideration in the selection process);\n   \n  \n   \n     A research statement describing accomplishments, analytical experience and lab space requirements (up to 3 pages);\n   \n  \n   \n     Outline of a seven-year research program and its relationship to one or more \n    \n     university strategic areas of research\n    , including potential funding sources (up to 3 pages);\n   \n  \n   \n     A statement of teaching interests (up to 2 pages);\n   \n  \n   \n     A statement on equity, diversity, and inclusion philosophy and concrete practices (1 page);\n   \n  \n   \n     The names of three people whom may be contacted by the University for letters of reference which will follow the \n    \n     Canada Research Chairs guidelines\n     (i.e. all three arm’s length including one international); and\n   \n  \n   \n     Self-identification: Complete the confidential Employment equity questionnaire on the web portal during the application process. The Canada Research Chairs Program requires institutions to collect self-identification data from all applicants, following the program’s \n    \n     best practices\n    .\n   \n \n \n \n   Deadline: February 23, 2024\n \n \n \n   Applications should be submitted electronically through the University of Ottawa Careers portal.\n \n \n \n   The selection process will begin immediately after the closing date and will continue until the position is filled. Only candidates selected for an interview will be contacted.\n \n \n \n   Please address your cover letter to the following person:\n \n \n   Dr. Sylvain Charbonneau, Vice-President, Research and Innovation\n \n \n   University of Ottawa\n \n \n   550 Cumberland St., room 246\n \n \n   Ottawa, ON K1N 6N5 CANADA\n \n \n   For questions, please email: \n  \n   rccacrcp@uottawa.ca\n  \n \n \n \n   Ad posted on Tuesday, January 23, 2024\n \n \n \n   The University of Ottawa is committed to ensuring equity, diversity, and inclusion in the scholarly and leadership environments of our students, staff, and faculty. Accordingly, we strongly encourage applications from Indigenous Peoples in Canada, visible minorities members (racialized persons), persons with disabilities, women, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse, and inclusive communities. Candidates who wish to be considered as a member of one or more designated groups are asked to complete the confidential Self-Identification Questionnaire, to be completed at the time of application.\n \n \n \n   All qualified candidates are invited to apply; however, preference will be given to Canadians and permanent residents. When submitting your application, please indicate if you are legally entitled to work in Canada\n \n \n \n   The University of Ottawa provides accommodations for applicants with disabilities throughout the recruitment process. If you are invited to proceed in the selection process, please notify us of any accommodations that you require by contacting the Office of the Vice-Provost, Faculty Relations by email at \n  \n   vra.affairesprofessorales@uottawa.ca\n  . Any information you send us will be handled respectfully and in complete confidence.\n \n \n \n   The University of Ottawa is proud of its 160-year tradition of bilingualism. Through its Official Languages and Bilingualism Institute, the University provides training to staff members and to their spouses in their second official language.\n \n \n \n   Prior to May 1, 2022, the University required all students, faculty, staff, and visitors (including contractors) to be fully vaccinated against Covid-19 as defined in Policy 129 – Covid-19 Vaccination. This policy was suspended effective May 1, 2022 but may be reinstated at any point in the future depending on public health guidelines and the recommendations of experts.",
    "preprocessed_description": "Job Family: Academic Leadership and Faculty Union affiliation: APUO Faculty/Department: Department of Earth and Environmental Sciences_FT Campus: Main Campus Date Posted: janvier 23, 2024 Closing Date: février 24, 2024 Note: Applications will be accepted until 11:59 Project Manager on the day prior to the Posting End Date above The University of Ottawa and its Faculty of Science invites applications for a Tier 1 Canada Research Chair in Accelerator Mass Spectrometry (AMS) with applications related to Quaternary science, which may include paleoecology, paleolimnology, paleoclimatology, carbon cycling, and modern surface processes. The successful candidate will work in the Department of Earth and Environmental Sciences and should be an established researcher who have received widespread recognition for their sustained accomplishments in applying radiotracers and isotopes to investigate knowledge gaps in Quaternary science. This position will involve strategic long-term collaboration with, and use of, the André E. Lalonde AMS Laboratory and other geochemical facilities including the Ján Veizer Stable Isotope Laboratory hosted within University of Ottawa. The AEL AMS Lab is a Canadian National Laboratory, which hosts unique instrumentation including a MICADAS (2022) and a recently upgraded 3MV AMS (2023) along with a world-class sample preparation facility for radiocarbon and actinides analyses. The candidate will have extensive analytical experience in AMS techniques and a long-term research vision for incorporating AMS technology in their research program. Analytical laboratories on campus include microbeam (SEM, TEM, EMPA), X-ray (SCXRD, PXRD, XRF, Micro-CT), and geochemical (LA-ICP-MS, ICP-ES, ICP-OES) facilities, and noble gas and stable isotope instrumentation. The University of Ottawa is recognized nationally and internationally as one of the best universities in the country and the largest bilingual university in the world. Tier 1 Chairs, tenable for seven years and renewable once, are for outstanding researchers acknowledged by their peers as world leaders in their fields. For each Tier 1 Chair, the institution receives $200,000 annually for seven years. Nominees for Tier 1 Chair positions must be full professors or associate professors who are expected to be promoted to the full professor level within one or two years of the nomination. Alternatively, if they come from outside the academic sector, nominees must possess the necessary qualifications to be appointed at these levels. New CRC nominees are also eligible for infrastructure support from the Canada Foundation for Innovation (CFI) to help acquire state-of-the-art equipment essential to their work. Standard hiring: The University of Ottawa is committed to ensuring equity, diversity and inclusion in the scholarly and leadership environments of our students, staff, and faculty. Accordingly, we strongly encourage applications from skilled and experienced members of the four designated groups (such as Indigenous peoples, racialized individuals, persons with disabilities, women and gender equity-seeking groups, as defined in the CRC Program method for establishing equity targets and the Employment Equity Act ), as well as from all qualified candidates with the skills and knowledge to productively implement equity measures that ensure and retain diverse teams and promote inclusive practices for research team members. All candidates are asked to complete the confidential self-identification form during the application process online (Employment Equity Questionnaire). Internal candidates are not eligible. Skills requirements: Education: PhD in Earth Sciences, Geology, or Environmental Sciences. Required Qualifications: Outstanding independent research achievements in the CRC's identified area(s) and proof of interdisciplinary collaborations, a solid record with respect to teaching and training of students at the graduate level, strong record of external research funding, excellent communication skills in either English or French. Passive knowledge of the other official language in Canada is a requirement for tenure. English-French bilingualism is an asset. Duties: The responsibilities include: 1) teaching across the broad spectrum of Earth and environmental sciences; 2) supervision of BSc, MSc and PhD students; 3) maintaining a strong track record of attracting research funding, 4) preparing large grant applications and overseeing their implementation to ensure funding requirements are met and infrastructure is maintained (the 6-year cycle of the Major Science Initiative funding for the AEL-AMS was successfully renewed in 2023), and 5) promoting a competitive publication record demonstrating impactful scientific contributions. Rank and salary: Regular tenure-track academic appointment in the Faculty of Science. The salary range for a full professor is $118,864 to $207,511 (based on the May 1, 2023, scale of the collective agreement between APUO and the University of Ottawa). Salaries are competitive and commensurate with qualifications and experience. Benefits package: The University of Ottawa provides a complete benefits package which includes long term disability, basic group life insurance, supplementary health insurance, University of Ottawa Pension Plan and optional life insurance, as well as relocation expenses. Location of work: Department of Earth & Environmental Sciences, Faculty of Science, University of Ottawa, 150 Louis Pasteur Pvt., Ottawa, Ontario K1N 6N5 Canada Application Package: A cover letter outlining qualifications (up to 2 pages); An up-to-date curriculum vitae (Please include any personal circumstances and/or career interruptions such as parental or sick leaves that may have impacted your research trajectory. These will be taken into consideration in the selection process); A research statement describing accomplishments, analytical experience and lab space requirements (up to 3 pages); Outline of a seven-year research program and its relationship to one or more university strategic areas of research , including potential funding sources (up to 3 pages); A statement of teaching interests (up to 2 pages); A statement on equity, diversity, and inclusion philosophy and concrete practices (1 page); The names of three people whom may be contacted by the University for letters of reference which will follow the Canada Research Chairs guidelines (i.e. all three arm's length including one international); and Self-identification: Complete the confidential Employment equity questionnaire on the web portal during the application process. The Canada Research Chairs Program requires institutions to collect self-identification data from all applicants, following the program's best practices . Deadline: February 23, 2024 Applications should be submitted electronically through the University of Ottawa Careers portal. The selection process will begin immediately after the closing date and will continue until the position is filled. Only candidates selected for an interview will be contacted. Please address your cover letter to the following person: Dr. Sylvain Charbonneau, Vice-President, Research and Innovation University of Ottawa 550 Cumberland St., room 246 Ottawa, ON K1N 6N5 CANADA For questions, please email: rccacrcp@uottawa.ca Ad posted on Tuesday, January 23, 2024 The University of Ottawa is committed to ensuring equity, diversity, and inclusion in the scholarly and leadership environments of our students, staff, and faculty. Accordingly, we strongly encourage applications from Indigenous Peoples in Canada, visible minorities members (racialized persons), persons with disabilities, women, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse, and inclusive communities. Candidates who wish to be considered as a member of one or more designated groups are asked to complete the confidential Self-Identification Questionnaire, to be completed at the time of application. All qualified candidates are invited to apply; however, preference will be given to Canadians and permanent residents. When submitting your application, please indicate if you are legally entitled to work in Canada The University of Ottawa provides accommodations for applicants with disabilities throughout the recruitment process. If you are invited to proceed in the selection process, please notify us of any accommodations that you require by contacting the Office of the Vice-Provost, Faculty Relations by email at vra.affairesprofessorales@uottawa.ca . Any information you send us will be handled respectfully and in complete confidence. The University of Ottawa is proud of its 160-year tradition of bilingualism. Through its Official Languages and Bilingualism Institute, the University provides training to staff members and to their spouses in their second official language. Prior to May 1, 2022, the University required all students, faculty, staff, and visitors (including contractors) to be fully vaccinated against Covid-19 as defined in Policy 129 – Covid-19 Vaccination. This policy was suspended effective May 1, 2022 but may be reinstated at any point in the future depending on public health guidelines and the recommendations of experts.",
    "processed_description": "Family Academic Leadership Faculty Union affiliation Main Campus post janvier closing fevrier note application accept Project Manager invite application tier Research Chair Accelerator Mass Spectrometry application relate quaternary science include paleoecology paleolimnology paleoclimatology carbon cycling modern surface process . successful establish researcher receive widespread recognition sustain accomplishment apply radiotracer isotope investigate knowledge gap quaternary science . position involve strategic long term collaboration geochemical facility include host . host unique instrumentation include upgrade class sample preparation facility radiocarbon actinide analysis . extensive analytical AMS technique long term research vision incorporate AMS technology research program . analytical laboratory campus include microbeam SEM ray geochemical ICP MS ICP OES facility noble gas stable isotope instrumentation . recognize nationally internationally good university country large university . tier chair tenable renewable outstanding researcher acknowledge peer leader field . tier Chair institution receive . nominee Tier Chair position professor associate professor expect promote professor level nomination . alternatively academic sector nominee possess qualification appoint level . CRC nominee eligible infrastructure support CFI help acquire state art equipment essential . standard hiring commit ensure equity diversity inclusion scholarly leadership environment student staff faculty . encourage application skilled experienced designate group indigenous people racialize individual person woman gender equity seek group define CRC Program method establish equity target qualified skill knowledge productively implement equity measure ensure retain diverse team promote inclusive practice research team . complete confidential identification form application process online Employment Equity Questionnaire . internal eligible . skill requirement education phd . require qualification outstanding independent research achievement CRC's identify area proof interdisciplinary collaboration solid record respect teaching training student graduate level strong record external research funding excellent communication skill . passive knowledge official language requirement tenure . english french bilingualism asset . duty responsibility include teaching broad spectrum Earth environmental science supervision BSc MSc student maintain strong track record attract research funding prepare large grant application oversee implementation ensure funding requirement meet infrastructure maintain cycle Major Science Initiative funding renew promote competitive publication record demonstrate impactful scientific contribution . rank salary regular tenure track academic appointment . salary range professor base scale collective agreement . salary competitive commensurate qualification . benefit package provide complete benefit package include long term basic group life insurance supplementary health insurance optional life insurance relocation expense . location K1N 6n5 Application Package cover letter outline qualification curriculum vitae include personal circumstance career interruption parental sick leave impact research trajectory . consideration selection process research statement describe accomplishment analytical lab space requirement outline research program relationship university strategic area research include potential funding source statement teaching interest statement equity diversity inclusion philosophy concrete practice people contact University letter reference follow Research Chairs guideline i.e. arm's length include international identification complete confidential Employment equity questionnaire web portal application process . require institution collect identification datum applicant follow program's good practice . deadline submit electronically portal . selection process closing continue position fill . select interview contact . address cover letter follow person Vice room question email ad post commit ensure equity diversity inclusion scholarly leadership environment student staff faculty . encourage application visible minority racialize person person woman qualified skill knowledge productively engage equitable diverse inclusive community . consider designate group complete confidential Identification Questionnaire complete application . qualified invite apply preference permanent resident . submit application indicate legally entitle provide accommodation applicant recruitment process . invite proceed selection process notify accommodation require contact email . information send handle respectfully complete confidence . tradition bilingualism . provide training staff spouse second official language . prior require student faculty staff visitor include contractor fully vaccinate Covid define Policy – Covid Vaccination . policy suspend effective reinstate point future depend public health guideline recommendation expert .",
    "results_group": {
        "extracted_noun_chunks": [
            "microbeam SEM ray geochemical ICP MS ICP",
            "standard hiring commit",
            "complete benefit package",
            "competitive publication record",
            "implementation",
            "selection process closing",
            "knowledge gap quaternary science",
            "Project Manager",
            "identification datum",
            "extensive analytical AMS technique long term research vision",
            "contractor",
            "rank salary regular tenure track academic appointment",
            "AMS technology research program",
            "contact email",
            "Covid Vaccination",
            "infrastructure",
            "applicant",
            "application tier Research Chair Accelerator Mass Spectrometry application",
            "accommodation",
            "designate group",
            "diverse team",
            "paleoecology paleolimnology paleoclimatology carbon cycling modern surface process",
            "host unique instrumentation",
            "CFI help",
            "interest statement equity diversity inclusion philosophy concrete practice people",
            "equity measure",
            "CRC's identify area",
            "Covid",
            "radiotracer isotope",
            "widespread recognition",
            "salary range professor base scale collective agreement",
            "analytical laboratory campus",
            "address cover letter",
            "skill requirement education phd",
            "location",
            "effective reinstate point future",
            "funding requirement",
            "equity diversity inclusion scholarly leadership environment student staff faculty",
            "accomplishment analytical lab space requirement",
            "permanent resident",
            "Research Chairs guideline i.e. arm's length",
            "benefit package",
            "policy",
            "impactful scientific contribution",
            "salary competitive commensurate qualification",
            "proceed selection process",
            "public health guideline recommendation expert",
            "equitable diverse inclusive community",
            "tier chair tenable renewable outstanding researcher",
            "maintain cycle Major Science Initiative funding renew",
            "professor level nomination",
            "upgrade class sample preparation facility radiocarbon actinide analysis",
            "outline research program relationship university strategic area research",
            "individual person woman gender equity seek group",
            "tier Chair institution",
            "complete confidential identification form application process",
            "select interview contact",
            "qualification outstanding independent research achievement",
            "consideration selection process research statement",
            "successful establish researcher",
            "accomplishment",
            "CRC nominee",
            "preference",
            "tradition bilingualism",
            "CRC Program method",
            "strong track record",
            "application",
            "passive knowledge official language requirement tenure",
            "information",
            "large grant application",
            "online Employment Equity Questionnaire",
            "peer leader field",
            "broad spectrum Earth environmental science supervision BSc MSc student",
            "strategic long term collaboration geochemical facility",
            "Policy",
            "deadline",
            "training staff spouse second official language",
            "University letter reference",
            "position",
            "long term basic group life insurance supplementary health insurance optional life insurance relocation expense",
            "person",
            "potential funding source statement",
            "institution",
            "cover letter outline qualification curriculum vitae",
            "noble gas stable isotope instrumentation",
            "Family Academic Leadership Faculty Union affiliation Main Campus post janvier closing fevrier",
            "duty responsibility",
            "Vice room question email ad post commit",
            "legally entitle",
            "nominee Tier Chair position professor associate professor",
            "student faculty staff visitor",
            "internationally good university country large university",
            "alternatively academic sector nominee possess qualification appoint level",
            "equity target qualified skill knowledge",
            "training student graduate level strong record external research funding excellent communication skill",
            "inclusive practice research team",
            "personal circumstance career interruption parental sick leave impact research trajectory",
            "respectfully complete confidence",
            "applicant recruitment process",
            "skilled experienced designate group indigenous people",
            "host",
            "visible minority racialize person person woman qualified skill knowledge",
            "english french bilingualism asset",
            "research funding",
            "confidential Employment equity questionnaire web portal application process",
            "international identification",
            "K1N 6n5 Application Package",
            "interdisciplinary collaboration solid record respect",
            "state art equipment",
            "quaternary science"
        ],
        "combined_lemmatized_tokens": "Family Academic Leadership Faculty Union affiliation Main Campus post janvier closing fevrier note application accept Project Manager invite application tier Research Chair Accelerator Mass Spectrometry application relate quaternary science include paleoecology paleolimnology paleoclimatology carbon cycling modern surface process . successful establish researcher receive widespread recognition sustain accomplishment apply radiotracer isotope investigate knowledge gap quaternary science . position involve strategic long term collaboration geochemical facility include host . host unique instrumentation include upgrade class sample preparation facility radiocarbon actinide analysis . extensive analytical AMS technique long term research vision incorporate AMS technology research program . analytical laboratory campus include microbeam SEM ray geochemical ICP MS ICP OES facility noble gas stable isotope instrumentation . recognize nationally internationally good university country large university . tier chair tenable renewable outstanding researcher acknowledge peer leader field . tier Chair institution receive . nominee Tier Chair position professor associate professor expect promote professor level nomination . alternatively academic sector nominee possess qualification appoint level . CRC nominee eligible infrastructure support CFI help acquire state art equipment essential . standard hiring commit ensure equity diversity inclusion scholarly leadership environment student staff faculty . encourage application skilled experienced designate group indigenous people racialize individual person woman gender equity seek group define CRC Program method establish equity target qualified skill knowledge productively implement equity measure ensure retain diverse team promote inclusive practice research team . complete confidential identification form application process online Employment Equity Questionnaire . internal eligible . skill requirement education phd . require qualification outstanding independent research achievement CRC's identify area proof interdisciplinary collaboration solid record respect teaching training student graduate level strong record external research funding excellent communication skill . passive knowledge official language requirement tenure . english french bilingualism asset . duty responsibility include teaching broad spectrum Earth environmental science supervision BSc MSc student maintain strong track record attract research funding prepare large grant application oversee implementation ensure funding requirement meet infrastructure maintain cycle Major Science Initiative funding renew promote competitive publication record demonstrate impactful scientific contribution . rank salary regular tenure track academic appointment . salary range professor base scale collective agreement . salary competitive commensurate qualification . benefit package provide complete benefit package include long term basic group life insurance supplementary health insurance optional life insurance relocation expense . location K1N 6n5 Application Package cover letter outline qualification curriculum vitae include personal circumstance career interruption parental sick leave impact research trajectory . consideration selection process research statement describe accomplishment analytical lab space requirement outline research program relationship university strategic area research include potential funding source statement teaching interest statement equity diversity inclusion philosophy concrete practice people contact University letter reference follow Research Chairs guideline i.e. arm's length include international identification complete confidential Employment equity questionnaire web portal application process . require institution collect identification datum applicant follow program's good practice . deadline submit electronically portal . selection process closing continue position fill . select interview contact . address cover letter follow person Vice room question email ad post commit ensure equity diversity inclusion scholarly leadership environment student staff faculty . encourage application visible minority racialize person person woman qualified skill knowledge productively engage equitable diverse inclusive community . consider designate group complete confidential Identification Questionnaire complete application . qualified invite apply preference permanent resident . submit application indicate legally entitle provide accommodation applicant recruitment process . invite proceed selection process notify accommodation require contact email . information send handle respectfully complete confidence . tradition bilingualism . provide training staff spouse second official language . prior require student faculty staff visitor include contractor fully vaccinate Covid define Policy – Covid Vaccination . policy suspend effective reinstate point future depend public health guideline recommendation expert ."
    }
}