{
    "id": "a03c654a1febc596",
    "companyDescription": "",
    "description": "Compensation Pay Range:\n  $37.45-$45.96\n \n \n   Job Description:\n \n \n   Please Note: If you are a current CHEO employee with access to Workday, please apply to this posting via the Workday application as an internal applicant.\n \n \n \n   To successfully apply for this position, please submit your application by 11:59 pm the day before the advertised closing date in the posting to ensure your application is received.\n   \n \n \n \n   POSITION SUMMARY\n \n \n   Study Coordinator for local and Multi Center trials including pharma sponsored, cooperative group and investigator initiated trials.\n   Submission of required documents to Canadian and US regulatory bodies.\n   Provide information and documentation for potential protocol patients to physicians (i.e., consents, patient eligibility items, and required pre-study testing).\n   Collect and submit participant data within required timelines.\n   Coordinate collection and shipment of pathology and/or biology materials as required by protocol guidelines and shipping regulations where appropriate.\n   Maintains inventory and ordering of study supplies.\n   Distributes the study protocol and procures required departmental, division, director/manager authorizations for all personnel directly or indirectly involved in new clinical trial applications to the REB.\n   Act as a resource to trial and medical staff, nurses, colleagues, and other departments as required in the clinical trial process.\n   Development and maintenance of divisional Standard Operating Procedures.\n   Oversees and supports research administration assistant, research assistants and students\n   Proficient in multiple electronic data capture systems.\n   Prepare institution for site audits and monitoring by sponsor, regulatory bodies and drug companies.\n   Mandatory training maintained from institution, sponsor, REB.\n   Maintain professional certification based on continuing education related to clinical research, regulations, policy, education and therapeutic or professional area of experience.\n   Supervise training and orientation of new CRA’s/students. s\n   Perform work in accordance with the provisions of the Occupational Health and Safety Act and Regulations and all CHEO corporate/departmental policies and procedures related to Occupational Health and Safety.\n \n \n \n   QUALIFICATIONS\n \n \n   Police Record Check (PRC) (Essential)\n   University undergraduate degree/College diploma in a health related field (Essential)\n   Certification with the Society of Clinical Research Associates (SoCRA) or the Association of Clinical Research Professionals (ACRP) or in progress (Essential)\n   Minimum 2 years research experience (Essential)\n   Understanding of research design, procedures, guidelines and standards governing clinical trials (Essential)\n   Certification in GCP, Health Canada Division 5, TCPS2 and TDG (Preferred)\n   Demonstrated management and organizational skills (Essential)\n   Data management experience (Essential)\n   Proficiency in computer skills (Essential)\n   Effective interpersonal, verbal and written communication skills (Essential)\n   Bilingual (English/ French) (Preferred)\n \n \n \n  Please note you will be represented by the Ontario Public Service Employees Union (OPSEU). Please note that this position will be based out of Ottawa. Please note that location may be subject to change at any time at the discretion of the employer\n \n \n \n   CHEO is committed to providing a safe environment for staff, patients, and visitors. Consistent with that commitment, all applicants must be fully vaccinated against COVID-19 to be considered for any staff or volunteer opportunities. Applicants are also strongly encouraged to receive their COVID-19 booster shots when eligible to protect against the spread of COVID-19. Upon hiring, presentation of government issued documentation confirming full vaccination must be provided, o presentation of supporting documentation of a valid medical contraindication or other reasonable consideration pursuant to the Ontario Human Rights Code.\n \n \n \n   Effective March 29, 2021, CHEO will conduct a more comprehensive pre-screening and evaluation process. This process may include more varied and multidimensional testing such as a written test, practical exam, or other assessment. All candidates who meet the essential and preferred qualifications may be tested. All OPSEU members shall be granted an interview upon passing the pre-screening. Pre-screening might include testing.\n \n \n \n   CHEO values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants.\n \n \n \n   Should you require accommodation during any phase in the recruitment process, please contact Human Resources at \n  \n   jobs@cheo.on.ca\n  . All information received in relation to accommodation will be kept confidential and will be handled in compliance with the Accessibility for Ontarians with Disabilities Act.\n \n \n \n   We thank all those who apply, however, only those to be interviewed will be contacted.\n \n \n \n   Veuillez noter : Si vous êtes un employé actuel de CHEO et que vous avez accès à Workday, veuillez postuler à cette offre par l’entremise de l’application Workday à titre de candidat interne.\n \n \n \n   Pour postuler avec succès à ce poste, veuillez soumettre votre candidature avant 23 h 59 le jour précédant la date de clôture annoncée dans l’annonce afin de vous assurer que votre candidature sera bien reçue.\n \n \n \n   RÉSUMÉ DES FONCTIONS\n \n \n   Coordonner des études pour les essais locaux et multicentriques, y compris les essais parrainés par des groupes pharmaceutiques, initiés par des groupes coopératifs et des chercheurs ;\n   Soumettre les documents requis aux organismes de réglementation canadiens et américains ;\n   Fournir aux médecins des informations et des documents relativement au protocole sur les patients potentiels (c’est-à-dire les consentements, les éléments d’admissibilité des patients et les tests préalables à l’étude requis) ;\n   Recueillir et soumettre les données des participants dans les délais requis ;\n   Coordonner la collecte et l’expédition du matériel de pathologie et/ou de biologie conformément aux directives du protocole et aux réglementations d’expédition, le cas échéant ;\n   Tenir l’inventaire et la commande des fournitures d’étude ;\n   Distribuer le protocole d’étude et fournir les autorisations du département, de la division et du directeur/gestionnaire pour tout le personnel participant directement ou indirectement à de nouvelles demandes d’essais cliniques au CER ;\n   Agir en tant que ressource pour le personnel de l’étude, le personnel médical et infirmier, les collègues et les autres services, selon les besoins du processus d’essais cliniques;\n   Élaborer et maintenir les procédures opérationnelles normales de la division ;\n   Superviser et soutenir les adjoints administratifs de la recherche, les adjoints à la recherche ainsi que les étudiants\n   Maîtriser plusieurs systèmes de saisie de données électroniques ;\n   Préparer l’organisme pour les audits de site et la surveillance effectués par le promoteur, les organismes de réglementation et les sociétés pharmaceutiques ;\n   Formation obligatoire maintenue par l’organisme, le promoteur et le CER ;\n   Maintenir sa certification professionnelle basée sur la formation continue liée à la recherche clinique, aux réglementations, aux politiques, à la formation et au domaine d’expérience thérapeutique ou professionnelle ;\n   Superviser la formation et l’orientation des nouveaux étudiants/ARC ;\n   Effectuer son travail conformément aux dispositions de la Loi sur la santé et la sécurité au travail et de ses règlements, ainsi qu’à toutes les politiques et procédures internes de CHEO.\n \n \n \n   QUALIFICATIONS\n \n \n   Vérification du casier judiciaire (Essentiel)\n   Diplôme universitaire de premier cycle/diplôme collégial dans un domaine lié à la santé (Essentiel)\n   Certification auprès de la Society of Clinical Research Associates (SoCRA) ou de l’Association des professionnels de la recherche clinique (ACRP) ou en cours (Essentiel)\n   Minimum de 2 ans d’expérience en recherche (Essentiel)\n   Compréhension de la conception de la recherche, des procédures, des lignes directrices et des normes régissant les essais cliniques (Essentiel)\n   Certification en BPC, Division 5 de Santé Canada, EPTC2 et TMD (Préférable)\n   Compétences démontrées en gestion et en organisation (Essentiel)\n   Expérience en gestion de données (Essentiel)\n   Maîtrise des compétences informatiques (Essentiel)\n   Compétences efficaces en communication interpersonnelle, verbale et écrite (Essentiel)\n   Bilinguisme (anglais/français) (Préférable)\n \n \n \n  Veuillez noter que vous serez représenté.e par le syndicat des employés de la fonction publique de l’Ontario. Veuillez noter que ce poste sera basé à Ottawa. Veuillez noter que l’emplacement pourrait être modifié en tout temps à la discrétion de l’employeur.\n \n \n \n   CHEO s’engage à offrir un environnement sécuritaire au personnel, aux patients et aux visiteurs. Conformément à cet engagement, tous les candidats doivent être entièrement vaccinés contre la COVID-19 pour être considérés comme des candidats pour tout emploi de personnel ou de bénévole. Les candidats sont également fortement encouragés à recevoir leurs doses de rappel contre la COVID-19 lorsqu’ils sont admissibles pour éviter la propagation de COVID-19. Lors de l’embauche, la présentation de documents gouvernementaux confirmant la vaccination complète doit être fournie, ou la présentation de documents justificatifs d’une contre-indication médicale valide ou d’une autre considération raisonnable en vertu du Code des droits de la personne de l’Ontario.\n \n \n \n   À partir du 29 mars 2021, CHEO mènera un processus de présélection et d'évaluation plus complet. Ce processus peut comprendre des tests plus variés et multidimensionnels tels qu'un test écrit, un examen pratique ou une autre évaluation. Tous les candidats qui satisfont aux qualifications essentielles et préférées peuvent être testés. Tous les membres de OPSEU serront accorder une entrevue après avoir passé la présélection. La présélection peut comprendre des tests.\n \n \n \n   CHEO valorise la diversité et est un employeur qui souscrit au principe de l’égalité d’accès. Nous nous sommes engagés à fournir un environnement de travail inclusif et sans obstacle, en commençant par le processus d’embauche et nous sommes heureux de recevoir des demandes provenant de tous les candidats qualifiés.\n \n \n   Si vous avez besoin de mesures d’adaptation pendant une phase du processus de recrutement, veuillez communiquer avec les Ressources humaines à \n  \n   jobs@cheo.on.ca\n  . Tous les renseignements reçus concernant les mesures d’adaptation resteront confidentiels et seront traités conformément à la \n  Loi sur l’accessibilité pour les personnes handicapées de l’Ontario.\n \n \n \n   Nous remercions toutes les personnes qui posent leur candidature; toutefois, nous ne communiquerons qu’avec celles qui seront convoquées à une entrevue.\n \n \n \n   Please note you will be represented by the Ontario Public Service Employees Union (OPSEU).\n \n \n \n   CHEO values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants.\n \n \n \n   Should you require accommodation during any phase in the recruitment process, please contact Human Resources at jobs@cheo.on.ca. All information received in relation to accommodation will be kept confidential and will be handled in compliance with the Accessibility for Ontarians with Disabilities Act.\n \n \n \n   We thank all those who apply, however, only those to be interviewed will be contacted.\n \n \n \n   Job Posting End Date (if applicable):\n  January 15, 2024",
    "preprocessed_description": "Compensation Pay Range: $37.45-$45.96 Job Description: Please Note: If you are a current CHEO employee with access to Workday, please apply to this posting via the Workday application as an internal applicant. To successfully apply for this position, please submit your application by 11:59 pm the day before the advertised closing date in the posting to ensure your application is received. POSITION SUMMARY Study Coordinator for local and Multi Center trials including pharma sponsored, cooperative group and investigator initiated trials. Submission of required documents to Canadian and US regulatory bodies. Provide information and documentation for potential protocol patients to physicians (i.e., consents, patient eligibility items, and required pre-study testing). Collect and submit participant data within required timelines. Coordinate collection and shipment of pathology and/or biology materials as required by protocol guidelines and shipping regulations where appropriate. Maintains inventory and ordering of study supplies. Distributes the study protocol and procures required departmental, division, director/manager authorizations for all personnel directly or indirectly involved in new clinical trial applications to the REB. Act as a resource to trial and medical staff, nurses, colleagues, and other departments as required in the clinical trial process. Development and maintenance of divisional Standard Operating Procedures. Oversees and supports research administration assistant, research assistants and students Proficient in multiple electronic data capture systems. Prepare institution for site audits and monitoring by sponsor, regulatory bodies and drug companies. Mandatory training maintained from institution, sponsor, REB. Maintain professional certification based on continuing education related to clinical research, regulations, policy, education and therapeutic or professional area of experience. Supervise training and orientation of new CRA's/students. s Perform work in accordance with the provisions of the Occupational Health and Safety Act and Regulations and all CHEO corporate/departmental policies and procedures related to Occupational Health and Safety. QUALIFICATIONS Police Record Check (PRC) (Essential) University undergraduate degree/College diploma in a health related field (Essential) Certification with the Society of Clinical Research Associates (SoCRA) or the Association of Clinical Research Professionals (ACRP) or in progress (Essential) Minimum 2 years research experience (Essential) Understanding of research design, procedures, guidelines and standards governing clinical trials (Essential) Certification in Good Clinical Practice, Health Canada Division 5, TCPS2 and TDG (Preferred) Demonstrated management and organizational skills (Essential) Data management experience (Essential) Proficiency in computer skills (Essential) Effective interpersonal, verbal and written communication skills (Essential) Bilingual (English/ French) (Preferred) Please note you will be represented by the Ontario Public Service Employees Union (OPSEU). Please note that this position will be based out of Ottawa. Please note that location may be subject to change at any time at the discretion of the employer CHEO is committed to providing a safe environment for staff, patients, and visitors. Consistent with that commitment, all applicants must be fully vaccinated against COVID-19 to be considered for any staff or volunteer opportunities. Applicants are also strongly encouraged to receive their COVID-19 booster shots when eligible to protect against the spread of COVID-19. Upon hiring, presentation of government issued documentation confirming full vaccination must be provided, o presentation of supporting documentation of a valid medical contraindication or other reasonable consideration pursuant to the Ontario Human Rights Code. Effective March 29, 2021, CHEO will conduct a more comprehensive pre-screening and evaluation process. This process may include more varied and multidimensional testing such as a written test, practical exam, or other assessment. All candidates who meet the essential and preferred qualifications may be tested. All OPSEU members shall be granted an interview upon passing the pre-screening. Pre-screening might include testing. CHEO values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants. Should you require accommodation during any phase in the recruitment process, please contact Human Resources at jobs@cheo.on.ca . All information received in relation to accommodation will be kept confidential and will be handled in compliance with the Accessibility for Ontarians with Disabilities Act. We thank all those who apply, however, only those to be interviewed will be contacted. Veuillez noter : Si vous êtes un employé actuel de CHEO et que vous avez accès à Workday, veuillez postuler à cette offre par l'entremise de l'application Workday à titre de candidat interne. Pour postuler avec succès à ce poste, veuillez soumettre votre candidature avant 23 h 59 le jour précédant la date de clôture annoncée dans l'annonce afin de vous assurer que votre candidature sera bien reçue. RÉSUMÉ DES FONCTIONS Coordonner des études pour les essais locaux et multicentriques, y compris les essais parrainés par des groupes pharmaceutiques, initiés par des groupes coopératifs et des chercheurs ; Soumettre les documents requis aux organismes de réglementation canadiens et américains ; Fournir aux médecins des informations et des documents relativement au protocole sur les patients potentiels (c'est-à-dire les consentements, les éléments d'admissibilité des patients et les tests préalables à l'étude requis) ; Recueillir et soumettre les données des participants dans les délais requis ; Coordonner la collecte et l'expédition du matériel de pathologie et/ou de biologie conformément aux directives du protocole et aux réglementations d'expédition, le cas échéant ; Tenir l'inventaire et la commande des fournitures d'étude ; Distribuer le protocole d'étude et fournir les autorisations du département, de la division et du directeur/gestionnaire pour tout le personnel participant directement ou indirectement à de nouvelles demandes d'essais cliniques au CER ; Agir en tant que ressource pour le personnel de l'étude, le personnel médical et infirmier, les collègues et les autres services, selon les besoins du processus d'essais cliniques; Élaborer et maintenir les procédures opérationnelles normales de la division ; Superviser et soutenir les adjoints administratifs de la recherche, les adjoints à la recherche ainsi que les étudiants Maîtriser plusieurs systèmes de saisie de données électroniques ; Préparer l'organisme pour les audits de site et la surveillance effectués par le promoteur, les organismes de réglementation et les sociétés pharmaceutiques ; Formation obligatoire maintenue par l'organisme, le promoteur et le CER ; Maintenir sa certification professionnelle basée sur la formation continue liée à la recherche clinique, aux réglementations, aux politiques, à la formation et au domaine d'expérience thérapeutique ou professionnelle ; Superviser la formation et l'orientation des nouveaux étudiants/ARC ; Effectuer son travail conformément aux dispositions de la Loi sur la santé et la sécurité au travail et de ses règlements, ainsi qu'à toutes les politiques et procédures internes de CHEO. QUALIFICATIONS Vérification du casier judiciaire (Essentiel) Diplôme universitaire de premier cycle/diplôme collégial dans un domaine lié à la santé (Essentiel) Certification auprès de la Society of Clinical Research Associates (SoCRA) ou de l'Association des professionnels de la recherche clinique (ACRP) ou en cours (Essentiel) Minimum de 2 ans d'expérience en recherche (Essentiel) Compréhension de la conception de la recherche, des procédures, des lignes directrices et des normes régissant les essais cliniques (Essentiel) Certification en BPC, Division 5 de Santé Canada, EPTC2 et TMD (Préférable) Compétences démontrées en gestion et en organisation (Essentiel) Expérience en gestion de données (Essentiel) Maîtrise des compétences informatiques (Essentiel) Compétences efficaces en communication interpersonnelle, verbale et écrite (Essentiel) Bilinguisme (anglais/français) (Préférable) Veuillez noter que vous serez représenté.e par le syndicat des employés de la fonction publique de l'Ontario. Veuillez noter que ce poste sera basé à Ottawa. Veuillez noter que l'emplacement pourrait être modifié en tout temps à la discrétion de l'employeur. CHEO s'engage à offrir un environnement sécuritaire au personnel, aux patients et aux visiteurs. Conformément à cet engagement, tous les candidats doivent être entièrement vaccinés contre la COVID-19 pour être considérés comme des candidats pour tout emploi de personnel ou de bénévole. Les candidats sont également fortement encouragés à recevoir leurs doses de rappel contre la COVID-19 lorsqu'ils sont admissibles pour éviter la propagation de COVID-19. Lors de l'embauche, la présentation de documents gouvernementaux confirmant la vaccination complète doit être fournie, ou la présentation de documents justificatifs d'une contre-indication médicale valide ou d'une autre considération raisonnable en vertu du Code des droits de la personne de l'Ontario. À partir du 29 mars 2021, CHEO mènera un processus de présélection et d'évaluation plus complet. Ce processus peut comprendre des tests plus variés et multidimensionnels tels qu'un test écrit, un examen pratique ou une autre évaluation. Tous les candidats qui satisfont aux qualifications essentielles et préférées peuvent être testés. Tous les membres de OPSEU serront accorder une entrevue après avoir passé la présélection. La présélection peut comprendre des tests. CHEO valorise la diversité et est un employeur qui souscrit au principe de l'égalité d'accès. Nous nous sommes engagés à fournir un environnement de travail inclusif et sans obstacle, en commençant par le processus d'embauche et nous sommes heureux de recevoir des demandes provenant de tous les candidats qualifiés. Si vous avez besoin de mesures d'adaptation pendant une phase du processus de recrutement, veuillez communiquer avec les Ressources humaines à jobs@cheo.on.ca . Tous les renseignements reçus concernant les mesures d'adaptation resteront confidentiels et seront traités conformément à la Loi sur l'accessibilité pour les personnes handicapées de l'Ontario. Nous remercions toutes les personnes qui posent leur candidature; toutefois, nous ne communiquerons qu'avec celles qui seront convoquées à une entrevue. Please note you will be represented by the Ontario Public Service Employees Union (OPSEU). CHEO values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants. Should you require accommodation during any phase in the recruitment process, please contact Human Resources at jobs@cheo.on.ca. All information received in relation to accommodation will be kept confidential and will be handled in compliance with the Accessibility for Ontarians with Disabilities Act. We thank all those who apply, however, only those to be interviewed will be contacted. Job Posting End Date (if applicable): January 15, 2024",
    "processed_description": "compensation pay Range description note current CHEO employee access apply posting Workday application internal applicant . apply position submit application advertise closing posting ensure application receive . position summary Study Coordinator local Multi Center trial include pharma sponsor cooperative group investigator initiate trial . submission require document canadian regulatory body . provide information documentation potential protocol patient physician i.e. consent patient eligibility item require pre study testing . collect submit participant datum require timeline . coordinate collection shipment pathology biology material require protocol guideline shipping regulation appropriate . maintain inventory ordering study supply . distribute study protocol procure require departmental division director manager authorization personnel directly indirectly involve clinical trial application . resource trial medical staff nurse colleague department require clinical trial process . development maintenance . oversee support research administration assistant research assistant student proficient multiple electronic datum capture system . prepare institution site audits monitoring sponsor regulatory body drug company . mandatory training maintain institution sponsor . maintain professional certification base continue education relate clinical research regulation policy education therapeutic professional area . supervise training orientation cra' student . perform provision cheo corporate departmental policy procedure relate . qualifications Police Record Check Essential University undergraduate degree College diploma health relate field Essential Certification SoCRA ACRP progress Essential minimum research essential understanding research design procedure guideline standard govern clinical trial Essential Certification Good Clinical Practice Preferred demonstrate management organizational skill Essential Data management essential proficiency computer skill essential effective interpersonal verbal write communication skill essential prefer note represent OPSEU . note position base . note location subject change discretion employer commit provide safe environment staff patient visitor . consistent commitment applicant fully vaccinate covid consider staff volunteer . applicant encourage receive covid booster shot eligible protect spread covid . hiring presentation government issue documentation confirm vaccination provide presentation support documentation valid medical contraindication reasonable consideration pursuant . effective conduct comprehensive pre screening evaluation process . process include varied multidimensional testing write test practical exam assessment . meet essential prefer qualification test . OPSEU grant interview pass pre screening . pre screening include testing . CHEO diversity equal employer . committed provide inclusive barrier free environment start hiring process interest qualified applicant . require accommodation phase recruitment process contact . information receive relation accommodation confidential handle compliance . apply interview contact . Veuillez noter employe actuel CHEO vous avez acces Workday cette offre par l'entremise l'application Workday titre candidat interne . pour postuler veuillez soumettre votre candidature avant . RESUME DES FONCTIONS Coordonner des etudes pour compris les essais parraines par des groupes pharmaceutique Soumettre les document requis aux organismes reglementation canadiens americains des documents relativement les patient potentiel c'est dire les consentement les element d'admissibilite des patient les test prealable l'etude requis soumettre les donnees des participant dans les delais requis commande protocole d'etude les autorisations division du directeur gestionnaire pour tout personnel participant directement tant ressource pour selon les besoins du processus d'essais clinique Elaborer maintenir les procedure operationnelles normale division les adjoint les adjoint recherche ainsi les etudiant Preparer l'organisme pour les audits site surveillance effectues les organisme reglementation les societes pharmaceutique Formation obligatoire maintenue par l'organisme continue aux reglementation aux politiques son travail conformement ainsi qu'a toute les politiques procedures internes CHEO . qualification Essentiel Diplome universitaire premier cycle diplome collegial dans Essentiel Certification aupres Society Clinical Research Associates SoCRA ACRP cour Essentiel Minimum ans d'experience recherche Essentiel Comprehension conception des procedure des lignes directrice des normes regissant les essais cliniques Essentiel Certification BPC Preferable Competences demontrees gestion organisation Essentiel gestion donnees Essentiel Maitrise des competences informatique Essentiel Competences efficace communication interpersonnelle verbale ecrite Essentiel Bilinguisme anglais francais noter vous serez represente.e . . Veuillez noter lthemplacement pourrait etre modifie tout temp discretion lthemployeur . personnel aux patient aux visiteur . Conformement cet engagement tous les candidats doivent etre entierement vaccines contre COVID pour etre consideres comme des candidats pour . candidats recevoir leurs doses rappel contre COVID admissible pour eviter propagation covid . confirmant vaccination complete raisonnable . partir du mars CHEO menera processus preselection d'evaluation complet . Ce processus peut comprendre des test varie multidimensionnels tel qu'un test ecrit examen pratique une autre evaluation . Tous les candidats satisfont aux qualifications essentielles testes . Tous les membres OPSEU serront une entrevue apres avoir passe preselection . preselection peut comprendre des test . employeur souscrit au principe l'egalite d'acces . nous nous sommes engages fournir environnement travail inclusif sans obstacle commencant par nous provenant tous les candidats qualifie . Si vous avez besoin mesures d'adaptation pendant une phase du processus recrutement humaine . Tous les renseignements recus concernant les mesures d'adaptation resteront seront traites conformement Loi sur l'accessibilite pour . nous remercion tout les personnes posent leur candidature toutefois nous ne communiquerons qu'avec celles seront convoquees une entrevue . note represent OPSEU . CHEO diversity equal employer . committed provide inclusive barrier free environment start hiring process interest qualified applicant . require accommodation phase recruitment process contact . information receive relation accommodation confidential handle compliance . apply interview contact . posting applicable",
    "results_group": {
        "extracted_noun_chunks": [
            "candidats recevoir leurs doses rappel contre COVID",
            "pharma sponsor cooperative group investigator",
            "postuler veuillez soumettre votre candidature avant",
            "interview contact",
            "BPC",
            "participant datum",
            "travail conformement ainsi qu'a toute les politiques procedures internes",
            "provision cheo corporate departmental policy procedure",
            "development maintenance",
            "qualified applicant",
            "clinical trial application",
            "c'est dire les consentement les element d'admissibilite des patient les test prealable",
            "institution site audits",
            "reasonable consideration",
            "sponsor regulatory body drug company",
            "education",
            "partir du mars CHEO menera processus preselection d'evaluation",
            "entrevue apres avoir passe preselection",
            "applicant",
            "nous nous sommes",
            "protocol guideline",
            "ACRP",
            "Si vous avez besoin mesures d'adaptation pendant",
            "vaccination",
            "study supply",
            "Essential Certification SoCRA",
            "position submit application advertise closing posting",
            "OPSEU grant interview",
            "pre screening",
            "d'acces",
            "Essential University",
            "Essentiel Maitrise des competences informatique",
            "current CHEO employee access",
            "clinical trial process",
            "personnel",
            "covid",
            "patient potentiel",
            "compliance",
            "resource trial medical staff nurse colleague department",
            "Essentiel Diplome universitaire premier cycle diplome collegial",
            "preselection peut comprendre des test",
            "les autorisations division",
            "parraines",
            "phase du processus recrutement",
            "Ce processus peut comprendre des test",
            "professional certification base",
            "par l'organisme",
            "du directeur gestionnaire",
            "testing",
            "safe environment staff patient visitor",
            "inclusive barrier free environment",
            "submission",
            "regissant les essais cliniques Essentiel Certification",
            "institution sponsor",
            "covid booster",
            "varied multidimensional testing write test practical exam assessment",
            "les delais",
            "position base",
            "employeur souscrit au principe l'egalite",
            "presentation government issue documentation",
            "tout personnel participant directement tant ressource pour selon les besoins du processus d'essais clinique Elaborer maintenir les procedure operationnelles normale division les adjoint les adjoint recherche ainsi les etudiant Preparer l'organisme pour les audits site surveillance effectues",
            "essential prefer qualification test",
            "Preferable Competences demontrees gestion organisation",
            "eviter propagation covid",
            "support research administration assistant research assistant student proficient multiple electronic datum capture system",
            "Tous les renseignements recus concernant les mesures d'adaptation resteront seront traites",
            "location subject change discretion employer commit",
            "Workday application internal applicant",
            "CHEO diversity equal employer",
            "eligible protect",
            "Essential minimum research essential understanding research design procedure guideline standard govern clinical trial",
            "COVID pour etre consideres comme des candidats",
            "note",
            "fournir environnement travail inclusif sans obstacle commencant par nous provenant tous les candidats qualifie",
            "collection shipment pathology biology material",
            "Loi sur l'accessibilite pour",
            "regulation",
            "consistent commitment applicant",
            "CHEO",
            "relation accommodation",
            "Range description",
            "management organizational skill Essential Data management essential proficiency computer skill essential effective interpersonal verbal write communication skill essential prefer note",
            "trial",
            "pre study testing",
            "Society Clinical Research Associates",
            "application",
            "information",
            "Veuillez noter employe",
            "timeline",
            "Essential Certification Good Clinical Practice Preferred",
            "accommodation phase recruitment process contact",
            "evaluation process",
            "effective conduct",
            "aux visiteur",
            "patient",
            "process interest",
            "departmental division director manager authorization personnel",
            "Tous les candidats satisfont aux qualifications essentielles testes",
            "position summary Study Coordinator local Multi Center trial",
            "Essentiel Competences efficace communication",
            "diversity equal employer",
            "qualifications",
            "CHEO vous avez",
            "clinical research regulation policy education therapeutic professional area",
            "OPSEU",
            "document canadian regulatory body",
            "test ecrit examen pratique une autre evaluation",
            "i.e. consent",
            "process",
            "orientation cra' student",
            "nous remercion tout les personnes posent leur candidature toutefois nous ne communiquerons qu'avec celles seront convoquees une entrevue",
            "les organisme reglementation les societes pharmaceutique Formation",
            "Workday cette offre par l'entremise l'application Workday titre candidat interne",
            "Veuillez noter lthemplacement pourrait etre modifie tout temp discretion lthemployeur",
            "distribute study protocol procure",
            "mandatory training",
            "ecrite Essentiel Bilinguisme anglais francais noter vous serez represente.e"
        ],
        "combined_lemmatized_tokens": "compensation pay Range description note current CHEO employee access apply posting Workday application internal applicant . apply position submit application advertise closing posting ensure application receive . position summary Study Coordinator local Multi Center trial include pharma sponsor cooperative group investigator initiate trial . submission require document canadian regulatory body . provide information documentation potential protocol patient physician i.e. consent patient eligibility item require pre study testing . collect submit participant datum require timeline . coordinate collection shipment pathology biology material require protocol guideline shipping regulation appropriate . maintain inventory ordering study supply . distribute study protocol procure require departmental division director manager authorization personnel directly indirectly involve clinical trial application . resource trial medical staff nurse colleague department require clinical trial process . development maintenance . oversee support research administration assistant research assistant student proficient multiple electronic datum capture system . prepare institution site audits monitoring sponsor regulatory body drug company . mandatory training maintain institution sponsor . maintain professional certification base continue education relate clinical research regulation policy education therapeutic professional area . supervise training orientation cra' student . perform provision cheo corporate departmental policy procedure relate . qualifications Police Record Check Essential University undergraduate degree College diploma health relate field Essential Certification SoCRA ACRP progress Essential minimum research essential understanding research design procedure guideline standard govern clinical trial Essential Certification Good Clinical Practice Preferred demonstrate management organizational skill Essential Data management essential proficiency computer skill essential effective interpersonal verbal write communication skill essential prefer note represent OPSEU . note position base . note location subject change discretion employer commit provide safe environment staff patient visitor . consistent commitment applicant fully vaccinate covid consider staff volunteer . applicant encourage receive covid booster shot eligible protect spread covid . hiring presentation government issue documentation confirm vaccination provide presentation support documentation valid medical contraindication reasonable consideration pursuant . effective conduct comprehensive pre screening evaluation process . process include varied multidimensional testing write test practical exam assessment . meet essential prefer qualification test . OPSEU grant interview pass pre screening . pre screening include testing . CHEO diversity equal employer . committed provide inclusive barrier free environment start hiring process interest qualified applicant . require accommodation phase recruitment process contact . information receive relation accommodation confidential handle compliance . apply interview contact . Veuillez noter employe actuel CHEO vous avez acces Workday cette offre par l'entremise l'application Workday titre candidat interne . pour postuler veuillez soumettre votre candidature avant . RESUME DES FONCTIONS Coordonner des etudes pour compris les essais parraines par des groupes pharmaceutique Soumettre les document requis aux organismes reglementation canadiens americains des documents relativement les patient potentiel c'est dire les consentement les element d'admissibilite des patient les test prealable l'etude requis soumettre les donnees des participant dans les delais requis commande protocole d'etude les autorisations division du directeur gestionnaire pour tout personnel participant directement tant ressource pour selon les besoins du processus d'essais clinique Elaborer maintenir les procedure operationnelles normale division les adjoint les adjoint recherche ainsi les etudiant Preparer l'organisme pour les audits site surveillance effectues les organisme reglementation les societes pharmaceutique Formation obligatoire maintenue par l'organisme continue aux reglementation aux politiques son travail conformement ainsi qu'a toute les politiques procedures internes CHEO . qualification Essentiel Diplome universitaire premier cycle diplome collegial dans Essentiel Certification aupres Society Clinical Research Associates SoCRA ACRP cour Essentiel Minimum ans d'experience recherche Essentiel Comprehension conception des procedure des lignes directrice des normes regissant les essais cliniques Essentiel Certification BPC Preferable Competences demontrees gestion organisation Essentiel gestion donnees Essentiel Maitrise des competences informatique Essentiel Competences efficace communication interpersonnelle verbale ecrite Essentiel Bilinguisme anglais francais noter vous serez represente.e . . Veuillez noter lthemplacement pourrait etre modifie tout temp discretion lthemployeur . personnel aux patient aux visiteur . Conformement cet engagement tous les candidats doivent etre entierement vaccines contre COVID pour etre consideres comme des candidats pour . candidats recevoir leurs doses rappel contre COVID admissible pour eviter propagation covid . confirmant vaccination complete raisonnable . partir du mars CHEO menera processus preselection d'evaluation complet . Ce processus peut comprendre des test varie multidimensionnels tel qu'un test ecrit examen pratique une autre evaluation . Tous les candidats satisfont aux qualifications essentielles testes . Tous les membres OPSEU serront une entrevue apres avoir passe preselection . preselection peut comprendre des test . employeur souscrit au principe l'egalite d'acces . nous nous sommes engages fournir environnement travail inclusif sans obstacle commencant par nous provenant tous les candidats qualifie . Si vous avez besoin mesures d'adaptation pendant une phase du processus recrutement humaine . Tous les renseignements recus concernant les mesures d'adaptation resteront seront traites conformement Loi sur l'accessibilite pour . nous remercion tout les personnes posent leur candidature toutefois nous ne communiquerons qu'avec celles seront convoquees une entrevue . note represent OPSEU . CHEO diversity equal employer . committed provide inclusive barrier free environment start hiring process interest qualified applicant . require accommodation phase recruitment process contact . information receive relation accommodation confidential handle compliance . apply interview contact . posting applicable"
    }
}