{
    "id": "8153beb3ceccc358",
    "company": "Douglas Guardian",
    "positionName": "Field Inventory Specialist",
    "jobType": [
        "Part-time"
    ],
    "location": "Gatineau, QC",
    "salary": "$15.25 an hour",
    "postingDateParsed": "2024-01-24T12:18:17.452Z",
    "url": "https://www.indeed.ca/rc/clk?jk=8153beb3ceccc358&from=jasx&tk=1hl5dm5j5kc37800&bb=oevkGIDXh7gG1VwZljrf76T8p8fbR0IZMyTJF7xq9CCwuT2Yf2dQ-es0E0bwsSwuXZbaaevfgzh1co9JZyqozatQ5BtcmIV0_zTfqMIdUHnOb_fIYJsHcg%3D%3D&xkcb=SoDO67M3FlTXbXRRp50GbzkdCdPP&vjs=3",
    "externalApplyLink": "https://douglasguardian.bamboohr.com/careers/446?source=indeed&src=indeed&postedDate=2024-01-23",
    "companyDescription": "Douglas Guardian is looking for qualified candidates to join our team of associates. We hire talented people who share our passion for providing exceptional customer service. \r\nA job at Douglas Guardian l is exciting, fast-paced, and offers many growth opportunities to advance your professional life.",
    "description": "Do you enjoy the flexibility to set your own schedule? Then this steady part time position may be the opportunity for you.\n \n  This job is well suited to recent retirees and shift workers looking to supplement their income however all will be considered.\n  \n  \n  Douglas-Guardian conducts verifications of financed assets for manufacturers, banks, and finance companies throughout the United States and Canada. Using our proprietary technology, field representatives verify inventory in a variety of industries including automobile, agriculture, lawn & garden, recreational vehicle, powersports, marine, manufactured housing, and music.\n  \n  \n  Douglas-Guardian is looking for field representatives to perform inventory inspections at business locations on a part-time as needed basis. All work is scheduled by the field representative and must be performed during normal business hours Monday – Friday from 8:00 AM to 5:00 PM. No weekends. A knowledge of inventory finance, retail dealership operations, or floor plan financing is beneficial.\n \n  Essential Responsibilities \n  \n  Perform physical inspections of dealer inventories and reconcile to dealer records. \n  Communicate effectively with dealer and home office personnel. \n  Verify collateral, assess condition, and provide prompt and accurate reporting. \n  Schedule and route inspections to ensure efficient completion within required timeline. \n  Utilize a company supplied tablet PC in performance of services. \n  \n Skills & Qualifications: \n  \n  Flexible schedule and available during weekday business hours. \n  Reliable transportation and a valid driver’s license. \n  Willing to travel within a 300 km radius. \n  Comfortable using mobile applications. \n  Detail oriented and willing to learn. \n  Good communication skills. \n  \n Transferable Experience: \n  \n  Home Inspector \n  Insurance Adjuster \n  Mortgage Inspector \n  Inventory Control Specialist\n \n  \n  \n  Douglas Guardian Services Corporation provides equal employment opportunity (EEO) to all applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics.\n \n  About Us: \n  Douglas-Guardian has been providing timely, thorough, and accurate inventory verification and valuation services since 1932. We work primarily for banks and finance companies throughout the US and Canada. Visit our website at DouglasGuardian.com to learn more.\n \n  COVID-19 precautions \n  \n  Remote interview process \n  Personal protective equipment provided or required \n  \n Sanitizing, disinfecting, or cleaning procedures in place"
}