{
    "id": "c332fef64567eced",
    "company": "Accreditation Canada",
    "positionName": "Client Engagement Lead, Health Systems, Accreditation Canada",
    "jobType": [],
    "location": "1150 Cyrville Rd, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-06T02:05:01.482Z",
    "url": "https://www.indeed.ca/rc/clk?jk=c332fef64567eced&from=jasx&tk=1hc6geptqk7pr800&vjs=3",
    "externalApplyLink": "https://can232.dayforcehcm.com/CandidatePortal/en-US/healthstandards/Posting/View/688",
    "companyDescription": "",
    "description": "Terms: Full-time permanent \n  \n  \n   Salary: Commensurate with experience\n   \n  \n    Location: Ottawa (Hybrid Work Model) | Montreal (Hybrid Work Model) | Toronto (Hybrid Work Model) | Remote Work Models, will have occasional travel to Ottawa\n  \n   \n   \n  \n    ABOUT THE ROLE:\n  \n   \n   \n  \n    The Client Engagement Lead is a member of team at Accreditation Canada. We are seeking a dynamic leader that has experience in Canadian Health Systems and particularly knowledge of the British Columbia and Manitoba Health Systems. The client lead will primarily be accountable to lead all health systems accreditation activities for Manitoba and British Columbia, more specifically being responsible for leading the Accreditation Canada Accreditation Program, including the updated assessment programs, digital platforms, and standards, which further embed our philosophy of People Powered Health™ and continuous quality improvement. The Client Engagement Lead will manage and provide support to client organizations while consulting and advising for improving the quality of care for all. The person in this role can take joy in working alongside other dedicated and compassionate Client Engagement Leads, the full accreditation team and many other supports across Accreditation Canada and Health Standards Organization.\n  \n   \n   \n  \n    The person in this role may be required at times to work evenings and weekends when managing accreditation survey activities. When this occurs, you will have the capacity to compensate these extra hours as flex time and take them off later. We value employee balance work/life.\n  \n   \n  \n    \n  \n  \n   Main Responsibilities:\n  \n   \n   \n   \n   Building relationships with client organizations and supporting them where they are at in their accreditation cycles in the interest of increasing their capacity for continuous quality improvement. \n   Support and lead the Accreditation team to become proficient in the planning and implementation of the survey process that is focused on quality while working efficiently to meet targets. \n   Plan, organize, implement, and evaluate the Accreditation Program and represent the program both internally and with external partners and funders. \n   Work effectively with partners and stakeholders of diverse backgrounds to co-create the next era of quality improvement and patient safety initiatives. \n   Holds people accountable for results they can control while providing guidance, conflict resolution and a proactive approach in identifying success for the team. \n   \n  \n  \n   Must Have Qualifications:\n  \n   \n   \n   \n   University degree at a master’s level is preferred. An equivalent combination of work experience and education will be considered. \n   Three to five years of progressive experience leading teams with health care and quality improvement experience. Demonstrated problem-solving skills to identify root causes and develop effective solutions. \n   Strong verbal and written communication skills. \n   Knowledge of quality improvement principles.\n  \n   \n   \n  \n    Desired Qualifications and Attributes:\n  \n   \n   \n   Knowledge of HSO standards \n   Experience in Accreditation Canada process \n   Proficiency in a comprehensive range of Microsoft applications including Teams, Word, and Excel \n   A leadership style orientation to empathetic, team oriented working relationships \n   Experience in change management and systems transformation. \n   Have project management qualification(s) and/or experience. \n   Have quality assurance and improvement qualification(s). \n   Have experience in client services.\n  \n   \n   You will stand out if: \n   \n   You are an Accreditation Canada surveyor or are in the process of becoming one. \n   Completely bilingual in Canada’s official languages. \n   \n  \n   WHAT YOU CAN EXPECT:\n  \n   \n   \n  \n    In Your First 30-90 Days: \n  \n  \n   Complete our orientation program with other new employees to learn about HSO, our values of trust, inclusion, collaboration, innovation and learning, and our mission of quality improvement in healthcare and social services. \n   Enroll in the Accreditation Canada surveyor training modules as part of the orientation and familiarize yourself with the HSO standards. \n   Review and learn departmental policies, procedures, IT platforms and workflows. \n   Set your performance and learning objectives for the year in collaboration with your people manager. \n   Meet regularly with your people manager to discuss your learning progression and alignment for your accountabilities. \n   Take on assigned initiatives or projects for your role. \n   \n  \n  \n   What We Can Offer to You\n   :\n  \n   \n   \n   Collaborating with an awesome team! \n   Opportunity to make an impact at a system level with our clients. \n   Hybrid work model for candidates in Ottawa/Montreal/Toronto area \n   A remote model for candidates outside Ottawa/Montreal/Toronto area. \n  \n  \n   Competitive compensation and benefits, including a defined benefit pension plan. \n   Time-off programs, including office shutdown during last week of December. \n   Professional development support. \n   A culture that measures and values psychological safety, inclusion, and engagement.\n  \n   \n   \n  \n    WHO WE ARE AND WHAT WE DO:\n   \n   Health Standards Organization (HSO) and our affiliates Accreditation Canada (AC) and the Institute for Quality Management in Healthcare (IQMH) are global, not-for-profit organizations. Together, we develop standards and deliver assessment programs and quality improvement solutions that have been adopted in over 12,000 locations across five continents. Our people-centered programs and services have been setting the bar for quality across the health ecosystem for 65 years. \n  Join us toward a future that will lead to “Safer Care and A Healthier World.” Let’s follow a mission together, where we “empower and enable people around the world to continuously improve quality of care.” \n   HSO is committed to fostering a culture of inclusion, diversity, equity, and access, where all employees feel respected and valued and have an equal opportunity to achieve success. We encourage applications from Indigenous Peoples, people from diverse races, ethnicities and/or religions, persons with disabilities, people from gender diverse communities and/or people with intersectional identities. Please let us know how we can support you throughout the recruiting process, including through the provision of accommodations on request. \n   We are also proud to have been named as one of the Top 100 National Capital Region’s Top Employers in 2022 and 2023. \n \n \n  \n   \n    We are equal opportunity employer and are committed to the principles of Employment Equity. We encourage qualified applications from all genders, including visible minorities, Indigenous Peoples, and persons with disabilities. We thank all applicants for their interest; only those selected for an interview will be contacted. Accommodations are available on request for candidates taking part in all aspects of the selection process. To request accommodation, please email HR at HumanResources@healthstandards.org. For any queries related to recruitment please email at recruitment@healthstandards.org."
}