{
    "id": "a4920a6c72c37481",
    "company": "Service Coordination For Persons With Special Need",
    "positionName": "Quality Assurance Coordinator",
    "jobType": [
        "Permanent",
        "Full-time"
    ],
    "location": "Ottawa, ON",
    "salary": "$51,425–$65,038 a year",
    "postingDateParsed": "2024-01-25T12:15:10.339Z",
    "url": "https://www.indeed.ca/rc/clk?jk=a4920a6c72c37481&from=jasx&tk=1hl5dg27tgspi800&bb=p2DViMR2A5Ah9kScPDlOWGiuFa7M51OagmL6gQxzNwIW4Uu8pDlx-RMh5BdxNxm3USA_eNXxHsB356DH3H7Wl-8W3O73JlLeGC3n38LHqG8tEL6RzaTzOw%3D%3D&xkcb=SoDE67M3FlTPl1WZkx0BbzkdCdPP&vjs=3",
    "externalApplyLink": "https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html?cid=f21adaa6-35ec-4a40-a145-b1e5844c2d88&ccId=19000101_000001&jobId=464174&source=IN&lang=en_CA&ittk=BQ5MNP29DW",
    "companyDescription": null,
    "description": "Date posted\n    January 22, 2024\n  \n  \n    Title\n    Quality Assurance Coordinator\n  \n  \n    Status\n    Permanent\n  \n  \n    Language\n    Bilingualism in both official languages is preferred\n  \n  \n    Salary Range\n    $ 51,425 - $65,038\n  \n  \n    Closing Date\n    February 2, 2024\n  \n   \n \n  Service Coordination Support for People with Developmental Disabilities (SCS) is a not-for-profit bilingual organization managed by a volunteer Board of Directors. SCS helps people with a developmental disability and their families who reside in the Ottawa region. SCS serves adults and children by providing information, referral services and case management support. One of our important goals is to empower families/individuals to make informed choices about the supports they seek.\n  Primary Focus\n  Reporting directly to the Manager, Evaluation and Performance Improvement, the Quality Assurance Coordinator is primarily responsible for reporting Serious Occurrences to the Ministry for all Outside Paid Resource Providers (OPRs) that SCS has a signed service agreement with. The Quality Assurance Coordinator will also be responsible to follow-up on Serious Occurrence Reports submitted by SCS and will oversee the agency’s adherence to the reporting requirements. The Quality Assurance Coordinator will also complete requests and tasks supporting the work and objectives of the Evaluation and Performance team, within prescribed deadlines, which will have an impact on the quality of our services and the attainment of our organizational objectives.\n  Major Responsibilities\n  Serious Occurrences related functions (corresponds to approximately 70% of the workload, which can vary based on operational needs)\n \n   Complete Serious Occurrence reports on behalf of all OPRs sites/programs and third-party service providers, which encompasses the following actions:\n   \n     Daily surveillance and triage of the Shared Serious Occurrence Inbox for manual Serious Occurrence reports.\n     Communicate with the OPRs and SCS staff to clarify Serious Occurrence incidents, as required.\n     Submit Serious Occurrence reports on the SOR-RL online database and internal database.\n     Follow-up with the OPRs when further actions have been identified, or when adherence to specific QAM requirements needs to be confirmed.\n     Submit Serious Occurrence updates on the SOR-RL online database, as per Ministry directives and Serious Occurrence Reporting guidelines.\n     Identify training opportunities for OPRs sites/programs and third-party provider when trends or patterns of Serious Occurrence reporting emerges.\n   \n   Track statistics for internal and external purposes. Maintain metrics documents and revise as needed.\n   Oversee SCS’ adherence to the Serious Occurrence reporting guidelines and expectations, by reviewing all SCS Serious Occurrence reports prepared by SCS staff, prior to submitting to the Ministry, and following-up with SCS staff on any outstanding reports they have initially submitted on the online platform.\n   Provide ongoing training and coaching to SCS staff and OPR representatives on Serious Occurrence Reporting guidelines and expectations.\n \n  Administrative functions (corresponds to approximately 30% of the workload, which can vary based on operational needs)\n \n   Support the Evaluation and Performance team by:\n   \n     Organizing and scheduling agency training provided by members of the Evaluation and Performance team.\n     Preparing agenda and writing meeting minutes for the Evaluation and Performance team meetings.\n     Completing data entry for members of the Evaluation and Performance team, when required.\n     Participating in data analysis and interpretation for various reports produced by the Evaluation and Performance team\n     Participating in SCS internal audit sessions, as per the Internal Audit Framework (in development).\n   \n   Support SCS’ feedback process by sending invitations to individuals receiving services from SCS to complete the online client satisfaction survey, and by providing information to the Manager, Evaluation and Performance Improvement about individuals requesting that we contact them directly to discuss their feedback.\n   Completing other related tasks as required.\n \n  Knowledge and Skills\n \n   A College Degree in Administrative Services and/or Social Services (College Degree) supplemented by at least two (2) years of previous work experience in an office administration or customer service environment or related field. Equivalent experience will also be considered.\n   Proficient in the use of Microsoft Office Suite including Word, Excel, PowerPoint, Outlook and Internet along with experience working with databases.\n   Above average oral, written and interpersonal communication skills in both official languages (French & English) preferred.\n   Must have strong analytical, reasoning, presentation and facilitation skills.\n   Must be highly organized and detail oriented.\n   Excellent organizational and time management skills to meet scheduled deadlines.\n   Ability to work in a fast paced environment and handle a number of issues simultaneously.\n   The nature of the work requires to have a high degree of concentration and attention.\n   Experience working with an Electronic Client Records system is an asset.\n \n  Working Conditions\n  Working conditions are normal for a hybrid remote working environment. Business hours are regular with some overtime when required. Attend meetings locally and potentially regionally.\n  Accommodations\n  Service Coordination (SCS) has an accommodation process in place and provides accommodations for candidates and employees with specific needs. If you require specific accommodations, please contact the Human Resources to arrange appropriate accommodations.\n  As the ideal candidate you are a self-starter with excellent interpersonal skills who works well in a virtual team environment. Qualified candidates may submit their resumes, along with a cover letter quoting Competition Number 03 – 2024 by February 2, 2024 at 4:30pm to Human Resources.\n  While we appreciate all responses, only candidates under consideration will be contacted. We kindly ask not to send in duplicate copies of your resume.\n  SCS embraces diversity and equal opportunity in a serious way. We are committed to building teams that represents the communities we serve. All employment decisions are based on qualifications, skills and business need."
}