{
    "id": "54b7abe9ddf4da18",
    "company": "CHEO",
    "positionName": "Director, Precision Health and Regional Genetics Program",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-30T20:06:25.254Z",
    "url": "https://www.indeed.ca/rc/clk?jk=54b7abe9ddf4da18&from=jasx&tk=1he3lftbdk7tt800&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=54b7abe9ddf4da18&atk=&xpse=SoCl67I3IDjObPTU4p0LbzkdCdPP",
    "companyDescription": "",
    "description": "Compensation Pay Range:\n  $57.26-$69.58\n \n \n   Job Description:\n \n \n   Location: Ottawa\n   \n   CHEO is one of the few stand-alone, global leaders in pediatric health and is home to nearly 4,500 staff and physicians dedicated to helping children and youth live their best lives. Within its own walls and through partnerships with community providers, CHEO has transformed from a 20th Century acute care hospital into a 21st Century integrated child and youth health system. Ranked in the top 1% of Canadian hospitals for the digitization of its clinical infrastructure, CHEO combines excellence in clinical care, research, and education to advance seamless care that’s provided where, when, and how it is needed.\n   \n   CHEO has twice been named as the best place to work in Canadian healthcare by Forbes Magazine and is ranked second among Canadian hospitals on its list of Canada’s Best Employers for 2021. For the 10th consecutive year in a row, the editors of Canada's Top 100 Employers has recognized CHEO as a top employer in the National Capital Region.\n   \n   Reporting to the Vice President of Child Development & Community Services, the Director, Precision Health and Regional Genetics Program,will develop and implement a multi-year precision health strategy that positions CHEO as a leader provincially, nationally, and internationally.You will provide leadership to the Centre for Genomic Innovation (CGI) and lead the expansion of Precision Diagnostics, accelerating the clinical adoption of advances in genomics and helping to establish a robust lifecycle strategy. As Director, you will oversee all operational, financial, programmatic and people activities across the portfolio, which includes Clinical Genetics Services and the Genetics Diagnostic Laboratory. Working alongside your team, and in tandem with key internal and external stakeholders, you will maintain high-quality patient care, ensuring continuous business growth of the Program.\n   \n   As the ideal candidate, you are a Master’s-prepared leader with a minimum of five (5) years’ of leadership experience implementing organization-wide initiatives, ideally within a complex health-related or translational research environment, including precision health. Highly autonomous and a motivated self-starter, your organizational, analytical, problem solving, and decision-making skills are effectively balanced by your ability to successfully collaborate within a variety of teams. You are known for your exceptional interpersonal skills that allow you to cogently communicate, motivate, and present to staff across departments and at all levels, fostering an inclusive environment that achieves results by valuing, supporting, and rewarding collaboration. Fluency in both official languages is a highly desirable asset.\n   \n   If you are interested in this impactful leadership opportunity with one of Canada’s most respected paediatric healthcare organizations, please contact John Caminiti and Olivia Pfeffer of Boyden at 613-604-5310. To apply for this position, please submit your application and related materials to \n  \n   opfeffer@boyden.com\n   and \n  state the title of the position in the subject line of your e-mail, or simply submit your materials directly using the \"Apply\" button.\n   \n   \n  We thank all applicants for their interest, however only those under consideration for the role will be contacted\n \n \n \n   CHEO values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants.\n \n \n \n   Should you require accommodation during any phase in the recruitment process, please contact Human Resources at jobs@cheo.on.ca. All information received in relation to accommodation will be kept confidential and will be handled in compliance with the Accessibility for Ontarians with Disabilities Act.\n \n \n \n   We thank all those who apply, however, only those to be interviewed will be contacted.\n \n \n \n   Job Posting End Date (if applicable):\n  November 7, 2023"
}