{
    "id": "7a8bf1f9990aa8e9",
    "companyDescription": "",
    "description": "QUALITY ASSURANCE (QA) SPECIALIST\n \n  Solink is a different kind of data analytics software company. We’ve successfully made surveillance video a source of powerful insight for business owners of franchise and retail chains. We focus on security applications that combat fraud proactively and make it easier for owners to track down problems. Today we focus on loss prevention and in the future, we see every department using video to make data-driven decisions: marketing, operations, and even HR.\n \n  A job at Solink means working with an amazing team and tackling one of the biggest data problems out there. We are venture-backed and focus on continuous execution to delight our customers. We have a creative and collaborative work environment, and all of our employees have meaningful equity in the company.\n \n  A bit about the role…\n \n  Work alongside our Development Team and other QA Team members where you will have the opportunity to shape and implement the technology and product deliverables to drive forward Solink’s Product. You will ensure that test plans are of high quality, maintained throughout the lifecycle of development, and ready for future deployment by our Delivery teams. Working within our tight knit Team, your main focus will be manual testing web and mobile applications for quality assurance.\n \n  WHO YOU ARE\n  \n \n  \n   You have 3-5 years of web and mobile application QA manual testing experience, ideally with cloud-based SaaS solutions. \n  You have experience with looking at logs (e.g., DevTools). \n  You can create, update, and review test documentation. \n  You have a strong work ethic with a POSITIVE attitude and a PASSION for Quality Assurance. \n  You have excellent time management skills. \n  You THRIVE at solving problems and enjoy a good challenge. \n  You are an out-of-the-box thinker. \n  You are a Team Player with EXCELLENT interpersonal and communication skills (written and verbal). \n  You have a “CAN DO” attitude. \n  You have strong analytical skills and attention to detail. \n  You have an interest and ability to learn new tools. \n  You have basic knowledge of CSS and HTML. \n  You have a Bachelor of Science Degree or higher education (Computer Science or related field is an asset).\n \n  \n  \n  SECURITY REQUIREMENTS:\n  \n \n  \n   Candidates must undergo a criminal records check upon hire; \n  Be a Canadian Citizen (dual citizens included), or eligible to work in Canada; \n  Be willing to comply with Solink’s own security policies and standards.\n \n  \n  \n  WHAT WILL YOU DO?\n  \n \n  \n   You will proactively drive all testing activities with web and mobile applications. \n  You will execute manual regression tests for new software versions to ensure product functionality and investigate any issues that appear during testing. \n  You will ensure that validated deliverables meet functional and design specifications and requirements. \n  You will identify test requirements from specifications, map test case requirements and design test coverage plan. \n  You will participate with the development team and product management to understand upcoming new features and create new test cases. \n  You will isolate, replicate, and report defects and verify defect fixes. \n  You will collaborate closely with other team and cross-functional departments. \n  You will manage QA risks and mitigation plans. \n  You will become an expert user of our SaaS platform, from the perspectives of customers, internal support team, and customer success managers that set up the accounts. \n  You will design and perform brain-engaged testing, thinking out of the box, doing the unpredictable. \n  You will continuously improve processes.\n \n  \n  \n  WHAT IS SOLINK?\n \n  Solink is transforming conventional data into ‘smart’ data. Solink connects and synchronizes brick-and-mortar business systems like video + Point of Sale data, to create insight into loss prevention, security, and operations issues. We find new and powerful ways for businesses to get real value from the data and footage created daily by their standard systems.\n \n  We’re one of Ottawa’s fastest-growing companies. We're not just a tech and security company - we are rapidly evolving the way that we use and think about video security, data analytics, and technology. We're enhancing the status quo to positively impact clients and customers' businesses.\n \n  We’re on a steep growth trajectory, which means lots to do, lots to learn, and lots to experience! What an exciting adventure ahead - and our Solinkians make the greatest travel companions…\n \n  Solink thrives because of our team; we know that in our business and in our daily work, people make all the difference. We’re looking for people who are driven by curiosity, hungry to innovate, and striving to make an impact.\n \n  WHY WORK AT SOLINK?\n \n  Working with us means you’ll be working for a company that values your input and allows you to bring your ideas to life. We offer a collaborative, creative, supportive work environment with a culture that is undeniably fun…\n \n  All that - PLUS we offer…..\n  \n \n  \n   Flexibility in your chosen hours of work by helping you get \"stuff\" done (encourages that work-life balance); \n  Opportunities for growth based on merit, skill, and initiative; \n  Friendly, welcoming, and team-oriented atmosphere that fosters collaboration; \n  A creative and innovative environment that mentors supports, motivates, and inspires you to make an impact; \n  Interesting and exciting assignments ranging in size, type, and complexity; \n  An “open-door” policy where communication and brainstorming are encouraged; \n  A really positive and fun environment working with an incredibly ENERGETIC team; \n  Fully paid Health / dental benefits offered immediately (an additional $500 spending account for items that aren’t covered in our AMAZING benefits program); \n  Monthly reimbursement toward a health and wellness program; \n  Extracurricular SOLINKIAN social events (annual “solink-o de mayo”, so-learns, sports teams, so-lunches, team builders, and much more) \n  Please note: We currently operate within a hybrid model.\n \n  \n  \n  Solink welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process. Should you need accommodations, please email peopleops@SolinkCorp.com.\n \n  We know that everyone has different experiences and that’s what makes all of us so unique. Solink is an Equal Opportunity Employer. We’re looking at building our team of great people and we know that comes in various forms. We are committed to a diverse and representative workforce, and an open and inclusive work environment and we encourage all candidates with interest to apply. We will provide accommodation on request through all parts of the selection process.\n \n  HOW TO APPLY?\n \n  Please submit your cover letter and resume addressed to LUKE SKYWALKER outlining why you would be the right fit for this position.",
    "preprocessed_description": "QUALITY ASSURANCE (Quality Assurance) SPECIALIST Solink is a different kind of data analytics software company. We've successfully made surveillance video a source of powerful insight for business owners of franchise and retail chains. We focus on security applications that combat fraud proactively and make it easier for owners to track down problems. Today we focus on loss prevention and in the future, we see every department using video to make data-driven decisions: marketing, operations, and even Human Resources. A job at Solink means working with an amazing team and tackling one of the biggest data problems out there. We are venture-backed and focus on continuous execution to delight our customers. We have a creative and collaborative work environment, and all of our employees have meaningful equity in the company. A bit about the role… Work alongside our Development Team and other Quality Assurance Team members where you will have the opportunity to shape and implement the technology and product deliverables to drive forward Solink's Product. You will ensure that test plans are of high quality, maintained throughout the lifecycle of development, and ready for future deployment by our Delivery teams. Working within our tight knit Team, your main focus will be manual testing web and mobile applications for quality assurance. WHO YOU ARE You have 3-5 years of web and mobile application Quality Assurance manual testing experience, ideally with cloud-based SaaS solutions. You have experience with looking at logs (e.g., DevTools). You can create, update, and review test documentation. You have a strong work ethic with a POSITIVE attitude and a PASSION for Quality Assurance. You have excellent time management skills. You THRIVE at solving problems and enjoy a good challenge. You are an out-of-the-box thinker. You are a Team Player with EXCELLENT interpersonal and communication skills (written and verbal). You have a \"CAN DO\" attitude. You have strong analytical skills and attention to detail. You have an interest and ability to learn new tools. You have basic knowledge of Cascading Style Sheets and Hypertext Markup Language. You have a Bachelor of Science Degree or higher education (Computer Science or related field is an asset). SECURITY REQUIREMENTS: Candidates must undergo a criminal records check upon hire; Be a Canadian Citizen (dual citizens included), or eligible to work in Canada; Be willing to comply with Solink's own security policies and standards. WHAT WILL YOU DO? You will proactively drive all testing activities with web and mobile applications. You will execute manual regression tests for new software versions to ensure product functionality and investigate any issues that appear during testing. You will ensure that validated deliverables meet functional and design specifications and requirements. You will identify test requirements from specifications, map test case requirements and design test coverage plan. You will participate with the development team and product management to understand upcoming new features and create new test cases. You will isolate, replicate, and report defects and verify defect fixes. You will collaborate closely with other team and cross-functional departments. You will manage Quality Assurance risks and mitigation plans. You will become an expert user of our SaaS platform, from the perspectives of customers, internal support team, and customer success managers that set up the accounts. You will design and perform brain-engaged testing, thinking out of the box, doing the unpredictable. You will continuously improve processes. WHAT IS SOLINK? Solink is transforming conventional data into 'smart' data. Solink connects and synchronizes brick-and-mortar business systems like video + Point of Sale data, to create insight into loss prevention, security, and operations issues. We find new and powerful ways for businesses to get real value from the data and footage created daily by their standard systems. We're one of Ottawa's fastest-growing companies. We're not just a tech and security company - we are rapidly evolving the way that we use and think about video security, data analytics, and technology. We're enhancing the status quo to positively impact clients and customers' businesses. We're on a steep growth trajectory, which means lots to do, lots to learn, and lots to experience! What an exciting adventure ahead - and our Solinkians make the greatest travel companions… Solink thrives because of our team; we know that in our business and in our daily work, people make all the difference. We're looking for people who are driven by curiosity, hungry to innovate, and striving to make an impact. WHY WORK AT SOLINK? Working with us means you will be working for a company that values your input and allows you to bring your ideas to life. We offer a collaborative, creative, supportive work environment with a culture that is undeniably fun… All that - PLUS we offer….. Flexibility in your chosen hours of work by helping you get \"stuff\" done (encourages that work-life balance); Opportunities for growth based on merit, skill, and initiative; Friendly, welcoming, and team-oriented atmosphere that fosters collaboration; A creative and innovative environment that mentors supports, motivates, and inspires you to make an impact; Interesting and exciting assignments ranging in size, type, and complexity; An \"open-door\" policy where communication and brainstorming are encouraged; A really positive and fun environment working with an incredibly ENERGETIC team; Fully paid Health / dental benefits offered immediately (an additional $500 spending account for items that are not covered in our AMAZING benefits program); Monthly reimbursement toward a health and wellness program; Extracurricular SOLINKIAN social events (annual \"solink-o de mayo\", so-learns, sports teams, so-lunches, team builders, and much more) Please note: We currently operate within a hybrid model. Solink welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process. Should you need accommodations, please email peopleops@SolinkCorp.com. We know that everyone has different experiences and that is what makes all of us so unique. Solink is an Equal Opportunity Employer. We're looking at building our team of great people and we know that comes in various forms. We are committed to a diverse and representative workforce, and an open and inclusive work environment and we encourage all candidates with interest to apply. We will provide accommodation on request through all parts of the selection process. HOW TO APPLY? Please submit your cover letter and resume addressed to LUKE SKYWALKER outlining why you would be the right fit for this position.",
    "processed_description": "quality ASSURANCE Quality Assurance SPECIALIST Solink kind datum analytic software company . surveillance video source powerful insight business owner franchise retail chain . focus security application combat fraud proactively easy owner track problem . focus loss prevention future department video data drive decision marketing operation . amazing team tackle big data problem . venture focus continuous execution delight customer . creative collaborative environment employee meaningful equity company . bit role ... alongside Quality Assurance Team shape implement technology product deliverable drive forward Solink's Product . ensure test plan high quality maintain lifecycle development ready future deployment Delivery team . main focus manual testing web mobile application quality assurance . web mobile application Quality Assurance manual testing ideally cloud base saas solution . log e.g. . create update review test documentation . strong ethic positive attitude passion Quality Assurance . excellent management skill . solve problem enjoy good challenge . box thinker . Team Player excellent interpersonal communication skill write verbal . attitude . strong analytical skill attention detail . interest learn tool . basic knowledge Hypertext Markup Language . Bachelor Science Degree high education field asset . security requirement undergo criminal record check hire canadian Citizen dual citizen include eligible comply Solink's security policy standard . proactively drive testing activity web mobile application . execute manual regression test software version ensure product functionality investigate issue appear testing . ensure validate deliverable meet functional design specification requirement . identify test requirement specification map test case requirement design test coverage plan . participate development team product management understand upcoming feature create test case . isolate replicate report defect verify defect . collaborate closely team cross functional department . manage Quality Assurance risk mitigation plan . expert user saas platform perspective customer internal support team customer success manager set account . design perform brain engage testing box unpredictable . continuously improve process . SOLINK Solink transform conventional datum 'smart' datum . Solink connect synchronize brick mortar business system video + Point sale datum create insight loss prevention security operation issue . find powerful business real datum footage create daily standard system . Ottawa's fast grow company . tech security company rapidly evolve video security datum analytic technology . enhance status quo positively impact client customer' business . steep growth trajectory lot lot learn lot exciting adventure ahead great travel companion ... Solink thrive team business daily people difference . people drive curiosity hungry innovate strive impact . SOLINK company input allow bring idea life . offer collaborative creative supportive environment culture undeniably fun ... offer ... .. flexibility help stuff encourage life balance growth base merit skill initiative friendly welcoming team orient atmosphere foster collaboration creative innovative environment mentor support motivate inspire impact interesting exciting assignment range size type complexity open door policy communication brainstorming encourage positive fun environment incredibly energetic team fully pay Health dental benefit offer additional spending account item cover amazing benefit program monthly reimbursement health wellness program extracurricular solinkian social event annual solink mayo learn sport team lunch team builder note currently operate hybrid model . Solink encourage application people . accommodation request aspect selection process . accommodation email . unique . Solink Equal Employer . build team great people form . committed diverse representative workforce open inclusive environment encourage interest apply . provide accommodation request selection process . apply submit cover letter resume address outline fit position .",
    "results_group": {
        "extracted_noun_chunks": [
            "fit position",
            "expert user saas platform perspective customer internal support team customer success manager",
            "conventional datum 'smart' datum",
            "Solink Equal Employer",
            "issue",
            "application people",
            "future deployment Delivery team",
            "deliverable meet functional design specification requirement",
            "status quo",
            "upcoming feature",
            "good challenge",
            "venture",
            "Health dental benefit",
            "big data problem",
            "kind datum analytic software company",
            "excellent management skill",
            "lifecycle development",
            "client customer' business",
            "basic knowledge Hypertext Markup Language",
            "idea life",
            "Quality Assurance Team shape",
            "SOLINK company input",
            "inspire impact",
            "technology product",
            "diverse representative workforce open inclusive environment",
            "great travel companion",
            "Quality Assurance risk mitigation plan",
            "daily standard system",
            "loss prevention future department video data drive decision marketing operation",
            "testing activity web mobile application",
            "Solink",
            "security application combat fraud",
            "accommodation email",
            "strive impact",
            "Solink's Product",
            "canadian Citizen dual citizen",
            "strong analytical skill attention detail",
            "testing",
            "life balance growth base merit skill initiative friendly welcoming team orient atmosphere foster collaboration",
            "tool",
            "additional spending account item",
            "team business daily people",
            "great people",
            "surveillance video source powerful insight business owner franchise retail chain",
            "problem",
            "report defect",
            "Ottawa's fast grow company",
            "Bachelor Science Degree high education field asset",
            "amazing team",
            "design",
            "interesting exciting assignment range size type complexity open door policy communication brainstorming",
            "proactively easy owner track problem",
            "... offer",
            "team",
            "insight loss prevention security operation issue",
            "strong ethic positive attitude passion Quality Assurance",
            "Solink's security policy standard",
            "SOLINK Solink",
            "test case",
            "manual regression test software version",
            "high quality",
            "development team product management",
            "web mobile application Quality Assurance manual testing ideally cloud base saas solution",
            "accommodation request selection process",
            "product functionality",
            "interest",
            "people",
            "continuous execution delight customer",
            "hybrid model",
            "main focus manual testing web mobile application quality assurance",
            "security requirement",
            "tech security company",
            "stuff",
            "Team Player excellent interpersonal communication skill",
            "account",
            "creative collaborative environment employee meaningful equity company",
            "quality ASSURANCE Quality Assurance SPECIALIST Solink",
            "test plan",
            "video security datum analytic technology",
            "attitude",
            "creative innovative environment mentor support",
            "box thinker",
            "lot exciting adventure",
            "collaborative creative supportive environment culture",
            "accommodation request aspect selection process",
            "powerful business real datum footage",
            "curiosity",
            "defect",
            "criminal record check",
            "incredibly energetic team",
            "process",
            "steep growth trajectory lot lot",
            "functional department",
            "positive fun environment",
            "test requirement specification map test case requirement design test coverage plan",
            "builder",
            "synchronize brick mortar business system video + Point sale datum",
            "flexibility help",
            "update review test documentation"
        ],
        "combined_lemmatized_tokens": "quality ASSURANCE Quality Assurance SPECIALIST Solink kind datum analytic software company . surveillance video source powerful insight business owner franchise retail chain . focus security application combat fraud proactively easy owner track problem . focus loss prevention future department video data drive decision marketing operation . amazing team tackle big data problem . venture focus continuous execution delight customer . creative collaborative environment employee meaningful equity company . bit role ... alongside Quality Assurance Team shape implement technology product deliverable drive forward Solink's Product . ensure test plan high quality maintain lifecycle development ready future deployment Delivery team . main focus manual testing web mobile application quality assurance . web mobile application Quality Assurance manual testing ideally cloud base saas solution . log e.g. . create update review test documentation . strong ethic positive attitude passion Quality Assurance . excellent management skill . solve problem enjoy good challenge . box thinker . Team Player excellent interpersonal communication skill write verbal . attitude . strong analytical skill attention detail . interest learn tool . basic knowledge Hypertext Markup Language . Bachelor Science Degree high education field asset . security requirement undergo criminal record check hire canadian Citizen dual citizen include eligible comply Solink's security policy standard . proactively drive testing activity web mobile application . execute manual regression test software version ensure product functionality investigate issue appear testing . ensure validate deliverable meet functional design specification requirement . identify test requirement specification map test case requirement design test coverage plan . participate development team product management understand upcoming feature create test case . isolate replicate report defect verify defect . collaborate closely team cross functional department . manage Quality Assurance risk mitigation plan . expert user saas platform perspective customer internal support team customer success manager set account . design perform brain engage testing box unpredictable . continuously improve process . SOLINK Solink transform conventional datum 'smart' datum . Solink connect synchronize brick mortar business system video + Point sale datum create insight loss prevention security operation issue . find powerful business real datum footage create daily standard system . Ottawa's fast grow company . tech security company rapidly evolve video security datum analytic technology . enhance status quo positively impact client customer' business . steep growth trajectory lot lot learn lot exciting adventure ahead great travel companion ... Solink thrive team business daily people difference . people drive curiosity hungry innovate strive impact . SOLINK company input allow bring idea life . offer collaborative creative supportive environment culture undeniably fun ... offer ... .. flexibility help stuff encourage life balance growth base merit skill initiative friendly welcoming team orient atmosphere foster collaboration creative innovative environment mentor support motivate inspire impact interesting exciting assignment range size type complexity open door policy communication brainstorming encourage positive fun environment incredibly energetic team fully pay Health dental benefit offer additional spending account item cover amazing benefit program monthly reimbursement health wellness program extracurricular solinkian social event annual solink mayo learn sport team lunch team builder note currently operate hybrid model . Solink encourage application people . accommodation request aspect selection process . accommodation email . unique . Solink Equal Employer . build team great people form . committed diverse representative workforce open inclusive environment encourage interest apply . provide accommodation request selection process . apply submit cover letter resume address outline fit position ."
    }
}