{
    "id": "b75cc104106dc1c3",
    "company": "Isologic Innovative Radiopharmaceuticals",
    "positionName": "Delivery Driver (Radiopharmaceutical) - Full time",
    "jobType": [
        "Permanent",
        "Full-time"
    ],
    "location": "Ottawa, ON",
    "salary": "$20 an hour",
    "postingDateParsed": "2024-01-23T12:19:19.781Z",
    "url": "https://www.indeed.ca/rc/clk?jk=b75cc104106dc1c3&from=jasx&tk=1hl5dnps928uu000&bb=UGkEiCo3Z_GruqQb2rXDBGXz2J-W0nxw-UJvBRFIB0IXfwFPNemgdrjXoh9WfpUjSMdeQ8eUy-1QnB6gqpkmK9mY6naEOpJ99scLqkEaioZzIhzFe4maBQ%3D%3D&xkcb=SoAW67M3FlTQ5AwTEJ0BbzkdCdPP&vjs=3",
    "externalApplyLink": null,
    "job_info_group": {
        "extracted_phone_numbers": [],
        "extracted_links": [
            "HTTP/HTTPS Links",
            "General Links",
            "WWW Links",
            "TLDs"
        ],
        "extracted_emails": [],
        "extracted_location_data": [],
        "extracted_dates": [],
        "extracted_languages": [],
        "extracted_laws": [],
        "extracted_norps": [],
        "extracted_orgs": [
            "CDA Job Types",
            "Isologic Innovative Radiopharmaceuticals",
            "RRSP"
        ],
        "extracted_persons": [],
        "extracted_products": [],
        "extracted_money": [
            {
                "amount": "20.00",
                "noun_phrases": []
            }
        ],
        "processed_text": "industry leader preparation delivery nuclear medicine position courier driver . Customer Delivery Associate delivery driver support pharmacy operation handle packaging deliver radiopharmaceutical . KEY responsibility ESSENTIAL FUNCTIONS processing prepare product wrap place proper delivery container prepare shipping paperwork label Handle package deliver radiopharmaceutical hazardous material compliance regulation company policy assist task require laboratory Short long distance REQUIRED qualification valid driver's license clean abstract lift lb . regular basis accommodate shift change base business shift stagger start early strong skill teamwork customer service previous delivery drive handling transport pharmaceutical radioactive material asset . training provide pay . application include retiree semi retiree . equal employer . note application retain contact . permanent salary hour benefit dental care insurance Employee assistance program extended health care Life insurance site parking match vision care schedule shift supplemental pay type overtime pay location road"
    },
    "companyDescription": "Isologic Innovative Radiopharmaceuticals (ISOLOGIC) is a nationwide radiopharmaceutical company, dedicated to nuclear medicine and the science of Radiopharmaceutical production. Our commitment to these fields extends to the communities we serve. We have over 170 team members focused on serving our customers and their patients. We utilize our significant experience, expertise and networks in Nuclear Pharmacy to provide our customers and patients with reliable; safe and high-quality radiopharmaceutical products and services.",
    "description": "Isologic Innovative Radiopharmaceuticals, the industry leader in preparation and delivery of nuclear medicines, has an immediate position available as a full time courier driver.\nAs a Customer Delivery Associate (delivery driver), you will support pharmacy operations by handling, packaging and delivering radiopharmaceuticals.\nKEY RESPONSIBILITIES/ESSENTIAL FUNCTIONS\n\n Processing prepared products by wrapping and placing in proper delivery containers, preparing shipping paperwork and labels\n Handle, package and deliver radiopharmaceuticals and hazardous materials in compliance with all regulations and company policies\n Assist with tasks required in the laboratory\n Short and long distance runs available\n\nREQUIRED QUALIFICATIONS\n\n Valid G driver’s license and clean abstract\n Ability to lift 50 lbs. on a regular basis throughout the day\n Ability to accommodate shift changes based on business needs\n Ability to work shifts that have staggered start times beginning as early as 4am through 8am\n Strong skills in teamwork and customer service\n\nPrevious delivery driving experience and/or handling and transporting pharmaceuticals or radioactive materials would be an asset. All training will be provided and paid for by Isologic Innovative Radiopharmaceuticals.\nWe welcome applications from all candidates, including retirees or semi-retirees.\nWe are an equal opportunity employer. It is important to note that only those whose applications have been retained will be contacted.\n#CDA\nJob Types: Full-time, Permanent\nSalary: $20.00 per hour\nBenefits:\n\n Dental care\n Disability insurance\n Employee assistance program\n Extended health care\n Life insurance\n On-site parking\n RRSP match\n Vision care\n\nSchedule:\n\n 8 hour shift\n\nSupplemental pay types:\n\n Overtime pay\n\nWork Location: On the road"
}