{
    "id": "4d34953bad75b71e",
    "company": "CHEO",
    "positionName": "Pharmacy Technician, Pharmacy - Permanent Part Time (0.5)",
    "jobType": [
        "Part-time"
    ],
    "location": "401 Smyth Road, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-06T03:12:37.249Z",
    "url": "https://www.indeed.ca/rc/clk?jk=4d34953bad75b71e&from=jasx&tk=1hjm39h30jroo800&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "POSITION SUMMARY\nThe Pharmacy Department at CHEO operates 24 hours daily, 7 days a week. Pharmacy technicians are expected to work day, evening, weekend and night shifts.\nJOB DESCRIPTION\nUnder a pharmacist’s supervision the Pharmacy Technician:\n\n Performs all the tasks defined in the NAPRA Standards Practice for Pharmacy Technician practice from the Ontario College of Pharmacists (OCP).\n Keep up to date and follows workflow processes of the pharmacy department and the Hospital based on pharmacy standards and regulatory requirements\n Maintains accurate computerized patient profiles\n Dispenses, verify and deliver inpatient and outpatient prescriptions\n Distributes and maintains inventory of all pharmaceuticals, i.e. formulary, non-formulary, controlled substances, SAP, drug studies.\n Maintains stock of pharmaceuticals, labels, containers, and other supplies within the pharmacy work areas\n Records and reports any shortages of pharmaceuticals or supplies on the appropriate order list and to the pharmacy buyer\n Maintains stock of pharmaceuticals and supplies on the clinical wards and ambulatory clinics as required\n Maintains non-expired pharmaceuticals availability and participation in the rotation of stocks in the pharmacy and on the clinical wards and ambulatory clinics.\n Prioritize, initiate and complete the Patients Best Possible Medication History and highlight any discrepancies to the pharmacist\n Keeps work areas clean, organized, and functional\n Maintains equipment and automation in good working condition, problem solves as appropriate and reports issues to appropriate pharmacy personnel\n Reports product defects, i.e. labelling issues, product discoloration or deterioration, precipitate, contamination, etc. to pharmacist and complete the incident report\n Reports medication errors to pharmacist and complete the incident report\n Maintains records of pharmacy related activities and participate in the statistical reports for the Pharmacy Department\n Participates in the pharmacy technician work rotation fulfilling the responsibilities and tasks of each assigned area including weekend and night shifts\n Participates in staff and pharmacy technician meetings, departmental planning and communication activities, and special project assignments as required\n Participates in the training and orientation of new personnel in technical aspects of the Pharmacy Department\n Participates in departmental quality assurance activities\n Works cooperatively with all colleagues, promoting and maintaining harmonious inter and intra departmental relationships\n Maintains professional conduct and standards in all aspects of his/her work and when interacting with hospital staff and the public\n Cover Kid Care Pharmacy as required\n Performs other duties as assigned\n\nQUALIFICATIONS\n\n Criminal Record Check (Essential)\n Graduate of an accredited college Pharmacy Technician Program (Essential)\n Licensed as a Pharmacy Technician with the Ontario College of Pharmacists (Essential)\n Minimum of two (2) years related experience (Preferred)\n Sterile compounding experience (Preferred)\n Non-sterile compounding experience (Preferred)\n Bilingual (English/French) (Preferred)\n Maintains competency on all equipment and automation (Essential)\n Maintains sterile and non-sterile certifications yearly (Essential)\n\n* Please note you will be represented by the Ontario Public Service Employees Union (OPSEU).\nCHEO is committed to providing a safe environment for staff, patients, and visitors. Consistent with that commitment, all applicants must be fully vaccinated against COVID-19 to be considered for any staff or volunteer opportunities. Applicants are also strongly encouraged to receive their COVID-19 booster shots when eligible to protect against the spread of COVID-19. Upon hiring, presentation of government issued documentation confirming full vaccination must be provided, or presentation of supporting documentation of a valid medical contraindication or other reasonable consideration pursuant to the Ontario Human Rights Code.\nEffective March 29, 2021, CHEO will conduct a more comprehensive pre-screening and evaluation process. This process may include more varied and multidimensional testing such as a written test, practical exam, or other assessment. All candidates who meet the essential and preferred qualifications may be tested. All OPSEU members shall be granted an interview upon passing the pre-screening. Pre-screening might include testing.\nCHEO values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants.\nShould you require accommodation during any phase in the recruitment process, please contact Human Resources at jobs@cheo.on.ca. All information received in relation to accommodation will be kept confidential and will be handled in compliance with the Accessibility for Ontarians with Disabilities Act.\nWe thank all those who apply, however, only those to be interviewed will be contacted.\nRÉSUMÉ DES FONCTIONS\nLe Service de la pharmacie du CHEO ne s’arrête jamais. Les techniciens et techniciennes en pharmacie doivent accepter de travailler la journée, le soir, les weekends et la nuit.\nDESCRIPTION DES TÂCHES\nLe technicien ou la technicienne en pharmacie relève du pharmacien et accomplit les tâches suivantes :\n\n Exécuter toutes les tâches définies dans le Modèle de normes des techniciens en pharmacie du Canada de NAPRA et du Ontario College of Pharmacists (OCP).\n Se tenir informé et suivre les politiques et procédures du Département de pharmacie et de l’Hôpital basés sur les standards professionnels de la pharmacies et les réglementations en vigueuresTenir à jour le profil électronique exact de chaque patient.\n Préparer, vérifier et livrer les médicaments d’ordonnance aux patients hospitalisés et ambulatoires.\n § Distribuer tous les produits pharmaceutiques et tenir l’inventaire à jourincluant les médicaments qui figurent ou non au formulaire, les stupéfiants, substances ciblées et contrôllées, les médicaments d’urgence, les médicaments du Programme d’Accès Spéciale de Santé Canada, les médicaments d’essais cliniques.\n Maintenirdes stocks de produits pharmaceutiques, des étiquettes et desautres fournitures dans les lieux de travail du Département de pharmacie.\n Inscrire les produits et les fournitures pharmaceutiques manquants sur la liste de commande désignée et les signaler à le(la) technicien(ne) en pharmacie assignéeà l’approvisionnement.\n Approvisionner es stocks de produits pharmaceutiques et de fournitures dans les services cliniques et ambulatoires de l’Hôpital en fonction de leurs besoins.\n S’assurer que les produits pharmaceutiques disponibles à la pharmacie et sur les étages cliniques et ambulatoires sont non-expirés et participer à la rotation des stocks\n Prioriser, débuter et compléter les histoires médicamenteuses des patients et informer rapidement le pharmacien de toutes divergences pour que celui-ci puisse les réconcilier.\n Assurer la propreté, l’ordre et la fonctionnalité des lieux de travail.\n Tenir les équipements et les dispositifs automatiques en bon état de fonctionnement; résoudre les problèmes dans la mesure du possible et signaler les problèmes aux membres du personnel concernés.\n Signaler au pharmacien les défauts des produits tels que le mauvais étiquetage, la décoloration, la détérioration, les dépôts ou la contamination d’un produit et remplir le rapport d’incident\n Signaler les erreurs de médication au pharmacien et remplir le rapport d’incident\n Mettre à jour les dossiers d’activités liées à la pharmacie et participer à la compilation des statistiques du Département de Pharmacie\n Participer aux différents rôles des techniciens en pharmacie en assumant les responsabilités et en exécutant les tâches de chaque section, ce qui inclue la rotation des horaires et d quarts de weekend et de nuit.\n Participer aux réunions du personnel et des techniciens du Département de pharmacie, aux activités de planification et de communication du Département ainsi qu’à l’exécution de projets spéciaux au besoin.\n Participer à la formation et à l’orientation des nouveaux employés en leur montrant les aspects techniques du Département de pharmacie.\n Participer aux activités d’assurance de la qualité du Département.\n Collaborer avec tous les collègues afin de favoriser et d’entretenir des relations harmonieuses dans le Département de pharmacie et avec les autres services de l’Hôpital.\n Remplacer les collègues dans la pharmacie KidCare selon les besoins\n Accomplir d’autres tâches à la demande du superviseur.\n\nQUALIFICATIONS\n\n Vérification du casier judiciaire (Essentiel)\n Diplôme de technicien en pharmacie d’un collègue accrédité (Essentiel)\n Agrément de technicien en pharmacie de l’Ordre des pharmaciens de l’Ontario (Essentiel)\n Expérience pertinente d’au moins deux (2) ans (Préférable)\n Expérience de la préparation d’articles stériles (Préférable)\n Expérience de la préparation d’articles non stériles (Préférable)\n Bilinguisme (français et anglais) (Préférable)\n Maintenir à jour ses connaissances et assurer le bon fonctionnement de tous les équipements et de tous les dispositifs automatiques (Essentiel)\n Réussir la certification annuelle pour les préparations stériles et non-stériles (Essentiel)\n\n* Veuillez noter que vous serez représenté(e) par le syndicat des employés de la fonction publique de l’Ontario (SEFPO).\nCHEO s’engage à offrir un environnement sécuritaire au personnel, aux patients et aux visiteurs. Conformément à cet engagement, tous les candidats doivent être entièrement vaccinés contre la COVID-19 pour être considérés comme des candidats pour tout emploi de personnel ou de bénévole. Les candidats sont également fortement encouragés à recevoir leurs doses de rappel contre la COVID-19 lorsqu’ils sont admissibles pour éviter la propagation de COVID-19. Lors de l’embauche, la présentation de documents gouvernementaux confirmant la vaccination complète doit être fournie, ou la présentation de documents justificatifs d’une contre-indication médicale valide ou d’une autre considération raisonnable en vertu du Code des droits de la personne de l’Ontario.\nÀ partir du 29 mars 2021, CHEO mènera un processus de présélection et d'évaluation plus complet. Ce processus peut comprendre des tests plus variés et multidimensionnels tels qu'un test écrit, un examen pratique ou une autre évaluation. Tous les candidats qui satisfont aux qualifications essentielles et préférées peuvent être testés. Tous les membres de OPSEU serront accorder une entrevue après avoir passé la présélection. La présélection peut comprendre des tests.\nCHEO valorise la diversité et est un employeur qui souscrit au principe de l’égalité d’accès. Nous nous sommes engagés à fournir un environnement de travail inclusif et sans obstacle, en commençant par le processus d’embauche et nous sommes heureux de recevoir des demandes provenant de tous les candidats qualifiés.\nSi vous avez besoin de mesures d’adaptation pendant une phase du processus de recrutement, veuillez communiquer avec les Ressources humaines à jobs@cheo.on.ca. Tous les renseignements reçus concernant les mesures d’adaptation resteront confidentiels et seront traités conformément à la Loi sur l’accessibilité pour les personnes handicapées de l’Ontario.\nNous remercions toutes les personnes qui posent leur candidature; toutefois, nous ne communiquerons qu’avec celles qui seront convoquées à une entrevue.\nJob Type: Part-time\nSalary: $31.09-$37.77 per hour\nExpected hours: 18.75 per week\nApplication question(s):\n\n Are you licensed as a Pharmacy Technician with the Ontario College of Pharmacists?\n\nAbility to Commute:\n\n Ottawa, ON K1H 8L1 (required)\n\nWork Location: In person"
}