{
    "id": "32a9236b930d2498",
    "companyDescription": "",
    "description": "Site Name: Canada – Ontario – Ottawa\n  \n Posted Date: Jan 15 2024\n  Our Pharmaceuticals business has a broad portfolio of innovative and established medicines in respiratory, HIV, immuno-inflammation, and oncology. We are strengthening our R&D pipeline by focusing on immunology, human genetics, and advanced technologies to help us deliver transformational new medicines for patients. The business generated sales of £17 billion in 2020.\n \n  Our strategy is to research and produce innovative, high-quality, and needed medicines, making these as accessible as possible to countries at all levels of income and development. We focus on creating a differentiated pipeline, leading in HIV and respiratory, and developing our presence in specialty therapy areas, including oncology and immuno-inflammation.\n \n  Our portfolio includes innovative and established medicines, and we have leading global positions in respiratory disease and HIV. We have been a leader in respiratory disease for over 40 years and have a portfolio of mature products.\n \n  We are creating an agile and more competitive Pharma business equipped to win in a dynamic external environment by improving our pipeline and performance. We will prioritize taking rapid, decisive action to focus the portfolio and accelerate timelines across four core areas to maintain or build global leadership (Respiratory, HIV/Infectious Disease, Oncology, and Immuno-Inflammation). Our integrated Pharma business will become a more competitive organisation: R&D, Manufacturing, and Commercial will combine to simplify decision-making and increase efficiency. Plus, we will continue to be a ‘force for good’ driven equally by competitive performance and our values.\n \n  Find additional details about our Pharma business and portfolio:\n  Our Pharma business\n  Product Pipeline\n \n  Details (your) Responsibilities\n \n \n  Develop business sales plans for individual customers to grow the business, set appropriate short term objectives for customer calls to achieve long term goals and execute territory business plans for the product mix in order to achieve/surpass sales objectives in the Respiratory Division.\n  Effectively integrate product knowledge into a relevant informative dialogue which brings customers an insightful perspective, elevates the patient experience, competitively differentiates Gsk products and drives customer action to change\n  Thoroughly understand GSK products, strategies, positioning and POA as well as those of key competitors\n  Understand how patients and health care professionals navigate the health care system and integrate these insights in the dialogue with the customer\n \n  • Build and maintain a network of health care professionals to grow sales of the product mix through positive and value additive customer relationships • Allocate budget and effectively use available resources (internal and external) to create customer value (right resource / right customer / right channel / right time) • You ensure your work contributes to the goals of the business and use your judgment to influence decisions in a timely and ethical way • You find the best solutions for the business by working with people both inside and outside the organization\n \n  You work collaboratively with others and develop effective relationships to create new ideas together to get the best results\n  You contribute to a great working environment by bringing positive energy and commitment.\n  You are open to learning, adapting quickly to new ways of working and identifying opportunities for development.\n \n \n  Why you?\n  Basic Qualifications\n \n \n  Minimum of a bachelor’s Degree completed\n  *Valid driver's license\n  Previous sales experience in a highly competitive pharmaceutical environment\n  Strong working knowledge of the terr healthcare structure, hospital landscape and the pharmaceutical industry\n  Working knowledge of computer technology, Word, Excel, PPT and agility to learn new programs\n \n \n  Required Qualifications\n \n  High sense of initiative bringing a Business Owner / Hunter mindset to seek and quickly realize business/ customer opportunity aligning the right resources and tactics to win across channels\n  Proven track record of consistently winning in a highly competitive pharmaceutical sales environment by utilizing your sales skills to optimally match customer and patient needs to company solutions to drive results (Respiratory Sales Experience an Asset)\n \n  • Exceptional active listening skills and flexibility to deliver a sales approach that matches customer communication styles and needs • Highly developed verbal and written communication skills across channels by communicating with clarity, structure and passion to drive desired change\n  • Strong working knowledge interpreting scientific research studies that allows you to sell in compelling and competitive way that supports patients, customers and the business • In-depth knowledge of data analysis techniques to support business analysis and to optimize territory management\n \n  Impressive track record of leading sales results by consistently utilizing a multichannel approach to win (face to face, phone, Veeva Engage, Zoom, email, etc..)\n  Ability to lead and thrive through change by bringing an agile working approach that embraces continuous improvement and optimism to win in any working environment\n  Brilliant team player who makes those around them better through collaboration, optimism, creativity, communication and commitment for the team to win together\n  Strong organization, time management and team coordination skills to manage a large geography to its optimal potential with other team members\n  This position requires the employee to drive routinely on Company business and allows for the provision of a company – leased vehicle. However, to be eligible for this position and a company vehicle, GSK will need to obtain acceptable results from a license verification inquiry and drivers abstract review against its safe driver program requirements\n \n \n  Why GSK?\n  Our values and expectations are at the heart of everything we do and form an important part of our culture.\n  These include Patient focus, Transparency, Respect, Integrity along with Courage, Accountability, Development, and Teamwork. As GSK focuses on our values and expectations and a culture of innovation, performance, and trust, the successful candidate will demonstrate the following capabilities: \n \n  Operating at pace and agile decision-making – using evidence and applying judgement to balance pace, rigor, and risk.\n   Committed to delivering high quality results, overcoming challenges, focusing on what matters, execution.\n   Continuously looking for opportunities to learn, build skills and share learning.\n   Sustaining energy and well-being\n   Building strong relationships and collaboration, honest and open conversations.\n   Budgeting and cost-consciousness\n \n \n \n  Please note that only candidates meeting the above-mentioned requirements will be contacted for an interview. In the event where the number of qualified candidates vastly exceeds the number of vacancies, the candidates’ leadership team will be contacted to help rank candidates. Only top candidates are to be interviewed.\n \n \n  #LI-GSK\n  Why Us?\n  GSK is a global biopharma company with a special purpose – to unite science, technology and talent to get ahead of disease together – so we can positively impact the health of billions of people and deliver stronger, more sustainable shareholder returns – as an organization where people can thrive. Getting ahead means preventing disease as well as treating it, and we aim to positively impact the health of 2.5 billion people by the end of 2030.\n \n  Our success absolutely depends on our people. While getting ahead of disease together is about our ambition for patients and shareholders, it’s also about making GSK a place where people can thrive. We want GSK to be a workplace where everyone can feel a sense of belonging and thrive as set out in our Equal and Inclusive Treatment of Employees policy. We’re committed to being more proactive at all levels so that our workforce reflects the communities we work and hire in, and our GSK leadership reflects our GSK workforce.\n \n  GSK is an equal opportunity employer committed to diversity and inclusion. We welcome applications from all qualified individuals to apply to our career opportunities. GSK is committed to accommodating persons with disabilities. If you need accommodation at any stage of the application process or want more information on our accommodation policies, please contact us at canada-recruitment@gsk.com. Please do not send resumes to this e-mail and instead apply through the online application process of this posting.\n \n  Important notice to Employment businesses/ Agencies\n  GSK does not accept referrals from employment businesses and/or employment agencies in respect of the vacancies posted on this site. All employment businesses/agencies are required to contact GSK's commercial and general procurement/human resources department to obtain prior written authorization before referring any candidates to GSK. The obtaining of prior written authorization is a condition precedent to any agreement (verbal or written) between the employment business/ agency and GSK. In the absence of such written authorization being obtained any actions undertaken by the employment business/agency shall be deemed to have been performed without the consent or contractual agreement of GSK. GSK shall therefore not be liable for any fees arising from such actions or any fees arising from any referrals by employment businesses/agencies in respect of the vacancies posted on this site.",
    "preprocessed_description": "Site Name: Canada – Ontario – Ottawa Posted Date: Jan 15 2024 Our Pharmaceuticals business has a broad portfolio of innovative and established medicines in respiratory, HIV, immuno-inflammation, and oncology. We are strengthening our Research and Development pipeline by focusing on immunology, human genetics, and advanced technologies to help us deliver transformational new medicines for patients. The business generated sales of £17 billion in 2020. Our strategy is to research and produce innovative, high-quality, and needed medicines, making these as accessible as possible to countries at all levels of income and development. We focus on creating a differentiated pipeline, leading in HIV and respiratory, and developing our presence in specialty therapy areas, including oncology and immuno-inflammation. Our portfolio includes innovative and established medicines, and we have leading global positions in respiratory disease and HIV. We have been a leader in respiratory disease for over 40 years and have a portfolio of mature products. We are creating an agile and more competitive Pharma business equipped to win in a dynamic external environment by improving our pipeline and performance. We will prioritize taking rapid, decisive action to focus the portfolio and accelerate timelines across four core areas to maintain or build global leadership (Respiratory, HIV/Infectious Disease, Oncology, and Immuno-Inflammation). Our integrated Pharma business will become a more competitive organisation: Research and Development, Manufacturing, and Commercial will combine to simplify decision-making and increase efficiency. Plus, we will continue to be a 'force for good' driven equally by competitive performance and our values. Find additional details about our Pharma business and portfolio: Our Pharma business Product Pipeline Details (your) Responsibilities Develop business sales plans for individual customers to grow the business, set appropriate short term objectives for customer calls to achieve long term goals and execute territory business plans for the product mix in order to achieve/surpass sales objectives in the Respiratory Division. Effectively integrate product knowledge into a relevant informative dialogue which brings customers an insightful perspective, elevates the patient experience, competitively differentiates Gsk products and drives customer action to change Thoroughly understand GSK products, strategies, positioning and POA as well as those of key competitors Understand how patients and health care professionals navigate the health care system and integrate these insights in the dialogue with the customer - Build and maintain a network of health care professionals to grow sales of the product mix through positive and value additive customer relationships • Allocate budget and effectively use available resources (internal and external) to create customer value (right resource / right customer / right channel / right time) • You ensure your work contributes to the goals of the business and use your judgment to influence decisions in a timely and ethical way • You find the best solutions for the business by working with people both inside and outside the organization You work collaboratively with others and develop effective relationships to create new ideas together to get the best results You contribute to a great working environment by bringing positive energy and commitment. You are open to learning, adapting quickly to new ways of working and identifying opportunities for development. Why you? Basic Qualifications Minimum of a bachelor's Degree completed Valid driver's license Previous sales experience in a highly competitive pharmaceutical environment Strong working knowledge of the terr healthcare structure, hospital landscape and the pharmaceutical industry Working knowledge of computer technology, Word, Excel, PPT and agility to learn new programs Required Qualifications High sense of initiative bringing a Business Owner / Hunter mindset to seek and quickly realize business/ customer opportunity aligning the right resources and tactics to win across channels Proven track record of consistently winning in a highly competitive pharmaceutical sales environment by utilizing your sales skills to optimally match customer and patient needs to company solutions to drive results (Respiratory Sales Experience an Asset) - Exceptional active listening skills and flexibility to deliver a sales approach that matches customer communication styles and needs • Highly developed verbal and written communication skills across channels by communicating with clarity, structure and passion to drive desired change - Strong working knowledge interpreting scientific research studies that allows you to sell in compelling and competitive way that supports patients, customers and the business • In-depth knowledge of data analysis techniques to support business analysis and to optimize territory management Impressive track record of leading sales results by consistently utilizing a multichannel approach to win (face to face, phone, Veeva Engage, Zoom, email, etc..) Ability to lead and thrive through change by bringing an agile working approach that embraces continuous improvement and optimism to win in any working environment Brilliant team player who makes those around them better through collaboration, optimism, creativity, communication and commitment for the team to win together Strong organization, time management and team coordination skills to manage a large geography to its optimal potential with other team members This position requires the employee to drive routinely on Company business and allows for the provision of a company – leased vehicle. However, to be eligible for this position and a company vehicle, GSK will need to obtain acceptable results from a license verification inquiry and drivers abstract review against its safe driver program requirements Why GSK? Our values and expectations are at the heart of everything we do and form an important part of our culture. These include Patient focus, Transparency, Respect, Integrity along with Courage, Accountability, Development, and Teamwork. As GSK focuses on our values and expectations and a culture of innovation, performance, and trust, the successful candidate will demonstrate the following capabilities: Operating at pace and agile decision-making – using evidence and applying judgement to balance pace, rigor, and risk. Committed to delivering high quality results, overcoming challenges, focusing on what matters, execution. Continuously looking for opportunities to learn, build skills and share learning. Sustaining energy and well-being Building strong relationships and collaboration, honest and open conversations. Budgeting and cost-consciousness Please note that only candidates meeting the above-mentioned requirements will be contacted for an interview. In the event where the number of qualified candidates vastly exceeds the number of vacancies, the candidates' leadership team will be contacted to help rank candidates. Only top candidates are to be interviewed. #LI-GSK Why Us? GSK is a global biopharma company with a special purpose – to unite science, technology and talent to get ahead of disease together – so we can positively impact the health of billions of people and deliver stronger, more sustainable shareholder returns – as an organization where people can thrive. Getting ahead means preventing disease as well as treating it, and we aim to positively impact the health of 2.5 billion people by the end of 2030. Our success absolutely depends on our people. While getting ahead of disease together is about our ambition for patients and shareholders, it is also about making GSK a place where people can thrive. We want GSK to be a workplace where everyone can feel a sense of belonging and thrive as set out in our Equal and Inclusive Treatment of Employees policy. We're committed to being more proactive at all levels so that our workforce reflects the communities we work and hire in, and our GSK leadership reflects our GSK workforce. GSK is an equal opportunity employer committed to diversity and inclusion. We welcome applications from all qualified individuals to apply to our career opportunities. GSK is committed to accommodating persons with disabilities. If you need accommodation at any stage of the application process or want more information on our accommodation policies, please contact us at canada-recruitment@gsk.com. Please do not send resumes to this e-mail and instead apply through the online application process of this posting. Important notice to Employment businesses/ Agencies GSK does not accept referrals from employment businesses and/or employment agencies in respect of the vacancies posted on this site. All employment businesses/agencies are required to contact GSK's commercial and general procurement/human resources department to obtain prior written authorization before referring any candidates to GSK. The obtaining of prior written authorization is a condition precedent to any agreement (verbal or written) between the employment business/ agency and GSK. In the absence of such written authorization being obtained any actions undertaken by the employment business/agency shall be deemed to have been performed without the consent or contractual agreement of GSK. GSK shall therefore not be liable for any fees arising from such actions or any fees arising from any referrals by employment businesses/agencies in respect of the vacancies posted on this site.",
    "processed_description": "site – – Posted Pharmaceuticals business broad portfolio innovative establish medicine respiratory HIV immuno inflammation oncology . strengthen Research Development pipeline focus immunology human genetic advanced technology help deliver transformational medicine patient . business generate sale . strategy research produce innovative high quality medicine accessible country level income development . focus create differentiated pipeline lead HIV respiratory develop presence specialty therapy area include oncology immuno inflammation . portfolio include innovative establish medicine lead global position respiratory disease HIV . leader respiratory disease portfolio mature product . create agile competitive Pharma business equip win dynamic external environment improve pipeline performance . prioritize rapid decisive action focus portfolio accelerate timeline core area maintain build global leadership Respiratory HIV Infectious Disease Oncology Immuno Inflammation . integrated Pharma business competitive organisation combine simplify decision making increase efficiency . continue 'force good ' drive equally competitive performance . find additional detail Pharma business portfolio Pharma business Product Pipeline Details business sale plan individual customer grow business set appropriate short term objective customer achieve long term goal execute territory business plan product mix order achieve surpass sale objective . effectively integrate product knowledge relevant informative dialogue bring customer insightful perspective elevate patient competitively differentiate Gsk product drive customer action change thoroughly understand GSK product strategy positioning POA key competitor understand patient health care professional navigate health care system integrate insight dialogue customer build maintain network health care professional grow sale product mix positive additive customer relationship • allocate budget effectively resource internal external create customer resource customer channel • ensure contribute goal business judgment influence decision timely ethical • find good solution business people inside organization collaboratively develop effective relationship create idea good result contribute great working environment bring positive energy commitment . open learn adapt identify development . Basic Qualifications Minimum bachelor's degree complete valid driver's license previous sale highly competitive pharmaceutical environment strong knowledge terr healthcare structure hospital landscape pharmaceutical industry working knowledge computer technology ppt agility learn program require Qualifications high sense initiative bring Business Owner Hunter mindset seek realize business customer align resource tactic win channel prove track record consistently win highly competitive pharmaceutical sale environment utilize sale skill optimally match customer patient company solution drive result respiratory Sales Asset exceptional active listening skill flexibility deliver sale approach match customer communication style • highly developed verbal write communication skill channel communicate clarity structure passion drive desire change strong knowledge interpret scientific research study allow sell compelling competitive support patient customer business • depth knowledge data analysis technique support business analysis optimize territory management impressive track record lead sale result consistently utilize multichannel approach win face face phone Zoom email .. lead thrive change bring agile approach embrace continuous improvement optimism win working environment brilliant team player collaboration optimism creativity communication commitment team win strong organization management team coordination skill manage large geography optimal potential team position require employee drive routinely Company business allow provision company – lease vehicle . eligible position company vehicle acceptable result license verification inquiry driver abstract review safe driver program requirement expectation heart form culture . include patient focus Transparency respect Integrity . focus expectation culture innovation performance trust successful demonstrate follow capability operate pace agile decision making – evidence apply judgement balance pace rigor risk . commit deliver high quality result overcome challenge focus matter execution . continuously learn build skill share learn . sustain energy strong relationship collaboration honest open conversation . budgeting cost consciousness note meet mention requirement contact interview . event number qualified vastly exceed number vacancy candidate' leadership team contact help rank . interview . global biopharma company special purpose – unite science technology talent ahead disease – positively impact health people deliver strong sustainable shareholder return – organization people thrive . ahead prevent disease treat aim positively impact health billion people . success absolutely depend people . ahead disease ambition patient shareholder place people thrive . workplace feel sense belong thrive set Equal Inclusive Treatment Employees policy . committed proactive level workforce reflect community hire GSK leadership reflect GSK workforce . equal employer commit diversity inclusion . application qualified individual apply career . committed accommodate person . accommodation stage application process information accommodation policy contact . send resume mail apply online application process posting . notice accept referral employment business employment agency respect vacancy post site . employment business agency require contact GSK's commercial general procurement human resource department prior write authorization refer . obtaining prior write authorization condition precedent agreement verbal write employment business agency . absence write authorization action undertake employment business agency deem perform consent contractual agreement . liable fee action fee referral employment business agency respect vacancy post site .",
    "results_group": {
        "extracted_noun_chunks": [
            "timeline core area",
            "track record",
            "budget",
            "respiratory Sales Asset exceptional active listening skill flexibility",
            "organization people",
            "immunology human genetic advanced technology help",
            "multichannel approach win face",
            "healthcare structure hospital landscape pharmaceutical industry",
            "budgeting cost consciousness note",
            "liable fee action fee referral employment business agency respect vacancy post site",
            "customer patient company solution drive result",
            "mention requirement contact interview",
            "prior write authorization condition precedent agreement verbal write employment business agency",
            "authorization refer",
            "good solution business people",
            "compelling competitive support patient customer business • depth knowledge data analysis technique support business analysis",
            "success",
            "open learn",
            "customer",
            "provision company",
            "medicine",
            "referral employment business employment agency respect vacancy post site",
            "health care system",
            "identify development",
            "lease vehicle",
            "committed proactive level workforce",
            "overcome",
            "global position respiratory disease HIV",
            "portfolio",
            "agility",
            "sale",
            "judgement balance pace rigor risk",
            "transformational medicine patient",
            "Posted Pharmaceuticals business broad portfolio",
            "decision",
            "energy strong relationship collaboration honest open conversation",
            "product knowledge",
            "patient health care professional",
            "strong sustainable shareholder return",
            "GSK leadership",
            "disease",
            "long term goal",
            "evidence",
            "large geography optimal potential team position",
            "phone Zoom email",
            "workplace",
            "global biopharma company special purpose",
            "effective relationship",
            "rapid decisive action focus portfolio",
            "relevant informative dialogue",
            "Business Owner Hunter mindset",
            "scientific research study",
            "GSK product strategy positioning POA key competitor",
            "employment business agency",
            "sale skill",
            "challenge",
            "additional detail",
            "insight dialogue customer",
            "health people",
            "Qualifications high sense initiative",
            "sense",
            "highly developed verbal write communication skill channel",
            "science technology talent",
            "build skill share",
            "absence",
            "follow capability",
            "business customer",
            "safe driver program requirement expectation heart form culture",
            "thrive change",
            "great working environment",
            "oncology immuno inflammation",
            "strong knowledge",
            "focus expectation culture innovation performance trust",
            "people",
            "GSK workforce",
            "highly competitive pharmaceutical sale environment",
            "internal external create customer resource customer channel",
            "agile decision making",
            "high quality result",
            "Respiratory HIV Infectious Disease Oncology Immuno Inflammation",
            "Equal Inclusive Treatment Employees policy",
            "health billion people",
            "diversity inclusion",
            "Research Development pipeline",
            "employee",
            "Pharma business portfolio Pharma business Product Pipeline Details business sale plan individual customer",
            "continuous improvement optimism win working environment brilliant team player collaboration optimism creativity communication commitment team",
            "notice",
            "event number",
            "differentiated pipeline",
            "equally competitive performance",
            "patient",
            "innovative high quality medicine accessible country level income development",
            "Gsk product drive customer action change",
            "committed accommodate person",
            "working knowledge computer technology",
            "agile approach",
            "respiratory HIV immuno inflammation oncology",
            "contribute goal business judgment influence decision",
            "resume mail",
            "positive energy commitment",
            "increase efficiency",
            "accommodation stage application process information accommodation policy contact",
            "leader respiratory disease portfolio",
            "appropriate short term objective customer",
            "application qualified individual",
            "resource tactic win channel",
            "territory management impressive track record lead sale result",
            "pipeline performance",
            "global leadership",
            "dynamic external environment",
            "interview",
            "Basic Qualifications Minimum bachelor's degree complete valid driver's license previous sale highly competitive pharmaceutical environment",
            "agile competitive Pharma business equip",
            "innovative establish medicine",
            "patient focus Transparency respect Integrity",
            "program",
            "strategy research",
            "equal employer",
            "grow sale product mix positive additive customer relationship",
            "career",
            "online application process",
            "network health care professional",
            "presence specialty therapy area",
            "surpass sale objective",
            "site",
            "sale approach match customer communication style",
            "integrated Pharma business competitive organisation",
            "organization",
            "territory business plan product mix order",
            "perform consent contractual agreement",
            "strong organization management team coordination skill",
            "business",
            "Company business",
            "idea good result",
            "authorization action",
            "contact GSK's commercial general procurement human resource department",
            "insightful perspective"
        ],
        "combined_lemmatized_tokens": "site – – Posted Pharmaceuticals business broad portfolio innovative establish medicine respiratory HIV immuno inflammation oncology . strengthen Research Development pipeline focus immunology human genetic advanced technology help deliver transformational medicine patient . business generate sale . strategy research produce innovative high quality medicine accessible country level income development . focus create differentiated pipeline lead HIV respiratory develop presence specialty therapy area include oncology immuno inflammation . portfolio include innovative establish medicine lead global position respiratory disease HIV . leader respiratory disease portfolio mature product . create agile competitive Pharma business equip win dynamic external environment improve pipeline performance . prioritize rapid decisive action focus portfolio accelerate timeline core area maintain build global leadership Respiratory HIV Infectious Disease Oncology Immuno Inflammation . integrated Pharma business competitive organisation combine simplify decision making increase efficiency . continue 'force good ' drive equally competitive performance . find additional detail Pharma business portfolio Pharma business Product Pipeline Details business sale plan individual customer grow business set appropriate short term objective customer achieve long term goal execute territory business plan product mix order achieve surpass sale objective . effectively integrate product knowledge relevant informative dialogue bring customer insightful perspective elevate patient competitively differentiate Gsk product drive customer action change thoroughly understand GSK product strategy positioning POA key competitor understand patient health care professional navigate health care system integrate insight dialogue customer build maintain network health care professional grow sale product mix positive additive customer relationship • allocate budget effectively resource internal external create customer resource customer channel • ensure contribute goal business judgment influence decision timely ethical • find good solution business people inside organization collaboratively develop effective relationship create idea good result contribute great working environment bring positive energy commitment . open learn adapt identify development . Basic Qualifications Minimum bachelor's degree complete valid driver's license previous sale highly competitive pharmaceutical environment strong knowledge terr healthcare structure hospital landscape pharmaceutical industry working knowledge computer technology ppt agility learn program require Qualifications high sense initiative bring Business Owner Hunter mindset seek realize business customer align resource tactic win channel prove track record consistently win highly competitive pharmaceutical sale environment utilize sale skill optimally match customer patient company solution drive result respiratory Sales Asset exceptional active listening skill flexibility deliver sale approach match customer communication style • highly developed verbal write communication skill channel communicate clarity structure passion drive desire change strong knowledge interpret scientific research study allow sell compelling competitive support patient customer business • depth knowledge data analysis technique support business analysis optimize territory management impressive track record lead sale result consistently utilize multichannel approach win face face phone Zoom email .. lead thrive change bring agile approach embrace continuous improvement optimism win working environment brilliant team player collaboration optimism creativity communication commitment team win strong organization management team coordination skill manage large geography optimal potential team position require employee drive routinely Company business allow provision company – lease vehicle . eligible position company vehicle acceptable result license verification inquiry driver abstract review safe driver program requirement expectation heart form culture . include patient focus Transparency respect Integrity . focus expectation culture innovation performance trust successful demonstrate follow capability operate pace agile decision making – evidence apply judgement balance pace rigor risk . commit deliver high quality result overcome challenge focus matter execution . continuously learn build skill share learn . sustain energy strong relationship collaboration honest open conversation . budgeting cost consciousness note meet mention requirement contact interview . event number qualified vastly exceed number vacancy candidate' leadership team contact help rank . interview . global biopharma company special purpose – unite science technology talent ahead disease – positively impact health people deliver strong sustainable shareholder return – organization people thrive . ahead prevent disease treat aim positively impact health billion people . success absolutely depend people . ahead disease ambition patient shareholder place people thrive . workplace feel sense belong thrive set Equal Inclusive Treatment Employees policy . committed proactive level workforce reflect community hire GSK leadership reflect GSK workforce . equal employer commit diversity inclusion . application qualified individual apply career . committed accommodate person . accommodation stage application process information accommodation policy contact . send resume mail apply online application process posting . notice accept referral employment business employment agency respect vacancy post site . employment business agency require contact GSK's commercial general procurement human resource department prior write authorization refer . obtaining prior write authorization condition precedent agreement verbal write employment business agency . absence write authorization action undertake employment business agency deem perform consent contractual agreement . liable fee action fee referral employment business agency respect vacancy post site ."
    }
}