{
    "id": "32a9236b930d2498",
    "company": "GSK",
    "positionName": "Territory Associate/ Manager, Ottawa - 18 months contract",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-17T05:13:41.323Z",
    "url": "https://www.indeed.ca/rc/clk?jk=32a9236b930d2498&from=jasx&tk=1hkikipjiii32800&bb=g3LG73kDIG2DKbipZ3VbGC1ohMgvnDMtoCg1JGLY3-7Am90fJS_KG4YQsFXkrUcjjkKV5TbXX9RfStxEHOBoSOmY7mGlQaMeigiIRdCQuEPL9xa2jQcIcA%3D%3D&xkcb=SoCD67M3FShE7dQ2y50MbzkdCdPP&vjs=3",
    "externalApplyLink": "https://jobs.gsk.com/en-gb/jobs/386975?lang=en-us&source=Indeed&sourceType=PREMIUM_POST_SITE",
    "companyDescription": "",
    "description": "Site Name: Canada – Ontario – Ottawa\n  \n Posted Date: Jan 15 2024\n  Our Pharmaceuticals business has a broad portfolio of innovative and established medicines in respiratory, HIV, immuno-inflammation, and oncology. We are strengthening our R&D pipeline by focusing on immunology, human genetics, and advanced technologies to help us deliver transformational new medicines for patients. The business generated sales of £17 billion in 2020.\n \n  Our strategy is to research and produce innovative, high-quality, and needed medicines, making these as accessible as possible to countries at all levels of income and development. We focus on creating a differentiated pipeline, leading in HIV and respiratory, and developing our presence in specialty therapy areas, including oncology and immuno-inflammation.\n \n  Our portfolio includes innovative and established medicines, and we have leading global positions in respiratory disease and HIV. We have been a leader in respiratory disease for over 40 years and have a portfolio of mature products.\n \n  We are creating an agile and more competitive Pharma business equipped to win in a dynamic external environment by improving our pipeline and performance. We will prioritize taking rapid, decisive action to focus the portfolio and accelerate timelines across four core areas to maintain or build global leadership (Respiratory, HIV/Infectious Disease, Oncology, and Immuno-Inflammation). Our integrated Pharma business will become a more competitive organisation: R&D, Manufacturing, and Commercial will combine to simplify decision-making and increase efficiency. Plus, we will continue to be a ‘force for good’ driven equally by competitive performance and our values.\n \n  Find additional details about our Pharma business and portfolio:\n  Our Pharma business\n  Product Pipeline\n \n  Details (your) Responsibilities\n \n \n  Develop business sales plans for individual customers to grow the business, set appropriate short term objectives for customer calls to achieve long term goals and execute territory business plans for the product mix in order to achieve/surpass sales objectives in the Respiratory Division.\n  Effectively integrate product knowledge into a relevant informative dialogue which brings customers an insightful perspective, elevates the patient experience, competitively differentiates Gsk products and drives customer action to change\n  Thoroughly understand GSK products, strategies, positioning and POA as well as those of key competitors\n  Understand how patients and health care professionals navigate the health care system and integrate these insights in the dialogue with the customer\n \n  • Build and maintain a network of health care professionals to grow sales of the product mix through positive and value additive customer relationships • Allocate budget and effectively use available resources (internal and external) to create customer value (right resource / right customer / right channel / right time) • You ensure your work contributes to the goals of the business and use your judgment to influence decisions in a timely and ethical way • You find the best solutions for the business by working with people both inside and outside the organization\n \n  You work collaboratively with others and develop effective relationships to create new ideas together to get the best results\n  You contribute to a great working environment by bringing positive energy and commitment.\n  You are open to learning, adapting quickly to new ways of working and identifying opportunities for development.\n \n \n  Why you?\n  Basic Qualifications\n \n \n  Minimum of a bachelor’s Degree completed\n  *Valid driver's license\n  Previous sales experience in a highly competitive pharmaceutical environment\n  Strong working knowledge of the terr healthcare structure, hospital landscape and the pharmaceutical industry\n  Working knowledge of computer technology, Word, Excel, PPT and agility to learn new programs\n \n \n  Required Qualifications\n \n  High sense of initiative bringing a Business Owner / Hunter mindset to seek and quickly realize business/ customer opportunity aligning the right resources and tactics to win across channels\n  Proven track record of consistently winning in a highly competitive pharmaceutical sales environment by utilizing your sales skills to optimally match customer and patient needs to company solutions to drive results (Respiratory Sales Experience an Asset)\n \n  • Exceptional active listening skills and flexibility to deliver a sales approach that matches customer communication styles and needs • Highly developed verbal and written communication skills across channels by communicating with clarity, structure and passion to drive desired change\n  • Strong working knowledge interpreting scientific research studies that allows you to sell in compelling and competitive way that supports patients, customers and the business • In-depth knowledge of data analysis techniques to support business analysis and to optimize territory management\n \n  Impressive track record of leading sales results by consistently utilizing a multichannel approach to win (face to face, phone, Veeva Engage, Zoom, email, etc..)\n  Ability to lead and thrive through change by bringing an agile working approach that embraces continuous improvement and optimism to win in any working environment\n  Brilliant team player who makes those around them better through collaboration, optimism, creativity, communication and commitment for the team to win together\n  Strong organization, time management and team coordination skills to manage a large geography to its optimal potential with other team members\n  This position requires the employee to drive routinely on Company business and allows for the provision of a company – leased vehicle. However, to be eligible for this position and a company vehicle, GSK will need to obtain acceptable results from a license verification inquiry and drivers abstract review against its safe driver program requirements\n \n \n  Why GSK?\n  Our values and expectations are at the heart of everything we do and form an important part of our culture.\n  These include Patient focus, Transparency, Respect, Integrity along with Courage, Accountability, Development, and Teamwork. As GSK focuses on our values and expectations and a culture of innovation, performance, and trust, the successful candidate will demonstrate the following capabilities: \n \n  Operating at pace and agile decision-making – using evidence and applying judgement to balance pace, rigor, and risk.\n   Committed to delivering high quality results, overcoming challenges, focusing on what matters, execution.\n   Continuously looking for opportunities to learn, build skills and share learning.\n   Sustaining energy and well-being\n   Building strong relationships and collaboration, honest and open conversations.\n   Budgeting and cost-consciousness\n \n \n \n  Please note that only candidates meeting the above-mentioned requirements will be contacted for an interview. In the event where the number of qualified candidates vastly exceeds the number of vacancies, the candidates’ leadership team will be contacted to help rank candidates. Only top candidates are to be interviewed.\n \n \n  #LI-GSK\n  Why Us?\n  GSK is a global biopharma company with a special purpose – to unite science, technology and talent to get ahead of disease together – so we can positively impact the health of billions of people and deliver stronger, more sustainable shareholder returns – as an organization where people can thrive. Getting ahead means preventing disease as well as treating it, and we aim to positively impact the health of 2.5 billion people by the end of 2030.\n \n  Our success absolutely depends on our people. While getting ahead of disease together is about our ambition for patients and shareholders, it’s also about making GSK a place where people can thrive. We want GSK to be a workplace where everyone can feel a sense of belonging and thrive as set out in our Equal and Inclusive Treatment of Employees policy. We’re committed to being more proactive at all levels so that our workforce reflects the communities we work and hire in, and our GSK leadership reflects our GSK workforce.\n \n  GSK is an equal opportunity employer committed to diversity and inclusion. We welcome applications from all qualified individuals to apply to our career opportunities. GSK is committed to accommodating persons with disabilities. If you need accommodation at any stage of the application process or want more information on our accommodation policies, please contact us at canada-recruitment@gsk.com. Please do not send resumes to this e-mail and instead apply through the online application process of this posting.\n \n  Important notice to Employment businesses/ Agencies\n  GSK does not accept referrals from employment businesses and/or employment agencies in respect of the vacancies posted on this site. All employment businesses/agencies are required to contact GSK's commercial and general procurement/human resources department to obtain prior written authorization before referring any candidates to GSK. The obtaining of prior written authorization is a condition precedent to any agreement (verbal or written) between the employment business/ agency and GSK. In the absence of such written authorization being obtained any actions undertaken by the employment business/agency shall be deemed to have been performed without the consent or contractual agreement of GSK. GSK shall therefore not be liable for any fees arising from such actions or any fees arising from any referrals by employment businesses/agencies in respect of the vacancies posted on this site."
}