{
    "id": "b2cd4ca34fa5ef22",
    "company": "City of Ottawa",
    "positionName": "Engineer, Transit Vehicles",
    "jobType": [
        "Temporary",
        "Full-time"
    ],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-05T03:13:49.566Z",
    "url": "https://www.indeed.ca/rc/clk?jk=b2cd4ca34fa5ef22&from=jasx&tk=1hjm3b3kbip98800&vjs=3",
    "externalApplyLink": "https://jobs-emplois.ottawa.ca/city-jobs/job/Ottawa%2C-ON-Engineer%2C-Transit-Vehicles-ON/728213347/",
    "companyDescription": "",
    "description": "Requisition ID: 11083 Department: Transit Services Department Service: Transit Engineering Services Branch: Technical Support Branch Employment Type: 1 Full-time Temporary - Up to 18 months Work Hours: 35.00 hours per week Affiliation: MPE Salary Information: $75,550.02 - $95,546.36 annually (2022 rates of pay) Location: 1500 St.Laurent City: Ottawa, ON Job Category: Engineering Application Close: 18/01/2024 \n       \n        \n         \n           JOB SUMMARY\n         \n         \n           The Transit Fleet and Facilities Maintenance team provides safe, reliable, efficient, timely and cost-effective transit vehicle maintenance services to support federally regulated transit services within the City. The work involves planning, developing, managing, implementing, coordinating and monitoring transit vehicle maintenance activities; materials management and warranty activities; and engineering and technical support activities for vehicle maintenance, including reliability and quality process analysis. \n          You provide vehicle-related engineering and technical expertise to Transit Operations through analysis of issues, problem solving, research/development, life cycle analysis and teamwork on special projects. You support other units within the branch, ensuring best practices, performance measurement, and client-focused service delivery models and designs, in order to maximize existing resources. \n          As one of multiple incumbents in this job, you may be required to perform any/all of the following duties: \n          \n           providing engineering support including design sketches, drawings and work procedures; \n           providing engineering expertise in bus electronic hardware and software systems; \n           providing engineering expertise for the transit vehicle capital acquisition program; \n           providing engineering expertise regarding safety issues for transit vehicles; \n           providing engineering expertise and life cycle management for the Vehicle Refurbishment and Rebuild programs; \n           developing/implementing a Configuration Management Program for transit vehicles and developing/implementing approved modifications for transit vehicles; \n           developing/implementing and supporting a hybrid or other alternative technology program; \n           designing/implementing Trial and Evaluation Programs to provide design and engineering support for projects relating to new requirements, and new technologies; and \n           planning, coordinating and implementing a variety of Transit Operations studies and special projects.\n          \n           \n           \n          You may also assist the manager with engineering expertise in procurement projects and technical specification documentation; and communicate with internal/external clients, liaise with other City of Ottawa centers of expertise, and liaise with federal/provincial government agencies and civilian automotive societies and associations for application and interpretation of standards, regulations and various acts. \n          In addition, you direct the implementation of project strategies, and manage project work, including the financial and human resources related to the project. \n         \n        \n        \n         \n           EDUCATION AND EXPERIENCE\n         \n         \n           Completion of 4 year university degree in Engineering, in either Mechanical Engineering or Electronics / Electrical Engineering, depending on the position \n          Minimum of 3 years of experience in the field of systems engineering for vehicles, including the analysis of data, specification development, manufacturing or project management \n         \n        \n        \n         \n           CERTIFICATIONS AND LICENCES \n         \n         \n          \n           Licensed Professional Engineer (P.Eng.) with Professional Engineers Ontario (PEO)\n          \n         \n        \n        \n         \n           KNOWLEDGE \n         \n         \n          \n           Technical knowledge of the design, fabrication, quality control and installations of vehicle electrical and electronic parts, components and systems; \n           Practical knowledge of automotive systems and sub-system designs, and operation \n           Motor vehicle standards and legislation (Canadian Motor Vehicle Safety standards, Society of Automotive Engineer standards, Canadian Safety standards, Ontario Highway Traffic Act regulations) \n           Repair garages and work processes involved \n           Reliability centered maintenance, including reliability, maintainability, and availability \n           Vehicle technology including performance and technical specifications \n           Business software and information systems (SAP, maintenance management information systems, Project management) \n           Engineering and Configuration Change Management \n           Quality Assurance and Control standards and methodology applicable to automotive industry \n           Life Cycle Management and Life Cycle Costing of equipment \n           Principles/techniques of project management \n           Knowledge of data collection, validation, analysis, and uses \n           Knowledge of drafting software tools such as AutoCAD or MicroStation \n          \n         \n        \n        \n         \n          COMPETENCIES, SKILLS AND ABILITIES \n         \n         \n          \n           Able to work independently, with minimum supervision, and collaboratively with all staff as part of a team \n           Possess organizational skills and flexibility to plan, initiate, organize and prioritize own work, and to deal effectively with multiple projects/demands, conflicting priorities, pressures and deadlines \n           Able to research and analyze issues, interpret trial results, make decisions, develop appropriate solutions and formulate recommendations \n           Able to work collaboratively and to bring conflicting points of view to consensus \n           Possess computer literacy in MS Office Suite in a Windows environment, including use of the intra/Internet \n           Possess analytical skills using fleet maintenance data \n           Possess excellent interpersonal, communication, and report writing skills \n           Able to present information to internal/external audiences \n           Analytical and attentive to detail \n           Innovative and resourceful \n           Able to demonstrate sound judgement \n           Able to demonstrate tact and diplomacy \n           Possess initiative and self-motivation \n           Flexible and adaptable to deal with shifting priorities \n           Possess a work record of good attendance and job performance \n           \n         \n        \n       \n       WHAT YOU NEED TO KNOW \n       \n        Language Requirement: English oral, reading, writing \n        Please save a copy of the job poster. Once the closing date has passed, it will no longer be available.\n       \n        \n        \n       We wish to thank all applicants for their interest and effort in applying for this position. Only candidates selected for interviews will be contacted.\n        \n        \n       The City of Ottawa promotes the principles of diversity and inclusion and adheres to the tenets of the Canadian Human Rights Act and the Ontario Human Rights Code. We encourage applications from members of Indigenous, Black and other racialized communities, persons with disabilities, women and non-binary persons, persons of all ethnic origins, religions, sexual orientations, classes, gender identities and expressions. Candidates are encouraged to self-identify as a member of one or more designated employment equity groups in the self-identification questionnaire.\n        \n        \n       The City of Ottawa provides accommodation during all parts of the hiring process, upon request, to applicants with disabilities. If contacted to proceed to the selection process, please advise us if you require any accommodation.\n        \n        \n       Accessible formats and communication supports are available upon request. Please contact the HR Service Centre at 613-580-2424, extension 47411."
}