{
    "id": "5301b6394348a297",
    "company": "Bureau Veritas",
    "positionName": "SAMPLE RECEPTION COORDINATOR-OTTAWA DEPOT",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-16T18:53:12.658Z",
    "url": "https://www.indeed.ca/rc/clk?jk=5301b6394348a297&from=jasx&tk=1hcvfn7eljiim800&vjs=3",
    "externalApplyLink": "https://careers.bureauveritas.com/UnitedStates/job/Ottawa-Sample-Reception-Coordinator-Ottawa-Depot-Onta/994675801/",
    "companyDescription": "",
    "description": "Do you believe in the power of teamwork and sharing ideas? Do you take pride in delivering exceptional quality and service with everything you do? Do you seek out ideas for improving the status quo? If you want to make a difference and love being surrounded by the best and the brightest, Bureau Veritas Laboratories might be the place for you!\n \n  \n  \n \n  Imagine being surrounded by the brightest minds in the industry\n \n  \n  \n \n  Bureau Veritas is looking for a\n \n  \n  \n \n  Sample Reception Coordinator - Ottawa Depot , Fulltime\n  \n \n  Join our talented team of experts in the scientific field to advance your technical knowledge and advance your career. Every day we go above and beyond to deliver innovative solutions to help our clients make important decisions that directly impact the community and the environment.\n \n  \n \n \n  As a \n  Sample Reception Coordinator\n  , your main responsibilities are:\n  \n \n  Greet all clients in a friendly, positive manner \n  Receive all external client samples \n  Unpack samples and organize them according to analytical requirements \n  Ensure client samples are entered into LIMS and approved in a timely manner according to sample holding time, test code, due date, and / or received date. \n  Ensure all required samples are redirected as required \n  Prepare bottle orders requests and coordinate delivery of bottle orders \n  Provide support to the Campobello Sample Entry team \n  Ensure accuracy of results and data entry \n  Recognize routine and non-routine problems and escalate to the Supervisor \n  Ensure supply inventories are maintained \n  Proactively ensure overall satisfaction of regional client base including communication to project management and supervisor as appropriate. \n  Monitor/Calibrate the temperatures of fridges, thermometers and temperature guns \n  Work closely with project management staff to grow Bureau Veritas’s regional market share with existing and new clients. \n  Adhere to Bureau Veritas’s quality systems QA/QC, SOP's and external accreditation requirements. \n  Adhere to Bureau Veritas's safety policies.\n \n  \n  \n \n \n  You are the ideal Customer Service Supervisor, if you have:\n  \n \n  A post-secondary degree in the Sciences, preferably chemistry or environmental related and/or equivalent experience. \n  Experience in a laboratory environment is considered an asset. \n  Ability to lift up to 40 pounds \n  Excellent communication skills (both written and verbal). \n  Energetic personality that can work independently in a multi-tasking fast paced environment. \n  You have excellent communication skills (both written and verbal) as well as outstanding computer skills (Microsoft Word, Excel, Outlook etc.) \n  You have a strong ability to work independently as well as engage others when required in escalation of concerns to meet the client needs or to best manage client disappointments \n  You are an energetic and keen individual with a positive attitude who thrives in a fast-paced environment where multi-tasking, prioritizing and adapting to changes are required\n \n  \n  \n \n \n  Bureau Veritas is a world leader in testing, inspection and certification services.\n \n  \n  \n \n  When we look at Bureau Veritas, we want to see a reflection of the communities in which we work. Inclusion is about actively involving every employee’s ideas, knowledge, perspectives, approaches and styles to maximize business success. Inclusion is about attracting new talent who will bring more diversity to our workforce, with differences in culture, professional backgrounds and beliefs.\n \n  \n \n \n  \n   purpose: shaping a world of trust.\n  \n \n  \n  \n \n \n  Guaranteeing quality, ensuring Health and Safety, mitigating risks and improving performance as well as environmental protection and social responsibility … This is what Bureau Veritas is about, truly believing that it contributes to bettering society.\n \n  \n  \n \n  Blending performance & integrity, with \n  ambition & humility, responsibility & openness, we are proud that our people \n  leave a mark on what they do.\n \n  \n  \n \n  We respect our people and believe in our talents.\n \n  \n  \n \n  We empower them to leave their mark, working as a team for the benefit of our 400,000 clients across 140 countries.\n \n  \n  \n \n  We believe that \n  leaving a mark is a true challenge and opportunity for every one of us, a sign of trust and impact, a bond with the future, a proof of growth and development.\n \n  \n  \n \n  Being part of the BV family, is more than just working, it’s being convinced that you will \n  Leave your mark…. in shaping a world of trust.\n \n  \n  \n \n  Join our talented community of scientists and experts and apply today at http://bvlabs.com/careers/current-opportunities\n \n  \n  \n \n  Bureau Veritas Labs is an equal opportunity employer. We are committed to an inclusive, barrier-free recruitment and selection process and work environment. If you are contacted for a job opportunity, please advise Human Resources of any accommodations that are required. Any information received relating to accommodations will be treated as confidential.\n \n  \n  \n \n  Shaping a World of Trust\n \n  \n  \n \n  #LI-DNI"
}