{
    "id": "c02036385076db1b",
    "companyDescription": "",
    "description": "As the Account Technology Strategist on the Federal Government team, you will support a few Federal government departments. You will be joining a dynamic and diverse team of Account Executives and Account Technology Strategists that are passionate about their roles and about making a real difference for Government and Citizens in Canada.\n \n \n   Microsoft’s Enterprise Team focuses on empowering customers on their digital journey, from envisioning new possibilities to delivering solutions that result in targeted business outcomes and a great customer experience and revenue growth for Microsoft.\n   As an Enterprise Account Technology Strategist, you will have the opportunity to drive digital technology transformation in partnership with your customer, to achieve both Microsoft and customer business outcomes.\n \n \n   Paired with an Account Executive, leveraging your large, multi-functional team across the breadth of the Microsoft product portfolio, engage at the most senior levels of your customer and bring industry-relevant solutions to help the customer adopt and embrace digital technologies.\n   \n \n \n   With a proven history of innovating technical solutions to achieve customers’ business transformation and achieving account growth targets, this role will give the opportunity to combine your technology and industry knowledge to deliver on digital solutions to accelerate your customer’s digital vision.\n \n \n \n   Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n \n  Responsibilities\n \n   Customer and Industry Insights\n \n \n   Synthesizes and combines various business and industry insights from their team, global best practices, proof points from experience/case studies with countries and/or regions, and deep industry expertise (e.g., level 200) related to customers and their competitors to conduct forecasting and develop recommendations for managing accounts and subsidiary planning. Ensures that all levels of the organization challenge customers to consider alternatives and adapt strategies, plans, business models, and solutions to insights. Orchestrates cross-regional teams to gather information, collaborate on performance markers, and identify potential risks in customer accounts. Oversees technical teams for driving opportunities with others, as necessary. Brings in business and industry insights to address the broader business challenges for the customer and deliver solutions.\n   Applies expertise (deep expertise across few accounts or broad expertise across many accounts) and thought leadership to identify and inform the development of the right Industry Sales Kits and industry partners within the customer's vertical industry. Articulates and understands specific industry-related market trends, as well as customer threats, opportunities, and barriers to growth as they relate to the customer's broader industry. Leverages industry trends from other industries to gather insights and develop an informed perspective on similar issues that may occur within their industry/industries. Applies industry knowledge to support customers in solving issues.\n \n \n   Trusted Advisor\n \n \n   Provides Account thought leadership inclusive of information technology (IT), business strategy knowledge, and technology landscape, and shares best practices internally while providing coaching to subsidiary resources. Leverages account thought leadership in partnership with account executives to set strategy, own accountability for outcomes, and lead extended teams. Provides technical guidance to internal teams to position technology while using customer landscape knowledge. Creates connections and feedback loops with Product and Engineering teams.\n   Creates security thought leadership with the customer's executives (e.g., technical decision maker [TDM]/business decision maker [BDM]) using the Microsoft Security and Zero Trust narratives and engages TDM and BDM stakeholders to position security as a business enabler and instill a security mindset in all aspects of the customer's technology landscape. Uses their understanding of the customers' technology and security needs to establish Microsoft’s security credentials and to build opportunities to improve the customer's security posture and orchestrates execution through security specialists.\n   Acts as the voice of the customer, industry, and internal advocate by providing insights, feedback, and challenges from the customer to internal teams (e.g., product groups, engineers) across all levels of the organization. Drives action to ensure that internal teams understand and respond to insights. Articulates the business opportunity for Microsoft based on product gaps.\n \n \n \n   Technology Strategy Formulation\n \n \n   Leads analysis of overall customer needs, outcomes, and blockers. Determines key stakeholders for driving execution on the largest and/or most complex accounts. Partners with global executives to lead overall strategy development to identify and address gaps and drive end-to-end solutions. Leads the adoption of technologies by plotting the long-term vision of the customer's business strategy and driving action to bring to fruition.\n   Creates mid- and long-term (e.g., 12 or more months) multi-horizon technology and business roadmaps for highly prominent, challenging, and/or strategic accounts based on a deep understanding of business and technology priorities and industry landscape. Challenges and validates the strategy and plan with customer stakeholders and drives envisioning and articulates business and program changes in the roadmaps around new and groundbreaking capabilities. Leads the translation of the customer's business objectives in conjunction with Industry Sales Kits and Solution Plays (including consumption-heavy workloads and cloud services) to develop an effective Industry Technology Architecture to plans for and drives consumption and adoption of Microsoft cloud and a higher share of customer potential and propensity (CPP).\n \n \n   Technology Sales: Demand Generation and Orchestration\n \n \n   Creates, develops, and drives opportunities based on industry best practices, presents opportunities to the customer, and creates demand. Develops a plan, within a broader strategy, to create and qualify a set number of opportunities for product sales, solutions sales, or consumption. Leverages partners and multiple channels (e.g., social media) to create demand. Orchestrates efforts to drive MCEM lifecycle and stage progression. Leverages experience and strategic foresight to lead technical teams by driving opportunities with Specialist Team Unit (STU), Customer Success Unit (CSU), and others, as necessary. Leads efforts to reach out to key stakeholders to give customer-driven pitches and drives the appropriate customer reach together with the account executive to generate new demand. Uses advanced technical knowledge of products to determine feasibility of technical customer requirements requests and works with core engineering teams to prepare solutions.\n   Leads Account Strategy Envisioning (ASE, formerly IDTA) with the extended account team, customer, and partner to deliver the outcomes for the customer through joint envisioning, as a vehicle for Industry Sales Kits and Solution Plays.\n \n \n \n   Differentiated Value Proposition\n \n \n   Acts as the customer's Technology Mentor in established relationships with a line-of-business leader or senior executive within a large-scale or high-impact customer organization senior leaders, including technical decision makers (TDMs) and/or Business Unit leaders at the C-level (e.g., HR, Risk, Finance leadership). Develops extended relationships beyond core customers, advises on solutions, and aligns Microsoft capabilities with customer needs. Drives market share (e.g., cloud, collaboration, AI). Leads customer business transformations through digital technologies for assigned accounts to drive business outcomes and create business value for customers by understanding customer industry and position to provide guidance and to challenge customer thinking with innovative ideas that showcase the need for change and new strategic direction, and proactively involves corporate and cross-industry resources to drive customer transformation. Ensures line-of-business wins are captured (e.g., customer write-ups) as reference for scale, and represents the face of the business during public relations events for significant business wins.\n   Partners with a line-of-business leader or senior executive within a large-scale or high-impact customer organization to articulate how complex Microsoft technology/services will meet future business needs better than the competition and will enable the achievement of long-term growth and success. Provides an outside-in view around existing and emerging compete or other solutions that are also a requirement for the customer.\n \n \n \n   Mapping and Account Planning\n \n \n   Helps customer technical specialists build the message to sell Microsoft offerings to other parts of their business or end users. Creates stakeholder maps for accounts, determines, and orchestrates a coverage plan, and builds out an execution framework across multiple Rooms of the House of the customer.\n   Orchestrates internal teams and local partners (inclusive of global systems integrators and consultancy partners) to ensure sufficient technical resources for demand generation, when appropriate.\n   Establishes best practices and standards around account planning for budgeting, quota attainment, consumption goals, and customer consumption gaps to inform quarterly and fiscal objectives. Coordinates highly complex extended account teams (e.g., spanning complex technologies, geographies, functions) and drives forecasting and tracking of the business. Owns the technical portion of the account plan and leads the customer plan delivery for large, critical, and/or strategic accounts. Captures all Account Planning input in MSX D365 Account Plan.\n \n \n \n   Education and Thought Leadership\n \n \n   Leads customer technology engagement by engaging and influencing technical resources of customer, partner, and Microsoft towards customer’s business transformation. Delivers regular (e.g., quarterly, monthly) industry/technology briefings to customer technology senior decision-makers technical teams.\n \n \n \n   Other\n \n \n   Embody our culture and values\n \n  Qualifications\n \n   Required/Minimum Qualifications :\n \n \n   Bachelor's Degree in Computer Science, Information Technology, Engineering, Business or related field AND 6+ years technical consulting, technical consultative selling, business consulting, practice building, or related technical/sales experience\n   \n     OR equivalent experience.\n   \n \n \n   Additional or Preferred Qualifications\n \n \n   Bachelor's Degree in Computer Science, Information Technology, Engineering, or related field AND 12+ years technical consulting, technical consultative selling, business consulting, practice building, or related technical/sales experience\n   \n     OR equivalent experience.\n   \n   6+ years experience in relevant customer industry.\n   6+ years experience in digital transformation, or using technology to drive customer business outcomes.\n \n  Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
    "preprocessed_description": "As the Account Technology Strategist on the Federal Government team, you will support a few Federal government departments. You will be joining a dynamic and diverse team of Account Executives and Account Technology Strategists that are passionate about their roles and about making a real difference for Government and Citizens in Canada. Microsoft's Enterprise Team focuses on empowering customers on their digital journey, from envisioning new possibilities to delivering solutions that result in targeted business outcomes and a great customer experience and revenue growth for Microsoft. As an Enterprise Account Technology Strategist, you will have the opportunity to drive digital technology transformation in partnership with your customer, to achieve both Microsoft and customer business outcomes. Paired with an Account Executive, leveraging your large, multi-functional team across the breadth of the Microsoft product portfolio, engage at the most senior levels of your customer and bring industry-relevant solutions to help the customer adopt and embrace digital technologies. With a proven history of innovating technical solutions to achieve customers' business transformation and achieving account growth targets, this role will give the opportunity to combine your technology and industry knowledge to deliver on digital solutions to accelerate your customer's digital vision. Microsoft's mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. Responsibilities Customer and Industry Insights Synthesizes and combines various business and industry insights from their team, global best practices, proof points from experience/case studies with countries and/or regions, and deep industry expertise (e.g., level 200) related to customers and their competitors to conduct forecasting and develop recommendations for managing accounts and subsidiary planning. Ensures that all levels of the organization challenge customers to consider alternatives and adapt strategies, plans, business models, and solutions to insights. Orchestrates cross-regional teams to gather information, collaborate on performance markers, and identify potential risks in customer accounts. Oversees technical teams for driving opportunities with others, as necessary. Brings in business and industry insights to address the broader business challenges for the customer and deliver solutions. Applies expertise (deep expertise across few accounts or broad expertise across many accounts) and thought leadership to identify and inform the development of the right Industry Sales Kits and industry partners within the customer's vertical industry. Articulates and understands specific industry-related market trends, as well as customer threats, opportunities, and barriers to growth as they relate to the customer's broader industry. Leverages industry trends from other industries to gather insights and develop an informed perspective on similar issues that may occur within their industry/industries. Applies industry knowledge to support customers in solving issues. Trusted Advisor Provides Account thought leadership inclusive of information technology (IT), business strategy knowledge, and technology landscape, and shares best practices internally while providing coaching to subsidiary resources. Leverages account thought leadership in partnership with account executives to set strategy, own accountability for outcomes, and lead extended teams. Provides technical guidance to internal teams to position technology while using customer landscape knowledge. Creates connections and feedback loops with Product and Engineering teams. Creates security thought leadership with the customer's executives (e.g., technical decision maker [TDM]/business decision maker [BDM]) using the Microsoft Security and Zero Trust narratives and engages TDM and BDM stakeholders to position security as a business enabler and instill a security mindset in all aspects of the customer's technology landscape. Uses their understanding of the customers' technology and security needs to establish Microsoft's security credentials and to build opportunities to improve the customer's security posture and orchestrates execution through security specialists. Acts as the voice of the customer, industry, and internal advocate by providing insights, feedback, and challenges from the customer to internal teams (e.g., product groups, engineers) across all levels of the organization. Drives action to ensure that internal teams understand and respond to insights. Articulates the business opportunity for Microsoft based on product gaps. Technology Strategy Formulation Leads analysis of overall customer needs, outcomes, and blockers. Determines key stakeholders for driving execution on the largest and/or most complex accounts. Partners with global executives to lead overall strategy development to identify and address gaps and drive end-to-end solutions. Leads the adoption of technologies by plotting the long-term vision of the customer's business strategy and driving action to bring to fruition. Creates midand long-term (e.g., 12 or more months) multi-horizon technology and business roadmaps for highly prominent, challenging, and/or strategic accounts based on a deep understanding of business and technology priorities and industry landscape. Challenges and validates the strategy and plan with customer stakeholders and drives envisioning and articulates business and program changes in the roadmaps around new and groundbreaking capabilities. Leads the translation of the customer's business objectives in conjunction with Industry Sales Kits and Solution Plays (including consumption-heavy workloads and cloud services) to develop an effective Industry Technology Architecture to plans for and drives consumption and adoption of Microsoft cloud and a higher share of customer potential and propensity (CPP). Technology Sales: Demand Generation and Orchestration Creates, develops, and drives opportunities based on industry best practices, presents opportunities to the customer, and creates demand. Develops a plan, within a broader strategy, to create and qualify a set number of opportunities for product sales, solutions sales, or consumption. Leverages partners and multiple channels (e.g., social media) to create demand. Orchestrates efforts to drive MCEM lifecycle and stage progression. Leverages experience and strategic foresight to lead technical teams by driving opportunities with Specialist Team Unit (STU), Customer Success Unit (CSU), and others, as necessary. Leads efforts to reach out to key stakeholders to give customer-driven pitches and drives the appropriate customer reach together with the account executive to generate new demand. Uses advanced technical knowledge of products to determine feasibility of technical customer requirements requests and works with core engineering teams to prepare solutions. Leads Account Strategy Envisioning (ASE, formerly IDTA) with the extended account team, customer, and partner to deliver the outcomes for the customer through joint envisioning, as a vehicle for Industry Sales Kits and Solution Plays. Differentiated Value Proposition Acts as the customer's Technology Mentor in established relationships with a line-of-business leader or senior executive within a large-scale or high-impact customer organization senior leaders, including technical decision makers (TDMs) and/or Business Unit leaders at the C-level (e.g., Human Resources, Risk, Finance leadership). Develops extended relationships beyond core customers, advises on solutions, and aligns Microsoft capabilities with customer needs. Drives market share (e.g., cloud, collaboration, Artificial Intelligence). Leads customer business transformations through digital technologies for assigned accounts to drive business outcomes and create business value for customers by understanding customer industry and position to provide guidance and to challenge customer thinking with innovative ideas that showcase the need for change and new strategic direction, and proactively involves corporate and cross-industry resources to drive customer transformation. Ensures line-of-business wins are captured (e.g., customer write-ups) as reference for scale, and represents the face of the business during public relations events for significant business wins. Partners with a line-of-business leader or senior executive within a large-scale or high-impact customer organization to articulate how complex Microsoft technology/services will meet future business needs better than the competition and will enable the achievement of long-term growth and success. Provides an outside-in view around existing and emerging compete or other solutions that are also a requirement for the customer. Mapping and Account Planning Helps customer technical specialists build the message to sell Microsoft offerings to other parts of their business or end users. Creates stakeholder maps for accounts, determines, and orchestrates a coverage plan, and builds out an execution framework across multiple Rooms of the House of the customer. Orchestrates internal teams and local partners (inclusive of global systems integrators and consultancy partners) to ensure sufficient technical resources for demand generation, when appropriate. Establishes best practices and standards around account planning for budgeting, quota attainment, consumption goals, and customer consumption gaps to inform quarterly and fiscal objectives. Coordinates highly complex extended account teams (e.g., spanning complex technologies, geographies, functions) and drives forecasting and tracking of the business. Owns the technical portion of the account plan and leads the customer plan delivery for large, critical, and/or strategic accounts. Captures all Account Planning input in MSX D365 Account Plan. Education and Thought Leadership Leads customer technology engagement by engaging and influencing technical resources of customer, partner, and Microsoft towards customer's business transformation. Delivers regular (e.g., quarterly, monthly) industry/technology briefings to customer technology senior decision-makers technical teams. Other Embody our culture and values Qualifications Required/Minimum Qualifications : Bachelor's Degree in Computer Science, Information Technology, Engineering, Business or related field AND 6+ years technical consulting, technical consultative selling, business consulting, practice building, or related technical/sales experience OR equivalent experience. Additional or Preferred Qualifications Bachelor's Degree in Computer Science, Information Technology, Engineering, or related field AND 12+ years technical consulting, technical consultative selling, business consulting, practice building, or related technical/sales experience OR equivalent experience. 6+ years experience in relevant customer industry. 6+ years experience in digital transformation, or using technology to drive customer business outcomes. Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
    "processed_description": "Federal Government team support federal government department . join dynamic diverse team passionate role real difference . focus empower customer digital journey envision possibility deliver solution result target business outcome great customer revenue growth . drive digital technology transformation partnership customer achieve customer business outcome . pair leverage large multi functional team breadth Microsoft product portfolio engage senior level customer bring industry relevant solution help customer adopt embrace digital technology . prove history innovate technical solution achieve customer' business transformation achieve account growth target role combine technology industry knowledge deliver digital solution accelerate customer's digital vision . Microsoft's mission empower person organization planet achieve . employee growth mindset innovate empower collaborate realize share goal . build respect integrity accountability create culture inclusion thrive . responsibility Customer Industry Insights Synthesizes combine business industry insight team global good practice proof point case study country region deep industry expertise e.g. level relate customer competitor conduct forecasting develop recommendation manage account subsidiary planning . ensure level organization challenge customer consider alternative adapt strategy plan business model solution insight . cross regional team gather information collaborate performance marker identify potential risk customer account . Oversees technical team drive . bring business industry insight address broad business challenge customer deliver solution . applie expertise deep expertise account broad expertise account leadership identify inform development Industry Sales Kits industry partner customer's vertical industry . understand specific industry relate market trend customer threat barrier growth relate customer's broad industry . leverage industry trend industry gather insight develop inform perspective issue occur industry industry . applie industry knowledge support customer solve issue . Trusted Advisor Account leadership inclusive information technology business strategy knowledge technology landscape share good practice internally provide coaching subsidiary resource . leverage account thought leadership partnership account executive set strategy accountability outcome lead extended team . provide technical guidance internal team position technology customer landscape knowledge . create connection feedback loop Product Engineering team . create security thought leadership customer's executive e.g. technical decision maker decision maker bdm Microsoft Security Zero Trust narrative engage TDM stakeholder position security business enabler instill security mindset aspect customer's technology landscape . understanding customer' technology security establish Microsoft's security credential build improve customer's security posture orchestrate execution security specialist . voice customer industry internal advocate provide insight feedback challenge customer internal team e.g. product group engineer level organization . drive action ensure internal team understand respond insight . business base product gap . Technology Strategy Formulation lead analysis customer outcome blocker . determine key stakeholder drive execution large complex account . partner global executive lead strategy development identify address gap drive solution . lead adoption technology plot long term vision customer's business strategy drive action bring fruition . create multi horizon technology business roadmap highly prominent challenging strategic account base deep understanding business technology priority industry landscape . challenge validate strategy plan customer stakeholder drive envision articulate business program change roadmap groundbreaking capability . lead translation customer's business objective conjunction Industry Sales Kits Solution play include consumption heavy workload cloud service develop plan drive consumption adoption Microsoft cloud high share customer potential propensity . technology sale demand Generation orchestration Creates develop drive base industry good practice customer create demand . develop plan broad strategy create qualify set number product sale solution sale consumption . leverage partner multiple channel e.g. social medium create demand . effort drive mcem lifecycle stage progression . leverage strategic foresight lead technical team drive . lead effort reach key stakeholder customer drive pitch drive appropriate customer reach account executive generate demand . advanced technical knowledge product determine feasibility technical customer requirement request core engineering team prepare solution . Leads Account Strategy Envisioning ASE extended account team customer partner deliver outcome customer joint envisioning vehicle Industry Sales Kits Solution Plays . differentiated Proposition establish relationship business leader senior executive large scale high impact customer organization senior leader include technical decision maker TDMs Business Unit leader level e.g. Human Resources risk Finance leadership . develop extended relationship core customer advise solution align Microsoft capability customer . drive market share e.g. cloud collaboration . lead customer business transformation digital technology assign account drive business outcome create business customer understand customer industry position provide guidance challenge customer innovative idea showcase change strategic direction proactively involve corporate cross industry resource drive customer transformation . ensure business win capture e.g. customer write reference scale represent face business public relation event business win . partner business leader senior executive large scale high impact customer organization articulate complex Microsoft technology service meet future business competition enable achievement long term growth success . provide view exist emerge compete solution requirement customer . mapping Account Planning help customer technical specialist build message sell Microsoft offering business user . create stakeholder map account determine orchestrate coverage plan build execution framework multiple Rooms customer . internal team local partner inclusive global system integrator consultancy partner ensure sufficient technical resource demand generation appropriate . establishe good practice standard account planning budgeting quota attainment consumption goal customer consumption gap inform quarterly fiscal objective . coordinate highly complex extended account team e.g. span complex technology geography function drive forecasting tracking business . owns technical portion account plan lead customer plan delivery large critical strategic account . capture Account Planning input D365 Account Plan . education Thought Leadership lead customer technology engagement engage influence technical resource customer partner customer's business transformation . deliver regular e.g. quarterly monthly industry technology briefing customer technology senior decision maker technical team . embody culture Qualifications require Minimum Qualifications Bachelor's Degree Computer Science Information Technology Engineering Business field + technical consulting technical consultative selling business consulting practice building relate technical sale equivalent . additional Preferred Qualifications Bachelor's Degree Computer Science Information Technology Engineering field + technical consulting technical consultative selling business consulting practice building relate technical sale equivalent . + relevant customer industry . + digital transformation technology drive customer business outcome . equal employer . consistent applicable law qualified applicant receive consideration employment regard age ancestry citizenship color family medical care leave gender identity expression genetic information immigration status marital status medical condition national origin physical mental political affiliation protect veteran military status race ethnicity religion sex include pregnancy sexual orientation characteristic protect applicable local law regulation ordinance . assistance reasonable accommodation application process read request accommodation .",
    "results_group": {
        "extracted_noun_chunks": [
            "customer's digital vision",
            "relationship business leader senior executive large scale high impact customer organization senior leader",
            "orchestrate coverage plan",
            "technical decision maker",
            "strategic foresight",
            "technical consulting technical consultative selling business consulting practice building",
            "Microsoft cloud high share customer potential propensity",
            "Minimum Qualifications Bachelor's Degree Computer Science Information Technology Engineering Business field",
            "employee growth mindset",
            "Proposition",
            "issue",
            "deep industry expertise e.g. level",
            "plan drive consumption adoption",
            "e.g. cloud collaboration",
            "lead effort",
            "plan",
            "Microsoft Security Zero Trust narrative",
            "good practice customer",
            "Account Strategy",
            "adoption technology plot long term vision customer's business strategy drive action",
            "customer competitor",
            "senior level customer",
            "digital technology transformation partnership customer",
            "culture Qualifications",
            "connection feedback loop Product Engineering team",
            "consideration employment regard age ancestry citizenship color family medical care",
            "industry industry",
            "business industry insight",
            "address gap drive solution",
            "deep expertise",
            "history",
            "Account Plan",
            "federal government department",
            "action",
            "execution framework",
            "education Thought Leadership",
            "Microsoft's mission empower person organization planet",
            "customer",
            "strategy plan business model solution insight",
            "respect integrity accountability",
            "customer' business transformation",
            "Microsoft",
            "digital transformation technology",
            "great customer revenue growth",
            "establishe good practice standard account planning budgeting quota attainment consumption goal customer consumption gap",
            "Microsoft capability customer",
            "broad business challenge customer",
            "+ relevant customer industry",
            "request accommodation",
            "good practice",
            "stakeholder map account",
            "e.g. Human Resources risk Finance leadership",
            "passionate role real difference",
            "feasibility technical customer requirement request core engineering team",
            "subsidiary resource",
            "additional Preferred Qualifications Bachelor's Degree Computer Science Information Technology Engineering field",
            "envision",
            "leverage partner multiple channel",
            "Account Planning input",
            "internal team local partner inclusive global system integrator consultancy partner",
            "insight feedback challenge customer internal team",
            "account growth target role",
            "Technology Strategy Formulation",
            "market share",
            "address",
            "applie expertise",
            "lead",
            "Microsoft's security credential build",
            "advanced technical knowledge product",
            "technical guidance internal team position technology customer landscape knowledge",
            "compete solution requirement customer",
            "regular e.g. quarterly monthly industry technology briefing customer technology senior decision maker technical team",
            "Industry Sales Kits industry partner customer's vertical industry",
            "TDM stakeholder",
            "solution",
            "corporate cross industry resource drive customer transformation",
            "responsibility",
            "customer plan delivery large critical strategic account",
            "execution",
            "partner business leader senior executive large scale high impact customer organization",
            "leverage industry trend industry",
            "account executive",
            "partner global executive lead strategy development",
            "demand",
            "Federal Government team",
            "pregnancy sexual orientation",
            "technical solution",
            "level organization challenge customer",
            "market trend customer threat barrier growth",
            "orchestrate execution security specialist",
            "customer technology engagement",
            "influence technical resource customer partner customer's business transformation",
            "customer digital journey envision possibility",
            "reference scale",
            "assistance reasonable accommodation application process",
            "internal team",
            "specific industry",
            "e.g. span complex technology geography function drive forecasting tracking business",
            "challenge",
            "drive base industry",
            "share goal",
            "culture inclusion",
            "view",
            "customer technical specialist",
            "customer's security posture",
            "face business public relation event business win",
            "business win capture",
            "strategic direction",
            "applie industry knowledge support customer",
            "appropriate customer",
            "customer's broad industry",
            "achievement long term growth success",
            "industry",
            "security thought leadership customer's executive e.g. technical decision maker decision maker",
            "business customer",
            "technical sale equivalent",
            "customer' technology security",
            "potential risk customer account",
            "technical portion account plan",
            "veteran military status race ethnicity religion sex",
            "ASE",
            "relevant solution",
            "business user",
            "key stakeholder customer drive pitch",
            "guidance challenge customer innovative idea",
            "analysis customer outcome blocker",
            "strategy plan customer stakeholder",
            "multiple Rooms customer",
            "extended team",
            "information",
            "business industry insight team global good practice proof point case study country region",
            "recommendation manage account subsidiary planning",
            "account drive business outcome",
            "future business competition",
            "large multi functional team breadth Microsoft product portfolio",
            "consistent applicable law qualified applicant",
            "dynamic diverse team",
            "key stakeholder",
            "multi horizon technology business roadmap highly prominent challenging strategic account base deep understanding business technology priority industry landscape",
            "cross regional team",
            "conjunction",
            "digital solution",
            "applicable local law regulation ordinance",
            "solution result target business outcome",
            "perspective issue",
            "qualify set number product sale solution sale consumption",
            "highly complex extended account team",
            "message",
            "extended relationship core customer",
            "business base product gap",
            "development",
            "large complex account",
            "customer industry position",
            "customer business transformation digital technology",
            "equal employer",
            "security business enabler instill security mindset aspect customer's technology landscape",
            "technology industry knowledge",
            "Oversees technical team",
            "Customer Industry Insights Synthesizes",
            "voice customer industry internal advocate",
            "Trusted Advisor Account leadership inclusive information technology business strategy knowledge technology landscape",
            "consumption heavy workload cloud service",
            "Account Planning",
            "broad strategy",
            "effort drive mcem lifecycle stage progression",
            "articulate business program change roadmap groundbreaking capability",
            "e.g. social medium create demand",
            "quarterly fiscal objective",
            "fruition",
            "customer business outcome",
            "complex Microsoft technology service",
            "leverage account thought leadership partnership account executive set strategy accountability outcome",
            "digital technology",
            "e.g. product group engineer level organization",
            "insight",
            "broad expertise account leadership"
        ],
        "combined_lemmatized_tokens": "Federal Government team support federal government department . join dynamic diverse team passionate role real difference . focus empower customer digital journey envision possibility deliver solution result target business outcome great customer revenue growth . drive digital technology transformation partnership customer achieve customer business outcome . pair leverage large multi functional team breadth Microsoft product portfolio engage senior level customer bring industry relevant solution help customer adopt embrace digital technology . prove history innovate technical solution achieve customer' business transformation achieve account growth target role combine technology industry knowledge deliver digital solution accelerate customer's digital vision . Microsoft's mission empower person organization planet achieve . employee growth mindset innovate empower collaborate realize share goal . build respect integrity accountability create culture inclusion thrive . responsibility Customer Industry Insights Synthesizes combine business industry insight team global good practice proof point case study country region deep industry expertise e.g. level relate customer competitor conduct forecasting develop recommendation manage account subsidiary planning . ensure level organization challenge customer consider alternative adapt strategy plan business model solution insight . cross regional team gather information collaborate performance marker identify potential risk customer account . Oversees technical team drive . bring business industry insight address broad business challenge customer deliver solution . applie expertise deep expertise account broad expertise account leadership identify inform development Industry Sales Kits industry partner customer's vertical industry . understand specific industry relate market trend customer threat barrier growth relate customer's broad industry . leverage industry trend industry gather insight develop inform perspective issue occur industry industry . applie industry knowledge support customer solve issue . Trusted Advisor Account leadership inclusive information technology business strategy knowledge technology landscape share good practice internally provide coaching subsidiary resource . leverage account thought leadership partnership account executive set strategy accountability outcome lead extended team . provide technical guidance internal team position technology customer landscape knowledge . create connection feedback loop Product Engineering team . create security thought leadership customer's executive e.g. technical decision maker decision maker bdm Microsoft Security Zero Trust narrative engage TDM stakeholder position security business enabler instill security mindset aspect customer's technology landscape . understanding customer' technology security establish Microsoft's security credential build improve customer's security posture orchestrate execution security specialist . voice customer industry internal advocate provide insight feedback challenge customer internal team e.g. product group engineer level organization . drive action ensure internal team understand respond insight . business base product gap . Technology Strategy Formulation lead analysis customer outcome blocker . determine key stakeholder drive execution large complex account . partner global executive lead strategy development identify address gap drive solution . lead adoption technology plot long term vision customer's business strategy drive action bring fruition . create multi horizon technology business roadmap highly prominent challenging strategic account base deep understanding business technology priority industry landscape . challenge validate strategy plan customer stakeholder drive envision articulate business program change roadmap groundbreaking capability . lead translation customer's business objective conjunction Industry Sales Kits Solution play include consumption heavy workload cloud service develop plan drive consumption adoption Microsoft cloud high share customer potential propensity . technology sale demand Generation orchestration Creates develop drive base industry good practice customer create demand . develop plan broad strategy create qualify set number product sale solution sale consumption . leverage partner multiple channel e.g. social medium create demand . effort drive mcem lifecycle stage progression . leverage strategic foresight lead technical team drive . lead effort reach key stakeholder customer drive pitch drive appropriate customer reach account executive generate demand . advanced technical knowledge product determine feasibility technical customer requirement request core engineering team prepare solution . Leads Account Strategy Envisioning ASE extended account team customer partner deliver outcome customer joint envisioning vehicle Industry Sales Kits Solution Plays . differentiated Proposition establish relationship business leader senior executive large scale high impact customer organization senior leader include technical decision maker TDMs Business Unit leader level e.g. Human Resources risk Finance leadership . develop extended relationship core customer advise solution align Microsoft capability customer . drive market share e.g. cloud collaboration . lead customer business transformation digital technology assign account drive business outcome create business customer understand customer industry position provide guidance challenge customer innovative idea showcase change strategic direction proactively involve corporate cross industry resource drive customer transformation . ensure business win capture e.g. customer write reference scale represent face business public relation event business win . partner business leader senior executive large scale high impact customer organization articulate complex Microsoft technology service meet future business competition enable achievement long term growth success . provide view exist emerge compete solution requirement customer . mapping Account Planning help customer technical specialist build message sell Microsoft offering business user . create stakeholder map account determine orchestrate coverage plan build execution framework multiple Rooms customer . internal team local partner inclusive global system integrator consultancy partner ensure sufficient technical resource demand generation appropriate . establishe good practice standard account planning budgeting quota attainment consumption goal customer consumption gap inform quarterly fiscal objective . coordinate highly complex extended account team e.g. span complex technology geography function drive forecasting tracking business . owns technical portion account plan lead customer plan delivery large critical strategic account . capture Account Planning input D365 Account Plan . education Thought Leadership lead customer technology engagement engage influence technical resource customer partner customer's business transformation . deliver regular e.g. quarterly monthly industry technology briefing customer technology senior decision maker technical team . embody culture Qualifications require Minimum Qualifications Bachelor's Degree Computer Science Information Technology Engineering Business field + technical consulting technical consultative selling business consulting practice building relate technical sale equivalent . additional Preferred Qualifications Bachelor's Degree Computer Science Information Technology Engineering field + technical consulting technical consultative selling business consulting practice building relate technical sale equivalent . + relevant customer industry . + digital transformation technology drive customer business outcome . equal employer . consistent applicable law qualified applicant receive consideration employment regard age ancestry citizenship color family medical care leave gender identity expression genetic information immigration status marital status medical condition national origin physical mental political affiliation protect veteran military status race ethnicity religion sex include pregnancy sexual orientation characteristic protect applicable local law regulation ordinance . assistance reasonable accommodation application process read request accommodation ."
    }
}