{
    "id": "b2abb992810d7bf3",
    "companyDescription": "",
    "description": "If you love a fast-paced, action-packed shift and are looking for more variety during your day, then Alta Vista Animal Hospital, ER is the place for you!\nWe offer 24-hour emergency and critical care services in our state-of-the-art facility. As a member of the ER team, you will work alongside specialized technicians and Veterinarians.\nSchedule: Hours of work vary from 8 to 12 hours in length, including days, evenings, weekends and overnights. This position reports directly to the Technical Resource Manager - Emergency\nThe skills that you will be utilizing include, but are not limited to:\n\n Venipuncture\n Catheter placement\n Radiology\n Anesthesia monitoring\n Physical examinations and patient assessment\n Surgical preparation and assisting\n Dentistry\n Laboratory work\n Pharmacy\n Patient recovery\n Compassionate care for our hospitalized patients\n\nWhat VCA Canada Offers\nJoin our team and you will make a huge difference in the lives of pets and their families! With an extensive network of hospitals across Canada, each location offers a diverse experience, a local community feel, and a caring culture you can thrive in: We have the right fit for you!\n\n RRSP Employer Group Match Program! Saving for your future just got easier with VCA Canada\n VCA Canada RRSP Student Loan Program – Ask us more!\n Medical Library; 2000+ journals, 600+ textbooks, research, and more at your fingertips!\n Ask us about our mobilization and hands-free radiology!\n Paid membership and dues\n Paid wellness days, sick days, and vacation time\n Employee assistance program\n Continuing education benefits; paid to learn!\n Exceptional career development: there is room to grow here!\n Referral Bonus Rewards!\n E-tools to assist with meditation, better sleep, exercise, and focus\n Virtual health care (telemedicine) offering quick access to quality care\n A caring culture of Wellness and Appreciation!\n Access to amazing mini-courses\n Opportunities to give back to your community through VCA initiatives\n Annual uniform allowance\n Generous personal pet care discounts\n And extra perks like shopping discounts and cool wellness apps!\n\nEmail: careers.canada@vca.com for further information or click Apply Now!\nJob Type: Full-time\nBenefits:\n\n Casual dress\n Employee assistance program\n Extended health care\n Flexible schedule\n Life insurance\n On-site gym\n On-site parking\n Paid time off\n RRSP match\n Vision care\n Wellness program\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n Monday to Friday\n Weekends as needed\n\nWork Location: In person",
    "preprocessed_description": "If you love a fast-paced, action-packed shift and are looking for more variety during your day, then Alta Vista Animal Hospital, ER is the place for you! We offer 24-hour emergency and critical care services in our state-of-the-art facility. As a member of the ER team, you will work alongside specialized technicians and Veterinarians. Schedule: Hours of work vary from 8 to 12 hours in length, including days, evenings, weekends and overnights. This position reports directly to the Technical Resource Manager - Emergency The skills that you will be utilizing include, but are not limited to: Venipuncture Catheter placement Radiology Anesthesia monitoring Physical examinations and patient assessment Surgical preparation and assisting Dentistry Laboratory work Pharmacy Patient recovery Compassionate care for our hospitalized patients What VCA Canada Offers Join our team and you will make a huge difference in the lives of pets and their families! With an extensive network of hospitals across Canada, each location offers a diverse experience, a local community feel, and a caring culture you can thrive in: We have the right fit for you! RRSP Employer Group Match Program! Saving for your future just got easier with VCA Canada VCA Canada RRSP Student Loan Program – Ask us more! Medical Library; 2000+ journals, 600+ textbooks, research, and more at your fingertips! Ask us about our mobilization and hands-free radiology! Paid membership and dues Paid wellness days, sick days, and vacation time Employee assistance program Continuing education benefits; paid to learn! Exceptional career development: there is room to grow here! Referral Bonus Rewards! E-tools to assist with meditation, better sleep, exercise, and focus Virtual health care (telemedicine) offering quick access to quality care A caring culture of Wellness and Appreciation! Access to amazing mini-courses Opportunities to give back to your community through VCA initiatives Annual uniform allowance Generous personal pet care discounts And extra perks like shopping discounts and cool wellness apps! Email: careers.canada@vca.com for further information or click Apply Now! Job Type: Full-time Benefits: Casual dress Employee assistance program Extended health care Flexible schedule Life insurance On-site gym On-site parking Paid time off RRSP match Vision care Wellness program Flexible Language Requirement: French not required Schedule: Monday to Friday Weekends as needed Work Location: In person",
    "processed_description": "love fast pace action pack shift variety place offer hour emergency critical care service state art facility . ER team alongside specialized technician veterinarian . schedule vary length include evening weekend overnight . position report directly skill utilize include limit Venipuncture Catheter placement Radiology anesthesia monitor physical examination patient assessment surgical preparation assist Dentistry Laboratory Pharmacy Patient recovery compassionate care hospitalize patient team huge difference life pet family extensive network hospital location offer diverse local community feel care culture thrive fit save future easy – + journal + textbook research fingertip mobilization hand free radiology paid membership paid wellness sick vacation employee assistance program continue education benefit pay learn exceptional career development room grow referral bonus Rewards tool assist meditation sleep exercise focus virtual health care telemedicine offer quick access quality care care culture access amazing mini courses community VCA initiative annual uniform allowance generous personal pet care discount extra perk shopping discount cool wellness app email information click apply type benefit casual dress employee assistance program extended health care flexible schedule life insurance site gym site parking Paid require Schedule location person",
    "results_group": {
        "extracted_noun_chunks": [
            "Venipuncture Catheter placement Radiology anesthesia",
            "virtual health care",
            "journal + textbook research fingertip mobilization hand free radiology",
            "referral bonus Rewards tool",
            "evening weekend",
            "physical examination patient assessment surgical preparation",
            "fast pace action pack shift variety place",
            "hour emergency critical care service state art facility",
            "quick access quality care care culture access",
            "position report",
            "health care flexible schedule life insurance site gym site parking Paid",
            "Dentistry Laboratory Pharmacy Patient recovery compassionate care hospitalize patient team huge difference life pet family extensive network hospital location",
            "education benefit pay",
            "schedule",
            "apply type benefit casual dress employee assistance program",
            "telemedicine",
            "exceptional career development room",
            "specialized technician veterinarian",
            "diverse local community",
            "Schedule location person",
            "wellness sick vacation employee assistance program",
            "meditation sleep exercise",
            "care culture",
            "membership",
            "ER team"
        ],
        "combined_lemmatized_tokens": "love fast pace action pack shift variety place offer hour emergency critical care service state art facility . ER team alongside specialized technician veterinarian . schedule vary length include evening weekend overnight . position report directly skill utilize include limit Venipuncture Catheter placement Radiology anesthesia monitor physical examination patient assessment surgical preparation assist Dentistry Laboratory Pharmacy Patient recovery compassionate care hospitalize patient team huge difference life pet family extensive network hospital location offer diverse local community feel care culture thrive fit save future easy – + journal + textbook research fingertip mobilization hand free radiology paid membership paid wellness sick vacation employee assistance program continue education benefit pay learn exceptional career development room grow referral bonus Rewards tool assist meditation sleep exercise focus virtual health care telemedicine offer quick access quality care care culture access amazing mini courses community VCA initiative annual uniform allowance generous personal pet care discount extra perk shopping discount cool wellness app email information click apply type benefit casual dress employee assistance program extended health care flexible schedule life insurance site gym site parking Paid require Schedule location person"
    }
}