{
    "id": "fcf8fbe2253867b5",
    "companyDescription": "",
    "description": "Great Minds. One Goal. Canada's Success.\n     \n     \n    Help bring research to life and drive your career forward with the National Research Council of Canada (NRC), Canada's largest research and technology organization.\n     \n     \n    We are looking for a Technical Officer, Instrumentation Support to support the Ocean, Coastal and River Engineering (OCRE) Research Centre. The selected candidate would be someone who shares our core values Integrity, Excellence, Respect and Creativity.\n     \n     Do you want to be part of a team working to find solutions to protect infrastructure, property and people from severe weather events and other environmental risks while also meeting the challenges of climate change?\n     \n     At OCRE, the researchers are using physical modelling techniques to find real world solutions to ongoing challenges present in the natural world. The primary purpose of the position is to provide electronic technical support services in installing, maintaining, troubleshooting and calibrating laboratory instrumentation of various physical model experiments. The incumbent should be able to design, build electronic equipment and install and maintain data acquisition equipment in support of the laboratory physical model experiments. Upon completion of the experimental setup the employee ensures the continuous operation of the instrumentation throughout the project. The employee may be asked to coordinate or assist with the production of technical reports and users’ manuals. The incumbent will also be involved in the regular maintenance, upgrade and development of OCRE’s testing facilities instrumentation.\n     \n     NRC’s main campus on Montreal Road offers free parking and easy access for runners, walkers and in-line skaters to break away during the day and enjoy the beautiful surroundings. Most buildings have shower and locker facilities, in addition to an on-campus Fitness Centre. There are also areas for soccer, volleyball and even beach volleyball during the summer! There are ample picnic areas and easy access to a shopping centre, grocery store and pharmacy, as well as numerous restaurants. \n   \n  \n  \n   \n     Screening Criteria \n   \n   \n     Applicants must demonstrate within the content of their application that they meet the following screening criteria in order to be given further consideration as candidates: \n   \n  \n  \n   \n     Education \n   \n   \n     Completion of post-secondary education in an electronic engineering/technology program or other technical, engineering or scientific discipline related to the position, or equivalent combination of work-related experience, training and education.\n     \n     \n    For information on certificates and diplomas issued abroad, please see Degree equivalency \n   \n  \n  \n   \n     Experience \n   \n   \n    \n     Recent experience in providing electronic technical expertise by installing, maintaining, troubleshooting, and calibrating laboratory instrumentation; \n     Experience in installing and maintaining data acquisition equipment for support of laboratory physical model studies; \n     Experience in providing programming assistance for ongoing laboratory real-time software development including programming and interfacing data acquisition hardware and control systems. \n     Experience in using computers to analyze data, and present test results. \n     Experience in working in a multidisciplinary team environment. \n     Experience operating machinery such as skid steers and/or forklift would be an asset. \n    \n   \n  \n  \n   \n    Condition of Employment \n   \n   \n     Secret (II) \n   \n  \n  \n   \n     Language Requirements \n   \n   \n     English\n     \n     \n    Information on language requirements and self-assessment tests \n   \n  \n  \n   \n     Assessment Criteria \n   \n   \n     Candidates will be assessed on the basis of the following criteria: \n   \n  \n  \n   \n     Technical Competencies \n   \n   \n    \n     Ability to work independently, and with others, under the general guidance of project engineers to meet objectives and deadlines \n     Ability to use computers and research laboratory instrumentation devices and their application, set-up, calibration, and use for control of facilities and equipment, for data acquisition, analysis and processing. \n     Ability in the application, use, and interpretation of results from instruments and gauges for measuring wave heights, flows, displacements, accelerations, and other physical quantities. \n     Knowledge of preparation of calibration reports and operational procedures \n     Ability to apply reading and interpretation skills to review technical drawings, instructions and specifications. \n     Knowledge of Occupational Health & Safety regulations and legislation required to create and maintain a safe and healthy environment. \n     Ability to work with CAD software (AutoCAD, Solid Works) considered an asset. \n    \n   \n  \n  \n   \n    Behavioural Competencies \n   \n   \n    Technology support - Communication (Level 2) \n    Technology support - Conceptual and analytical ability (Level 2) \n    Technology support - Results orientation (Level 2) \n    Technology support - Self-knowing and self-development (Level 2) \n    Technology support - Teamwork (Level 2) \n   \n  \n  \n   \n    Competency Profile(s) \n   \n   \n     For this position, the NRC will evaluate candidates using the following competency profile: Technology Support\n     \n     \n   \n  \n  \n   \n     Compensation \n   \n   \n     Salary under review.\n     \n     \n    From $58,445 to $80,040 per annum.\n     \n     \n    NRC employees enjoy a wide-range of competitive benefits including comprehensive health and dental plans, vacation, sick, and other leave entitlements, disability insurance and pension plans. \n   \n  \n  \n   \n     The NRC Advantage \n   \n   \n     The National Research Council of Canada (NRC) is the Government of Canada's largest research organization supporting industrial innovation, the advancement of knowledge and technology development. We collaborate with over 70 colleges, universities and hospitals annually, work with 800 companies on their projects, and provide advice or funding to over 8000 Small and Medium-sized Enterprises (SMEs) each year.\n     \n     \n    We bring together the brightest minds to deliver tangible impacts on the lives of Canadians and people around the world. And now, we want to partner with you. Let your expertise and inspirations make an impact by joining the NRC.\n     \n     \n    At the NRC Employee wellness matters. We offer flexible work schedules as well as part-time work to help employees maintain work-life balance. We are one of the few federal organizations that close our offices during the December holiday season. We offer professional learning and development opportunities such as conferences, workshops, and a suite of mentorship, award and recognition programs. Diversity enables creativity and innovation. Fostering a diverse, inclusive, welcoming and supportive workplace is important to us, and contributes to a more inclusive Canadian innovation system. We welcome all qualified applicants and encourage you to complete the employment equity self-declaration questions during the job application process. Please let us know of any accommodation measures required to help you to be assessed in a fair and equitable manner. Please note that the information you provide will be treated confidentially.\n     \n     \n    Help us solve problems for Canada. Grow your career with us today! \n   \n  \n  \n   \n     Notes \n   \n   \n    \n     Relocation assistance will be determined in accordance with the NRC's directives. \n     Overtime will sometimes be required. \n     Work typically requires daily intermittent periods of standing, walking and sitting at a work bench; working in awkward positions; bending and stretching; moving lightweight objects and large, awkward and heavier objects on occasion; operating hand and power tools and forklifts; climbing stairs and ladders on occasion. \n     Work is typically performed in a laboratory, plant or shop environment that includes daily exposure to background noise from tools and equipment, and regular exposure to chemicals, dirt, noise, noxious odors, hazardous equipment and substances, extreme temperatures or other awkward conditions. Work can be performed indoors and outdoors, extreme weather conditions, and working on uneven terrain and from heights. \n     A pre-qualified list may be established for similar positions for a one year period. \n     Preference will be given to Canadian Citizens and Permanent Residents of Canada. Please include citizenship information in your application. \n     The incumbent must adhere to safe workplace practices at all times. \n     We thank all those who apply, however only those selected for further consideration will be contacted.\n    \n   \n  \n \n  \n  \n Please direct your questions, with the requisition number (19859) to: \n E-mail: NRC.NRCHiring-EmbaucheCNRC.CNRC@nrc-cnrc.gc.ca \n Telephone: 343-550-0290 \n Closing Date: 19 January 2024 - 23:59 Eastern Time",
    "preprocessed_description": "Great Minds. One Goal. Canada's Success. Help bring research to life and drive your career forward with the National Research Council of Canada (National Research Council Canada), Canada's largest research and technology organization. We are looking for a Technical Officer, Instrumentation Support to support the Ocean, Coastal and River Engineering (OCRE) Research Centre. The selected candidate would be someone who shares our core values Integrity, Excellence, Respect and Creativity. Do you want to be part of a team working to find solutions to protect infrastructure, property and people from severe weather events and other environmental risks while also meeting the challenges of climate change? At OCRE, the researchers are using physical modelling techniques to find real world solutions to ongoing challenges present in the natural world. The primary purpose of the position is to provide electronic technical support services in installing, maintaining, troubleshooting and calibrating laboratory instrumentation of various physical model experiments. The incumbent should be able to design, build electronic equipment and install and maintain data acquisition equipment in support of the laboratory physical model experiments. Upon completion of the experimental setup the employee ensures the continuous operation of the instrumentation throughout the project. The employee may be asked to coordinate or assist with the production of technical reports and users' manuals. The incumbent will also be involved in the regular maintenance, upgrade and development of OCRE's testing facilities instrumentation. National Research Council Canada's main campus on Montreal Road offers free parking and easy access for runners, walkers and in-line skaters to break away during the day and enjoy the beautiful surroundings. Most buildings have shower and locker facilities, in addition to an on-campus Fitness Centre. There are also areas for soccer, volleyball and even beach volleyball during the summer! There are ample picnic areas and easy access to a shopping centre, grocery store and pharmacy, as well as numerous restaurants. Screening Criteria Applicants must demonstrate within the content of their application that they meet the following screening criteria in order to be given further consideration as candidates: Education Completion of post-secondary education in an electronic engineering/technology program or other technical, engineering or scientific discipline related to the position, or equivalent combination of work-related experience, training and education. For information on certificates and diplomas issued abroad, please see Degree equivalency Experience Recent experience in providing electronic technical expertise by installing, maintaining, troubleshooting, and calibrating laboratory instrumentation; Experience in installing and maintaining data acquisition equipment for support of laboratory physical model studies; Experience in providing programming assistance for ongoing laboratory real-time software development including programming and interfacing data acquisition hardware and control systems. Experience in using computers to analyze data, and present test results. Experience in working in a multidisciplinary team environment. Experience operating machinery such as skid steers and/or forklift would be an asset. Condition of Employment Secret (II) Language Requirements English Information on language requirements and self-assessment tests Assessment Criteria Candidates will be assessed on the basis of the following criteria: Technical Competencies Ability to work independently, and with others, under the general guidance of project engineers to meet objectives and deadlines Ability to use computers and research laboratory instrumentation devices and their application, set-up, calibration, and use for control of facilities and equipment, for data acquisition, analysis and processing. Ability in the application, use, and interpretation of results from instruments and gauges for measuring wave heights, flows, displacements, accelerations, and other physical quantities. Knowledge of preparation of calibration reports and operational procedures Ability to apply reading and interpretation skills to review technical drawings, instructions and specifications. Knowledge of Occupational Health & Safety regulations and legislation required to create and maintain a safe and healthy environment. Ability to work with Computer-Aided Design software (AutoCAD, Solid Works) considered an asset. Behavioural Competencies Technology support - Communication (Level 2) Technology support - Conceptual and analytical ability (Level 2) Technology support - Results orientation (Level 2) Technology support - Self-knowing and self-development (Level 2) Technology support - Teamwork (Level 2) Competency Profile(s) For this position, the National Research Council Canada will evaluate candidates using the following competency profile: Technology Support Compensation Salary under review. From $58,445 to $80,040 per annum. National Research Council Canada employees enjoy a wide-range of competitive benefits including comprehensive health and dental plans, vacation, sick, and other leave entitlements, disability insurance and pension plans. The National Research Council Canada Advantage The National Research Council of Canada (National Research Council Canada) is the Government of Canada's largest research organization supporting industrial innovation, the advancement of knowledge and technology development. We collaborate with over 70 colleges, universities and hospitals annually, work with 800 companies on their projects, and provide advice or funding to over 8000 Small and Medium-sized Enterprises (SMEs) each year. We bring together the brightest minds to deliver tangible impacts on the lives of Canadians and people around the world. And now, we want to partner with you. Let your expertise and inspirations make an impact by joining the National Research Council Canada. At the National Research Council Canada Employee wellness matters. We offer flexible work schedules as well as part-time work to help employees maintain work-life balance. We are one of the few federal organizations that close our offices during the December holiday season. We offer professional learning and development opportunities such as conferences, workshops, and a suite of mentorship, award and recognition programs. Diversity enables creativity and innovation. Fostering a diverse, inclusive, welcoming and supportive workplace is important to us, and contributes to a more inclusive Canadian innovation system. We welcome all qualified applicants and encourage you to complete the employment equity self-declaration questions during the job application process. Please let us know of any accommodation measures required to help you to be assessed in a fair and equitable manner. Please note that the information you provide will be treated confidentially. Help us solve problems for Canada. Grow your career with us today! Notes Relocation assistance will be determined in accordance with the National Research Council Canada's directives. Overtime will sometimes be required. Work typically requires daily intermittent periods of standing, walking and sitting at a work bench; working in awkward positions; bending and stretching; moving lightweight objects and large, awkward and heavier objects on occasion; operating hand and power tools and forklifts; climbing stairs and ladders on occasion. Work is typically performed in a laboratory, plant or shop environment that includes daily exposure to background noise from tools and equipment, and regular exposure to chemicals, dirt, noise, noxious odors, hazardous equipment and substances, extreme temperatures or other awkward conditions. Work can be performed indoors and outdoors, extreme weather conditions, and working on uneven terrain and from heights. A pre-qualified list may be established for similar positions for a one year period. Preference will be given to Canadian Citizens and Permanent Residents of Canada. Please include citizenship information in your application. The incumbent must adhere to safe workplace practices at all times. We thank all those who apply, however only those selected for further consideration will be contacted. Please direct your questions, with the requisition number (19859) to: E-mail: National Research Council Canada.NRCHiring-EmbaucheCNRC.CNRC@nrc-cnrc.gc.ca Telephone: 343-550-0290 Closing Date: 19 January 2024 - 23:59 Eastern Time",
    "processed_description": ". goal . . help bring research life drive career forward large research technology organization . Technical Officer Instrumentation Support support River Engineering OCRE Research Centre . select share core respect creativity . teamwork find solution protect infrastructure property people severe weather event environmental risk meet challenge climate change OCRE researcher physical modelling technique find real solution ongoing challenge natural . primary purpose position provide electronic technical support service installing maintain troubleshoot calibrate laboratory instrumentation physical model experiment . incumbent design build electronic equipment install maintain datum acquisition equipment support laboratory physical model experiment . completion experimental setup employee ensure continuous operation instrumentation project . employee coordinate assist production technical report user' manual . incumbent involve regular maintenance upgrade development OCRE's testing facility instrumentation . National Research Council Canada's main campus offer free parking easy access runner walker skater break enjoy beautiful surrounding . building shower locker facility addition . area soccer volleyball beach volleyball ample picnic area easy access shopping centre grocery store pharmacy numerous restaurant . screen Criteria Applicants demonstrate content application meet follow screening criterion order consideration Education Completion post secondary education electronic engineering technology program technical engineering scientific discipline relate position equivalent combination relate training education . information certificate diploma issue abroad degree equivalency provide electronic technical expertise instal maintain troubleshoot calibrate laboratory instrumentation instal maintain datum acquisition equipment support laboratory physical model study provide programming assistance ongoing laboratory real software development include programming interface datum acquisition hardware control system . computer analyze datum test result . multidisciplinary team environment . operating machinery skid steer forklift asset . condition Employment Secret II Language Requirements English Information language requirement assessment test Assessment Criteria assess basis follow criterion Technical Competencies independently general guidance project engineer meet objective deadline computer research laboratory instrumentation device application set calibration control facility equipment data acquisition analysis processing . application interpretation result instrument gauge measure wave height flow displacement acceleration physical quantity . knowledge preparation calibration report operational procedure apply reading interpretation skill review technical drawing instruction specification . regulation legislation require create maintain safe healthy environment . Computer aid Design software AutoCAD Solid Works consider asset . support Communication Level technology support conceptual analytical level technology support result orientation Level technology support development Level technology support Teamwork Level competency profile position evaluate follow competency profile Technology Support Compensation salary review . annum . National Research Council employee enjoy wide range competitive benefit include comprehensive health dental plan vacation sick leave entitlement insurance pension plan . large research organization support industrial innovation advancement knowledge technology development . collaborate college university hospital company project provide advice funding small medium sized Enterprises sme . bring bright mind deliver tangible impact life people . partner . expertise inspiration impact join . wellness matter . offer flexible schedule help employee maintain life balance . federal organization close office . offer professional learning development conference workshop suite mentorship award recognition program . diversity enable creativity innovation . foster diverse inclusive welcoming supportive workplace contribute inclusive canadian innovation system . qualified applicant encourage complete employment equity declaration question application process . accommodation measure require help assess fair equitable manner . note information provide treat confidentially . help solve problem . grow career note relocation assistance determine National Research Council Canada's directive . overtime require . typically require daily intermittent period standing walk sit bench awkward position bend stretching lightweight object large awkward heavy object occasion operate hand power tool forklift climb stair ladder occasion . typically perform laboratory plant shop environment include daily exposure background noise tool equipment regular exposure chemical dirt noise noxious odor hazardous equipment substance extreme temperature awkward condition . perform indoors outdoors extreme weather condition uneven terrain height . pre qualified list establish position period . . include citizenship information application . incumbent adhere safe workplace practice . apply select consideration contact . direct question requisition number mail closing Eastern",
    "results_group": {
        "extracted_noun_chunks": [
            "River Engineering OCRE Research Centre",
            "primary purpose position",
            "OCRE's testing facility instrumentation",
            "ongoing challenge",
            "diverse inclusive welcoming supportive workplace",
            "follow competency profile Technology Support Compensation salary review",
            "help",
            "shower locker facility addition",
            "datum acquisition equipment support laboratory physical model experiment",
            "daily intermittent period",
            "qualified applicant",
            "treat",
            "position equivalent combination",
            "independently general guidance project engineer",
            "life balance",
            "employee coordinate",
            "bright mind",
            "research life drive career",
            "condition Employment Secret II Language Requirements English Information language requirement assessment test Assessment Criteria",
            "interpretation skill review technical drawing instruction specification",
            "select consideration contact",
            "safe workplace practice",
            "basis follow criterion Technical Competencies",
            "large awkward heavy object occasion",
            "large research technology organization",
            "National Research Council Canada's directive",
            "production technical report user' manual",
            "asset",
            "hand power tool forklift climb stair ladder occasion",
            "electronic technical expertise instal",
            "objective deadline computer research laboratory instrumentation device application set calibration control facility equipment data acquisition analysis processing",
            "completion experimental setup employee",
            "laboratory plant shop environment",
            "application interpretation result instrument gauge measure wave height flow displacement acceleration physical quantity",
            "complete employment equity declaration question application process",
            "laboratory instrumentation physical model experiment",
            "area soccer volleyball beach volleyball ample picnic area easy access shopping centre grocery store pharmacy",
            "goal",
            "National Research Council Canada's main campus",
            "overtime require",
            "college university hospital company project",
            "Technical Officer Instrumentation Support",
            "bench",
            "screen Criteria Applicants",
            "training education",
            "real solution",
            "incumbent",
            "problem",
            "partner",
            "multidisciplinary team environment",
            "safe healthy environment",
            "computer",
            "industrial innovation advancement knowledge technology development",
            "numerous restaurant",
            "standing walk",
            "troubleshoot",
            "inclusive canadian innovation system",
            "large research organization",
            "infrastructure property people severe weather event environmental risk meet challenge climate change",
            "federal organization close office",
            "Computer aid Design software AutoCAD",
            "fair equitable manner",
            "datum acquisition equipment support laboratory physical model study",
            "Communication Level technology support conceptual analytical level technology support",
            "machinery skid steer forklift asset",
            "orientation Level technology support development Level technology support Teamwork Level competency profile position",
            "content application meet follow screening criterion order consideration",
            "relocation assistance",
            "National Research Council employee",
            "entitlement insurance pension plan",
            "expertise inspiration impact",
            "flexible schedule help",
            "information",
            "position period",
            "employee",
            "electronic technical support service installing",
            "datum test result",
            "wide range competitive benefit",
            "wellness matter",
            "programming assistance",
            "programming interface datum acquisition hardware control system",
            "Solid Works",
            "lightweight object",
            "indoors",
            "OCRE researcher physical modelling technique",
            "share core respect creativity",
            "electronic equipment install",
            "career note",
            "ongoing laboratory real software development",
            "continuous operation instrumentation project",
            "outdoors extreme weather condition uneven terrain height",
            "regulation legislation",
            "free parking easy access runner walker skater break",
            "knowledge preparation calibration report operational procedure",
            "advice",
            "direct question requisition number mail",
            "daily exposure background noise tool equipment regular exposure chemical dirt noise noxious odor hazardous equipment substance extreme temperature awkward condition",
            "diversity",
            "qualified list",
            "citizenship information application",
            "small medium sized Enterprises",
            "creativity innovation",
            "tangible impact life people",
            "accommodation measure",
            "comprehensive health dental plan vacation",
            "regular maintenance upgrade development",
            "Education Completion post secondary education electronic engineering technology program technical engineering scientific discipline",
            "information certificate diploma issue abroad degree equivalency",
            "teamwork",
            "incumbent design",
            "professional learning development conference workshop suite mentorship award recognition program"
        ],
        "combined_lemmatized_tokens": ". goal . . help bring research life drive career forward large research technology organization . Technical Officer Instrumentation Support support River Engineering OCRE Research Centre . select share core respect creativity . teamwork find solution protect infrastructure property people severe weather event environmental risk meet challenge climate change OCRE researcher physical modelling technique find real solution ongoing challenge natural . primary purpose position provide electronic technical support service installing maintain troubleshoot calibrate laboratory instrumentation physical model experiment . incumbent design build electronic equipment install maintain datum acquisition equipment support laboratory physical model experiment . completion experimental setup employee ensure continuous operation instrumentation project . employee coordinate assist production technical report user' manual . incumbent involve regular maintenance upgrade development OCRE's testing facility instrumentation . National Research Council Canada's main campus offer free parking easy access runner walker skater break enjoy beautiful surrounding . building shower locker facility addition . area soccer volleyball beach volleyball ample picnic area easy access shopping centre grocery store pharmacy numerous restaurant . screen Criteria Applicants demonstrate content application meet follow screening criterion order consideration Education Completion post secondary education electronic engineering technology program technical engineering scientific discipline relate position equivalent combination relate training education . information certificate diploma issue abroad degree equivalency provide electronic technical expertise instal maintain troubleshoot calibrate laboratory instrumentation instal maintain datum acquisition equipment support laboratory physical model study provide programming assistance ongoing laboratory real software development include programming interface datum acquisition hardware control system . computer analyze datum test result . multidisciplinary team environment . operating machinery skid steer forklift asset . condition Employment Secret II Language Requirements English Information language requirement assessment test Assessment Criteria assess basis follow criterion Technical Competencies independently general guidance project engineer meet objective deadline computer research laboratory instrumentation device application set calibration control facility equipment data acquisition analysis processing . application interpretation result instrument gauge measure wave height flow displacement acceleration physical quantity . knowledge preparation calibration report operational procedure apply reading interpretation skill review technical drawing instruction specification . regulation legislation require create maintain safe healthy environment . Computer aid Design software AutoCAD Solid Works consider asset . support Communication Level technology support conceptual analytical level technology support result orientation Level technology support development Level technology support Teamwork Level competency profile position evaluate follow competency profile Technology Support Compensation salary review . annum . National Research Council employee enjoy wide range competitive benefit include comprehensive health dental plan vacation sick leave entitlement insurance pension plan . large research organization support industrial innovation advancement knowledge technology development . collaborate college university hospital company project provide advice funding small medium sized Enterprises sme . bring bright mind deliver tangible impact life people . partner . expertise inspiration impact join . wellness matter . offer flexible schedule help employee maintain life balance . federal organization close office . offer professional learning development conference workshop suite mentorship award recognition program . diversity enable creativity innovation . foster diverse inclusive welcoming supportive workplace contribute inclusive canadian innovation system . qualified applicant encourage complete employment equity declaration question application process . accommodation measure require help assess fair equitable manner . note information provide treat confidentially . help solve problem . grow career note relocation assistance determine National Research Council Canada's directive . overtime require . typically require daily intermittent period standing walk sit bench awkward position bend stretching lightweight object large awkward heavy object occasion operate hand power tool forklift climb stair ladder occasion . typically perform laboratory plant shop environment include daily exposure background noise tool equipment regular exposure chemical dirt noise noxious odor hazardous equipment substance extreme temperature awkward condition . perform indoors outdoors extreme weather condition uneven terrain height . pre qualified list establish position period . . include citizenship information application . incumbent adhere safe workplace practice . apply select consideration contact . direct question requisition number mail closing Eastern"
    }
}