{
    "id": "bb142cd960f39a2e",
    "company": "Microsoft",
    "positionName": "Solution Area Specialist - Business Applications - Government",
    "jobType": [
        "Full-time"
    ],
    "location": "Ottawa, ON",
    "salary": "$139,100–$205,700 a year",
    "postingDateParsed": "2024-01-24T12:17:07.018Z",
    "url": "https://www.indeed.ca/rc/clk?jk=bb142cd960f39a2e&from=jasx&tk=1hl5dju1ci4nl800&bb=gCzgXPzOG1uTP-CnMJvHBT3i2Bm9zHcSeZTR3w2w6z5eXR6uuSSBrapAZkW5PH1iv3kaR1iCfS-YpPZ8ndl7ceQvZO-XqsEvvGfVlvlp_ywVR5L7ebrKmA%3D%3D&xkcb=SoBb67M3FlTAH9xNAp0HbzkdCdPP&vjs=3",
    "externalApplyLink": "https://jobs.careers.microsoft.com/us/en/job/1673169/Solution-Area-Specialist---Business-Applications---Government?jobsource=indeed&utm_source=Job%20Board&utm_campaign=indeed-feed",
    "companyDescription": "Microsoft Corporation (NASDAQ: MSFT) is an American public multinational corporation headquartered in Redmond, Washington, USA that develops, manufactures, licenses, and supports a wide range of products and services predominantly related to computing through its various product divisions. Established on April 4, 1975 to develop and sell BASIC interpreters for the Altair 8800, Microsoft rose to dominate the home computer operating system market with MS-DOS in the mid-1980s, followed by the Microsoft Windows line of operating systems. Microsoft would also come to dominate the office suite market with Microsoft Office. The company has diversified in recent years into the video game industry with the Xbox and its successor, the Xbox 360 as well as into the consumer electronics and digital services market with Zune, MSN and the Windows Phone OS. The ensuing rise of stock in the company's 1986 initial public offering (IPO) made an estimated four billionaires and 12,000 millionaires from Microsoft employees. In May 2011, Microsoft Corporation acquired Skype Communications for $8.5 billion dollars.",
    "description": "Microsoft is on a mission to empower every person and every organization on the planet to achieve more. Our culture is centered on embracing a growth mindset, a theme of inspiring excellence, and encouraging teams and leaders to bring their best each day. In doing so, we create life-changing innovations that impact billions of lives around the world. You can help us to achieve our mission.\n \n \n   Are you insatiably curious? Do you embrace uncertainty, take risks, and learn quickly from your mistakes? Do you collaborate well with others, knowing that better solutions come from working together? Do you stand in awe of what humans dare to achieve, and are you motivated every day to empower others to achieve more through technology and innovation? Are you ready to join the team that is at the leading edge of Innovation at Microsoft?\n \n \n \n   As a Solution Area Specialist - Business Applications - Government, you will be a seller within our enterprise sales organization working with some of our largest customers. You will lead a virtual team of technical, partner and consulting resources focused on helping customers digitize \n  their customer facing business processes and improve their customer engagement, leading to significantly better business outcomes.\n \n \n \n   You will advance the sales process and achieve/exceed solution sales and usage/consumption targets by helping customers identify business challenges/opportunities and addressing those with differentiated solutions based on Microsoft Dynamics 365 and the broader Microsoft cloud platform, removing deployment roadblocks and driving customer value and satisfaction.\n \n \n \n   To learn more about Microsoft’s mission, please visit: https://careers.microsoft.com/mission-culture. Check out all our products at: http://www.microsoft.com/en-us.\n \n \n \n   The Impact You’ll Be Making\n \n \n   The reinvention of business process represents a bold bet for Microsoft in accelerating our growth in commercial cloud services. The mission of Microsoft Business Applications is to help our customers digitally transform their businesses to drive new sources of revenue, create new and engaging ways to serve their customers, and to transform the way in which their business runs to drive new levels of profitability for their organization.\n \n \n \n   The Solution Area Specialist - Business Applications - Government is an accomplished specialist with a track record of exceeding sales targets by driving digital transformation using CRM (Customer Relation Management) and ERP (Enterprise Resource Planning) solutions in \n  federal government accounts. She/he uses their industry knowledge, solution expertise and customer relationships to influence key stakeholders and lead virtual teams to drive transformation.\n \n  Responsibilities\n  Sales Execution\n \n   Engages in conversations with customers aligned to their industry to introduce how other workloads could enable digital transformation areas that is aligned with the customer's industry and turns opportunities into deals. Initiates conversations with customers on digital transformation in one or more solution areas, in collaboration with partners and services. Creates guiding examples of digital transformation through seminars, workshops, webinars, and direct engagement.\n   Collaborates with team members to discover new opportunities. Drives incremental revenue growth through personal campaigns (e.g., portfolio analysis) or internal sources (e.g., Marketing). Collaborates with account teams, partners, or services to track and qualify new opportunities. Collaborates with other teams (e.g., account teams) and services to build pipeline. Interfaces with customers and builds relationships via social selling. Applies Microsoft's sales process (MSP) to determine the quality of the opportunity and whether to proceed.\n   Identifies opportunities to drive consumption and grow business with existing customers by initiating conversations, providing demos or quotes, and collaborating with partners or internal teams (e.g., Technical Sales Professionals, Global Black Belts. For licensing transactions and project engagements, ensures rapid and robust deployment plan at point of sale that is validated by services and partners.\n   Identifies customer business needs and technology readiness. Contributes to the development of solutions in collaboration with internal teams, partners, and services. Proposes prioritized solutions that align with customers' needs. Articulates the business value of proposed solutions.\n   Proactively builds external stakeholders' mapping. Collaborates with account teams (e.g., Account Executives) to identify and engage senior business subject matter decision makers at the customer's/partner's business.\n   Implements strategies to accelerate the closing of deals. Contributes input on strategies to drive and close prioritized opportunities. Coaches less experienced team members in deal plan execution. Implements close plans (e.g., how to map timeline, engage the customer, get customer buy-in and commitment) to de-risk and drive predictable deal closure.\n \n  Scaling and Collaboration\n \n   Collaborates with One Commercial Partner (OCP) and with a network of partners to cross-sell and up-sell. Identifies new partners by researching and discussing with partners on customer scenarios. Develops joint proposal with partners. Contributes to developing partner strategies to address gaps in partner capabilities.\n   Applies the orchestration model to leverage and expand relationships with internal stakeholders and partners (e.g., Enterprise Operating Unit). Navigates the Microsoft (MSFT) organization to bring the best impact to the customer.\n \n  Technical Expertise\n \n   Leads conversations and sets up events within Microsoft. Mentors others and develops strategies for best practice sharing across subsidiaries. Contributes ideas that can be instituted across Microsoft.\n   Initiates conversations with prospective customers/partners at events to expand external network. Acts as a subject matter advisor in one or more solution area(s).*\n   Collaborates with the 'compete' global black belts (GBB) to analyze competitor products, solutions, and/or services and implements strategies to position Microsoft against competitors in customer communication. Proactively provides analysis of the competitive landscape in supported solution area. Evaluates opportunities and makes recommendations on pursuit or withdrawal. Holistic value of MSFT platform versus single-point solution that positions Microsoft favorably against competitors.\n \n  Sales Excellence\n \n   Collaborates with partners and resources and leverages customer insights or industry knowledge. Contributes to exploring business and emerging opportunities to optimize the portfolio and support customer innovation.\n   Reviews feedback report and coaches others on ensuring customer/partner satisfaction and decreasing dissatisfaction by establishing recovery action plans to improve clients' overall experience. Manages and/or orchestrates sales and delivery success through the account team and pursuit team.\n   Engages with internal and external stakeholders on business planning, Rhythm of Business (ROB) meetings to review and plan for accounts in the assigned territory.\n   Collaborates with extended sales team, partners, and marketing to conduct business analysis (e.g., whitespace analysis, identify industry trends) to pursue high-potential customers and develop a target list of potential business.\n   Manages the end-to-end business of the assigned territory. Conducts forecasting for accounts and develops a portfolio and territory plan to drive intentional selling aligned with strategic priorities.\n   Completes required training and obtains relevant product and role certifications aligned to the role and workload/industry.\n \n  Other\n \n   Embody our culture and values\n \n \n  Qualifications\n \n   Required/Minimum Qualifications\n \n  \n \n \n   7+ years technology-related sales or account management experience\n   \n     OR Bachelor's Degree in Computer Science, Information Technology, Business Administration, or related field AND 6+ years technology-related sales or account management experience.\n   \n \n \n \n   Additional or Preferred Qualifications\n \n \n   9+ years technology-related sales or account management experience\n   \n     OR Bachelor's Degree in Information Technology, or related field AND 8+ years technology-related sales or account management experience\n     OR Master's Degree in Business Administration (i.e., MBA), Information Technology, or related field AND 5+ years technology-related sales or account management experience.\n   \n   6+ years solution or services sales experience.\n \n \n   Solution Area Specialists IC5 - The typical base pay range for this role across Canada is CAD $139,100 - CAD $205,700 per year.\n \n \n   Find additional pay information here: \n \n \n  https://careers.microsoft.com/v2/global/en/canada-pay-information.html\n \n  \n  Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations."
}