{
    "id": "5100839a67ccad40",
    "company": "AECOM",
    "positionName": "Senior Ecologist",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-09-01T06:50:22.859Z",
    "url": "https://www.indeed.ca/rc/clk?jk=5100839a67ccad40&from=jasx&tk=1hbl00v2ikedd801&vjs=3",
    "externalApplyLink": "https://jobs.smartrecruiters.com/AECOM2/743999913821309-senior-ecologist",
    "companyDescription": "",
    "description": "Company Description\n  At AECOM, we’re delivering a better world.\n  We believe infrastructure creates opportunity for everyone. Whether it’s improving your commute, keeping the lights on, providing access to clean water or transforming skylines, our work helps people and communities thrive.\n  Our clients trust us to bring together the best people, ideas, technical expertise and digital solutions to our work in transportation, buildings, water, the environment and new energy. We’re one global team – 47,000 strong – driven by a common purpose to deliver a better world.\n  Here, you will have freedom to grow in a world of opportunity.\n  We will give you the flexibility you need to do your best work with hybrid work options. Whether you’re working from an AECOM office, remote location or at a client site, you will be working in a dynamic environment where your integrity, entrepreneurial spirit and pioneering mindset are championed.\n  You will help us foster a culture of equity, diversity and inclusion – a safe and respectful workplace, where we invite everyone to bring their whole selves to work using their unique talents, backgrounds and expertise to create transformational outcomes for our clients.\n  We will encourage you to grow and develop your career with us through our technical and professional development programs and diverse career opportunities. We believe in leadership at all levels. No matter where you sit in the organization you can make a lasting impact on the projects you work on, the teams and committees you join and our business.\n  We offer competitive pay and benefits, well-being programs to support you and your family, and the development resources you need to advance your career.\n  When you join us, you will connect and collaborate with a global network of experts – planners, designers, engineers, scientists, consultants, program and construction managers – leading the change toward a more sustainable and equitable future. Join us and let’s get started.\n \n \n\n Job Description\n  AECOM’s ecology team is looking for applicants for the position of a Senior Ecologist to help drive the delivery of our existing projects and to grow our capacity to serve clients on challenging and exciting projects across the province. The position may be based out of any of the following offices: Whitby , Markham, Mississauga, Kitchener, Hamilton, London, Ottawa, Barrie or Ottawa.\n  The successful candidate will have a minimum of 10 years of relevant experience, be highly motivated and enjoy working on a diversity of projects, is an effective communicator and is committed to producing high quality work.\n  The position will involve working with project managers to deliver timely environmental tasks and commitments including baseline studies, environmental impact assessments, permit applications, agency consultation, site plan drawings, restoration plans and mitigation plans and related scopes of work. Responsibilities include:\n \n   Manage and conduct biological surveys and provide technical support in vegetation, fish and fish habitat, wetland and/or wildlife ecology.\n   Supervise and mentor intermediate and junior staff through on-the-job training and project work.\n   Effectively manage and coordinate projects as a technical lead or project manager.\n   Write and deliver high quality reports, which may include: field reports; permit applications; compensation plans; sustainability/restoration plans; environmental impact assessments; land/watershed plans; management plans.\n   Quality control of data analysis and reports and a commitment to technical excellence.\n   Work collaboratively between different offices and groups;\n   Identify emerging markets and business opportunities with existing and new clients.\n   Develop appropriate marketing materials and strategies.\n   Write effective proposals.\n \n\n \n \n\n Qualifications\n  Must Have Skills/Experience (Including any required Certifications): \n \n  At least 10 years relevant work experience in a related field (ideally consultancy) with advanced field skills in terrestrial vegetation, wetlands, fisheries, water quality or wildlife ecology.\n   Strong reputation for ecological expertise, and capable of developing good client relationships\n   Solid understanding of the environmental documentation process including impact assessment and mitigation.\n   Knowledge and experience with federal, provincial and municipal acts, regulations, policies and guidelines in particular, the Planning Act and Provincial Policy Statement, Endangered Species Act, Species at Risk Act, Fisheries Act, the Ontario Environmental Assessment Act, Migratory Birds Convention Act, and the Canadian Environmental Assessment Act 2012.\n   Good communicator and able to liaise with all stakeholders including regulatory agencies.\n   Proven leadership and superior communication skills.\n   Project Management skills and experience in tracking schedules and delivering projects on time and within budget.\n   Demonstrated ability in developing new business opportunities.\n \n  Preferred Skills/Experience:\n \n   Ecological Land Classification training and certification\n   Ontario Wetland Evaluation System training and certification\n   Ontario Stream Assessment Protocol training and certification\n   Experience on Ministry of Transportation (MTO) projects\n   Experience writing and preparing technical reports\n   Familiarity with Microsoft Office Suite with proficiency in Microsoft Word and Excel\n   Valid Drivers License\n \n  Additional Information\n \n  With infrastructure investment accelerating worldwide, our services are in great demand, and there’s never been a better time to be at AECOM! Join us, and you’ll get all the benefits of being a part of a global, publicly traded firm – access to industry-leading technology and thinking and transformational work with big impact and work flexibility.\n  AECOM provides a wide array of compensation and benefits programs to meet the diverse needs of our employees and their families. We also provide a robust global well-being program. We’re the world’s trusted global infrastructure firm, and we’re in this together – your growth and success are ours too.\n  As an Equal Opportunity Employer, we believe in each person’s potential, and we’ll help you reach yours.\n  Join us and let’s get started."
}