{
    "id": "0f6e4a9c1d21929b",
    "company": "Caduceon Environmental Labs",
    "positionName": "Sample Reception/Driver",
    "jobType": [],
    "location": "2378 Holly Lane, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-09-13T06:49:33.832Z",
    "url": "https://www.indeed.ca/rc/clk?jk=0f6e4a9c1d21929b&from=jasx&tk=1hb2v5rcfk7vv800&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "Team Caduceon in Ottawa is looking for a reliable and friendly individual to help us out with Sample Reception, Shipping and Receiving and Sample Pickup. The successful candidate will work in our Sample Reception Department with a small team of individuals.\nPosition: Customer Service/Sample Reception – Full-time\nLocation: 2378 Holly Lane, Ottawa, ON. K1V 7P1\nRequirements: Valid Driver’s license required, good attitude, punctual and ability to pick up/move up to 50lbs boxes/crates/coolers. Telephone Skills, Experience with MS Access or similar Database and Bilingual (i.e. English & French) will be considered and asset.\nDuties will entail the following:\n· Receiving of Environmental Samples either by Direct Client Drop off or via Courier.\n· Ensure all samples are received in good condition and meet appropriate QA/QC Requirements\n· Log samples into the Laboratory Information System (LIMS)\n· Label samples with unique ID’s generated from the LIMS.\n· Transfer samples to the appropriate storage areas of the Laboratory.\n· Preparation of bottle orders and supplies to be shipped or picked-up for customers.\n· Shipping/handling of bottle orders and supplies\n· Back-up receptionist when primary Receptionist is on break or holiday.\n· As you gain experience with the day to day operations of the Lab, provide consultation, recommendations, and technical assistance to clients.\n· Stay current on the application and interpretation of environmental regulations\n· Document and get closure on all client complaints\n· Preparation and shipping of subcontracted analyses\n· Coordinate and schedule on time pick-up of samples – including dropping off/picking up of samples\n· Coordinate on time and accurate delivery of all bottle orders\n· Adhere to all Health and Safety Regulations\n· Ensure Quality Standards are maintained\n· Provide client feedback to the management\n· Adhere to and participate with all QA\\QC policies of the organization\nOTHER RELATED DUTIES AS REQUIRED\nJob Type: Full-time\nSalary: From $18.00 per hour\nBenefits:\n\n Dental care\n Extended health care\n\nSchedule:\n\n 8 hour shift\n\nSupplemental pay types:\n\n Overtime pay\n\nAbility to commute/relocate:\n\n Ottawa, ON: reliably commute or plan to relocate before starting work (required)\n\nApplication question(s):\n\n Must be eligible to work in Canada\n\nWork Location: In person"
}