{
    "id": "54c482c5f75c75ff",
    "company": "Stantec",
    "positionName": "Team lead, Application Architect",
    "jobType": [],
    "location": "3001331 Clyde Avenue, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-16T18:52:48.492Z",
    "url": "https://www.indeed.ca/rc/clk?jk=54c482c5f75c75ff&from=jasx&tk=1hcvfn7eljiim800&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=54c482c5f75c75ff&atk=&xpse=SoAm67I3JfXR87Q9XR0LbzkdCdPP",
    "companyDescription": "",
    "description": "Team lead, Application Architect - ( 2300047E ) \n Description \n Grow with the best. Join a smart, creative, and inspired team that works to support operational excellence. The Stantec community unites more than 28,000 employees working in over 400 locations across 6 continents. Our Functional Services Teams (FSTs) include Corporate Development, Finance, HR, HSSE, IT, Legal, Marketing/Communications, Practice Services and Real Estate and Procurement. Bringing together individuals with diverse backgrounds, talents, and expertise, our FSTs are vital to making our Company stronger. \n Your Opportunity \n We are seeking an experienced and skilled Application Architect to join our Technical Development team. The ideal candidate will have deep understanding of Oracle applications, architecture, technologies, and most importantly Oracle modern best practices. \n This role requires a deep understanding of ERP solutions, business processes, and technological trends to create a robust and scalable architecture that aligns with our organization's strategic goals. you will play a pivotal role in shaping the technical direction of our corporate applications to also ensure alignment with best practices. \n Your Key Responsibilities \n \n  Contribute to the company’s long-term roadmap to meet its strategic business goals. \n  Develop architectural blueprints, diagrams, and documentation to represent the company’s complex systems along with all their integration points. \n  Ensure that a common and broad-based understanding of the architectural components exists. \n  Define architecture risk mitigation plans when required. \n  Stay current with Oracle's latest product offerings, updates, and industry trends to proactively identify opportunities for innovation and improvement. \n  Evaluate and recommend Oracle application technologies, tools, and frameworks to optimize system performance and efficiency. \n  Maintain the team’s service catalog with all the necessary documentation/procedures that support it. \n  Understand, document, and monitor application layering dependencies (User-Interface, Deployment, Public Interface, Application Domain, Application Infrastructure, Technical Frameworks, and Platforms) and application component dependencies. \n  Define data dependencies within, between, and among various applications and application components. \n  Identify misalignments, duplication of efforts, and opportunities to use reusable components. \n  Collaborate with database administrators, network engineers, and other IT professionals to ensure seamless integration of Oracle applications with existing infrastructure. \n  Provide technical guidance to development teams throughout the project lifecycle to ensure adherence to architectural standards and best practices. \n  Participate in some solution review sessions, design review sessions, and collaborate in proof of concepts. \n  Lead and supervise a team of business system analysts. \n \n Qualifications \n Your Capabilities and Credentials \n \n  In-depth knowledge of Oracle technologies, including Oracle E-Business Suite, Oracle Fusion Applications, Oracle Database, WebLogic Server, and related tools. \n  Expertise in designing scalable, reliable, and high-performance Oracle application architectures that meet business requirements. \n  Proficiency in Oracle-specific programming languages (PL/SQL, SQL), scripting languages, and integration technologies (SOA, REST, SOAP). \n  Strong understanding of Oracle security principles, data protection, and compliance standards. \n  Excellent problem-solving skills with the ability to analyze complex issues and provide innovative solutions. \n  Experience with cloud technologies and migration of Oracle applications to the cloud is desirable. \n  Experience in multiple ERP systems like Workday, SAP, E1, Deltek is desirable. \n  Strong understanding and experience of the Agile framework. \n  Effective communication and interpersonal skills, capable of collaborating with both technical and non-technical stakeholders. \n  Strong documentation skills. \n  Highly Self-motivated and driven. \n \n Education and Experience \n \n  Bachelor’s or master’s degree in computer science, Information Technology, or a related field. \n  10 experience in IT industry. \n  Proven experience (5 years) as an Oracle Application Architect or a Senior Application developer, with a strong track record of designing and implementing Oracle-based solutions. \n  Experience managing technical teams is a plus. \n \n Benefits Summary: Regular full-time and part-time employees will have access to health, dental, and vision plans, a well-being program, health care spending account, wellness spending accounts, group registered retirement savings plan, employee stock purchase program, group tax-free savings account, life and accidental death & dismemberment (AD&D) insurance, short-term/long-term disability plans, emergency travel benefits, tuition reimbursement, professional membership fee coverage, and paid time off. \n Temporary/casual employees will have access to group registered retirement savings plan, employee stock purchase program, and group tax-free savings account. \n The benefits information listed above may not apply to union positions because benefits for such positions are governed by applicable collective bargaining agreements. \n Primary Location : Canada-Alberta-Edmonton \n Other Locations : Canada-Alberta-Calgary, Canada-Manitoba-Winnipeg, Canada-British Columbia-Vancouver, Canada-New Brunswick, Canada-Ontario-Toronto, Canada-Ontario-Ottawa, Canada-Ontario-Waterloo, Canada-Nova Scotia \n Work Locations : \n Edmonton AB \n Organization : BC-1371 Integrated Business Applications-CA Canada \n Employee Status : Regular \n Job Level : Manager \n Travel : No \n Schedule : Full-time \n Job Posting : Oct 16, 2023, 2:26:22 PM \n Req ID: 2300047E \n Stantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans"
}