{
    "id": "b1b7ad56c5d90c63",
    "company": "Business Sherpa Group",
    "positionName": "Software Architect",
    "jobType": [
        "Full-time"
    ],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-26T12:13:40.668Z",
    "url": "https://www.indeed.ca/rc/clk?jk=b1b7ad56c5d90c63&from=jasx&tk=1hl5dd1pui7nm800&bb=NiGljfghLwyJxtbyZy8vs-Jk0qJZKd91pGFYGAENkLcorZtxwvRmT-c4S8w05zqyrSHX24iopoPO5LwS0F0OKJxOtDE4LBVjCBDTa7qcRyqsE2kXYt9KDw%3D%3D&xkcb=SoC467M3FlS757AVJj0NbzkdCdPP&vjs=3",
    "externalApplyLink": "https://www.businesssherpagroup.com/job/software-architect-searidge-technologies/",
    "companyDescription": "Business Sherpa Group provides its clients with an experienced, corporate class Human Resources team. With a focus on small or start up businesses, Business Sherpa is able to assist by providing its clients with HR business partners embedded, either physically or virtually, within each firm.  As well, organizations can count on the support of the entire Group, where a full spectrum of Human Resources functionality can be scaled exactly to client needs. ",
    "description": "Searidge Technologies \n     \n      searidgetech.com \n     \n    \n   \n  \n  \n   \n    \n     Published \n    \n    \n     January 8, 2024 \n    \n   \n   \n    \n     Location \n    \n    \n     Ottawa (Hybrid), Ontario, Canada \n    \n   \n   \n    \n     Category \n    \n    \n     Software Development \n    \n   \n   \n    \n     Job Type \n    \n    \n     Full-time \n    \n   \n   \n    \n     Experience\n     \n    \n     Mid-Senior Level \n    \n   \n  \n  \n   Description \n   \n    Headquarters: Ottawa, Ontario \n     Industry: Technology/Aviation \n     Job Type: Full-time \n     About the Job \n     Searidge Technologies, a global leader and preferred partner for Remote Tower and Digital Airport solutions is currently recruiting for a Software Architect with an excellent understanding of software development, software system architecture design and the software development life cycle. The successful candidate will be responsible for the architecture design of Searidge’s software components and integrated software subsystems as well as the Searidge’s digital data platform that underpins all software components and products. The software architect role is an essential part of Searidge’s V-Model system development process, interfacing with both project delivery and software development teams. The software architect will analyze system-level requirements, derive software-level requirements, and design the software architecture, while ensuring the overall architectural principles are followed for the platform and all products. \n     This will be a permanent, full-time position, reporting to the Head of Platform and Products. \n     Responsibilities \n    \n     Collaborate with Searidge project and software teams to create functional and non-functional software-level requirements \n     Collaborate with software testers to ensure the software-level requirements are adequately verified and validated \n     Use tools and software development methodologies to create high- and low-level software component and integrated software sub-system architecture design documentation \n     Documenting and recording software design selections and specifications \n     Actively seek ways to improve the architectural design of all Searidge products and the platform, with an aim to improve safety, efficiency, and customer satisfaction. \n     Provide technical guidance and mentoring to software developers, software testers, and project delivery teams \n     Ensure that software and sub-system designs follow a consistent design pattern and specification. \n     Communicate new concepts and guidelines to software developers and project delivery teams through documentation and presentations \n     Review and approve architecture-related information in software low-level design and high-level system design documentation \n    \n    Qualifications \n    \n     Computer Science Bachelor Degree or equivalent \n     5+ years experience in designing and implementing software applications \n     Solid understanding of development tooling and development platform \n     Excellent knowledge of software and application design and architecture \n     Demonstrated knowledge of real time applications, web applications, APIs, and cybersecurity \n     Experience with Helm, Docker, Kubernetes, Message Queues, SQL and No-SQL databases \n     Extensive experience with Message Queues, REST APIs and API architecture \n     Excellent communication and interpersonal skills \n     General understanding of software quality assurance principles \n     Strong analytical and critical thinking skills with the ability to see the big picture \n     Understanding of Linux systems \n     Must be a team player and willing to learn \n    \n    Desired Qualifications \n    \n     Experience in coding languages such as C++, JavaScript, and React \n     Hands-on experience with AWS technologies such as EC2, EKS, S3, Fargate and Lambda \n     Experience developing frontend and backend applications \n     Understanding of cybersecurity threats, solutions, and best practices \n     Familiarity with one or more languages in addition to English \n    \n    Why Searidge? \n     Searidge Technologies is an innovative technology company working in the mission critical world of aviation. As a pioneer and global leader in Digital Tower and Advanced Airport solutions, our team is on the forefront of technology and driving change in how aircraft and vehicles in the vicinity of an airport have been traditionally managed. \n     As a member of the Searidge team, you will be part of exciting industry firsts, encounter challenging problems, be exposed to a variety of internal functions, and encouraged to learn, grow and expand both professionally and personally. \n     We are an equal opportunity employer offering competitive compensation, a respectful and positive work environment where creative solutions, empowerment, and collaboration to achieve our shared goals are part of our corporate DNA. \n     To Apply \n     Sounds like a good fit? If so, follow this link to apply via LinkedIn."
}