{
    "id": "8d686ae4cb46bbfe",
    "companyDescription": "",
    "description": "Job Family:\n  Academic Leadership and Faculty\n \n   Union affiliation:\n \n  APUO\n \n \n   Faculty/Department:\n  Department of Earth and Environmental Sciences_FT\n \n \n   Campus:\n  STEM\n \n \n   Date Posted:\n  octobre 13, 2023\n \n \n   Closing Date:\n \n \n   Note: Applications will be accepted until 11:59 PM on the day prior to the Posting End Date above\n \n \n \n   Tenure-track position in Solid Earth Materials\n \n \n \n   The Department of Earth and Environmental Sciences at the University of Ottawa invites applications for a tenure-track position at the rank of Assistant Professor in a field broadly related to solid Earth petrologic processes. We are looking for a scientist with an outstanding track record for innovative research using experimental, theoretical and field-based investigations of structures and processes in rocks to understand the dynamics of geological systems. We are especially interested in candidates with research interests in igneous and metamorphic minerals and microstructures, or ore geology. Candidates with a research focus in the Arctic and that have a solid foundation in field geology are strongly encouraged to apply. The starting date is July 1, 2024.\n \n \n \n   Title of the position: Assistant Professor\n \n \n \n   Duties: The responsibilities include: 1) teach across a broad spectrum of mineralogy or petrology oriented courses; 2) supervision of BSc, MSc and PhD students; 3) develop an externally-funded research program; 4) establish connections with industry and government agencies; and 5) active engagement with the department and faculty by contributing to administrative and academic activities.\n \n \n \n   Rank and salary: Regular tenure-track academic appointment in the Faculty of Science, with a salary consistent with the collective agreement of the Association of Professors of the University of Ottawa. The base salary for assistant professors is $89,622.\n \n \n \n   Contact information: Dr. David Schneider, Department of Earth & Environmental Sciences, University of Ottawa, 150 Louis Pasteur Pvt., Ottawa, Ontario K1N 6N5 Canada, 613-562-5773, \n  \n   EESpost@uottawa.ca\n  \n \n \n \n   Skill requirements:\n \n \n   PhD in Earth Sciences, Geology, or Environmental Sciences\n   Postdoctoral experience and excellent didactic skills are an asset\n   Bilingualism: The University of Ottawa is proud to be the largest bilingual (English-French) university in North America and considers bilingualism to be a defining feature of the institution. It is expected that the candidate will be able to function and teach in both official languages by the time of tenure. The University is delighted to offer free training to achieve this aim. Preference may be given to candidates who are able to teach in French at the time of hiring.\n \n \n \n   Application procedure: More information regarding \n  \n   Academic Careers can be found online\n  . Applications must be submitted electronically through the University of Ottawa Careers portal. Candidates should include the following in their application:\n \n \n   a cover letter and curriculum vitae\n   a statement summarizing the proposed research program (2-3 pages)\n   strategies of the candidate's pedagogical approach to teaching Earth Sciences (2 pages)\n   a statement addressing past and/or potential contributions to diversity through research, teaching, and/or service (1 page)\n   names and contact details of three professional references\n \n \n \n   Application deadline: Review of applications will begin November 29, 2023. Applications received before this date will receive full consideration. Only candidates selected for an interview will be contacted.\n \n \n \n   Location of work: Department of Earth & Environmental Sciences, University of Ottawa, 150 Louis Pasteur Pvt., Ottawa, Ontario K1N 6N5 Canada\n \n \n \n   Other information:\n \n \n   Analytical laboratories on campus include microbeam (SEM, TEM, EMPA), X-ray (SCXRD, PXRD, XRF, Micro-CT), and geochemical (LA-ICP-MS, ICP-ES, ICP-OES) facilities, Canada’s National AE Lalonde Accelerating Mass Spectrometer Laboratory, and noble gas and stable isotope instrumentation. The University of Ottawa is recognized nationally and internationally as one of the best universities in the country and the largest bilingual university in the world. Located on the unceded territory of Anishinabé-Algonquin people, in the heart of downtown Ottawa, it contributes significantly to the economy, culture and quality of life of Canada's Capital.\n \n \n \n   The University of Ottawa is committed to ensuring equity, diversity and inclusion in the scholarly and leadership environments of our students, staff, and faculty. Accordingly, we strongly encourage applications from Indigenous Peoples in Canada, visible minorities members (racialized persons), persons with disabilities, women, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse and inclusive communities. Candidates who wish to be considered as a member of one or more designated groups are asked to complete the confidential Self-Identiﬁcation Questionnaire, to be completed at the time of application.\n \n \n \n   According to government policy, all qualified candidates are invited to apply; however, preference will be given to Canadians and permanent residents. When submitting your application, please indicate if you are legally entitled to work in Canada.\n \n \n \n   The University of Ottawa provides accommodations for applicants with disabilities throughout the recruitment process. If you are invited to proceed in the selection process, please notify us of any accommodations that you require by contacting the Office of the Vice-Provost, Faculty Relations by email at \n  \n   vra.affairesprofessorales@uottawa.ca\n  \n  . Any information you send us will be handled respectfully and in complete confidence.\n \n \n   The University of Ottawa is justly proud of its more than 160-year tradition of bilingualism. Through its Official Languages and Bilingualism Institute, the University provides training to staff members and their spouses in their second official language. At the time of tenure, professors are expected to be able to function in a bilingual setting. In certain cases, professors must have the ability to teach in both official languages to be granted tenure.\n \n \n \n   The University of Ottawa is committed to ensuring equity, diversity, and inclusion in the scholarly and leadership environments of our students, staff, and faculty. Accordingly, we strongly encourage applications from Indigenous Peoples in Canada, visible minorities members (racialized persons), persons with disabilities, women, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse, and inclusive communities. Candidates who wish to be considered as a member of one or more designated groups are asked to complete the confidential Self-Identification Questionnaire, to be completed at the time of application.\n \n \n \n   All qualified candidates are invited to apply; however, preference will be given to Canadians and permanent residents. When submitting your application, please indicate if you are legally entitled to work in Canada\n \n \n \n   The University of Ottawa provides accommodations for applicants with disabilities throughout the recruitment process. If you are invited to proceed in the selection process, please notify us of any accommodations that you require by contacting the Office of the Vice-Provost, Faculty Relations by email at \n  \n   vra.affairesprofessorales@uottawa.ca\n  . Any information you send us will be handled respectfully and in complete confidence.\n \n \n \n   The University of Ottawa is proud of its 160-year tradition of bilingualism. Through its Official Languages and Bilingualism Institute, the University provides training to staff members and to their spouses in their second official language.\n \n \n \n   Prior to May 1, 2022, the University required all students, faculty, staff, and visitors (including contractors) to be fully vaccinated against Covid-19 as defined in Policy 129 – Covid-19 Vaccination. This policy was suspended effective May 1, 2022 but may be reinstated at any point in the future depending on public health guidelines and the recommendations of experts.",
    "preprocessed_description": "Job Family: Academic Leadership and Faculty Union affiliation: APUO Faculty/Department: Department of Earth and Environmental Sciences_FT Campus: STEM Date Posted: octobre 13, 2023 Closing Date: Note: Applications will be accepted until 11:59 Project Manager on the day prior to the Posting End Date above Tenure-track position in Solid Earth Materials The Department of Earth and Environmental Sciences at the University of Ottawa invites applications for a tenure-track position at the rank of Assistant Professor in a field broadly related to solid Earth petrologic processes. We are looking for a scientist with an outstanding track record for innovative research using experimental, theoretical and field-based investigations of structures and processes in rocks to understand the dynamics of geological systems. We are especially interested in candidates with research interests in igneous and metamorphic minerals and microstructures, or ore geology. Candidates with a research focus in the Arctic and that have a solid foundation in field geology are strongly encouraged to apply. The starting date is July 1, 2024. Title of the position: Assistant Professor Duties: The responsibilities include: 1) teach across a broad spectrum of mineralogy or petrology oriented courses; 2) supervision of BSc, MSc and PhD students; 3) develop an externally-funded research program; 4) establish connections with industry and government agencies; and 5) active engagement with the department and faculty by contributing to administrative and academic activities. Rank and salary: Regular tenure-track academic appointment in the Faculty of Science, with a salary consistent with the collective agreement of the Association of Professors of the University of Ottawa. The base salary for assistant professors is $89,622. Contact information: Dr. David Schneider, Department of Earth & Environmental Sciences, University of Ottawa, 150 Louis Pasteur Pvt., Ottawa, Ontario K1N 6N5 Canada, 613-562-5773, EESpost@uottawa.ca Skill requirements: PhD in Earth Sciences, Geology, or Environmental Sciences Postdoctoral experience and excellent didactic skills are an asset Bilingualism: The University of Ottawa is proud to be the largest bilingual (English-French) university in North America and considers bilingualism to be a defining feature of the institution. It is expected that the candidate will be able to function and teach in both official languages by the time of tenure. The University is delighted to offer free training to achieve this aim. Preference may be given to candidates who are able to teach in French at the time of hiring. Application procedure: More information regarding Academic Careers can be found online . Applications must be submitted electronically through the University of Ottawa Careers portal. Candidates should include the following in their application: a cover letter and curriculum vitae a statement summarizing the proposed research program (2-3 pages) strategies of the candidate's pedagogical approach to teaching Earth Sciences (2 pages) a statement addressing past and/or potential contributions to diversity through research, teaching, and/or service (1 page) names and contact details of three professional references Application deadline: Review of applications will begin November 29, 2023. Applications received before this date will receive full consideration. Only candidates selected for an interview will be contacted. Location of work: Department of Earth & Environmental Sciences, University of Ottawa, 150 Louis Pasteur Pvt., Ottawa, Ontario K1N 6N5 Canada Other information: Analytical laboratories on campus include microbeam (SEM, TEM, EMPA), X-ray (SCXRD, PXRD, XRF, Micro-CT), and geochemical (LA-ICP-MS, ICP-ES, ICP-OES) facilities, Canada's National AE Lalonde Accelerating Mass Spectrometer Laboratory, and noble gas and stable isotope instrumentation. The University of Ottawa is recognized nationally and internationally as one of the best universities in the country and the largest bilingual university in the world. Located on the unceded territory of Anishinabé-Algonquin people, in the heart of downtown Ottawa, it contributes significantly to the economy, culture and quality of life of Canada's Capital. The University of Ottawa is committed to ensuring equity, diversity and inclusion in the scholarly and leadership environments of our students, staff, and faculty. Accordingly, we strongly encourage applications from Indigenous Peoples in Canada, visible minorities members (racialized persons), persons with disabilities, women, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse and inclusive communities. Candidates who wish to be considered as a member of one or more designated groups are asked to complete the confidential Self-Identiﬁcation Questionnaire, to be completed at the time of application. According to government policy, all qualified candidates are invited to apply; however, preference will be given to Canadians and permanent residents. When submitting your application, please indicate if you are legally entitled to work in Canada. The University of Ottawa provides accommodations for applicants with disabilities throughout the recruitment process. If you are invited to proceed in the selection process, please notify us of any accommodations that you require by contacting the Office of the Vice-Provost, Faculty Relations by email at vra.affairesprofessorales@uottawa.ca . Any information you send us will be handled respectfully and in complete confidence. The University of Ottawa is justly proud of its more than 160-year tradition of bilingualism. Through its Official Languages and Bilingualism Institute, the University provides training to staff members and their spouses in their second official language. At the time of tenure, professors are expected to be able to function in a bilingual setting. In certain cases, professors must have the ability to teach in both official languages to be granted tenure. The University of Ottawa is committed to ensuring equity, diversity, and inclusion in the scholarly and leadership environments of our students, staff, and faculty. Accordingly, we strongly encourage applications from Indigenous Peoples in Canada, visible minorities members (racialized persons), persons with disabilities, women, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse, and inclusive communities. Candidates who wish to be considered as a member of one or more designated groups are asked to complete the confidential Self-Identification Questionnaire, to be completed at the time of application. All qualified candidates are invited to apply; however, preference will be given to Canadians and permanent residents. When submitting your application, please indicate if you are legally entitled to work in Canada The University of Ottawa provides accommodations for applicants with disabilities throughout the recruitment process. If you are invited to proceed in the selection process, please notify us of any accommodations that you require by contacting the Office of the Vice-Provost, Faculty Relations by email at vra.affairesprofessorales@uottawa.ca . Any information you send us will be handled respectfully and in complete confidence. The University of Ottawa is proud of its 160-year tradition of bilingualism. Through its Official Languages and Bilingualism Institute, the University provides training to staff members and to their spouses in their second official language. Prior to May 1, 2022, the University required all students, faculty, staff, and visitors (including contractors) to be fully vaccinated against Covid-19 as defined in Policy 129 – Covid-19 Vaccination. This policy was suspended effective May 1, 2022 but may be reinstated at any point in the future depending on public health guidelines and the recommendations of experts.",
    "processed_description": "Family Academic Leadership Faculty Union affiliation stem post octobre closing note application accept Project Manager tenure track position invite application tenure track position rank Assistant Professor field broadly relate solid Earth petrologic process . scientist outstanding track record innovative research experimental theoretical field base investigation structure process rock understand dynamic geological system . interested research interest igneous metamorphic mineral microstructure ore geology . research focus solid foundation field geology encouraged apply . starting . title position Assistant Professor duty responsibility include teach broad spectrum mineralogy petrology orient course supervision BSc MSc student develop externally fund research program establish connection industry government agency active engagement department faculty contribute administrative academic activity . rank salary regular tenure track academic appointment salary consistent collective agreement . base salary assistant professor . contact information K1N skill requirement excellent didactic skill asset bilingualism large English French university consider bilingualism define feature institution . expect function teach official language tenure . delighted offer free training achieve aim . teach hiring . application procedure information regard find online . application submit electronically portal . include application cover letter curriculum vitae statement summarize propose research program strategy candidate's pedagogical approach teach statement address potential contribution diversity research teaching service contact detail professional reference Application deadline review application . application receive receive consideration . select interview contact . location K1N information analytical laboratory campus include microbeam SEM ray geochemical ICP MS ICP OES facility noble gas stable isotope instrumentation . recognize nationally internationally good university country large university . locate unceded territory Anishinabe Algonquin people heart contribute economy culture quality life Canada's Capital . commit ensure equity diversity inclusion scholarly leadership environment student staff faculty . encourage application visible minority racialize person person woman qualified skill knowledge productively engage equitable diverse inclusive community . consider designate group complete confidential Identification Questionnaire complete application . accord government policy qualified invite apply preference permanent resident . submit application indicate legally entitle . provide accommodation applicant recruitment process . invite proceed selection process notify accommodation require contact email . information send handle respectfully complete confidence . justly tradition bilingualism . provide training staff spouse second official language . tenure professor expect function setting . case professor teach official language grant tenure . commit ensure equity diversity inclusion scholarly leadership environment student staff faculty . encourage application visible minority racialize person person woman qualified skill knowledge productively engage equitable diverse inclusive community . consider designate group complete confidential Identification Questionnaire complete application . qualified invite apply preference permanent resident . submit application indicate legally entitle provide accommodation applicant recruitment process . invite proceed selection process notify accommodation require contact email . information send handle respectfully complete confidence . tradition bilingualism . provide training staff spouse second official language . prior require student faculty staff visitor include contractor fully vaccinate Covid define Policy – Covid Vaccination . policy suspend effective reinstate point future depend public health guideline recommendation expert .",
    "results_group": {
        "extracted_noun_chunks": [
            "application cover letter curriculum vitae statement",
            "research",
            "microbeam SEM ray geochemical ICP MS ICP",
            "Covid",
            "training staff spouse second official language",
            "equitable diverse inclusive community",
            "scientist outstanding track record innovative research experimental theoretical field base investigation structure process rock",
            "economy culture quality life",
            "noble gas stable isotope instrumentation",
            "broad spectrum mineralogy petrology orient course supervision BSc MSc student",
            "consideration",
            "accord",
            "externally fund research program",
            "Family Academic Leadership Faculty Union affiliation stem post octobre closing note application",
            "K1N",
            "connection industry government agency active engagement department faculty",
            "Project Manager tenure track position",
            "Policy",
            "effective reinstate point future",
            "function setting",
            "rank salary regular tenure track academic appointment salary consistent collective agreement",
            "legally entitle",
            "equity diversity inclusion scholarly leadership environment student staff faculty",
            "application tenure track position rank Assistant Professor field",
            "interested research interest igneous metamorphic mineral microstructure ore geology",
            "confidential Identification Questionnaire complete application",
            "official language grant tenure",
            "student faculty staff visitor",
            "internationally good university country large university",
            "select interview contact",
            "contact email",
            "contractor",
            "permanent resident",
            "Covid Vaccination",
            "Canada's Capital",
            "respectfully complete confidence",
            "applicant recruitment process",
            "contact information K1N skill requirement",
            "bilingualism",
            "accommodation applicant recruitment process",
            "excellent didactic skill asset",
            "delighted offer free training",
            "official language tenure",
            "preference",
            "policy",
            "tradition bilingualism",
            "accommodation",
            "administrative academic activity",
            "visible minority racialize person person woman qualified skill knowledge",
            "base salary assistant professor",
            "large English French university",
            "designate group",
            "unceded territory Anishinabe Algonquin people heart",
            "case professor",
            "solid Earth petrologic process",
            "function",
            "statement address potential contribution diversity research teaching service contact detail professional reference Application deadline review application",
            "application",
            "feature institution",
            "information",
            "aim",
            "proceed selection process",
            "tenure professor",
            "research program strategy candidate's pedagogical approach",
            "title position Assistant Professor duty responsibility",
            "application procedure information regard",
            "government policy",
            "application receive",
            "public health guideline recommendation expert",
            "dynamic geological system"
        ],
        "combined_lemmatized_tokens": "Family Academic Leadership Faculty Union affiliation stem post octobre closing note application accept Project Manager tenure track position invite application tenure track position rank Assistant Professor field broadly relate solid Earth petrologic process . scientist outstanding track record innovative research experimental theoretical field base investigation structure process rock understand dynamic geological system . interested research interest igneous metamorphic mineral microstructure ore geology . research focus solid foundation field geology encouraged apply . starting . title position Assistant Professor duty responsibility include teach broad spectrum mineralogy petrology orient course supervision BSc MSc student develop externally fund research program establish connection industry government agency active engagement department faculty contribute administrative academic activity . rank salary regular tenure track academic appointment salary consistent collective agreement . base salary assistant professor . contact information K1N skill requirement excellent didactic skill asset bilingualism large English French university consider bilingualism define feature institution . expect function teach official language tenure . delighted offer free training achieve aim . teach hiring . application procedure information regard find online . application submit electronically portal . include application cover letter curriculum vitae statement summarize propose research program strategy candidate's pedagogical approach teach statement address potential contribution diversity research teaching service contact detail professional reference Application deadline review application . application receive receive consideration . select interview contact . location K1N information analytical laboratory campus include microbeam SEM ray geochemical ICP MS ICP OES facility noble gas stable isotope instrumentation . recognize nationally internationally good university country large university . locate unceded territory Anishinabe Algonquin people heart contribute economy culture quality life Canada's Capital . commit ensure equity diversity inclusion scholarly leadership environment student staff faculty . encourage application visible minority racialize person person woman qualified skill knowledge productively engage equitable diverse inclusive community . consider designate group complete confidential Identification Questionnaire complete application . accord government policy qualified invite apply preference permanent resident . submit application indicate legally entitle . provide accommodation applicant recruitment process . invite proceed selection process notify accommodation require contact email . information send handle respectfully complete confidence . justly tradition bilingualism . provide training staff spouse second official language . tenure professor expect function setting . case professor teach official language grant tenure . commit ensure equity diversity inclusion scholarly leadership environment student staff faculty . encourage application visible minority racialize person person woman qualified skill knowledge productively engage equitable diverse inclusive community . consider designate group complete confidential Identification Questionnaire complete application . qualified invite apply preference permanent resident . submit application indicate legally entitle provide accommodation applicant recruitment process . invite proceed selection process notify accommodation require contact email . information send handle respectfully complete confidence . tradition bilingualism . provide training staff spouse second official language . prior require student faculty staff visitor include contractor fully vaccinate Covid define Policy – Covid Vaccination . policy suspend effective reinstate point future depend public health guideline recommendation expert ."
    }
}