{
    "id": "812e5aba08fd1e14",
    "companyDescription": "",
    "description": "We are a Quality Fast growing dental lab looking for an office assistant. No experience necessary!\nIt is a very fast paced environment with tight deadlines!\nDuties will include but are not limited to:\n\n Answering phones\n Unpacking/disinfecting dental cases as they arrive\n Packing cases for delivery\n Organizing deliveries\n Data entry\n Keeping lab organized with cases coming out\n Attention to detail is an absolute must!\n Computer skills a must\n Ability to multitask efficiently\n Punctual\n Pleasant phone mannerism\n Work well as a part of our team or individually\n No experience necessary, we are willing to train the right person\n\nHours are Monday to Friday, no weekends!\nBenefits, bonuses, plenty of on site-parking! If this sounds like it could be a good fit for you, please forward your resume.\nHours are Monday to Friday, no weekends!\nJob Types: Full-time, Permanent\nBenefits:\n\n Casual dress\n Dental care\n Extended health care\n On-site parking\n Wellness program\n\nSchedule:\n\n Monday to Friday\n\nEducation:\n\n Secondary School (preferred)\n\nWork Location: In person",
    "preprocessed_description": "We are a Quality Fast growing dental lab looking for an office assistant. No experience necessary! It is a very fast paced environment with tight deadlines! Duties will include but are not limited to: Answering phones Unpacking/disinfecting dental cases as they arrive Packing cases for delivery Organizing deliveries Data entry Keeping lab organized with cases coming out Attention to detail is an absolute must! Computer skills a must Ability to multitask efficiently Punctual Pleasant phone mannerism Work well as a part of our team or individually No experience necessary, we are willing to train the right person Hours are Monday to Friday, no weekends! Benefits, bonuses, plenty of on site-parking! If this sounds like it could be a good fit for you, please forward your resume. Hours are Monday to Friday, no weekends! Job Types: Full-time, Permanent Benefits: Casual dress Dental care Extended health care On-site parking Wellness program Schedule: Monday to Friday Education: Secondary School (preferred) Work Location: In person",
    "processed_description": "Quality Fast grow dental lab office assistant . fast pace environment tight deadline duty include limit answer phone unpack disinfect dental case arrive packing case delivery organizing delivery data entry lab organize case attention detail absolute computer skill multitask efficiently punctual pleasant phone mannerism team individually train person weekend benefit bonus plenty site parking sound good fit forward resume . weekend type permanent benefit casual dress dental care extended health care site parking program Schedule Friday Education preferred location person",
    "results_group": {
        "extracted_noun_chunks": [
            "fast pace environment",
            "case attention detail absolute computer skill",
            "person weekend benefit bonus plenty site parking sound good fit forward resume",
            "punctual pleasant phone mannerism team",
            "tight deadline duty",
            "delivery data entry lab",
            "weekend type permanent benefit casual dress dental care extended health care site parking program Schedule Friday Education preferred location person",
            "Quality Fast",
            "dental lab office assistant"
        ],
        "combined_lemmatized_tokens": "Quality Fast grow dental lab office assistant . fast pace environment tight deadline duty include limit answer phone unpack disinfect dental case arrive packing case delivery organizing delivery data entry lab organize case attention detail absolute computer skill multitask efficiently punctual pleasant phone mannerism team individually train person weekend benefit bonus plenty site parking sound good fit forward resume . weekend type permanent benefit casual dress dental care extended health care site parking program Schedule Friday Education preferred location person"
    }
}