{
    "id": "50f42bbba690fc30",
    "company": "Equispheres Inc",
    "positionName": "Materials Laboratory Technician",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-11-16T20:15:11.174Z",
    "url": "https://www.indeed.ca/rc/clk?jk=50f42bbba690fc30&from=jasx&tk=1hgol2euhk7i3800&vjs=3",
    "externalApplyLink": "https://equispheres.bamboohr.com/careers/41?source=indeed&src=indeed&postedDate=2023-11-15",
    "companyDescription": "",
    "description": "Materials Laboratory Technician\n \n  Who We Are \n  Equispheres is a materials science engineering firm specializing in high-performance metal powders for additive manufacturing (i.e., 3D printing) in the automotive, aerospace, and defense industries. We focus on developing innovative, clean-tech solutions with our deep knowledge of metallurgy and metal technology. Our industry-disruptive atomization technology produces metal powders with unique characteristics that enables additive manufacturing to produce faster, stronger, and lighter parts at a cost that competes economically with traditional manufacturing techniques.\n \n  Equispheres’ team of researchers, metallurgists, engineers, and manufacturing professionals lead the world in metal powder expertise for additive manufacturing, allowing us to offer products and related applications expertise required to meet the demanding needs of our aerospace, automotive, industrial and defense customers.\n \n  The Role \n  Equispheres is currently seeking an experienced Materials Laboratory Technician to join our growing technical team. \n  We are a fast-paced and demanding start-up environment, engaged in the continued development and commercialization of existing and future production processes.\n \n  This role will consist of: \n  \n  Diligent preparation and testing of incoming and outgoing materials and products using a variety of laboratory procedures and equipment. \n  Taking samples, recording sample information, preparation of metallurgical samples. \n  Performing tests ensuring that the procedures and directives are adhered to. \n  Communicating results effectively and participating in troubleshooting. \n  Supporting calibration and maintenance of laboratory equipment. \n  Monitoring, managing and procuring lab supplies. \n  Other tasks as may be assigned.\n \n  \n  \n  The ideal applicant will have demonstrated hands-on experience within a metallurgical laboratory setting – ideally supporting the demands of a production environment.\n \n  This position will work within the Equispheres technical team working closely with the Senior Metallurgist.\n \n  Qualifications & Skills: \n  Minimum Requirements: \n  \n  Must have completed a post-secondary college diploma or similar course – ideally in materials, metallurgy, or a closely related field. \n  Must have 4+ years (ideally 6+) years of experience in a metallurgical or materials laboratory ideally within a production or pilot plant setting. \n  Demonstrated experience in following detailed process instructions and operating laboratory instruments. \n  Demonstrated experience in performing simple analysis, writing laboratory reports, and collecting and compiling test results. \n  Experience with managing maintenance and calibration needs of laboratory equipment. \n  Must be organized, diligent and have strong attention to detail. \n  Basic level computer skills to perform simple analysis and write laboratory reports using the Microsoft Office Suite. \n  Knowledge and experience of health and safety regulations. \n  The ideal applicant will have hands-on experience and be capable of performing additional tasks as required within an ISO 9001 or AS9100 environment. \n \n Desired Requirements: \n  \n  Experience with the preparation and metallographic analysis of aluminum samples. \n  Experience with the characterization of metallic powder including powder flow testing, sieve analysis, apparent density and microstructure. \n  Demonstrated experience using SEM, EDS and ICP-OES. \n  Experience using image analysis software to process optical microscopic images.\n \n  \n  \n  Working at Equispheres \n  Equispheres values integrity, equity, respect, compassion and dignity and is committed to provide a positive, open, inclusive, accessible work environment that applies and embodies those values. At Equispheres, we all contribute to making the environment a positive and great place for everyone. We believe this is critical to our success. Safety is always important – follow, respect and be a champion of safe practices.\n \n  Compensation Package \n  Equispheres is proud to offer all our employees an opportunity to participate in our share options program as well as a competitive salary and great benefits plan.\n \n  Term \n  Full-time, indeterminate. \n  A typical standard 40-hour work schedule, but with some flexibility on occasion to support issues beyond standard hours.\n \n  Location \n  Kanata, Ontario\n \n  Travel \n  Less than 5%. \n  Equispheres is an equal opportunity employer, with policies and practices intended to build an inclusive and accessible work environment. \n  If you require accommodation during the recruitment process, please include in your cover letter when applying for the position and all efforts to provide the appropriate accommodation will be put into place.\n \n \n   If you require accommodation during the recruitment process, please include in your cover letter when applying for the position and all efforts to provide the appropriate accommodation will be put into place."
}