{
    "id": "12c9f68e3ea2018b",
    "company": "The Anglican Diocese of Ottawa",
    "positionName": "Kitchen Assistant",
    "jobType": [
        "Permanent",
        "Full-time"
    ],
    "location": "The Anglican Diocese of Ottawa in Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-04T03:14:07.840Z",
    "url": "https://www.indeed.ca/rc/clk?jk=12c9f68e3ea2018b&from=jasx&tk=1hjm3csar2cja000&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "Mission Statement\nBelong Ottawa offers support to homeless and vulnerably housed people to ensure health and well-being, nourishment, and social connection. Our programs promote equity and address barriers such as housing, food and income insecurity. Everyone who comes to our agencies will be given the opportunity to have their individual needs addressed through a variety of services unique to each program and space. Our mission is to provide safe spaces that connect people and create a community in which we foster dignity, wellness and hope for all.\nJob Summary\nThe Kitchen Supervisor reports to the Program Manager and is responsible for planning and preparing healthy food for our participants. Kitchen Supervisor’s role is a key factor at our drop-in programs, they produce quality meal services, that are consistent, and in line with our standards, mission and values.\nDuties and Responsibilities\n\n Daily opening of the kitchen, ensuring the kitchen is clean and prepared for daily service. This includes preparing the coffee station, ensuring supplies are stocked and that the kitchen is clean and ready for daily operation.\n Preparation of meals. This includes the preparation and cooking hot breakfasts as well as hot lunches daily, ensuring nutritional content while still operating within the budgetary restrictions.\n Maintaining the Community Fridge, ensuring all leftovers are containerized at the end of the day and made available to the participants as well as any unused items ordered from Food Bank are placed in the community fridge.\n Maintaining statistics and reporting them to management as well as Food Bank and using these numbers to plan accordingly month over month.\n Planning and preparing weekend and vacation days meals in advance and ensuring that volunteers and staff are fully informed on the plan.\n Working with related agencies to share information and ensure that any and all extra supplies/food is delivered to the appropriate place.\n Handling daily deliveries from several different suppliers and ensuring all items are properly stored and inventoried.\n Ensuring a running inventory of supplies and food and placing orders from suppliers both weekly and on a need basis.\n Setting a weekly menu and ensuring the ingredients and supplies are available as needed 7 days a week.\n Supporting the staff with requests related to food or supplies. Including ensuring everything is ready in case of door service and any individual requests such as emergency food packages.\n Responsible for training and supervising a crew of volunteers. Ensuring all volunteers are working together and are comfortable in the kitchen environment as well as following all health and safety protocols.\n Washing and appropriately storing all cooking appliances, instruments, utensils and cooking implements.\n Serving/overseeing service of meals and interacting with participants in a professional manner\n Ensuring all health and safety protocols are followed and working with the appropriate health authorities to maintain the continuation of the Inspection Certificate.\n Maintaining all required trainings and certifications including Food Handlers, WHMIS & First Aid\n Maintaining the facilities related to kitchen and working with outside companies to schedule and oversee work. (ex: grease trap cleanings)\n Have a running inventory of programs’ fridges/freezers and maintain a knowledge of the available items to cut down on any double ordering.\n Working with staff to prepare for and serve events such as BBQ’s and holiday meals.\n End of day shut down of the kitchen, making sure that it is clean and ready for the next shift.\n\nJob Requirements and Qualifications\n\n Culinary Management Ontario College Diploma (preferred) or minimum three years experience working in kitchens in a leadership role.\n A valid food handler's license, or willingness to acquire.\n The ability to work in a fast-paced environment.\n The ability to work independently and within a team; ability to perform job duties with minimal supervision.\n Excellent organizational and time management skills.\n Ability to plan and offer training and workshops for participants of the centre.\n Effective communication skills: A demonstrated understanding and proven sensitivity to the need of men and women related to social determinants of health including poverty, homelessness, addictions, mental illness, trauma, discrimination, and other personal and systemic challenges.\n Ability to work with men and women of diverse cultural and religious backgrounds.\n Demonstrated ability to problem solve and maintain a professional approach during stressful situations.\n\nOther Qualifications:\n\n Minimum 6 months experience working with people from marginalized communities and diverse populations.\n An optimistic and empathetic attitude as well as a strong sense of compassion for displaced people.\n A client-centered, non-judgmental, trauma-informed approach is essential.\n Demonstrated experience with vulnerable individuals.\n\nPhysical Abilities:\nthe role requires long periods of mobility with the understanding that the work differs from day to day. Heavy lifting involved in this position and requires the ability to stand for extended periods.\nWhere to submit your requirements:\n\n Submit your resume and cover letter by applying to our site provided here.\n\nWhile all applications will be gratefully received, only individuals selected for further consideration will be contacted. The Anglican Diocese of Ottawa reserves the right to contact individuals and to arrange for interviews at any time.\nOur organization is committed to creating a diverse environment and is proud to be an equal-opportunity employer. All qualified applicants will receive consideration for employment without regard to race, colour, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, age, veteran status, or disability. We will accommodate the needs of applicants under the Ontario Human Rights Code and the Accessibility for Ontarians with Disabilities Act (AODA). Please advise during the search process if you require accommodation by contacting us at hr@ottawa.anglican.ca\nJob Types: Full-time, Permanent\nSalary: $19.38 per hour\nBenefits:\n\n Company pension\n Dental care\n Employee assistance program\n Extended health care\n Life insurance\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n Day shift\n Weekends as needed\n\nWork Location: In person"
}