{
    "id": "0dfb0cb6ca7d7821",
    "companyDescription": "",
    "description": "Position: Regulatory Affairs Manager \n\nLocation: Quebec or Ontario (Hybrid / Flexibility Policy) \n\nProducts Portfolio: Industrial Chemicals, Mining, Oil & Gas, HI&I, Chemical Adhesives, Coatings, Food, Nutritional Ingredients and much more. \n\nStatus: Permanent, full-time \n\n We are seeking a Regulatory Affairs Manager to join our Regulatory Affairs Team that spans our Canadian and US portfolio. The ideal candidate will have experience industrial chemical industry. Reporting to the Director, Compliance, the Regulatory Affairs Manager plays a key role in expanding Quadra’s portfolio of products in Canada and in the United-States. This person will be responsible for managing the activities of his or her team while leading the new products screening procedures in order to meet our effective compliance program. \n\n As a strong regulatory manager, you will bring your comprehensive knowledge of regulatory compliance, meticulous attention to detail, and strong analytical skills to ensure our organization's adherence to regulatory requirements. In this role, you will have the opportunity to lead and inspire a talented team, fostering a culture of excellence and driving successful outcomes. By joining our team as a Regulatory Affairs Manager, you will be instrumental in shaping the future of our organization and making a positive difference for our valued clients. \n\n About your future team \nAt Quadra, we put people first so that together, we can reimagine the possibilities. \nBased in Burlington, Ontario or Vaudreuil-Dorion, Quebec, our modern head office is home to over a hundred fun-loving professionals. Of course, you can always take advantage of our hybrid telecommuting policy. Founded over 45 years ago, Quadra is dedicated to its 550+ employees located in Canada and the United States. Quadra Chemicals is one of the largest distributors of chemicals and ingredients in the Canadian marketplace. With multiple facilities across Canada, we are committed to delivering excellence in everything we do. We are a rapidly growing company with a long-term commitment to our employees. If you are committed to excellence, you belong at Quadra. At Quadra, we have created an environment where people are a priority and opportunities are growing. Our culture based on our core values of entrepreneurship, innovation and caring make us an employer of choice. \n\n We believe in fostering a work environment that challenges and empowers individuals, providing ample opportunities for personal growth and development. We recognize and celebrate outstanding performance, ensuring that your dedication and achievements are duly acknowledged. \n\n What will you bring to the team? \n\n \n A strong technical knowledge of pertinent government regulations and associated compliance requirements as well as insight in determining compliance pathways for new business areas developed by the company \n Being an active member with industry associations, including, but not limited to, participation on the Responsible Distribution Canada’s and NACD \n Excels in managing priorities, is resourceful and a relationship-builder \n Being known as a positive leader that works well with cross-functional teams (QA, Sales, Operations, etc.) \n Being acknowledged by peers as an expert in order to respond to external requests related to regulatory affairs \n Excellent communicator, focused on customer service, curious and eager to achieve excellence for his/her team \n Strong attention to detail, accuracy and precision \n A passion for the industry with a desire to share with your peers \n \nYou would be responsible for:\nTeam Management:\n \n \n Leading day-to-day Regulatory Affairs compliance activity regarding pertinent chemical, food and pharmaceutical regulations as they apply to the Canadian and US chemical distribution industry sector \n Leading department workflow to ensure a structured approach to compliance activity \n Ensuring that regulatory compliance activity meets all government requirements, and that department output is meeting Quadra’s commercial needs for efficient integration of compliance oversight in business operations \n Supervision of team members; establish departmental goals, action plans and strategies as well as mentoring/coaching, managing performance, hiring, onboarding, etc. \n Work in collaboration with the Director, Compliance Assurance to establish department goals and objectives \n New Product Regulatory Evaluation and Set-Up, Ongoing Regulation Compliance: \n\n \n Development and implementation of efficient Regulatory Affairs procedures to determine the CEPA/TSCA status of all new products and the identity of product ingredients \n Mentoring the Regulatory Affairs team regarding CEPA new substance screening activities \n Managing new product screening procedures that encompass compliance with many other product use regulations which reflect the wide diversity of industry sectors served: Food & Drugs Act and associated regulations, Transportation of Dangerous Goods Regulations, Drug Precursor Regulations, Explosive Regulations, WHMIS/GHS and additional Quadra internal requirements such as product High Risk classification \n Management of new product set-up workflow to facilitate a robust and efficient compliance program \n Product Registration Activity: Preparation and submission of pertinent product use approval submissions (i.e. NSN, fertilizers, animal feeds, pesticides, biocides, Food & Drug related use approvals, etc.) \n Management of regulation compliance (for existing regulations) to include procedure revisions when regulations are updated \n CEPA and TSCA Substances Management \n\n \n Monitoring of Canada Gazette and other industry association resources to identify government mandated reporting activities associated with chemical product importation and sales \n Supervising Quadra Significant New Activity Canada (SNAC) and Significant New Use (SNAN) submission activities \n Product Safety – WHMIS 2015 and US GHS Compliance \n\n \n Ensuring software resources are kept current and operating at full efficiency \n Management of product safety workflow to facilitate priority requirements \n Communicating with Quadra employees to ensure their awareness of system tools, including training requirements regarding the WHMIS 2015 and US GHS hazard communication system \n Assist in the preparation and presentation of ad hoc and routine department and management reports including compiling Chemical Data Reports (CDR) \n How will you be successful in this Regulatory Affairs Manager role? \n\n \n Possessing a master’s degree in strategic management, business administration or a Graduate certificate in Regulatory Affairs would be considered as an asset \n Bachelor's degree in Chemistry, Life Sciences, or any related field to science industry \n Minimum of 10-12 years of experience as a Regulatory Affairs Manager, Regulatory Affairs Supervisor, or other experience in the field of expertise with at least 8 years in the pharmaceutical, food ingredients or chemical industry (manufacturing or distribution) \n Thorough knowledge of regulatory affairs requirements for chemical industrial, energy and/or mining \n Proven experience in team management/leadership including performance management, recruitment, coaching and mentoring \n Strong knowledge of the Canadian Environmental Protection Act (CEPA) and the Toxic Substances Control Act (TSCA) \n Strong knowledge of Environment Canada’s new and existing substance programs and their various initiatives (Chemical Management Plan, Section 71 mandatory surveys, voluntary surveys, DSL updates, etc.) and required compliance requirements \n Knowledge of WHMIS 2015 regulations the associated classification criteria and system elements including WHMIS ingredient trade secret submissions \n Advanced knowledge of Canadian and US federal and provincial requirements \n Excellent oral and written communication skills, primarily in English. Bilingualism (French and English) will be mandatory to work from our Vaudreuil Office \n Advanced experience with the Office Suite as well as hands-on practical experience with Salesforce would be an asset \n Open to travel between Burlington and Vaudreuil if needed (Limited travel, less than 10%) \n At Quadra, we offer not only an engaging culture, a collaborative, family-oriented and supportive environment, but also plenty of autonomy and flexibility. We also offer you the opportunity to be part of a professional, fun, innovative and committed team in a growing, people-oriented, Great Place to Work® certified organization. In addition to being Great Place to Work® certified, Quadra has been recognized as one of the Best Managed Companies for over 20 years and as a Great Place to Work for Women®! You will work with dynamic colleagues who are eager to share their knowledge with you. \n\n Benefits for choosing Quadra? \n\n \n Enjoy a permanent full-time position with stability \n Benefit from a competitive salary and an enticing performance incentive program \n Receive excellent benefits coverage (dental, medical, and much more!) \n Programs offered to employees to improve their quality of life (Wellness Portfolio) \n Virtual care/telemedicine for you and your loved ones; 24/7 access to a physician \n Virtual wellness and mental health programs with a global healthcare leader \n Retirement plan with a match and several long-term investment programs \n Take advantage of personal, & flexible days as well as vacation time \n Telecommuting and flexibility within the organization \n Experience a great work environment every day where caring for each other and having fun are integral to our core values \n Be part of a company that promotes diversity, equity, and inclusion \n Digital environment \n Customized training built for you \n Opportunities for advancement and professional development; a growing company that focuses on its people! \n Participate in various internal and external trainings \n Possibility of joining various company committees \n Engage in social activities organized by the company \n Employee recognition program (years of service, merit awards, etc.) \n Private and family-owned company with a solid infrastructure \n Employee assistance program (EAP) \n Monthly cell phone & internet allowance \n And much more! \n If you are ready to unlock your potential, make a meaningful impact, and embark on a rewarding career in Regulatory Affairs, we warmly invite you to submit your resume, highlighting your experience and enthusiasm for this field. Let us join forces to redefine excellence in customer service, shaping a brighter future for Quadra and our esteemed clients. \n\n Quadra supports and values diversity and offer equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status and gender identity. Quadra also welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process. We recognize that some people do not identify themselves as either male or female. Therefore, whenever possible, we have opted for a gender-neutral (or gender-neutral) wording in a non-discriminatory spirit.",
    "preprocessed_description": "Position: Regulatory Affairs Manager Location: Quebec or Ontario (Hybrid / Flexibility Policy) Products Portfolio: Industrial Chemicals, Mining, Oil & Gas, HIandI, Chemical Adhesives, Coatings, Food, Nutritional Ingredients and much more. Status: Permanent, full-time We are seeking a Regulatory Affairs Manager to join our Regulatory Affairs Team that spans our Canadian and US portfolio. The ideal candidate will have experience industrial chemical industry. Reporting to the Director, Compliance, the Regulatory Affairs Manager plays a key role in expanding Quadra's portfolio of products in Canada and in the United-States. This person will be responsible for managing the activities of his or her team while leading the new products screening procedures in order to meet our effective compliance program. As a strong regulatory manager, you will bring your comprehensive knowledge of regulatory compliance, meticulous attention to detail, and strong analytical skills to ensure our organization's adherence to regulatory requirements. In this role, you will have the opportunity to lead and inspire a talented team, fostering a culture of excellence and driving successful outcomes. By joining our team as a Regulatory Affairs Manager, you will be instrumental in shaping the future of our organization and making a positive difference for our valued clients. About your future team At Quadra, we put people first so that together, we can reimagine the possibilities. Based in Burlington, Ontario or Vaudreuil-Dorion, Quebec, our modern head office is home to over a hundred fun-loving professionals. Of course, you can always take advantage of our hybrid telecommuting policy. Founded over 45 years ago, Quadra is dedicated to its 550+ employees located in Canada and the United States. Quadra Chemicals is one of the largest distributors of chemicals and ingredients in the Canadian marketplace. With multiple facilities across Canada, we are committed to delivering excellence in everything we do. We are a rapidly growing company with a long-term commitment to our employees. If you are committed to excellence, you belong at Quadra. At Quadra, we have created an environment where people are a priority and opportunities are growing. Our culture based on our core values of entrepreneurship, innovation and caring make us an employer of choice. We believe in fostering a work environment that challenges and empowers individuals, providing ample opportunities for personal growth and development. We recognize and celebrate outstanding performance, ensuring that your dedication and achievements are duly acknowledged. What will you bring to the team? A strong technical knowledge of pertinent government regulations and associated compliance requirements as well as insight in determining compliance pathways for new business areas developed by the company Being an active member with industry associations, including, but not limited to, participation on the Responsible Distribution Canada's and NACD Excels in managing priorities, is resourceful and a relationship-builder Being known as a positive leader that works well with cross-functional teams (Quality Assurance, Sales, Operations, etc.) Being acknowledged by peers as an expert in order to respond to external requests related to regulatory affairs Excellent communicator, focused on customer service, curious and eager to achieve excellence for his/her team Strong attention to detail, accuracy and precision A passion for the industry with a desire to share with your peers You would be responsible for: Team Management: Leading day-to-day Regulatory Affairs compliance activity regarding pertinent chemical, food and pharmaceutical regulations as they apply to the Canadian and US chemical distribution industry sector Leading department workflow to ensure a structured approach to compliance activity Ensuring that regulatory compliance activity meets all government requirements, and that department output is meeting Quadra's commercial needs for efficient integration of compliance oversight in business operations Supervision of team members; establish departmental goals, action plans and strategies as well as mentoring/coaching, managing performance, hiring, onboarding, etc. Work in collaboration with the Director, Compliance Assurance to establish department goals and objectives New Product Regulatory Evaluation and Set-Up, Ongoing Regulation Compliance: Development and implementation of efficient Regulatory Affairs procedures to determine the CEPA/TSCA status of all new products and the identity of product ingredients Mentoring the Regulatory Affairs team regarding CEPA new substance screening activities Managing new product screening procedures that encompass compliance with many other product use regulations which reflect the wide diversity of industry sectors served: Food & Drugs Act and associated regulations, Transportation of Dangerous Goods Regulations, Drug Precursor Regulations, Explosive Regulations, WHMIS/GHS and additional Quadra internal requirements such as product High Risk classification Management of new product set-up workflow to facilitate a robust and efficient compliance program Product Registration Activity: Preparation and submission of pertinent product use approval submissions (i.e. NSN, fertilizers, animal feeds, pesticides, biocides, Food & Drug related use approvals, etc.) Management of regulation compliance (for existing regulations) to include procedure revisions when regulations are updated CEPA and TSCA Substances Management Monitoring of Canada Gazette and other industry association resources to identify government mandated reporting activities associated with chemical product importation and sales Supervising Quadra Significant New Activity Canada (SNAC) and Significant New Use (SNAN) submission activities Product Safety – WHMIS 2015 and US GHS Compliance Ensuring software resources are kept current and operating at full efficiency Management of product safety workflow to facilitate priority requirements Communicating with Quadra employees to ensure their awareness of system tools, including training requirements regarding the WHMIS 2015 and US GHS hazard communication system Assist in the preparation and presentation of ad hoc and routine department and management reports including compiling Chemical Data Reports (CDR) How will you be successful in this Regulatory Affairs Manager role? Possessing a master's degree in strategic management, business administration or a Graduate certificate in Regulatory Affairs would be considered as an asset Bachelor's degree in Chemistry, Life Sciences, or any related field to science industry Minimum of 10-12 years of experience as a Regulatory Affairs Manager, Regulatory Affairs Supervisor, or other experience in the field of expertise with at least 8 years in the pharmaceutical, food ingredients or chemical industry (manufacturing or distribution) Thorough knowledge of regulatory affairs requirements for chemical industrial, energy and/or mining Proven experience in team management/leadership including performance management, recruitment, coaching and mentoring Strong knowledge of the Canadian Environmental Protection Act (CEPA) and the Toxic Substances Control Act (TSCA) Strong knowledge of Environment Canada's new and existing substance programs and their various initiatives (Chemical Management Plan, Section 71 mandatory surveys, voluntary surveys, DSL updates, etc.) and required compliance requirements Knowledge of WHMIS 2015 regulations the associated classification criteria and system elements including WHMIS ingredient trade secret submissions Advanced knowledge of Canadian and US federal and provincial requirements Excellent oral and written communication skills, primarily in English. Bilingualism (French and English) will be mandatory to work from our Vaudreuil Office Advanced experience with the Office Suite as well as hands-on practical experience with Salesforce would be an asset Open to travel between Burlington and Vaudreuil if needed (Limited travel, less than 10%) At Quadra, we offer not only an engaging culture, a collaborative, family-oriented and supportive environment, but also plenty of autonomy and flexibility. We also offer you the opportunity to be part of a professional, fun, innovative and committed team in a growing, people-oriented, Great Place to Work® certified organization. In addition to being Great Place to Work® certified, Quadra has been recognized as one of the Best Managed Companies for over 20 years and as a Great Place to Work for Women®! You will work with dynamic colleagues who are eager to share their knowledge with you. Benefits for choosing Quadra? Enjoy a permanent full-time position with stability Benefit from a competitive salary and an enticing performance incentive program Receive excellent benefits coverage (dental, medical, and much more!) Programs offered to employees to improve their quality of life (Wellness Portfolio) Virtual care/telemedicine for you and your loved ones; 24/7 access to a physician Virtual wellness and mental health programs with a global healthcare leader Retirement plan with a match and several long-term investment programs Take advantage of personal, & flexible days as well as vacation time Telecommuting and flexibility within the organization Experience a great work environment every day where caring for each other and having fun are integral to our core values Be part of a company that promotes diversity, equity, and inclusion Digital environment Customized training built for you Opportunities for advancement and professional development; a growing company that focuses on its people! Participate in various internal and external trainings Possibility of joining various company committees Engage in social activities organized by the company Employee recognition program (years of service, merit awards, etc.) Private and family-owned company with a solid infrastructure Employee assistance program (EAP) Monthly cell phone & internet allowance And much more! If you are ready to unlock your potential, make a meaningful impact, and embark on a rewarding career in Regulatory Affairs, we warmly invite you to submit your resume, highlighting your experience and enthusiasm for this field. Let us join forces to redefine excellence in customer service, shaping a brighter future for Quadra and our esteemed clients. Quadra supports and values diversity and offer equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status and gender identity. Quadra also welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process. We recognize that some people do not identify themselves as either male or female. Therefore, whenever possible, we have opted for a gender-neutral (or gender-neutral) wording in a non-discriminatory spirit.",
    "processed_description": "position Regulatory Affairs Manager Location hybrid Flexibility policy Products Portfolio Industrial Chemicals Mining Oil Gas HIandI . status permanent seek Regulatory Affairs Manager join span canadian portfolio . ideal industrial chemical industry . report Director Compliance Regulatory Affairs Manager play key role expand Quadra's portfolio product . person responsible manage activity team lead product screening procedure order meet effective compliance program . strong regulatory manager bring comprehensive knowledge regulatory compliance meticulous attention detail strong analytical skill ensure organization's adherence regulatory requirement . role lead inspire talented team foster culture excellence drive successful outcome . join team Regulatory Affairs Manager instrumental shape future organization positive difference client . future team people reimagine possibility . base modern head office fun love professional . course advantage hybrid telecommuting policy . dedicate + employee locate . large distributor chemical ingredient canadian marketplace . multiple facility committed deliver excellence . rapidly grow company long term commitment employee . commit excellence belong . create environment people priority grow . culture base core entrepreneurship innovation caring employer choice . foster environment challenge empower individual provide ample personal growth development . recognize celebrate outstanding performance ensure dedication achievement duly acknowledge . bring team strong technical knowledge pertinent government regulation associated compliance requirement insight determine compliance pathway business area develop company active industry association include limit participation manage priority resourceful relationship builder positive leader cross functional team Quality Assurance sale . acknowledge peer expert order respond external request relate regulatory affair Excellent communicator focus customer service curious eager achieve excellence team strong attention detail accuracy precision passion industry desire share peer responsible lead compliance activity regard pertinent chemical food pharmaceutical regulation apply canadian chemical distribution industry sector lead department workflow ensure structured approach compliance activity ensure regulatory compliance activity meet government requirement department output meet Quadra's commercial efficient integration compliance oversight business operation Supervision team establish departmental goal action plan strategy mentoring coaching manage performance hiring onboarding . collaboration Director Compliance Assurance establish department goal objective Ongoing Regulation Compliance development implementation efficient Regulatory Affairs procedure determine CEPA TSCA status product identity product ingredient team regard CEPA substance screening activity manage product screening procedure encompass compliance product regulation reflect wide diversity industry sector serve associate regulation Drug Precursor Regulations Explosive Regulations WHMIS GHS additional Quadra internal requirement product High risk classification management product set workflow facilitate submission pertinent product approval submission fertilizer animal feed pesticide biocide relate approval . management regulation compliance exist regulation include procedure revision regulation update industry association resource identify government mandate reporting activity associate chemical product importation sale SNAC submission activity – WHMIS GHS compliance ensure software resource current operate efficiency management product safety workflow facilitate priority requirement communicate Quadra employee ensure awareness system tool include training requirement regard GHS hazard communication system assist preparation presentation ad hoc routine department management report include compile CDR successful Regulatory Affairs Manager role possess master's degree strategic management business administration graduate certificate consider asset Bachelor's degree field science industry Minimum Regulatory Affairs Manager Regulatory Affairs Supervisor field expertise pharmaceutical food ingredient chemical industry manufacturing distribution thorough knowledge regulatory affair requirement chemical industrial energy mining proven team management leadership include performance management recruitment coach mentor strong knowledge TSCA strong knowledge Environment Canada's exist substance program initiative mandatory survey voluntary survey DSL update . require compliance requirement regulation associated classification criterion system element include WHMIS ingredient trade secret submission advanced knowledge canadian federal provincial requirement excellent oral write communication skill . Bilingualism mandatory Vaudreuil Office advanced Office Suite hand practical asset Open travel limited travel offer engaging culture collaborative family orient supportive environment plenty autonomy flexibility . offer professional fun innovative committed team certify organization . addition Great Place ® certify recognize Best Managed Companies Great Place Women ® dynamic colleague eager share knowledge . benefit choose enjoy permanent position stability benefit competitive salary enticing performance incentive program receive excellent benefit coverage dental medical program offer employee improve quality life Wellness Portfolio virtual care telemedicine loved access physician virtual wellness mental health program global healthcare leader Retirement plan match long term investment program advantage personal flexible vacation telecommuting flexibility organization great environment care fun integral core company promote diversity equity inclusion Digital environment customize training build Opportunities advancement professional development grow company focus people participate internal external training possibility join company committee engage social activity organize company Employee recognition program service merit award . private family company solid infrastructure employee assistance program monthly cell phone internet allowance ready unlock potential meaningful impact embark rewarding career warmly invite submit resume highlight enthusiasm field . join force redefine excellence customer service shape bright future esteemed client . support diversity offer equal employment race color ancestry religion sex national origin sexual orientation age citizenship marital status gender identity . encourage application people . accommodation request aspect selection process . recognize people identify male female . opt gender neutral gender neutral wording discriminatory spirit .",
    "results_group": {
        "extracted_noun_chunks": [
            "equal employment race color ancestry religion sex national origin",
            "GHS hazard communication system",
            "strong attention detail accuracy precision passion industry desire",
            "associate regulation Drug Precursor Regulations Explosive Regulations",
            "effective compliance program",
            "culture base core entrepreneurship innovation",
            "WHMIS GHS compliance",
            "government mandate",
            "product screening procedure order",
            "Quadra's portfolio product",
            "social activity",
            "awareness system tool",
            "application people",
            "support",
            "Regulatory Affairs Manager",
            "possibility",
            "dental medical program",
            "Quadra's commercial efficient integration compliance oversight business operation Supervision team",
            "base modern head office fun",
            "male female",
            "force",
            "Regulatory Affairs Manager Location hybrid Flexibility policy Products Portfolio Industrial Chemicals Mining Oil Gas",
            "hybrid telecommuting policy",
            "long term investment program advantage personal flexible vacation telecommuting flexibility organization great environment",
            "organization's adherence regulatory requirement",
            "approval",
            "product screening procedure",
            "priority requirement",
            "report",
            "rewarding career",
            "comprehensive knowledge regulatory compliance meticulous attention detail",
            "activity associate chemical product importation sale",
            "excellence team",
            "private family company solid infrastructure employee assistance program monthly cell phone internet allowance",
            "environment people priority",
            "Ongoing Regulation Compliance development implementation efficient Regulatory Affairs procedure",
            "employer choice",
            "excellence",
            "procedure revision regulation update industry association resource",
            "professional fun innovative committed team",
            "canadian chemical distribution industry sector lead",
            "wide diversity industry sector",
            "role lead",
            "ideal industrial chemical industry",
            "software resource current operate efficiency management product safety workflow",
            "strong technical knowledge pertinent government regulation associated compliance requirement insight",
            "priority resourceful relationship builder positive leader",
            "permanent position stability",
            "asset Bachelor's degree field science industry Minimum Regulatory Affairs Manager Regulatory Affairs Supervisor field expertise pharmaceutical food ingredient chemical industry manufacturing distribution thorough knowledge regulatory affair requirement chemical industrial energy mining proven team management leadership",
            "CDR successful Regulatory Affairs Manager role",
            "diversity equity inclusion Digital environment",
            "performance management recruitment coach mentor strong knowledge TSCA strong knowledge Environment Canada's exist substance program initiative mandatory survey voluntary survey DSL update",
            "excellence customer service shape bright future esteemed client",
            "key role",
            "gender neutral gender neutral wording discriminatory spirit",
            "company long term commitment employee",
            "sexual orientation age citizenship marital status gender identity",
            "department workflow",
            "company",
            "limit participation",
            "team Regulatory Affairs Manager instrumental shape future organization positive difference client",
            "functional team Quality Assurance sale",
            "collaboration Director Compliance Assurance",
            "team",
            "peer responsible lead compliance activity",
            "master's degree strategic management business administration graduate certificate",
            "Quadra employee",
            "ample personal growth development",
            "training requirement regard",
            "department goal objective",
            "future team people",
            "practical asset Open travel limited travel",
            "status",
            "span canadian portfolio",
            "internal external training possibility",
            "CEPA substance screening activity",
            "submission pertinent product approval submission fertilizer animal feed pesticide biocide",
            "Director Compliance Regulatory Affairs Manager",
            "WHMIS GHS additional Quadra internal requirement product High risk classification management product",
            "regulation",
            "excellent benefit coverage",
            "professional development",
            "structured approach compliance activity",
            "people",
            "strong analytical skill",
            "quality life Wellness Portfolio virtual care telemedicine loved access physician virtual wellness mental health program global healthcare leader Retirement plan",
            "CEPA TSCA status product identity product ingredient team",
            "course",
            "employee",
            "Opportunities advancement",
            "company Employee recognition program service merit award",
            "foster environment challenge",
            "company active industry association",
            "government requirement department output",
            "position",
            "WHMIS ingredient trade secret submission advanced knowledge canadian federal provincial requirement excellent oral write communication skill",
            "Bilingualism mandatory Vaudreuil Office",
            "compliance pathway business area",
            "customer service",
            "preparation presentation ad hoc routine department management report",
            "dedication achievement",
            "regulatory compliance activity",
            "person responsible manage activity team",
            "large distributor chemical ingredient canadian marketplace",
            "compliance product regulation",
            "external request",
            "multiple facility",
            "regulatory affair Excellent communicator",
            "accommodation request aspect selection process",
            "submit resume highlight enthusiasm field",
            "diversity",
            "pertinent chemical food pharmaceutical regulation",
            "classification criterion system element",
            "departmental goal action plan strategy mentoring coaching",
            "compliance requirement regulation",
            "potential meaningful impact",
            "dedicate + employee locate",
            "dynamic colleague",
            "workflow",
            "peer expert order",
            "outstanding performance",
            "organization",
            "HIandI",
            "culture collaborative family orient supportive environment plenty autonomy flexibility",
            "management regulation compliance",
            "talented team foster culture excellence",
            "Office Suite",
            "strong regulatory manager",
            "SNAC submission activity",
            "onboarding",
            "company committee"
        ],
        "combined_lemmatized_tokens": "position Regulatory Affairs Manager Location hybrid Flexibility policy Products Portfolio Industrial Chemicals Mining Oil Gas HIandI . status permanent seek Regulatory Affairs Manager join span canadian portfolio . ideal industrial chemical industry . report Director Compliance Regulatory Affairs Manager play key role expand Quadra's portfolio product . person responsible manage activity team lead product screening procedure order meet effective compliance program . strong regulatory manager bring comprehensive knowledge regulatory compliance meticulous attention detail strong analytical skill ensure organization's adherence regulatory requirement . role lead inspire talented team foster culture excellence drive successful outcome . join team Regulatory Affairs Manager instrumental shape future organization positive difference client . future team people reimagine possibility . base modern head office fun love professional . course advantage hybrid telecommuting policy . dedicate + employee locate . large distributor chemical ingredient canadian marketplace . multiple facility committed deliver excellence . rapidly grow company long term commitment employee . commit excellence belong . create environment people priority grow . culture base core entrepreneurship innovation caring employer choice . foster environment challenge empower individual provide ample personal growth development . recognize celebrate outstanding performance ensure dedication achievement duly acknowledge . bring team strong technical knowledge pertinent government regulation associated compliance requirement insight determine compliance pathway business area develop company active industry association include limit participation manage priority resourceful relationship builder positive leader cross functional team Quality Assurance sale . acknowledge peer expert order respond external request relate regulatory affair Excellent communicator focus customer service curious eager achieve excellence team strong attention detail accuracy precision passion industry desire share peer responsible lead compliance activity regard pertinent chemical food pharmaceutical regulation apply canadian chemical distribution industry sector lead department workflow ensure structured approach compliance activity ensure regulatory compliance activity meet government requirement department output meet Quadra's commercial efficient integration compliance oversight business operation Supervision team establish departmental goal action plan strategy mentoring coaching manage performance hiring onboarding . collaboration Director Compliance Assurance establish department goal objective Ongoing Regulation Compliance development implementation efficient Regulatory Affairs procedure determine CEPA TSCA status product identity product ingredient team regard CEPA substance screening activity manage product screening procedure encompass compliance product regulation reflect wide diversity industry sector serve associate regulation Drug Precursor Regulations Explosive Regulations WHMIS GHS additional Quadra internal requirement product High risk classification management product set workflow facilitate submission pertinent product approval submission fertilizer animal feed pesticide biocide relate approval . management regulation compliance exist regulation include procedure revision regulation update industry association resource identify government mandate reporting activity associate chemical product importation sale SNAC submission activity – WHMIS GHS compliance ensure software resource current operate efficiency management product safety workflow facilitate priority requirement communicate Quadra employee ensure awareness system tool include training requirement regard GHS hazard communication system assist preparation presentation ad hoc routine department management report include compile CDR successful Regulatory Affairs Manager role possess master's degree strategic management business administration graduate certificate consider asset Bachelor's degree field science industry Minimum Regulatory Affairs Manager Regulatory Affairs Supervisor field expertise pharmaceutical food ingredient chemical industry manufacturing distribution thorough knowledge regulatory affair requirement chemical industrial energy mining proven team management leadership include performance management recruitment coach mentor strong knowledge TSCA strong knowledge Environment Canada's exist substance program initiative mandatory survey voluntary survey DSL update . require compliance requirement regulation associated classification criterion system element include WHMIS ingredient trade secret submission advanced knowledge canadian federal provincial requirement excellent oral write communication skill . Bilingualism mandatory Vaudreuil Office advanced Office Suite hand practical asset Open travel limited travel offer engaging culture collaborative family orient supportive environment plenty autonomy flexibility . offer professional fun innovative committed team certify organization . addition Great Place ® certify recognize Best Managed Companies Great Place Women ® dynamic colleague eager share knowledge . benefit choose enjoy permanent position stability benefit competitive salary enticing performance incentive program receive excellent benefit coverage dental medical program offer employee improve quality life Wellness Portfolio virtual care telemedicine loved access physician virtual wellness mental health program global healthcare leader Retirement plan match long term investment program advantage personal flexible vacation telecommuting flexibility organization great environment care fun integral core company promote diversity equity inclusion Digital environment customize training build Opportunities advancement professional development grow company focus people participate internal external training possibility join company committee engage social activity organize company Employee recognition program service merit award . private family company solid infrastructure employee assistance program monthly cell phone internet allowance ready unlock potential meaningful impact embark rewarding career warmly invite submit resume highlight enthusiasm field . join force redefine excellence customer service shape bright future esteemed client . support diversity offer equal employment race color ancestry religion sex national origin sexual orientation age citizenship marital status gender identity . encourage application people . accommodation request aspect selection process . recognize people identify male female . opt gender neutral gender neutral wording discriminatory spirit ."
    }
}