{
    "id": "40aca97515b4dd28",
    "companyDescription": "",
    "description": "Job Family:\n  Academic Leadership and Faculty\n \n   Union affiliation:\n \n  APUO\n \n \n   Faculty/Department:\n  Department of Biology_FT\n \n \n   Campus:\n  STEM\n \n \n   Date Posted:\n  novembre 17, 2023\n \n \n   Closing Date:\n \n \n   Note: Applications will be accepted until 11:59 PM on the day prior to the Posting End Date above\n \n \n \n   REVISED\n \n \n \n   Tenure track position in molecular biology\n \n \n \n   The Department of Biology at University of Ottawa invites applications for a tenure-track position at the rank of Assistant Professor. For this position, the successful candidate will demonstrate potential to build internationally-recognized and externally funded research program that fully engages trainees at all levels, building collaborations within and beyond our collegial, research-intensive department. Candidates must be able to teach in both French and English at the time of hiring at undergraduate and graduate levels. Exceptional candidates at Associate Professor level may also be considered. The starting date is July 1, 2024.\n \n \n   We are particularly interested in applicants with expertise in either new cellular models (organoids, 3D cultures) and/or classic and/or emerging invertebrate models. A research focus on the molecular mechanisms of aging, regeneration, and cell programming will be seen as an asset. However, any novel and/or developing research topic in the area of molecular and developmental genetics will also be considered in full.\n \n \n   The successful candidate will join a research-intensive, growing department of 40 researchers working in a wide range of fields, including cell and molecular biology, physiology, ecotoxicology, neuroscience, developmental biology, ecology and conservation, evolutionary biology, and bioinformatics. The Department maintains close collaborations with researchers at the Ottawa Hospital Research Institute, University of Ottawa Brain and Mind Institute, Ottawa Heart Institute, Carleton University, federal science departments and agencies, and the Canadian Museum of Nature. The Faculty of Science provides access to core facilities for molecular biology, genomics, chemistry, microscopy and aquatic animal care to all of its members.\n \n \n \n   Title of the position: Assistant or Associate Professor\n \n \n \n   Duties: The responsibilities include: 1) maintaining a robust, externally funded research program; 2) supervision of graduate and undergraduate student thesis projects in the department; 3) teaching undergraduate and graduate courses that contribute to the bilingual (English-French) Biology or Biomedical Sciences curriculum; and 4) performing an active role within the department by contributing to administrative and academic activities of the Department, and Faculty of Science.\n \n \n \n   Rank and salary: Regular tenure-track academic appointment in the Faculty of Science, with a salary consistent with the collective agreement of the Association of Professors of the University of Ottawa. The salary scale for assistant professors starts at $89,622 (based on the scale in effect on May 1, 2023).\n \n \n \n   Required qualifications: PhD in Biology or a related discipline. Postdoctoral experience is expected. A demonstrated track record of research excellence must be clearly presented, along with commitment and strategies for teaching and graduate training. The candidate must be able to teach in both French and English, the two official languages of the University, at the time of hiring.\n \n \n \n   Application Package: More information regarding \n  \n   Academic Careers can be found online\n  . Applications must be submitted electronically through the \n  \n   University of Ottawa Careers portal\n  . Candidates should include the following in their application:\n \n \n \n   A one-page cover letter formally expressing interest in the position and including a statement regarding their ability to teach in French and English\n   A full curriculum vitae (please include career interruptions such as parental or sick leaves that may have impacted your record of research. These will be taken into consideration in the selection process)\n   A detailed research plan (3 pages maximum)\n   A statement of teaching interests and how principles of equity, diversity, and inclusion will be included in training of research group members (1 page)\n   Contact information of three references\n   Three peer-reviewed publications\n   Self-Identification Form: The University of Ottawa is committed to ensuring equity, diversity and inclusion in the scholarly and leadership environments of our students, staff, and faculty\n \n \n \n   Contact information: Chair, Department of Biology, 30 Marie Curie Private, Ottawa, ON K1N 6N5, \n  \n   biochair.assistant@uottawa.ca\n  . Telephone: 613-562-5729, fax: 613-562-5486\n \n \n \n   Location of work: Department of Biology, University of Ottawa, 30 Marie Curie Private, Ottawa, ON K1N 6N5.\n \n \n \n   Application deadline: Review of applications will begin January 10, 2024. Applications received before this date will receive full consideration. Only candidates selected for an interview will be contacted.\n \n \n \n   Other information: The University of Ottawa is proud of its more than 160-year tradition of bilingualism. Through its Official Languages and Bilingualism Institute, the University provides training to staff members and to their spouses in their second official language. Located on the unceded ancestral territory of the Anishinabé-Algonquin people, the University of Ottawa is at the heart of Canada’s capital with unparalleled opportunity for collaborations with governmental agencies for funding and samples (e.g., Canadian Museum of Nature, GSC).\n \n \n \n   In accordance with Immigration Canada requirements, any qualified person is invited to submit their application; however, priority will be given to Canadian citizens and permanent residents. The University of Ottawa is committed to ensuring equity, diversity and inclusion in the scholarly and leadership environments of our students, staff, and faculty\n  . Accordingly, we strongly encourage applications from Indigenous Peoples in Canada, visible minorities members (racialized persons), persons with disabilities, women, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse and inclusive communities. Candidates who wish to be considered as a member of one or more designated groups are asked to complete the confidential Self-Identification Questionnaire, to be completed at the time of application.\n \n \n \n   The University of Ottawa provides accommodations for applicants with disabilities throughout the recruitment process. If you are invited to proceed in the selection process, please notify us of any accommodations that you require by contacting the Office of the Vice-Provost, Faculty Relations at \n  \n   vra.affairesprofessorales@uottawa.ca\n  \n  . Any information you send us will be handled respectfully and in complete confidence.\n \n \n \n   The University of Ottawa is committed to ensuring equity, diversity, and inclusion in the scholarly and leadership environments of our students, staff, and faculty. Accordingly, we strongly encourage applications from Indigenous Peoples in Canada, visible minorities members (racialized persons), persons with disabilities, women, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse, and inclusive communities. Candidates who wish to be considered as a member of one or more designated groups are asked to complete the confidential Self-Identification Questionnaire, to be completed at the time of application.\n \n \n \n   All qualified candidates are invited to apply; however, preference will be given to Canadians and permanent residents. When submitting your application, please indicate if you are legally entitled to work in Canada\n \n \n \n   The University of Ottawa provides accommodations for applicants with disabilities throughout the recruitment process. If you are invited to proceed in the selection process, please notify us of any accommodations that you require by contacting the Office of the Vice-Provost, Faculty Relations by email at \n  \n   vra.affairesprofessorales@uottawa.ca\n  . Any information you send us will be handled respectfully and in complete confidence.\n \n \n \n   The University of Ottawa is proud of its 160-year tradition of bilingualism. Through its Official Languages and Bilingualism Institute, the University provides training to staff members and to their spouses in their second official language.\n \n \n \n   Prior to May 1, 2022, the University required all students, faculty, staff, and visitors (including contractors) to be fully vaccinated against Covid-19 as defined in Policy 129 – Covid-19 Vaccination. This policy was suspended effective May 1, 2022 but may be reinstated at any point in the future depending on public health guidelines and the recommendations of experts.",
    "preprocessed_description": "Job Family: Academic Leadership and Faculty Union affiliation: APUO Faculty/Department: Department of Biology_FT Campus: STEM Date Posted: novembre 17, 2023 Closing Date: Note: Applications will be accepted until 11:59 Project Manager on the day prior to the Posting End Date above REVISED Tenure track position in molecular biology The Department of Biology at University of Ottawa invites applications for a tenure-track position at the rank of Assistant Professor. For this position, the successful candidate will demonstrate potential to build internationally-recognized and externally funded research program that fully engages trainees at all levels, building collaborations within and beyond our collegial, research-intensive department. Candidates must be able to teach in both French and English at the time of hiring at undergraduate and graduate levels. Exceptional candidates at Associate Professor level may also be considered. The starting date is July 1, 2024. We are particularly interested in applicants with expertise in either new cellular models (organoids, 3D cultures) and/or classic and/or emerging invertebrate models. A research focus on the molecular mechanisms of aging, regeneration, and cell programming will be seen as an asset. However, any novel and/or developing research topic in the area of molecular and developmental genetics will also be considered in full. The successful candidate will join a research-intensive, growing department of 40 researchers working in a wide range of fields, including cell and molecular biology, physiology, ecotoxicology, neuroscience, developmental biology, ecology and conservation, evolutionary biology, and bioinformatics. The Department maintains close collaborations with researchers at the Ottawa Hospital Research Institute, University of Ottawa Brain and Mind Institute, Ottawa Heart Institute, Carleton University, federal science departments and agencies, and the Canadian Museum of Nature. The Faculty of Science provides access to core facilities for molecular biology, genomics, chemistry, microscopy and aquatic animal care to all of its members. Title of the position: Assistant or Associate Professor Duties: The responsibilities include: 1) maintaining a robust, externally funded research program; 2) supervision of graduate and undergraduate student thesis projects in the department; 3) teaching undergraduate and graduate courses that contribute to the bilingual (English-French) Biology or Biomedical Sciences curriculum; and 4) performing an active role within the department by contributing to administrative and academic activities of the Department, and Faculty of Science. Rank and salary: Regular tenure-track academic appointment in the Faculty of Science, with a salary consistent with the collective agreement of the Association of Professors of the University of Ottawa. The salary scale for assistant professors starts at $89,622 (based on the scale in effect on May 1, 2023). Required qualifications: PhD in Biology or a related discipline. Postdoctoral experience is expected. A demonstrated track record of research excellence must be clearly presented, along with commitment and strategies for teaching and graduate training. The candidate must be able to teach in both French and English, the two official languages of the University, at the time of hiring. Application Package: More information regarding Academic Careers can be found online . Applications must be submitted electronically through the University of Ottawa Careers portal . Candidates should include the following in their application: A one-page cover letter formally expressing interest in the position and including a statement regarding their ability to teach in French and English A full curriculum vitae (please include career interruptions such as parental or sick leaves that may have impacted your record of research. These will be taken into consideration in the selection process) A detailed research plan (3 pages maximum) A statement of teaching interests and how principles of equity, diversity, and inclusion will be included in training of research group members (1 page) Contact information of three references Three peer-reviewed publications Self-Identification Form: The University of Ottawa is committed to ensuring equity, diversity and inclusion in the scholarly and leadership environments of our students, staff, and faculty Contact information: Chair, Department of Biology, 30 Marie Curie Private, Ottawa, ON K1N 6N5, biochair.assistant@uottawa.ca . Telephone: 613-562-5729, fax: 613-562-5486 Location of work: Department of Biology, University of Ottawa, 30 Marie Curie Private, Ottawa, ON K1N 6N5. Application deadline: Review of applications will begin January 10, 2024. Applications received before this date will receive full consideration. Only candidates selected for an interview will be contacted. Other information: The University of Ottawa is proud of its more than 160-year tradition of bilingualism. Through its Official Languages and Bilingualism Institute, the University provides training to staff members and to their spouses in their second official language. Located on the unceded ancestral territory of the Anishinabé-Algonquin people, the University of Ottawa is at the heart of Canada's capital with unparalleled opportunity for collaborations with governmental agencies for funding and samples (e.g., Canadian Museum of Nature, GSC). In accordance with Immigration Canada requirements, any qualified person is invited to submit their application; however, priority will be given to Canadian citizens and permanent residents. The University of Ottawa is committed to ensuring equity, diversity and inclusion in the scholarly and leadership environments of our students, staff, and faculty . Accordingly, we strongly encourage applications from Indigenous Peoples in Canada, visible minorities members (racialized persons), persons with disabilities, women, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse and inclusive communities. Candidates who wish to be considered as a member of one or more designated groups are asked to complete the confidential Self-Identification Questionnaire, to be completed at the time of application. The University of Ottawa provides accommodations for applicants with disabilities throughout the recruitment process. If you are invited to proceed in the selection process, please notify us of any accommodations that you require by contacting the Office of the Vice-Provost, Faculty Relations at vra.affairesprofessorales@uottawa.ca . Any information you send us will be handled respectfully and in complete confidence. The University of Ottawa is committed to ensuring equity, diversity, and inclusion in the scholarly and leadership environments of our students, staff, and faculty. Accordingly, we strongly encourage applications from Indigenous Peoples in Canada, visible minorities members (racialized persons), persons with disabilities, women, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse, and inclusive communities. Candidates who wish to be considered as a member of one or more designated groups are asked to complete the confidential Self-Identification Questionnaire, to be completed at the time of application. All qualified candidates are invited to apply; however, preference will be given to Canadians and permanent residents. When submitting your application, please indicate if you are legally entitled to work in Canada The University of Ottawa provides accommodations for applicants with disabilities throughout the recruitment process. If you are invited to proceed in the selection process, please notify us of any accommodations that you require by contacting the Office of the Vice-Provost, Faculty Relations by email at vra.affairesprofessorales@uottawa.ca . Any information you send us will be handled respectfully and in complete confidence. The University of Ottawa is proud of its 160-year tradition of bilingualism. Through its Official Languages and Bilingualism Institute, the University provides training to staff members and to their spouses in their second official language. Prior to May 1, 2022, the University required all students, faculty, staff, and visitors (including contractors) to be fully vaccinated against Covid-19 as defined in Policy 129 – Covid-19 Vaccination. This policy was suspended effective May 1, 2022 but may be reinstated at any point in the future depending on public health guidelines and the recommendations of experts.",
    "processed_description": "Family Academic Leadership Faculty Union affiliation stem post closing note application accept Project Manager REVISED tenure track position molecular biology invite application tenure track position rank Assistant Professor . position successful demonstrate potential build internationally recognize externally fund research program fully engage trainee level build collaboration collegial research intensive department . teach hire undergraduate graduate level . exceptional Associate Professor level consider . starting . interested applicant expertise cellular model organoid 3d culture classic emerge invertebrate model . research focus molecular mechanism aging regeneration cell programming asset . novel develop research topic area molecular developmental genetic consider . successful join research intensive grow department researcher wide range field include cell molecular biology physiology ecotoxicology neuroscience developmental biology ecology conservation evolutionary biology bioinformatic . maintain close collaboration researcher federal science department agency . provide access core facility molecular biology genomic chemistry microscopy aquatic animal care . title position Assistant Associate Professor duty responsibility include maintain robust externally fund research program supervision graduate undergraduate student thesis project department teach undergraduate graduate course contribute English French Biology Biomedical Sciences curriculum perform active role department contribute administrative academic activity . rank salary regular tenure track academic appointment salary consistent collective agreement . salary scale assistant professor start base scale . require qualification discipline . postdoctoral expect . demonstrate track record research excellence commitment strategy teaching graduate training . teach official language hiring . application package information regard find online . application submit electronically portal . include application cover letter formally express interest position include statement regard teach french English curriculum vitae include career interruption parental sick leave impact record research . consideration selection process detailed research plan maximum statement teach interest principle equity diversity inclusion include training research group contact information reference peer review publication identification form commit ensure equity diversity inclusion scholarly leadership environment student staff faculty contact information Chair K1N 6n5 . fax location K1N 6n5 . application deadline review application . application receive receive consideration . select interview contact . information tradition bilingualism . provide training staff spouse second official language . locate unceded ancestral territory Anishinabe Algonquin people heart Canada's capital unparalleled collaboration governmental agency funding sample GSC . Immigration requirement qualified person invite submit application priority canadian citizen permanent resident . commit ensure equity diversity inclusion scholarly leadership environment student staff faculty . encourage application visible minority racialize person person woman qualified skill knowledge productively engage equitable diverse inclusive community . consider designate group complete confidential Identification Questionnaire complete application . provide accommodation applicant recruitment process . invite proceed selection process notify accommodation require contact . information send handle respectfully complete confidence . commit ensure equity diversity inclusion scholarly leadership environment student staff faculty . encourage application visible minority racialize person person woman qualified skill knowledge productively engage equitable diverse inclusive community . consider designate group complete confidential Identification Questionnaire complete application . qualified invite apply preference permanent resident . submit application indicate legally entitle provide accommodation applicant recruitment process . invite proceed selection process notify accommodation require contact email . information send handle respectfully complete confidence . tradition bilingualism . provide training staff spouse second official language . prior require student faculty staff visitor include contractor fully vaccinate Covid define Policy – Covid Vaccination . policy suspend effective reinstate point future depend public health guideline recommendation expert .",
    "results_group": {
        "extracted_noun_chunks": [
            "research topic area molecular developmental genetic consider",
            "Canada's capital unparalleled collaboration governmental agency funding sample GSC",
            "submit application priority canadian citizen permanent resident",
            "active role department",
            "undergraduate graduate level",
            "interest position",
            "contractor",
            "invertebrate model",
            "contact email",
            "access core facility molecular biology genomic chemistry microscopy",
            "training research group contact information reference peer review publication identification form commit",
            "Covid Vaccination",
            "accommodation applicant recruitment process",
            "accommodation",
            "application tenure track position rank Assistant Professor",
            "designate group",
            "cell molecular biology physiology ecotoxicology neuroscience developmental biology ecology conservation",
            "robust externally fund research program supervision graduate undergraduate student thesis project department",
            "title position Assistant Associate Professor duty responsibility",
            "K1N 6n5",
            "application receive",
            "equity diversity inclusion scholarly leadership environment student staff faculty contact information Chair",
            "close collaboration researcher federal science department agency",
            "Immigration requirement qualified person",
            "Covid",
            "statement regard",
            "application deadline review application",
            "application cover letter",
            "externally fund research program",
            "french English curriculum vitae",
            "effective reinstate point future",
            "official language hiring",
            "equity diversity inclusion scholarly leadership environment student staff faculty",
            "unceded ancestral territory Anishinabe Algonquin people",
            "permanent resident",
            "fax location",
            "aquatic animal care",
            "policy",
            "parental sick leave impact record research",
            "exceptional Associate Professor level",
            "contact",
            "proceed selection process",
            "public health guideline recommendation expert",
            "graduate training",
            "research",
            "equitable diverse inclusive community",
            "qualification discipline",
            "successful join research intensive grow department researcher wide range field",
            "base scale",
            "select interview contact",
            "career interruption",
            "interested applicant expertise cellular model organoid 3d culture classic",
            "research plan",
            "preference",
            "tradition bilingualism",
            "application package information regard",
            "information tradition bilingualism",
            "Project Manager REVISED tenure track position molecular biology",
            "application",
            "information",
            "potential build",
            "Policy",
            "English French Biology Biomedical Sciences curriculum",
            "training staff spouse second official language",
            "position",
            "interest principle equity diversity inclusion",
            "undergraduate graduate course",
            "Family Academic Leadership Faculty Union affiliation",
            "consideration",
            "rank salary regular tenure track academic appointment salary consistent collective agreement",
            "consideration selection process",
            "legally entitle",
            "student faculty staff visitor",
            "respectfully complete confidence",
            "molecular mechanism aging regeneration cell programming asset",
            "applicant recruitment process",
            "evolutionary biology",
            "administrative academic activity",
            "visible minority racialize person person woman qualified skill knowledge",
            "collaboration collegial research intensive department",
            "salary scale assistant professor",
            "novel"
        ],
        "combined_lemmatized_tokens": "Family Academic Leadership Faculty Union affiliation stem post closing note application accept Project Manager REVISED tenure track position molecular biology invite application tenure track position rank Assistant Professor . position successful demonstrate potential build internationally recognize externally fund research program fully engage trainee level build collaboration collegial research intensive department . teach hire undergraduate graduate level . exceptional Associate Professor level consider . starting . interested applicant expertise cellular model organoid 3d culture classic emerge invertebrate model . research focus molecular mechanism aging regeneration cell programming asset . novel develop research topic area molecular developmental genetic consider . successful join research intensive grow department researcher wide range field include cell molecular biology physiology ecotoxicology neuroscience developmental biology ecology conservation evolutionary biology bioinformatic . maintain close collaboration researcher federal science department agency . provide access core facility molecular biology genomic chemistry microscopy aquatic animal care . title position Assistant Associate Professor duty responsibility include maintain robust externally fund research program supervision graduate undergraduate student thesis project department teach undergraduate graduate course contribute English French Biology Biomedical Sciences curriculum perform active role department contribute administrative academic activity . rank salary regular tenure track academic appointment salary consistent collective agreement . salary scale assistant professor start base scale . require qualification discipline . postdoctoral expect . demonstrate track record research excellence commitment strategy teaching graduate training . teach official language hiring . application package information regard find online . application submit electronically portal . include application cover letter formally express interest position include statement regard teach french English curriculum vitae include career interruption parental sick leave impact record research . consideration selection process detailed research plan maximum statement teach interest principle equity diversity inclusion include training research group contact information reference peer review publication identification form commit ensure equity diversity inclusion scholarly leadership environment student staff faculty contact information Chair K1N 6n5 . fax location K1N 6n5 . application deadline review application . application receive receive consideration . select interview contact . information tradition bilingualism . provide training staff spouse second official language . locate unceded ancestral territory Anishinabe Algonquin people heart Canada's capital unparalleled collaboration governmental agency funding sample GSC . Immigration requirement qualified person invite submit application priority canadian citizen permanent resident . commit ensure equity diversity inclusion scholarly leadership environment student staff faculty . encourage application visible minority racialize person person woman qualified skill knowledge productively engage equitable diverse inclusive community . consider designate group complete confidential Identification Questionnaire complete application . provide accommodation applicant recruitment process . invite proceed selection process notify accommodation require contact . information send handle respectfully complete confidence . commit ensure equity diversity inclusion scholarly leadership environment student staff faculty . encourage application visible minority racialize person person woman qualified skill knowledge productively engage equitable diverse inclusive community . consider designate group complete confidential Identification Questionnaire complete application . qualified invite apply preference permanent resident . submit application indicate legally entitle provide accommodation applicant recruitment process . invite proceed selection process notify accommodation require contact email . information send handle respectfully complete confidence . tradition bilingualism . provide training staff spouse second official language . prior require student faculty staff visitor include contractor fully vaccinate Covid define Policy – Covid Vaccination . policy suspend effective reinstate point future depend public health guideline recommendation expert ."
    }
}