{
    "id": "9ba33cc5be2e71b8",
    "companyDescription": "Sirva Worldwide, Inc. provides HR and mobility professionals with the resources, guidance, and support they need to achieve the best possible relocation for talent, and for the companies that move them. As a leading global relocation management and moving services company, we bring together personalized program solutions, expansive global reach, innovative technology, and an unmatched supply chain to transform businesses of any size and empower talent moving to their next opportunity. From corporate relocation and household goods to home sale and commercial moving and storage, our portfolio of brands (including Sirva, Allied, northAmerican, Global Van Lines, Alliance, Sirva Mortgage and SMARTBOX) provide everything needed to move talent and deliver experience.",
    "description": "As a Claims Processing Coordinator, you will contribute to SIRVA’s success by being responsible for the processing/verification of claims, advances and supplier invoices for our clients. Claims will be from receipt through resolution in accordance with all policy, guidelines and quality standards as per our service level agreement. As well you will analyze claims, advances, and supplier invoices to determine if eligibility requirements and claim filing requirements are met and make determinations based on the type of claims. Also there is a responsibility to achieve the expected evel of service as required based on our Service Level Agreements. Additionally, the expected relocation costs of service delivery must be achieved within the prescribed policies and timeframes. \n\n What You’ll Be Doing \n\n \n \n Expense claim management in accordance with the relocation policy (verification and reconciliation of expenses) \n Analyze claims, advances and supplier invoices, to determine if eligibility requirements and claim filing requirements are met and make determinations \n Process all claim types by determining corrective action to be taken on various types of errors generated by the system and resolving these errors. \n Accurate and timely completion of invoice verification functions \n Deal tactfully with people in a wide variety of situations to convey a favorable corporate image \n Contact appropriate individuals for urgent and emergency requests to ensure requests are handled in a timely manner \n Identify area of opportunity and utilize skill/ knowledge to suggest improvements \n Data entry \n Analytical and detailed oriented with effective time management skills \n Excellent administrative skills, including record keeping \n Understanding of the Customer’s relocation budget in accordance with Relocation Policy, and the standard operating procedures \n Provides direction/information to clients and from time to time service providers as required to ensure excellent coordination/execution of work with minimal disruption \n Assist General Inquiries team with miscellaneous CAF Member communication (chats, emails, phone calls, voicemails) \n Perform various administrative tasks to support the Contact Centre \n What You Bring to SIRVA \n\n \n \n College graduate or equivalent work experience \n Knowledge in relocation, residential real estate, residential mortgages, legal or banking is an asset \n Familiarity with the accounts payable/receivable process. \n 1-2 years’ experience with the processing of client claims \n Previous experience in a customer support role through a contact center \n Professional, self-starter with the ability to assume additional responsibilities and work flexible hours as required \n Team player who is able to work with minimal supervision in a fast-paced environment \n Good interpersonal and communication skills \n Superior customer service skills and orientation \n Collaborative style needed \n Ability to maintain professionalism at all times under stressful situations \n Strong organizational skills \n Ability to plan and manage work under time constraints, without direct supervision \n Bilingualism is preferred \n You foster belonging and encourage authenticity. You are inclusive, value diversity, and recognize that these behaviors empower and inspire positive action and promote innovation \n \nKey Competencies:\n \n \n Excellent verbal and written communication skills \n Excellent Data Entry skills \n Listening skills \n Problem analysis and problem solving \n Organizational skills \n Attention to detail \n Judgment \n Adaptability \n Team work \n Stress tolerance \n Resilience \n \nOther Information:\n \n \n Reliability status security clearance granted by CIISD, PSPC is required; the security clearance application will be facilitated via the BGRS Company Security Officer (CSO) \n What SIRVA Offers \n\n \n \n Competitive salary and incentive plans \n Workplace flexibility for a balanced work/life approach \n Comprehensive benefits packages and wellness program \n Generous company-paid vacation days and holiday time \n Challenging, collaborative, diverse corporate culture \n Ongoing opportunities for learning and career development \n SIRVA Worldwide Relocation and Moving is a global leader in moving and relocation services, offering solutions for mobility programs to companies of every size. With 75 owned locations and more than 1,000 franchised and agent locations in 177 countries, we offer unmatched global breadth supported by localized attention and innovative technology that strikes the right balance of self service and human support. From relocation and household goods to commercial moving and storage, our portfolio of Brands (SIRVA, Team Relocations, Allied, northAmerican, & SMARTBOX) provides the only integrated moving/relocation solution in the industry. By leveraging our global network, we deliver a superior experience that only a “one-stop shop” can provide. We’re a team that works globally to provide the best service locally — a company that is everything you need, everywhere you need it. For more information please visit www.sirva.com. \n\n SIRVA brings together strong, collaborative people in a dynamic culture of mutual respect, support, and passion for the brand and product. We believe innovation drives winning performance, and we constantly challenge ourselves to be the very best we can in every aspect of our business. You will be surrounded by some of the brightest and most driven people in the industry. At SIRVA, you will be in great company! \n\n At SIRVA, we're committed to cultivating a workplace that reflects the diversity of the global organizations that we serve. We recognize that building an inclusive, engaged company culture results in empowered employees that reflect a wide range of approaches and perspectives. Those perspectives lead to new ideas. New ideas lead to innovation and excellence. Our approach to diversity, equality and inclusion is driven by a commitment to these values and a belief that diversity makes our company stronger. \n\n SIRVA is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, military status, genetic information or any other consideration made unlawful by applicable federal, state, or local laws. SIRVA also prohibits harassment of applicants and employees based on any of these protected categories. \n\n If you need a reasonable accommodation because of a disability of any part of the employment process, please send an email to Human Resources at HRSIRVA@SIRVA.com and let us know the nature of your request and your contact information.",
    "preprocessed_description": "As a Claims Processing Coordinator, you will contribute to SIRVA's success by being responsible for the processing/verification of claims, advances and supplier invoices for our clients. Claims will be from receipt through resolution in accordance with all policy, guidelines and quality standards as per our service level agreement. As well you will analyze claims, advances, and supplier invoices to determine if eligibility requirements and claim filing requirements are met and make determinations based on the type of claims. Also there is a responsibility to achieve the expected evel of service as required based on our Service Level Agreements. Additionally, the expected relocation costs of service delivery must be achieved within the prescribed policies and timeframes. What You'll Be Doing Expense claim management in accordance with the relocation policy (verification and reconciliation of expenses) Analyze claims, advances and supplier invoices, to determine if eligibility requirements and claim filing requirements are met and make determinations Process all claim types by determining corrective action to be taken on various types of errors generated by the system and resolving these errors. Accurate and timely completion of invoice verification functions Deal tactfully with people in a wide variety of situations to convey a favorable corporate image Contact appropriate individuals for urgent and emergency requests to ensure requests are handled in a timely manner Identify area of opportunity and utilize skill/ knowledge to suggest improvements Data entry Analytical and detailed oriented with effective time management skills Excellent administrative skills, including record keeping Understanding of the Customer's relocation budget in accordance with Relocation Policy, and the standard operating procedures Provides direction/information to clients and from time to time service providers as required to ensure excellent coordination/execution of work with minimal disruption Assist General Inquiries team with miscellaneous CAF Member communication (chats, emails, phone calls, voicemails) Perform various administrative tasks to support the Contact Centre What You Bring to SIRVA College graduate or equivalent work experience Knowledge in relocation, residential real estate, residential mortgages, legal or banking is an asset Familiarity with the accounts payable/receivable process. 1-2 years' experience with the processing of client claims Previous experience in a customer support role through a contact center Professional, self-starter with the ability to assume additional responsibilities and work flexible hours as required Team player who is able to work with minimal supervision in a fast-paced environment Good interpersonal and communication skills Superior customer service skills and orientation Collaborative style needed Ability to maintain professionalism at all times under stressful situations Strong organizational skills Ability to plan and manage work under time constraints, without direct supervision Bilingualism is preferred You foster belonging and encourage authenticity. You are inclusive, value diversity, and recognize that these behaviors empower and inspire positive action and promote innovation Key Competencies: Excellent verbal and written communication skills Excellent Data Entry skills Listening skills Problem analysis and problem solving Organizational skills Attention to detail Judgment Adaptability Team work Stress tolerance Resilience Other Information: Reliability status security clearance granted by CIISD, Public Services and Procurement Canada is required; the security clearance application will be facilitated via the BGRS Company Security Officer (CSO) What SIRVA Offers Competitive salary and incentive plans Workplace flexibility for a balanced work/life approach Comprehensive benefits packages and wellness program Generous company-paid vacation days and holiday time Challenging, collaborative, diverse corporate culture Ongoing opportunities for learning and career development SIRVA Worldwide Relocation and Moving is a global leader in moving and relocation services, offering solutions for mobility programs to companies of every size. With 75 owned locations and more than 1,000 franchised and agent locations in 177 countries, we offer unmatched global breadth supported by localized attention and innovative technology that strikes the right balance of self service and human support. From relocation and household goods to commercial moving and storage, our portfolio of Brands (SIRVA, Team Relocations, Allied, northAmerican, & SMARTBOX) provides the only integrated moving/relocation solution in the industry. By leveraging our global network, we deliver a superior experience that only a \"one-stop shop\" can provide. We're a team that works globally to provide the best service locally — a company that is everything you need, everywhere you need it. For more information please visit www.sirva.com. SIRVA brings together strong, collaborative people in a dynamic culture of mutual respect, support, and passion for the brand and product. We believe innovation drives winning performance, and we constantly challenge ourselves to be the very best we can in every aspect of our business. You will be surrounded by some of the brightest and most driven people in the industry. At SIRVA, you will be in great company! At SIRVA, we are committed to cultivating a workplace that reflects the diversity of the global organizations that we serve. We recognize that building an inclusive, engaged company culture results in empowered employees that reflect a wide range of approaches and perspectives. Those perspectives lead to new ideas. New ideas lead to innovation and excellence. Our approach to diversity, equality and inclusion is driven by a commitment to these values and a belief that diversity makes our company stronger. SIRVA is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, military status, genetic information or any other consideration made unlawful by applicable federal, state, or local laws. SIRVA also prohibits harassment of applicants and employees based on any of these protected categories. If you need a reasonable accommodation because of a disability of any part of the employment process, please send an email to Human Resources at HRSIRVA@SIRVA.com and let us know the nature of your request and your contact information.",
    "processed_description": "claim processing coordinator contribute SIRVA's success responsible processing verification claim advance supplier invoice client . claim receipt resolution policy guideline quality standard service level agreement . analyze claim advance supplier invoice determine eligibility requirement claim filing requirement meet determination base type claim . responsibility achieve expect evel service require base . additionally expect relocation cost service delivery achieve prescribe policy timeframe . expense claim management relocation policy verification reconciliation expense analyze claim advance supplier invoice determine eligibility requirement claim filing requirement meet determination process claim type determine corrective action type error generate system resolve error . accurate timely completion invoice verification function Deal tactfully people wide variety situation convey favorable corporate image contact appropriate individual urgent emergency request ensure request handle timely manner identify area utilize skill knowledge improvement Data entry analytical detail oriented effective management skill excellent administrative skill include record Understanding Customer's relocation budget standard operating procedure provide direction information client service provider require ensure excellent coordination execution minimal disruption Assist General Inquiries team miscellaneous CAF communication chat email phone voicemail perform administrative task support bring SIRVA College graduate equivalent knowledge relocation residential real estate residential mortgage legal banking account payable receivable process . year' processing client claim previous customer support role contact center Professional starter assume additional responsibility flexible hour require Team player minimal supervision fast pace environment good interpersonal communication skill superior customer service skill orientation Collaborative style maintain professionalism stressful situation strong organizational skill plan manage constraint direct supervision Bilingualism prefer foster belong encourage authenticity . inclusive diversity recognize behavior empower inspire positive action promote innovation excellent verbal write communication skill Excellent Data Entry skill listening skill problem analysis problem solve organizational skill attention detail stress tolerance resilience information reliability status security clearance grant require security clearance application facilitate BGRS Company Security Officer SIRVA Offers competitive salary incentive plan workplace flexibility balanced life approach Comprehensive benefit package holiday challenging collaborative diverse corporate culture ongoing learning career development global leader relocation service offer solution mobility program company size . location franchise agent location country offer unmatched global breadth support localize attention innovative technology strike balance service human support . relocation household good commercial moving storage portfolio provide integrate relocation solution industry . leverage global network deliver superior shop provide . team globally provide good service locally — company . information visit . bring strong collaborative people dynamic culture mutual respect support passion brand product . innovation drive win performance constantly challenge good aspect business . surround bright driven people industry . great company committed cultivate workplace reflect diversity global organization serve . recognize build inclusive engage company culture result empowered employee reflect wide range approach perspective . perspective lead idea . idea lead innovation excellence . approach diversity equality inclusion drive commitment belief diversity company strong . equal employer . evaluate qualified applicant regard race color religion sex sexual orientation gender identity national origin age military status genetic information consideration unlawful applicable federal state local law . prohibit harassment applicant employee base protect category . reasonable accommodation employment process send email nature request contact information .",
    "results_group": {
        "extracted_noun_chunks": [
            "determination base type claim",
            "harassment",
            "evel service",
            "foster",
            "determination process claim type",
            "constraint direct supervision",
            "system resolve error",
            "Bilingualism",
            "innovation drive win performance",
            "good aspect business",
            "accurate timely completion invoice verification function Deal",
            "corrective action type error",
            "request handle",
            "team",
            "qualified applicant regard race color religion sex sexual orientation gender identity national origin age military status genetic information consideration unlawful applicable federal state local law",
            "relocation solution industry",
            "people wide variety situation",
            "attention innovative technology strike balance service human support",
            "BGRS Company Security Officer SIRVA Offers competitive salary incentive plan workplace flexibility balanced life",
            "superior customer service skill orientation Collaborative style",
            "direction information client service provider",
            "bright driven people industry",
            "record Understanding Customer's relocation budget standard operating procedure",
            "eligibility requirement claim filing requirement",
            "identify area",
            "administrative task support",
            "excellent verbal write communication skill Excellent Data Entry skill listening skill problem analysis problem",
            "perspective lead idea",
            "approach diversity equality inclusion drive commitment belief diversity company",
            "additional responsibility flexible hour",
            "behavior",
            "relocation cost service delivery",
            "authenticity",
            "base",
            "ongoing learning career development global leader relocation service offer solution mobility program company size",
            "global network",
            "positive action",
            "collaborative diverse corporate culture",
            "innovation excellence",
            "year' processing client",
            "policy timeframe",
            "timely manner",
            "strong collaborative people dynamic culture mutual respect support passion brand product",
            "receipt resolution policy guideline quality standard service level agreement",
            "advance supplier invoice client",
            "equal employer",
            "inclusive diversity",
            "idea",
            "information visit",
            "unmatched global breadth support",
            "inclusive engage company culture",
            "responsibility",
            "diversity global organization",
            "superior shop provide",
            "expense claim management relocation policy verification reconciliation expense",
            "SIRVA College graduate equivalent knowledge relocation residential real estate residential mortgage legal banking account payable receivable process",
            "excellent coordination execution minimal disruption Assist General Inquiries team miscellaneous CAF communication chat email phone voicemail",
            "relocation household good commercial moving storage portfolio",
            "skill knowledge improvement Data entry analytical detail oriented effective management skill excellent administrative skill",
            "email nature request contact information",
            "processing coordinator",
            "professionalism stressful situation strong organizational skill plan",
            "reasonable accommodation employment process",
            "great company",
            "good service",
            "advance supplier invoice",
            "applicant employee base protect category",
            "workplace",
            "organizational skill attention detail stress tolerance resilience information reliability status security clearance grant",
            "empowered employee",
            "innovation",
            "wide range approach perspective",
            "previous customer support role contact center Professional starter",
            "location franchise agent location country",
            "favorable corporate image contact appropriate individual urgent emergency request",
            "company"
        ],
        "combined_lemmatized_tokens": "claim processing coordinator contribute SIRVA's success responsible processing verification claim advance supplier invoice client . claim receipt resolution policy guideline quality standard service level agreement . analyze claim advance supplier invoice determine eligibility requirement claim filing requirement meet determination base type claim . responsibility achieve expect evel service require base . additionally expect relocation cost service delivery achieve prescribe policy timeframe . expense claim management relocation policy verification reconciliation expense analyze claim advance supplier invoice determine eligibility requirement claim filing requirement meet determination process claim type determine corrective action type error generate system resolve error . accurate timely completion invoice verification function Deal tactfully people wide variety situation convey favorable corporate image contact appropriate individual urgent emergency request ensure request handle timely manner identify area utilize skill knowledge improvement Data entry analytical detail oriented effective management skill excellent administrative skill include record Understanding Customer's relocation budget standard operating procedure provide direction information client service provider require ensure excellent coordination execution minimal disruption Assist General Inquiries team miscellaneous CAF communication chat email phone voicemail perform administrative task support bring SIRVA College graduate equivalent knowledge relocation residential real estate residential mortgage legal banking account payable receivable process . year' processing client claim previous customer support role contact center Professional starter assume additional responsibility flexible hour require Team player minimal supervision fast pace environment good interpersonal communication skill superior customer service skill orientation Collaborative style maintain professionalism stressful situation strong organizational skill plan manage constraint direct supervision Bilingualism prefer foster belong encourage authenticity . inclusive diversity recognize behavior empower inspire positive action promote innovation excellent verbal write communication skill Excellent Data Entry skill listening skill problem analysis problem solve organizational skill attention detail stress tolerance resilience information reliability status security clearance grant require security clearance application facilitate BGRS Company Security Officer SIRVA Offers competitive salary incentive plan workplace flexibility balanced life approach Comprehensive benefit package holiday challenging collaborative diverse corporate culture ongoing learning career development global leader relocation service offer solution mobility program company size . location franchise agent location country offer unmatched global breadth support localize attention innovative technology strike balance service human support . relocation household good commercial moving storage portfolio provide integrate relocation solution industry . leverage global network deliver superior shop provide . team globally provide good service locally — company . information visit . bring strong collaborative people dynamic culture mutual respect support passion brand product . innovation drive win performance constantly challenge good aspect business . surround bright driven people industry . great company committed cultivate workplace reflect diversity global organization serve . recognize build inclusive engage company culture result empowered employee reflect wide range approach perspective . perspective lead idea . idea lead innovation excellence . approach diversity equality inclusion drive commitment belief diversity company strong . equal employer . evaluate qualified applicant regard race color religion sex sexual orientation gender identity national origin age military status genetic information consideration unlawful applicable federal state local law . prohibit harassment applicant employee base protect category . reasonable accommodation employment process send email nature request contact information ."
    }
}