{
    "id": "2cee8c249446a62a",
    "company": "Pomerleau",
    "positionName": "Quality Inspector",
    "jobType": null,
    "location": "343 Preston Street, Suite 220, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-05T03:12:16.570Z",
    "url": "https://www.indeed.ca/rc/clk?jk=2cee8c249446a62a&from=jasx&tk=1hjm39h30jroo800&vjs=3",
    "externalApplyLink": "https://pomerleau.csod.com/ux/ats/careersite/6/home/requisition/3545?c=pomerleau&lang=en-US&source=Indeed",
    "companyDescription": "",
    "description": "We are Pomerleau. And you could be too.  At Pomerleau, we fully understand that our mission is not only to create infrastructure or erect buildings, but to build communities. As a leader in the construction industry for nearly 60 years, we always aim to make a positive impact on the lives of the people we serve across Canada.\n  To do this, we do everything we can to listen to their needs, to never lose sight of the realities of tomorrow and to innovate in a more committed, more collaborative and more sustainable way. Together, this is how we redefine our practice - for the good of our profession and of future generations.\n  About the Role\n  We are looking to add a meticulous and experienced Quality Inspector to join our growing team! This role is ideal for someone who has a keen eye for detail and takes great pride in maintaining the highest quality standards throughout all project phases.\n  This role will work directly on-site supporting one of our key projects with the Federal Government of Canada.\n  The successful candidate must be able to obtain Security Clearance with the Government of Canada Contract Security Program.\n  What YOU Will Do\n  \n \n   Inspection and Compliance: Conduct thorough inspections of the site, materials, and installations to ensure compliance with project specifications, building codes, and standards\n   Quality Assurance: Monitor and evaluate construction processes, materials, and workmanship to maintain the highest quality standards\n   Document Control: Create detailed inspection reports outlining findings, deficiencies, and recommendations for corrective actions along with maintaining updated and accurate records of inspections, tests, and approvals through the use of inspection and testing plans\n   Client Management: Work closely with external clients as well as internal site teams and subcontractors to facilitate site inspections, visits, and project updates and address any quality-related issues\n   Test and Analysis: Coordinate and oversee material testing, including concrete, steel, and other construction materials, working with 3rd party agencies and clients\n   Training and Support: Provide training and guidance to on-site teams on quality standards, best practices and compliance requirements\n \n \n  What YOU Will Bring\n  \n \n   2-3 years of experience working as a Quality Inspector in the construction industry, preferably on large-scale building and infrastructure projects\n   Strong understanding of construction methods, materials, and building codes/regulations\n   Strong experience in document management and detailed reporting\n   Physical ability to conduct on-site inspections\n   Knowledge of mechanical or multidisciplinary environments is considered a strong asset\n   A passion for upholding the highest standards and building successful client relationships\n   Must be able to obtain security clearance with the Government of Canada\n \n \n  Why Choose Pomerleau\n \n   Competitive salary\n \n \n   4 weeks’ vacation\n \n \n   Group insurance (including a health spending account!)\n \n \n   Group RRSP\n \n \n   Employer paid monthly public transit pass\n \n \n   Fitness Membership or Activity Reimbursement\n \n \n   Employee assistance program\n \n \n   Exciting training opportunities\n \n \n   Dynamic culture\n \n \n   Exciting career opportunities\n \n \n   Summer hours all year long\n \n \n   Access to telemedicine platform Dialogue for free\n \n \n   New remote work policy\n \n \n  What are you waiting for? Let's build something extraordinary together. Apply now to join the team. We want to hear from you!  We thank all applicants, but only those selected for further consideration will be contacted. Be sure to join our Talent Network to stay informed about all job opportunities at Pomerleau.  Pomerleau Inc. is an equal opportunity employer. We are committed to providing employment accommodation in accordance with the Accessibility for Ontarians with Disabilities Act. During any stage of the recruitment and hiring process, accommodation for applicants with disabilities are available upon request."
}