{
    "id": "83040adadc879d50",
    "company": "City of Ottawa",
    "positionName": "Project Manager, Environmental Program",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-20T05:09:40.797Z",
    "url": "https://www.indeed.ca/rc/clk?jk=83040adadc879d50&from=jasx&tk=1hkikauqrkp0g800&bb=0cjRAupgChq89StZWKF-xISDtvbF9jopVB00e6x6ho1pLbjZ69i7dJqDAU7uGCc7zogeiFtYoVLcTVC8kp0TEjWrgT0wXxrWpcsofFliQgz-E83pM9737g%3D%3D&xkcb=SoCE67M3FSgkBuyCcx0HbzkdCdPP&vjs=3",
    "externalApplyLink": "https://jobs-emplois.ottawa.ca/city-jobs/job/Ottawa%2C-ON-Project-Manager%2C-Environmental-Program-ON/728257647/",
    "companyDescription": "",
    "description": "Requisition ID: 11216 Department: Planning, Real Estate & Economic Development Department Service: Economic Development Services Branch: Resiliency, Planning & Policy Branch Employment Type: 2 Full-time Temporary (up to 2 years) and 1 Full-time Temporary (up to 1 year) Work Hours: 35.00 hours per week Affiliation: CIPP Salary Information: $87,068.80 - $105,951.30 annually (2022 rates of pay) Location: City Hall,110 Laurier Avenue West City: Ottawa, ON Job Category: Planning and Infrastructure Application Close: 01/02/2024 \n       \n        \n         \n           JOB SUMMARY \n         \n         \n           Responsible for providing technical advice and management support to the corporation on climate change and climate mitigation and resiliency issues including but not limited to greenhouse gas mitigation issues, energy, energy conservation, renewable energy, transportation and urban planning, climate resiliency, water, wastewater, solid waste, surface water, and/or air quality management issues. The incumbent designs, implements and manages policies/projects/initiatives to enable achievement of branch, departmental, corporate and community climate goals and objectives, retains and manages consultants to assist with project delivery, provides communication support to the unit. \n          Municipal Buildings The incumbent will support the implementation of the Climate Change Master Plan and specifically develop strategies and lead greenhouse gas mitigation efforts associated with municipal building retrofits. Topics of focus may include policies, programs and projects related to municipal net zero building retrofits and new buildings.  District Energy The incumbent will support the implementation of the Climate Change Master Plan and specifically develop strategies, and lead policies, programs and projects related to zero emission community building heating and building energy resiliency, such as through district energy systems, wastewater energy transfer, renewable natural gas, and integrated energy planning.  Climate Resiliency The incumbent will support the implementation of the Climate Change Master Plan and specifically develop strategies and lead policies, programs and projects related to climate resiliency. \n         \n        \n        \n         \n           EDUCATION AND EXPERIENCE \n         \n         \n           Completion of 4-year degree in a relevant discipline such as, but not limited to, Environmental Science (Biology, Chemistry, Earth Sciences, and Physical Geography), Engineering (Mechanical, Electrical, Civil or Environmental), Building Technician, Property Management, Asset Management, Environmental Studies, Public or Business Management, or related program of study.  Minimum of 5 years of related experience managing, implementing, and evaluating projects, programs, policies or plans and supporting operational, strategic, and business planning related to climate initiatives including but not limited to building retrofits, greenhouse gas mitigation, distributed energy resources, energy conservation, renewable energy generation, and/or climate resiliency; or other relevant complex environmental or climate related projects or programs. \n          Experience should include conducting research/analysis, engaging with the general public, technical experts, community and environmental stakeholders and environmental regulators, creating business cases, report writing, and managing external consultants. \n         \n        \n        \n         \n           KNOWLEDGE \n         \n         \n          \n           Areas of environmental responsibility and procedures required to initiate change with municipal government \n           The processes required to initiate change while dealing with inter-governmental stakeholders \n           Broad-based knowledge and the ability to analyze technical information relating to greenhouse gas mitigation , energy conservation, geothermal, renewable energy, renewable natural gas generation; district energy, combustion and electric engines, climate resiliency and risk management, wastewater collection and treatment and bio-solids management; water production distribution and conservation; solid waste, surface and ground water protection and management, and/or air quality management \n           Applicable legislation, policies, regulations, guidelines, and initiatives being undertaken by the federal and provincial governments such as conservation and demand management and integrated resource planning. \n           Regulations relevant to the operational area, such as the Municipal Act, Building Code, Environmental Protection Act, Ontario Water Resources Act, the Environmental Assessment Act, The Electricity Act, The Ontario Energy Board \n           The land use planning processes in Ontario and the tools set out under the Planning Act used to guide growth and development, such as Official Plans and Zoning By-laws. \n           Communication and consultation approaches \n           Facilitation and negotiation processes \n           Business case development and analysis \n           Policy analysis \n           Quality Management systems \n           Research methodologies, data collection and analyses \n           Principles of project management \n           Contract management tools and procedures \n           Program, policy, and project evaluation and performance measurement processes \n           Knowledge of applicable health and safety legislation, including the rights and duties of workers \n          \n         \n        \n        \n         \n          COMPETENCIES, SKILLS AND ABILITIES \n         \n         \n          \n           Work independently, with minimal direction, and collaboratively with all staff as part of a team \n           Able to identify and analyze problems and manage multi-disciplinary assignments \n           Able to provide leadership to plan, lead, coordinate, implement and manage projects to completion, provide functional supervision to others, and to manage work quality, scheduling and completion \n           Possess organizational skills and flexibility to plan, initiate, organize and prioritize own work, to manage a high volume of projects and to deal effectively with multiple demands, conflicting priorities, pressures and deadlines \n           Able to use primary and secondary research techniques to perform data analysis, to evaluate existing and proposed processes, materials, equipment and operational practices, make judgments on the interpretation of issues/data, and formulate recommendations \n           Able to manage contracted work, and foster good working relationships with a variety of stakeholders in order to achieve Branch objectives \n           Possess computer literacy in applications such as MS Office Suite, Powerpoint, database management, and Project tracking \n           Possess excellent consultative, collaboration and interpersonal skills, and the ability to manage confrontational situations, persuade/influence others and to bring conflicting points of view to consensus \n           Possess strong documentation, report writing and presentation skills \n           Demonstrate leadership and initiative \n           Able to foster and maintain positive relationships with a variety of stakeholders \n           Flexible and adaptable \n           Possess diplomacy, discretion and tact \n           Client service oriented \n           Able to demonstrate sound judgement and decision-making capabilities \n           \n         \n        \n       \n       WHAT YOU NEED TO KNOW \n       \n        Language Requirement: English oral, reading, writing \n        Experience and formal training combined with demonstrated performance and ability may substitute for stipulated academic requirements. \n        Please save a copy of the job poster. Once the closing date has passed, it will no longer be available.\n       \n        \n        \n       We wish to thank all applicants for their interest and effort in applying for this position. Only candidates selected for interviews will be contacted.\n        \n        \n       The City of Ottawa promotes the principles of diversity and inclusion and adheres to the tenets of the Canadian Human Rights Act and the Ontario Human Rights Code. We encourage applications from members of Indigenous, Black and other racialized communities, persons with disabilities, women and non-binary persons, persons of all ethnic origins, religions, sexual orientations, classes, gender identities and expressions. Candidates are encouraged to self-identify as a member of one or more designated employment equity groups in the self-identification questionnaire.\n        \n        \n       The City of Ottawa provides accommodation during all parts of the hiring process, upon request, to applicants with disabilities. If contacted to proceed to the selection process, please advise us if you require any accommodation.\n        \n        \n       Accessible formats and communication supports are available upon request. Please contact the HR Service Centre at 613-580-2424, extension 47411."
}