{
    "id": "9472dc73125a9671",
    "company": "City of Ottawa",
    "positionName": "COOP Student, Forestry Assistant",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-18T05:11:35.045Z",
    "url": "https://www.indeed.ca/rc/clk?jk=9472dc73125a9671&from=jasx&tk=1hkikfdo3kecu801&bb=WxOhatT4U5HJji5qaEXltKC9ZFAcVA_cSoPCUzPpJJ2Lwr8jgEL18OtKt0RmS2pUD8HEaT25-NyAFo_oVHz8tpGSs4h1PZLxx9IPT7YpejWPJ6htjZQSOg%3D%3D&xkcb=SoBC67M3FSgyYCQ9SB0CbzkdCdPP&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/applystart?jk=9472dc73125a9671&from=vj&pos=top&mvj=0&spon=0&sjdu=o7sfz71MPdMgyiV0LZq0d4DDplm6SwWjHcxyoDIphKkDQKCIyo90nZUNcgkjLyned7GTjawfJxNXJLwX_BUQL45cYgHUCEphSPBJ7zIXFNhlRqQUXsgJIKqwP1yJfbBw-7VP7Io2JAp9onU2CwMtKYQ9JibNDlHeFjJ6-sqSWQLQq0VgsLNiQ_m2wK5azm99w9_XINGINv7OnqX9-Wv1cg&vjfrom=serp&astse=9e8a5b5e35941eba&assa=4566",
    "companyDescription": "",
    "description": "Requisition ID: 11290 Department: Public Works Dept. Service: Parks Maintenance & Forestry Services Branch: Forest Management Branch Employment Type: Multiple Co-op Student - Up to 5 months; May 2024 - September 2024 Work Hours: 35.00 hours per week Affiliation: Non Union/Non MPE Salary Information: $26.982 - $31.566 per hour (2024 rates of pay) Location: 100 Constellation, Nepean City: Ottawa, ON Job Category: Co-op student recruitment Application Close: 02/02/2024\n        \n        \n       To be considered for this competition you must be enrolled in a registered co-op program at a Canadian post-secondary institution, and eligible for a Work Term during the specified period. Students must upload proof of enrolment in a co-op program when completing your application. \n       \n        \n         \n           JOB SUMMARY \n         \n         \n           This job is exclusively for Coop Students who are enrolled in a recognized post-secondary co-operative education program. \n          The mandate of Parks, Forestry and Stormwater Services is to provide municipal drainage, laboratory testing services for drinking water, solid wastes, effluents, receiving waters and ground waters, stormwater management, engineering and environmental monitoring, parks (including lawn, landscaping, play structures, outdoor field maintenance, and winter maintenance services) and forestry (municipal forests, street and park trees) services in the City of Ottawa. Services and programs are designed to provide a one-stop shop for Ottawa residents, where they can access educational (by-laws and standards), preventative (home owners and landlords) and maintenance service requests (general public) within the service group. \n          You are responsible for carrying out specific assignments and projects involving the provision of support to the Forestry Services branches, including research, data analysis, preparing reports, forestry planning and operations.\n           \n           \n          KEY DUTIES  General Duties \n           \n           Assists with the research, development and execution of forestry studies and policies; \n           Collects, compiles, analyzes and evaluates data related to forestry studies and policies; \n           Assists in writing reports related to specific work; \n           Undertakes special projects or assignments as directed; \n           Updates plans and databases as required; \n           Compiles and reports on industry best practices; and \n           Works in accordance with the provisions of applicable health and safety legislation and all City of Ottawa corporate and departmental policies and procedures related to occupational health and safety.\n          \n           \n           \n          Tree Planting Unit The Forestry Co-op student may carry out specific assignments involving the provision of support to the Forest Establishment Unit: \n          \n           Assists with the planning and preparation for seasonal tree planting and watering operations including marking planting sites, utility locate coordination, route planning and scheduling, database entries; \n           Assists with the development and preparation of various landscape architectural initiatives and projects including site inventory and analysis, tree species selection, and the production of plans and presentation materials; \n           Assists with the planning and implementation of the tree distribution program; \n           Assists with community events and public outreach activities including the preparation of communication materials, volunteer management, and staff scheduling; \n           Tracking and reporting on various tree planting programs; \n          \n         \n        \n        \n         \n          KEY DUTIES (Continued) \n         \n         \n          \n          \n           Tree Maintenance Unit\n            The Forestry Co-op student may carry out specific assignments involving the provision of support to the Forestry Field Operations Branch:\n           \n          \n           Monitoring and reporting on activity performance; \n           Assists with the development of tree maintenance policies, procedures, and standards; \n           Develop, administer, and interpret surveys.\n          \n           \n           \n          Urban and Rural Forest Planning/ Forest and Tree Protection The Forestry Co-op student may carry out specific assignments involving the provision of support to the Forest Protection Unit as well as the Forest Planning and Outreach Unit: \n          \n           Assists with the collection, analysis, and reporting of data related to the City’s tree inventory using handheld GIS system and GPS technology; \n           Collects, analyzes, and reports on data related to various other inventories of forestry assets; \n           Provides support and assistance to Forestry inspectors in various duties such as tree inspections, site plan reviews, tree evaluations, and by-law enforcement; \n           Monitors, and analyzes the collection of field data for select activities related to the management of insects and diseases; \n           Assists with the insect and disease management programs including site monitoring, trap installation, maintenance and reporting, and the assessment of trees and locations for tree injection; \n           Performs investigations into new technologies or procedures to assist with the management of insects and diseases and gauges their applicability to the City of Ottawa and their adaptability to Branch activities. \n          \n         \n        \n        \n         \n          EDUCATION AND EXPERIENCE \n         \n         \n           Enrolment in a recognized co-operative program at a post-secondary institution in one of the following: Forestry, Urban Forestry, Landscape Architecture, Horticulture, Arboriculture, or related field. \n          No experience required \n         \n        \n        \n         \n           KNOWLEDGE \n         \n         \n          \n           Knowledge of urban forestry and/or landscape architectural principles and practices \n           Tree biology/physiology \n           Tree species and insect/disease identification \n           Knowledge of field data collection and recording techniques \n           Knowledge of GPS technology \n          \n         \n        \n        \n         \n          COMPETENCIES, SKILLS AND ABILITIES \n         \n         \n          \n           Oral fluency, reading and/or writing in English (oral fluency, reading and/or writing in French is considered an asset) \n           Communicate effectively both verbally and in writing \n           Ability to analyze and draw conclusions on information \n           Write reports and present information in a clear and direct manner both written and verbal \n           Proficient in MS Office Suite (Word, Excel, Outlook) \n           Analytical and research techniques \n           Attention to detail \n           \n         \n        \n       \n       WHAT YOU NEED TO KNOW \n       \n        Language Requirement: English oral, reading, writing \n        Driver’s License Requirement: A valid Ontario unrestricted G class driver’s license (or provincial equivalent) with no more than 6 demerit points accumulated \n        Please save a copy of the job poster. Once the closing date has passed, it will no longer be available.\n       \n        \n        \n       We wish to thank all applicants for their interest and effort in applying for this position. Only candidates selected for interviews will be contacted.\n        \n        \n       The City of Ottawa promotes the principles of diversity and inclusion and adheres to the tenets of the Canadian Human Rights Act and the Ontario Human Rights Code. We encourage applications from members of Indigenous, Black and other racialized communities, persons with disabilities, women and non-binary persons, persons of all ethnic origins, religions, sexual orientations, classes, gender identities and expressions. Candidates are encouraged to self-identify as a member of one or more designated employment equity groups in the self-identification questionnaire.\n        \n        \n       The City of Ottawa provides accommodation during all parts of the hiring process, upon request, to applicants with disabilities. If contacted to proceed to the selection process, please advise us if you require any accommodation.\n        \n        \n       Accessible formats and communication supports are available upon request. Please contact the HR Service Centre at 613-580-2424, extension 47411."
}