{
    "id": "0504225e15363c52",
    "company": "The Hamlet Veterinary Hospital",
    "positionName": "Veterinarian",
    "jobType": [],
    "location": "2592 Innes Rd, Gloucester, ON",
    "salary": null,
    "postingDateParsed": "2024-01-19T05:10:38.083Z",
    "url": "https://www.indeed.ca/rc/clk?jk=0504225e15363c52&from=jasx&tk=1hkikdavvii12803&bb=Z_xYV__n_sQAK0ynFsc1LrtxXpVqe2tsMmXNXBXpHAco9dIku8bDAzsz_z-Zpa1bn8pgVDUqfa3m5u181vLoVEQuPla04-h3gt9-YFHxQGqqqKZdGr2E1Q%3D%3D&xkcb=SoB867M3FSg6uFQ22p0dbzkdCdPP&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "The Hamlet Veterinary Hospital, located in Ottawa East is looking for a 5th full-time small animal veterinarian.\nWe are a family owned 4-veterinarian practice that focuses on pets, customer care, high quality/dedicated team medicine approach and fear-free methods.\nOur core values are honesty, transparency and integrity.\nWe cultivate a jovial atmosphere, take care of employees and respect their opinions and well-being.\nOur goal is to have a work place where the whole team, the clients and the patients are happy.\nModern equipment, newly remodeled facility and 30 minutes appointments.\nExcellent mentorship environment (surgery, dentistry and medicine). Very competitive salary and benefits to current market.\nFlexible hours, no on calls, Closed every weekends and limited evening hours.\nSchedule focusing on work-life balance and extremely flexible.\nFamily Health/dental benefits, no co-pay, CE, CVO included. Partnership possibilities. Check us on the web to see how highly our clients think of us.\nContact us at thehamletveterinaryhospital@gmail.com or baxa3366@hotmail.com and see if this is the place you are looking for.\nResponsibilities:- Diagnose and treat animals with illnesses or injuries- Perform surgeries and other medical procedures as needed- Conduct regular check-ups and vaccinations- Provide preventive care and advice on nutrition and general pet care- Communicate with pet owners to explain diagnoses, treatment plans, and prognosis- Maintain accurate medical records of all patients- Collaborate with other veterinary professionals to provide comprehensive care\nSkills:- Strong knowledge of veterinary medicine and procedures- Proficient in conducting laboratory tests and interpreting results- Excellent diagnostic and problem-solving skills- Effective communication and interpersonal skills to interact with pet owners and staff members- Ability to handle and restrain animals safely and compassionately- Attention to detail and ability to work in a fast-paced environment\nNote: This job description is not exhaustive and may be subject to change or modification at any time.\nJob Type: Full-time\nBenefits:\n\n Company events\n Dental care\n Discounted or free food\n Employee assistance program\n Extended health care\n Flexible schedule\n On-site parking\n Paid time off\n Profit sharing\n Store discount\n Vision care\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n Monday to Friday\n No weekends\n\nSupplemental pay types:\n\n Bonus pay\n Commission pay\n\nAbility to Relocate:\n\n Gloucester, ON K1B 4Z6: Relocate before starting work (required)\n\nWork Location: In person"
}