{
    "id": "08313cf58b02554a",
    "company": "TechInsights",
    "positionName": "Front-End Teardown Lab Manager",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-11-03T20:17:37.232Z",
    "url": "https://www.indeed.ca/rc/clk?jk=08313cf58b02554a&from=jasx&tk=1hgol75cilemg800&vjs=3",
    "externalApplyLink": "https://techinsights.applytojob.com/apply/rk5XycV7xO/FrontEnd-Teardown-Lab-Manager?source=INDE&~",
    "companyDescription": "",
    "description": "OUR STORY\n  TechInsights is the information platform for the semiconductor industry.\n  Regarded as the most trusted source of actionable, in-depth intelligence related to semiconductor innovation and surrounding markets, TechInsights’ content informs decision makers and professionals whose success depends on accurate knowledge of the semiconductor industry—past, present, or future.\n  Over 650 companies and 55,000 users access the TechInsights Platform, the world’s largest vertically integrated collection of unmatched reverse engineering, teardown, and market analysis in the semiconductor industry. This collection includes detailed circuit analysis, imagery, semiconductor process flows, device teardowns, illustrations, costing and pricing information, forecasts, market analysis, and expert commentary. TechInsights’ customers include the most successful technology companies who rely on TechInsights’ analysis to make informed business, design, and product decisions faster and with greater confidence. For more information, visit www.techinsights.com. \n THE OPPORTUNITY\n  This role is on-site at our Ottawa location.\n  Using your strong organizational and people skills you'll contribute to our top strategic priority, #Speed, by working with various stakeholders to ensure that preliminary data (Teardown, Depot, Optical Imaging) for product arriving at TechInsights is captured and delivered to customers as quickly as possible. Your creativity will be useful when working with other managers to prioritize teardown, part removals, depots, etc. to meet project deadlines. Also, a strong attention to detail will prove useful in maintaining our inventory records in this key role.\n  As the front-end lab manager, you will be responsible for front-end project management, the management of the lab environment, and the development of the front-end lab team.\n  WHAT YOU WILL DO\n  Project Management\n \n   Evaluate and monitor current capacity of the various functions in the front-end lab team.\n   Monitor and maintain queues for various capabilities within the team activities to ensure appropriate turnaround times while accommodating rush work as needed.\n   Report on current queues to stakeholders in the lab and engineering teams.\n   Manage queues and work loading/balancing to ensure target utilization for the team is met.\n   Raises resource contention to appropriate stakeholders and presents options for prioritization.\n   Coordinate closely with the other teams on aspects of project execution including sharing resources for effective resource planning.\n   Estimate and communicate the effort and schedule for proposals, building in risk mitigation plans.\n   Coordinate, submit (where necessary) and process lab work orders and obtain from inventory any parts for their lab team.\n   Actively work with operations groups that provide incoming work as well as operations groups that rely on completed work.\n \n  Develop and Manage Team Members\n \n   Sets objectives and professional development goals with and for individual contributors on their team.\n   Coordinates onboarding new lab team members to familiarize them with our processes and workflows.\n   Motivates, guides, and mentors the lab team, providing regular feedback and enabling the achievement of individual goals.\n   Continuously seeks changes to existing processes to improve efficiency.\n \n  Lab Environment Management\n \n   Monitors tool usage and coordinates optimal utilization of the equipment.\n   Coordinates with team members to update and develop process related documentation.\n   Coordinate schedule of required PMs with equipment Techs.\n   Coordinate regular calibration checks of necessary equipment.\n   Maintain a safe lab environment and address any safety concerns that arise within the lab. (JHSC training to be provided)\n   Regularly attend Joint Health and Safety Committee (JHSC) meetings\n \n  WHO YOU ARE\n \n   Technical diploma or equivalent from a recognized institution in a relevant field or demonstrated technical aptitude.\n   5+ years of hands-on experience with consumer electronic teardown, depot, and optical imaging.\n   3+ years of experience managing an area or multiple teams within a plant or corporate function.\n   Working knowledge of electronic component types, including integrated circuits, integrated circuit packaging, printed circuit boards.\n   Ability to manage multiple projects in a fast-paced environment, meeting sometimes aggressive due dates.\n   Deep knowledge in adapting departmental plans and priorities to address resource and operational challenges.\n   Experience with digital optical imaging and product/component photography.\n   Proficiency in Microsoft office suite (Excel, Word, PowerPoint)\n   Familiarity with LIMS and ERD considered a strong asset.\n \n  As part of the recruitment process for this position, you will be required to submit your latest citizenship and/or permanent residency information. This information will be used to comply with U.S. Export Control Laws and Regulations.\n  WHY WORK WITH US\n \n   Competitive pay and generous benefits (medical, dental, vision, wellness, RRSP/401K Matching)\n   Flexible vacation policy\n   Annual fitness reimbursement\n   Strong sense of camaraderie, mutual respect and shared goals among colleagues\n   Support for community through charitable alliances\n   Professional and career development opportunities\n   Wellness resources and support from management\n \n  Technology knows no bounds, and neither does TechInsights. Bringing together talented humans from different perspectives, backgrounds and abilities is something we take seriously. We’re committed to building an inclusive environment that welcomes you to be your authentic self and allows us to push past the boundaries together. \n TechInsights is committed to meeting the needs of people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process.\n  As part of any recruitment process, TechInsights collects and processes personal data relating to job applicants. We are committed to being transparent about how we collect and use that data and to meeting our data protection obligations. Our Privacy policy can be referenced here: https://www.techinsights.com/privacy-policy\n  \n rk5XycV7xO"
}