{
    "id": "090e69d232f9f7db",
    "company": "IBM",
    "positionName": "Directeur de projet Expert Labs",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-09-13T06:49:43.569Z",
    "url": "https://www.indeed.ca/rc/clk?jk=090e69d232f9f7db&from=jasx&tk=1hb2v5rcfk7vv800&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=090e69d232f9f7db&atk=&xpse=SoD267I3Ki2TyRR1I50LbzkdCdPP",
    "companyDescription": "",
    "description": "Introduction\n   Chez IBM, nos directeurs de projet excellent en dirigeant et en coordonnant le rendement global, la portée, le coût et les produits livrables d'une équipe de projet. Nos clients s'appuient sur des rapports d'état opportuns et efficaces, et en tant que directeurs de projets, vous serez responsable de l'orientation du projet, de la définition des paramètres et de la gestion du rendement. Si vous êtes prêts à aider nos clients et nos équipes de projets à réussir, nous aimerions vous rencontrer!\n   \n   \n  Votre rôle et vos responsabilités\n   La responsabilité principale du directeur de projet consiste à gérer les efforts des ressources IBM, des employés du client et des fournisseurs tiers pour s'assurer qu'une solution intégrée répond aux besoins du client. À titre de directeur principal de projet au sein du Bureau de gestion des projets (PMO), vous dirigerez des équipes interfonctionnelles pour réaliser des projets qui s'étendent sur plusieurs unités commerciales. En utilisant les meilleures pratiques de gestion de projet, vous serez responsable de la livraison d'un portefeuille de projets. Le directeur de projet travaille de façon autonome, mais informe rapidement la direction de l'état d'avancement des travaux, soulève les questions et les risques au niveau approprié et au moment opportun, travaille de façon efficace et efficiente avec un minimum de supervision, conseille et guide les autres professionnels, cherche à obtenir des conseils sur les questions critiques, s'il y a lieu, et possède un solide niveau d'expertise en gestion de projet. Le directeur de projet est responsable de l'exécution du plan de projet global, du budget, de la structure, de l'échéancier et des exigences en matière de dotation en personnel de l'organisation.\n   \n   Principales responsabilités du poste\n   \n  \n   Assurer une discipline de gestion de projet et un cadre pour les équipes de projet Expert Labs.\n    Fournir une orientation et un contrôle techniques pour coordonner et gérer les activités du personnel de projet Expert Labs.\n    Identifier, suivre et gérer les dépendances des projets afin d'assurer une utilisation optimale des ressources, l'identification continue des risques et la réalisation rapide des avantages du projet.\n    Identifier les parties prenantes et les gérer à différents niveaux au sein de l'organisation, en adaptant votre style et votre approche à leurs besoins, en personne et à distance.\n    Tenir des réunions régulières avec les clients et les parties prenantes du projet.\n    Organiser et présenter l'information sur le projet de façon complète et appropriée en fonction de l'auditoire et de la situation, y compris produire des rapports à l'intention de la direction.\n    Fournir des prévisions financières aux chefs de la prestation.\n    Maintenir la cadence de gestion avec les chefs de la prestation afin de fournir des informations sur l'état du projet.\n    Administrer la procédure de contrôle des modifications au contrat avec le client.\n    Maintenir la communication sur le projet avec le client et gérer les attentes du client.\n    Utilisation du processus de recours hiérarchique et gestion des situations critiques. Capacité de clarifier clairement l'énoncé du problème. Avoir recours à la méthode de résolution des problèmes, la pensée critique et l'analyse des causes fondamentales pour disséquer les questions complexes. Générer, évaluer et mettre en œuvre des solutions possibles et surveiller les résultats.\n    Aider à estimer et à évaluer les nouveaux projets.\n    Créer des livrables de gestion de projet (rapports d'état, suivi financier, plan de projet, risques, problèmes, actions, journaux de décisions, etc.)\n    Développer une connaissance des offres d'Integration Expert Labs avec une sensibilisation aux nouvelles technologies et solutions.\n  \n   \n   Expertise professionnelle et technique requise\n   \n  \n    Baccalauréat ou diplôme avec 4 années d'expérience au sein d'une organisation de services consultatifs aux clients.\n    Maîtrise de l'anglais et du français: Posséinez d'excellentes compétences en communication écrite et verbale en français et en anglais et doivent être basées au Canada.\n    Certification de gestion de projet (PMP, Scrum Master, PMI-ACP, ou autres certifications)\n    Expérience et compétence dans l'utilisation de MS Project et d'autres outils de gestion de projet.\n    Expérience de travail avec plusieurs méthodologies de projet (cascade, Agile, Scrum)\n    Solides compétences en communication verbale et écrite.\n    Expérience de la communication avec les chefs opérationnels.\n    Expérience de travail dans un environnement de bureau virtuel et maintien d'une présence active et dynamique par téléphone, Slack et courriel.\n    Excellentes compétences en gestion des relations et en facilitation.\n    Leadership personnel solide et compétences en gestion avec un style de collaboration.\n    Capacité de voyager jusqu'à 50 % du temps au besoin.\n  \n   \n   Expertise professionnelle et technique privilégié\n   \n  \n    MBA de préférence.\n  \n \n \n  \n    \n    A propos de l'unité commerciale\n   Alimentée par les technologies cognitives, plus de 150 offres SaaS, et des aperçus en temps réel, l'équipe des marchés mondiaux offre une expertise intégrée afin d'aider nos clients à prendre de meilleures décisions et à innover tout en collaborant avec leurs clients, partenaires et fournisseurs. Rejoignez-nous afin de continuer à stimuler l'innovation avec le portefeuille le plus complet pour les entreprises de tous les secteurs d'activité.\n \n \n  \n    \n    Votre vie chez IBM\n   Dans un monde où la technologie ne s'arrête jamais, nous comprenons que, le dévouement au succès de nos clients, les innovations importantes, et la confiance et la responsabilité personnelle dans toutes nos relations, se reflètent dans ce que nous faisons en tant qu'IBMistes alors que nous nous efforçons d'être le catalyseur dans un monde qui fonctionne mieux.\n   Être un IBMiste signifie que vous serez en mesure d'apprendre et d'évoluer personnellement et professionnellement. Vous serez encourager à expérimenter au quotidien, tout en ayant une confiance et un soutien constant dans un environnement où chacun peut s'épanouir quelle que soit leur expérience personnelle ou professionnelle.\n   Nos IBMistes sont soucieux de la croissance de notre entreprise et toujours curieux d'en savoir plus. Ils sont ouverts aux commentaires et à l'apprentissage de nouvelles informations et compétences pour évoluer constamment. On leur fait confiance pour fournir des commentaires continus pour aider les autres, ainsi que pour collaborer avec leurs collègues en gardant un esprit d'équipe qui est ouvert à différentes perspectives afin d'obtenir des résultats exceptionnels pour nos clients. Le courage dont nos IBMistes ont besoin pour prendre des décisions critiques tous les jours est essentiel pour qu'IBM devienne le catalyseur du progrès. Ils doivent toujours relever les défis avec les ressources dont ils disposent, posséder une attitude positive et s’efforcer toujours d'adopter une approche axée sur les résultats dans tout ce qu'ils font.\n   Êtes-vous prêt à devenir IBMiste ?\n \n \n  \n    À propos d'IBM\n   La plus grande invention d'IBM, c'est l'IBMiste. Nous sommes convaincus que la mise en application de l'intelligence, de la raison et de la science nous permet d'améliorer l'activité économique, la société et la condition humaine, en donnant vie à la puissance d'un nuage hybride ouvert et d'une stratégie d'IA pour nos clients et nos partenaires du monde entier.\n   \n   Ayant réinventé sans relâche depuis 1911, nous ne sommes pas seulement l'une des plus grandes entreprises au monde, nous sommes aussi l'un des plus grands employeurs en TI et en services-conseils, avec de nombreuses entreprises du classement Fortune 50 s'appuyant sur IBM Cloud pour gérer leur entreprise.\n   \n   Chez IBM, nous sommes fiers d'avoir été parmi les premiers à adopter l'intelligence artificielle, l'informatique quantique et la chaîne de blocs. C'est le moment de vous joindre à nous et de devenir un innovateur technologique responsable et une force au service du bien dans le monde.\n \n \n  \n    \n    Énoncé du lieu de travail\n   Doit avoir la capacité de travailler au Canada sans parrainage.\n   \n   Ce poste comporte des tâches qui mettent en jeu des technologies visées par des sanctions en vertu de la réglementation sur les exportations. Si vous êtes un ressortissant étranger de l'un des pays sanctionnés par les États-Unis (Cuba, Iran, Corée du Nord, Syrie et les régions ukrainiennes de Crimée, Luhansk, Donetsk, Kherson et Zaporizhia) titulaire d'un permis de travail, vous n'êtes pas admissible à ce poste.\n \n \n  \n    \n    Vous et IBM\n   IBM s'engage à créer un milieu diversifié et est fière de souscrire au principe de l'égalité d'accès à l'emploi. Tous les candidats qualifiés seront pris en considération pour un emploi sans égard à la race, à la couleur, à la religion, ausexe, à l'identité ou à l'expression de genre, à l'orientation sexuelle, à l'origine nationale, à la génétique, à la grossesse, aux handicaps, à l'âge, au statut de vétéran ou à d'autres caractéristiques. IBM s'engage également à se conformer à toutes lespratiques équitables en matière d'emploi à l'égard du statut de citoyen et d'immigrant."
}