{
    "id": "090e69d232f9f7db",
    "company": "IBM",
    "positionName": "Expert Labs Project Manager",
    "jobType": [],
    "location": "Markham, ON",
    "salary": null,
    "postingDateParsed": "2023-09-13T22:41:41.214Z",
    "url": "https://www.indeed.ca/rc/clk?jk=090e69d232f9f7db&from=jasx&tk=1haqc2kmdjoou800&vjs=3",
    "externalApplyLink": "https://careers.ibm.com/job/19088483/expert-labs-project-manager-remote/?codes=JB_Indeed&codes=1-INDEED",
    "companyDescription": "",
    "description": "Introduction\n   At IBM, our Project Managers excel by leading and coordinating a project team’s overall performance, scope, cost, and deliverables. Our clients rely on timely and efficient status reports, and as Project Manager, you will drive the charge with project direction, metric definition, and performance management. If you are ready to help our clients and project teams succeed, we would love to meet you!\n   \n   \n  Your Role and Responsibilities\n   The project manager's primary responsibility is to manage the efforts of IBM resources, client employees, and third-party vendors to ensure that an integrated solution provided meets the client's needs. As a Senior Project Manager within the Project Management Office (PMO), you will lead cross-functional teams to deliver projects that span multiple business units. Using project management best practices, you will be responsible for delivering a portfolio of projects. The Project Manager works independently but keeps leadership promptly apprised of work status, raising issues and risks to the appropriate level and at the appropriate time; works effectively and efficiently with minimal oversight; advises and guides other professionals; seeks guidance on critical issues as appropriate; and has a solid level of expertise in project management. The Project Manager is responsible for delivering the organization's overall project plan, budget, structure, schedule, and staffing requirements. \n   \n   Primary Job Responsibilities\n   \n  \n   Provide project management discipline and a framework for Expert Labs project teams.\n    Provide technical direction and control to coordinate and manage the activities of Expert Labs project personnel.\n    Identify, track, and manage project dependencies to ensure optimal utilization of resources, ongoing risk identification and timely benefits realization on the project.\n    Identify stakeholders and manage at varying levels within the organization, tailoring your style and approach to meet their needs, both in-person and remotely.\n    Conduct regular status meetings with clients and project stakeholders.\n    Organize and present project information comprehensively that is appropriate for the audience and the situation, including Executive-level reporting.\n    Provide financial forecasts to Delivery Leaders.\n    Keep management cadence with the Delivery Leaders to provide insight on project status. \n   Administer the contract change control procedure with the client.\n    Maintain project communications with the client and manage client expectations. \n   Escalation and critical situation management. Ability to clearly clarify the problem statement. Apply methodical problem-solving, critical thinking and root cause analysis to dissect complex issues. Generate, evaluate, and implement possible solutions and monitor outcomes.\n    Assist with estimating and sizing new projects.\n    Create Project Management deliverables (status reports, financial tracking, project plan, risks, issues, actions, decisions logs, etc.) \n   Develop knowledge of Integration Expert Labs offerings with awareness of emerging technologies and solutions.\n  \n   \n   Required Technical and Professional Expertise\n   \n  \n    Bachelor's degree or Diploma with 4+ years of experience working in a client-facing consultative services organization.\n    Fluent in English and French: Possess excellent written and verbal communication skills in both English and French and must be based in Canada\n    Project Management Certification (PMP, Scrum Master, PMI-ACP, or other certifications)\n    Experience and proficiency using MS Project and other project management tools.\n    Experience working with multiple project methodologies (waterfall, Agile, Scrum)\n    Strong verbal and written communication. \n   Experience communicating with C-suite executives.\n    Experience working in a virtual office setting and maintaining an active and dynamic presence via phone, Slack and email.\n    Possess excellent relationship management and facilitation skills.\n    Solid personal leadership and management skills with a collaborative style.\n    Ability to travel up 50% when required.\n  \n   \n   Preferred Technical and Professional Expertise\n   \n  \n    MBA preferred\n  \n \n \n  \n    \n    About Business Unit\n   IBM has a global presence, operating in more than 175 countries with a broad-based geographic distribution of revenue. The company’s Global Markets organization is a strategic sales business unit that manages IBM’s global footprint, working closely with dedicated country-based operating units to serve clients locally. These country teams have client relationship managers who lead integrated teams of consultants, solution specialists and delivery professionals to enable clients’ growth and innovation. By complementing local expertise with global experience and digital capabilities, IBM builds deep and broad-based client relationships. This local management focus fosters speed in supporting clients, addressing new markets and making investments in emerging opportunities. Additionally, the Global Markets organization serves clients with expertise in their industry as well as through the products and services that IBM and partners supply. IBM is also expanding its reach to new and existing clients through digital marketplaces.\n \n \n  \n    \n    Your Life @ IBM\n   In a world where technology never stands still, we understand that, dedication to our clients success, innovation that matters, and trust and personal responsibility in all our relationships, lives in what we do as IBMers as we strive to be the catalyst that makes the world work better.\n   Being an IBMer means you’ll be able to learn and develop yourself and your career, you’ll be encouraged to be courageous and experiment everyday, all whilst having continuous trust and support in an environment where everyone can thrive whatever their personal or professional background.\n   Our IBMers are growth minded, always staying curious, open to feedback and learning new information and skills to constantly transform themselves and our company. They are trusted to provide on-going feedback to help other IBMers grow, as well as collaborate with colleagues keeping in mind a team focused approach to include different perspectives to drive exceptional outcomes for our customers. The courage our IBMers have to make critical decisions everyday is essential to IBM becoming the catalyst for progress, always embracing challenges with resources they have to hand, a can-do attitude and always striving for an outcome focused approach within everything that they do.\n   Are you ready to be an IBMer?\n \n \n  \n    About IBM\n   IBM’s greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.\n   \n   Restlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we’re also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business. \n   \n   At IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it’s time for you to join us on our journey to being a responsible technology innovator and a force for good in the world.\n \n \n  \n    \n    Location Statement\n   Must have the ability to work in Canada without sponsorship.\n   \n   This role will involve working with technology that is covered by Export Regulations sanctions. If you are a Foreign National from any of the following US sanctioned countries (Cuba, Iran, North Korea, Syria, and the Crimea, Luhansk, Donetsk, Kherson, and Zaporizhia regions of Ukraine) on a work permit, you are not eligible for employment in this position.\n \n \n  \n    \n    Being You @ IBM\n   IBM is committed to creating a diverse environment and is proud to be an equal-opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender, gender identity or expression, sexual orientation, national origin, caste, genetics, pregnancy, disability, neurodivergence, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status."
}