{
    "id": "0befe59918fcfde9",
    "company": "McIntosh Perry",
    "positionName": "Senior Geotechnical Engineer - Ottawa",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-16T18:53:04.973Z",
    "url": "https://www.indeed.ca/rc/clk?jk=0befe59918fcfde9&from=jasx&tk=1hcvfn7eljiim800&vjs=3",
    "externalApplyLink": "https://can231.dayforcehcm.com/CandidatePortal/en-US/mcintoshperry/Posting/View/2003?source=Indeed",
    "companyDescription": "",
    "description": "Are you looking for an opportunity where you can make an impact in the community where you work and live? Do you want to join a growing company that continues to evolve with people, projects, commitment to clients and creativity? McIntosh Perry is the North American platform for Egis Group, a leading global consulting, construction engineering and operating firm, working side by side with clients with commitment to solving project related challenges, offering creative solutions and collaboration. \n\n Our team's expertise, gained through decades of experience, means clients can rely on us to quickly deliver high-quality and successful projects. \n\n \nOur core values validate everything we believe in:\n Walk a mile in someone else’s shoes - Treat others as they would like to be treated \nMake Momma proud - Do the right thing \nEvery McIntosh has a core - Be a leader \nPass. Shoot. Score. - Becoming excellent together \nDid you dot the i’s and cross the t’s? - Personal responsibility \nDon’t forget to cut the ribbon - Making a difference \n\n We are looking for new talent to join our collaborative, dedicated and supportive team of professionals and deliver high-quality projects regardless of the project size. \n\n McIntosh Perry’s foundation engineering team provides geotechnical services for a variety of public and private infrastructure projects. Our project work includes transportation, large and small municipal and provincial infrastructures, building foundations, slope hazards assessment, subdivision development, municipal pavement design, and many more applications. \n\n Our day-to-day assignments may include the design and inspection of deep and shallow foundation systems, settlement analysis of sensitive and compressible soils, instrumentation and monitoring, and meeting our internal and external clients' needs for a large spectrum of design applications. Site attendance during the construction phase of the project and providing expert opinion on the quality and conformance of deliverables with the engineering recommendations will be occasionally needed. \n\n As our Senior Geotechnical Engineer, you will work on a variety of projects and develop your skills with guidance and mentorship from our senior technical and management team. You will also provide valuable mentorship to our junior staff. The location of our project assignments may often go beyond the Ottawa geographical limits across Ontario. \n\n The ideal candidate will have previous experience with MTO projects and have RAQs certification (low to medium complexity) \n\n Job Duties & Responsibilities \n\n \n \n Manage client relationships throughout the project term, including providing technical advice and managing project schedules and budgets \n Managing the proposal process including preparing costs estimates for public and private sector markets; \n Project management of geotechnical investigation and design assignments including responsibility for project scope, schedule, quality, safety, and cost control; \n Geotechnical analysis, design and reporting; \n Liaise and collaborate with other disciplines within McIntosh Perry on joint proposals and projects; \n Conduct site reviews as needed during conceptual, investigation, and construction phases; \n Liaise with clients, government and/or regulatory bodies as well as contractors; \n Play an active role in business development activities and marketing by establishing and maintaining positive client relationships with internal and external stakeholders; \n Provide guidance, mentoring and geotechnical design training to staff as required; \n Other duties as may be assigned from time to time. \n Qualifications \n\n \n \n Being a licensed member of Professional Engineers Ontario; \n A minimum of 10 years of consulting experience, preferably in Ontario; \n Previous experience with MTO projects and have RAQs certification (low to medium complexity) is required; \n Knowledge and working experience with applicable regulations, codes, and guidelines such as CFEM, CHBDC, OPSS, OBC, etc. \n Strong written and verbal communication skills; \n Possession of a Graduate Degree in Geotechnical or Geological Engineering is an asset; \n Possession of Class G driver’s license; \n Ability to demonstrate or provide evidence of project management skills, client management, and interpersonal skills; \n Demonstrated experience working with or managing multi-disciplinary project teams; \n Previous construction inspection experience; \n Laboratory experience in reviewing/ordering testing or management of laboratory operations is an asset, and; \n Demonstrated project experience working with various municipalities across Ontario with preference given to previous experience within the Ottawa. \n McIntosh Perry Egis Group is an equal opportunities employer offering a competitive salary and benefits to those with the skills suited to the needs of our clients. \n\n McIntosh Perry Egis Group welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process. \n\n This role is eligible for a referral bonus in line with the Referral Program. If you have been referred, please provide the employee name at the time of application (Excellent together 'employee name')."
}