{
    "id": "1234567890",
    "company": "Canopy Growth Corporation",
    "positionName": "Quality Assurance Technician - Lot Release",
    "jobType": [],
    "location": "Smiths Falls, ON",
    "salary": null,
    "postingDateParsed": "2023-09-27T22:40:29.611Z",
    "url": "",
    "externalApplyLink": "https://www.workopolis.com/jobsearch/viewjob/oAdrkXBRa_JP9VkFQVOMZm7XtoKOBZNh2iXWlJVos-XBkvvSW3KD-26oqzLPH4NS?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "companyDescription": "",
    "description": "At Canopy Growth, our mission is clear: improve lives, end cannabis prohibition, and strengthen communities. We believe that cannabis can be a force for good. We’re building a consumer-centric organization that is focused on sharing the transformational potential of cannabis with the world. We will achieve this through an innovative and disruptive portfolio of cannabis and hemp-derived products.\n\nWith millions of square feet of licensed production capacity and operations spanning four continents, Canopy Growth is the world's leading cannabis and hemp company. We recognize that employees are at the core of our success, and we take pride in a corporate culture that emphasizes inclusiveness, collaboration, and diversity.\n\nOur employees come from a wide range of backgrounds, each bringing their own unique skills and talents to the table, working together to continue our incredible momentum of growth. If you are interested in building global challenger brands, scaling a business, and working in a values-driven environment, we want to hear from you!\n\nThe Opportunity\n\nReporting to the Manager, Quality Assurance, the Quality Assurance Technician – Lot Release is responsible for collaborating with key teams to ensure compliance with Health Canada regulations. You must be very well organized and detail oriented. You must have sound judgement and great time management skills mixed with the ability to work as part of an ever-growing team.\n\nResponsibilities\n\n- Collaborate with Quality Control, Regulatory Affairs, Operations, Logistics and Marketing departments to ensure compliance with internal procedures and Health Canada regulations.\n- Compiling and reviewing CMO lot release reports.\n- Tracking “right the first time” data for trending.\n- Reviewing and approving CMO transfer documents.\n- Following up on issues and initiating non-conformity reports and planned deviations as required.\n- Supporting continuous improvement projects.\n- Other tasks within the Quality department as assigned.\n\nExperience\n\n- Degree or diploma in biology, biotechnology, pharmacology or related field (or equivalent working experience).\n- Working knowledge of Good Documentation Practices, Good Manufacturing Practices and Cannabis Regulations as asset.\n- Experience reviewing and revising regulated documents.\n- Experience working in an ISO:9001 or GMP environment considered an asset.\n- Experience in a fast-paced working environment where time management, organization and problem solving were key skills.\n- Working knowledge of Microsoft Office suite of programs.\n- Experience with ERP systems (Sage) considered an asset.\n- Strong verbal and written communication skill."
}