{
    "id": "1d450b36a6b71099",
    "company": "Cisco Systems",
    "positionName": "Lab Engineer",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-09-15T06:49:34.392Z",
    "url": "https://www.indeed.ca/rc/clk?jk=1d450b36a6b71099&from=jasx&tk=1hb2v5rcfk7vv800&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=1d450b36a6b71099&atk=&xpse=SoDm67I3Ki2VPKRTrZ0LbzkdCdPP",
    "companyDescription": "",
    "description": "What You'll Do\n \n \n   You will be part of the Global Lab Solutions (GLS) team, which is responsible for day-to-day lab operations for more than one (1) million square feet of Engineering lab space world-wide as well as designing, delivering, and managing programs for the governance of Cisco Engineering Labs.\n \n \n   Your role will involve providing general operational network and system administration support for GLS-managed, Engineering Labs in Ottawa, Canada.\n \n \n \n   Who You'll Work With\n \n \n   Are you excited to be part of the next wave of Internet? Our team works alongside outstanding Cisco engineers who are at the leading edge of defining and creating compelling next generation technology and solutions. You will be making a significant contribution on the Cisco products as part of a passionate team that is redefining this industry.\n \n \n   GLS is a centralized team of approximately 80 talented professionals who focus on driving standard methodologies and encouraging innovation across Engineering Labs through collaboration, data, teamwork, and technology.\n \n \n \n   What You’ll Do:\n \n \n   The Lab Engineer will provide network, system administration and general operational support for Engineering labs located on the Ottawa campus, Cisco Systems Canada. This position will be lead for the GLS Ottawa team and will advise the members of the team in providing logistical support to lab clients, including equipment installation, network connectivity, shipping & receiving, inventory control, RMA support, e-waste disposal, EHS/safety inspections, ISO audits, etc.\n \n \n   Ottawa GLS team leadership\n   Installation, monitoring, debug, and maintenance of GLS Ottawa Lab network infrastructure.\n   Installation of servers and related operating systems (OS)\n   Installation, configuration and troubleshooting of Ottawa Lab Users’ testbeds and supporting equipment.\n   Provision and support of virtual solutions such as vCenter/ESXi, including troubleshooting and configuration.\n   Installing / supporting the installation of security patches for: Linux, Windows and ESXi systems as directed by Cisco Information Security.\n   Maintaining excellent client relationships with local Business Unit (BU) leaders and GLS clients.\n \n \n \n   Basic Qualifications:\n \n \n   Cisco Certifications: CCNA or CCNP required; CCIE recommended.\n   Proven understanding of Cisco router and switch product lines with a detailed understanding of Cisco Internet Operating Systems. (IOS, IOS XE, IOS XR, NX-OS)\n   Proficiency in server-based operating systems. PC / Windows, Linux OS types and desktop and server applications: WINS, DHCP, NT domain structure, domain controllers, group policies, etc.\n \n \n \n   Preferred Qualifications:\n \n \n   Knowledge of auto-mounters and communication protocols: NFS, TFTP, FTP, SSH, SCP, DNS, LISP, NIS+. TCP/IP, subnetting, routing protocols, Ethernet media.\n   Understanding of LAN switching and configuration of VLAN’s and Spanning Tree Protocol.\n   Solid grasp of active directory (AD) and the ability to troubleshoot Linux AD connections via Vintela.\n   Knowledge of KVM, Openstack, Docker and ESXi.\n   Knowledge of scripting and web services: Python, Bash Shell, Apache, NGINX\n   Knowledge on networking monitoring tools: Nagios, Zabbix, Wireshark\n   Self-starter who is able to work independently.\n   Good communication and collaboration skills to work across multiple GLS teams, with local clients and leaders, and with partner organizations (Cisco IT, WPR, Security & Trust Org (STO), etc.)\n   Highly organized, with the ability to structure/manage projects.\n \n \n \n   Why Cisco?\n \n \n   #WeAreCisco. We are all unique, but collectively we bring our talents to work as a team, to develop innovative technology and power a more inclusive, digital future for everyone. How do we do it? Well, for starters – with people like you!\n \n \n   Nearly every internet connection around the world touches Cisco. We’re the Internet’s optimists. Our technology makes sure the data traveling at light speed across connections does so securely, yet it’s not what we make but what we make happen which marks us out. We’re helping those who work in the health service to connect with patients and each other; schools, colleges, and universities to teach in even the most challenging of times. We’re helping businesses of all shapes and sizes to connect with their employees and customers in new ways, providing people with access to the digital skills they need and connecting the most remote parts of the world – whether through 5G, or otherwise.\n \n \n   We tackle whatever challenges come our way. We have each other’s backs, we recognize our accomplishments, and we grow together. We celebrate and support one another – from big and small things in life to big career moments. And giving back is in our DNA (we get 10 days off each year to do just that).\n \n \n   We know that powering an inclusive future starts with us. Because without diversity and a dedication to equality, there is no moving forward. Our 30 Inclusive Communities, that bring people together around commonalities or passions, are leading the way. Together we’re committed to learning, listening, caring for our communities, whilst supporting the most vulnerable with a collective effort to make this world a better place either with technology, or through our actions.\n \n \n   So, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us! #WeAreCisco\n \n \n\n\n Message to applicants applying to work in the U.S.:\n  \n  \n \n  When available, the salary range posted for this position reflects the projected hiring range for new hire, full-time salaries in U.S. locations, not including equity or benefits. For non-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\n  \n \n  U.S. employees have \n  access to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long-term disability coverage, basic life insurance and numerous wellbeing offerings. Employees receive up to twelve paid holidays per calendar year, which includes one floating holiday, plus a day off for their birthday. Employees accrue up to 20 days of Paid Time Off (PTO) each year and have access to paid time away to deal with critical or emergency issues without tapping into their PTO. We offer additional paid time to volunteer and give back to the community. Employees are also able to purchase company stock through our Employee Stock Purchase Program.\n  \n \n  Employees on sales plans earn performance-based incentive pay on top of their base salary, which is split between quota and non-quota components. For quota-based incentive pay, Cisco pays at the standard rate of 1% of incentive target for each 1% revenue attainment against the quota up to 100%. Once performance exceeds 100% quota attainment, incentive rates may increase up to five times the standard rate with no cap on incentive compensation. For non-quota-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid."
}