{
    "id": "1f43c6643e5bfc42",
    "company": "GeneBio Systems, Inc.",
    "positionName": "Sales Marketing Associate, Lab Research in Life Sci.-Ottawa/Montreal Metro",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-09-20T06:48:55.453Z",
    "url": "https://www.indeed.ca/rc/clk?jk=1f43c6643e5bfc42&from=jasx&tk=1hb2v4hd2is3q800&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "GeneBio Systems is a biotech company dedicated to help our customers by providing solutions to research and clinical laboratories. GeneBio Systems was founded on the strong scientific foundation stemming from our founding team's extensive biotechnological and life science research experience. Our professionals have many years of research and development experience in pharmaceutical, medical device and life science and laboratory products.\nAs a result of rapid growth of our business, we are hiring additional talents to expand our team.\nGeneBio is seeking outstanding applicants for a Sales/Marketing Associate I, Molecular Biology Life Science Lab Research to support ongoing sales initiatives. This position is located in\nOttawa and Montreal\nCandidates currently located in a nearby community are strongly preferred.\nThe ideal candidate has experience in molecular biology, with BSc degree in a life science discipline, and has an ability to build relationships with clients, working with colleagues, increasing sales and providing solutions that benefit both the employer and the client. With a knowledge and passion for the life science research, and development, the successful candidate will bring energy and drive to our existing team, opening up opportunities and expanding our current business portfolio.\nResponsibilities and Duties\n· Represent the company in a professional, respectful manner\n· Build, maintain and expand a network of (new) external relations, detect and realize new business opportunities\n· Create sales and marketing presentations for a broad range of researchers in clients' laboratories or otherwise sites.\n· Comfortable communicating with people at all levels, field to principal scientists\n· Effectively manage timely customer and product information, forecast accuracy and provides custom solutions\n· Partner with product managers managers, technical support services and sales management to strategize on new business development activities and set sales and revenue targets\n· Excellent communication skills;\n· Provide consistent follow up on customer communications to maintain strong professional relationships and explore ongoing and new opportunities\nQualifications and Skills\n· A minimum of BSc in a life science discipline preferably with 1 or more years of experience in a laboratory; though those who graduated in the last year are also encouraged to apply\n· A understanding of the sales process or willingness to acquire new skills and knowledge, and a strong passion to be successful.\n· Self-motivated with the ability to develop within a dynamic, fast-paced environment\n· Strong interpersonal and communication skills\n· Results driven with a high sense of urgency\n· Has a desire to learn and develop within the sales and marketing industry\n· Working towards career progression and growth within a company\n· Prior experience in sales or a customer-focused environment is an asset\nAbove all, driven, a go-getter who is independent, hungry for successes. Must be a great communicator.\n· Must be over the age of 18 with no criminal conviction or penal offence related to the tasks and responsibilities of the role. Recent graduates are encouraged to apply.\nThis position is compensated in salary with a performance based bonus, with an opportunity to participate in Company's employee stock option plan and conversion to a salary based position after 12-month.\nJob Type: Full-time\nSalary: Up to $49,000.00 per year\nBenefits:\n\n On-site parking\n Paid time off\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n 8 hour shift\n\nSupplemental pay types:\n\n Bonus pay\n\nApplication question(s):\n\n Must have a BSc in Biological discipline.\n\nEducation:\n\n Bachelor's Degree (required)\n\nWork Location: On the road\nExpected start date: 2023-10-01"
}