{
    "id": "21d9bef6e72a7816",
    "company": "General Dynamics Mission Systems - Canada",
    "positionName": "System Engineering Analyst, V&V",
    "jobType": [
        "Permanent"
    ],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-05T03:13:44.880Z",
    "url": "https://www.indeed.ca/rc/clk?jk=21d9bef6e72a7816&from=jasx&tk=1hjm3b3kbip98800&vjs=3",
    "externalApplyLink": "https://jobs.smartrecruiters.com/GDMSI/743999956816432-system-engineering-analyst-v-v",
    "companyDescription": "",
    "description": "Company Description\n  At General Dynamics Mission Systems–Canada, our focus extends beyond engineering technology solutions—we are dedicated to cultivating careers. Our mission is to establish a workplace that thrives on diversity, where your beliefs, cultural background, experiences, and ideas are valued and contribute to our collective strength. If you seek a purpose-driven career solving some of the world’s most critical problems, alongside some of the brightest engineering minds, your application is welcome. Join a community where your unique perspective propels innovation.\n  Job Description\n  We are seeking a Verification and Validation Analyst with broad system knowledge to join our team! While experience in the Airborne or Naval ASW domain, or Acoustic and Post Mission analysis is desirable, we are open to candidates with a diverse professional and educational backgrounds. This role will be a combination of working remotely and onsite at our Ottawa office.\n  In this role, you can expect to:\n \n   Perform requirements analysis and definition for new and updated Acoustics Products;\n   Develop plans for system integration and formal system test;\n   Produce system test descriptions;\n   Perform traceability of system requirements to functional, hardware and software tests;\n   Report to the project engineer on all aspect of system integration and formal test;\n   Prepare formal test reports;\n   Provide support for proposal development by proposing requirements and design for new features;\n   Conduct Acoustic Data analysis as well as Post Mission analysis with an eye to improving product performance;\n   Perform operational testing and evaluation for Acoustics systems both at GDMS-C and customer premises;\n   Develop realistic Acoustic test scenarios for the testing and qualification of the Acoustic Processor products;\n   May perform software development responsibilities as required.\n \n  \n  Qualifications\n  Required:\n \n   Candidates must possess either a science, engineering degree or equivalent operational experience as a subject matter expert;\n   Strong problem solving and root cause analysis skills;\n   Enthusiastic contributor, willingness to learn new skills and takes on ownership of work;\n   Strong interpersonal and time management skills, whether working as a self-motivated individual, a team member or leader;\n   Experience in using generic electronic test equipment;\n   Broad knowledge of the System development process and lifecycles.\n \n  Desired:\n \n   Broad knowledge of the Requirements definition and management;\n   Background in basic electronic principles;\n   Experience with software and hardware engineering processes and tools;\n   Experience working in an avionics laboratory environment;\n   Experience with Matlab is desirable;\n   Experience with UNIX/LINUX;\n   Experience in ASW or Avionics.\n \n  \n  Additional Information\n  Our success is fueled by individual diversity, encouraging applications from women, members of the LGBTQ2+ community, multi-cultural backgrounds, and persons with disabilities. We will work with you around any workplace accommodation required during our application process. If you require accommodation or have questions, please contact Human Resources via recruitment@gd-ms.ca.\n  Our comprehensive benefits package is just another reason our employees stick around, enjoy:\n \n   A Flexible Working Environment: Embracing a Hybrid work model with the choice of enjoying every other Friday off is more than a perk; it's a commitment to fostering a healthy work-life balance.\n   Personalized Career Development: Your growth within the organization is not just supported; it's valued. Anticipate regular progress reviews, access to an Educational Assistance Program, and a personalized development plan tailored to your aspirations.\n   Total Rewards Package: Consider it covered—health, dental, and beyond. Early access to a pension plan, coupled with various perks to acknowledge your contributions to the organization.\n \n  Apply now to be a part of a workplace defined by who we are, and who we do it for."
}