{
    "id": "224a96241aa8d177",
    "company": "Bruyère Continuing Care",
    "positionName": "Research Associate I",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-09-12T22:42:54.971Z",
    "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0Az2iNjeEfHXNwE0SzwhSkmDNQI8i9Vjon05RnpHnjhnTRb7LUcI3252DSCathDV_mYJh-z1DkuVxKYYx2qaWvNijvvD4BTtGg7Hv9QV1VNrTJt92ntVYzSfRcFQpILgn74CRlRgGyTSgFjKph2_Xbx1cdXFnS66YMvP1lJeLmvtW2tTiBRIDMUcyGu-Kq_9aLEAI1PkKZtNbxz8JcSvoZkbGo6OnztOmKd3nxU40WVEBqwlGEa5DSgcl8i1VxmE662Qm5oRFoSU0kULcRP9YDARgVKIOtQTC-PkUPv_hdw37nW1asye15IYG_PH_zu7fC8eGZOAjRodhmZXN0dCyoaO5tEvg35Qv-zaY1BQTzeitkMa_eG7-OAND0GKPruKv8eh6n5v5H769lJb64YOoqbUVDAfuvM0IfUFHIOQR8uUzwS8v1MZr9zaJFHsPEotfqx772pIa1reDnQASfWyJ3zoqlAJSXJ8uLnLLXqUOTDr1hGfeXZPKrMvhOE27mOCUtDTy02sgo48F5BUNLzXAjBv7zU5vA4ffq28iyHj_QA8POygLL5VSXg&xkcb=SoD9-_M3KaQcydALAL0KbzkdCdPP&p=1&fvj=0&vjs=3&jsa=2580&tk=1haqc4og42ahi000&from=jasx&wvign=1",
    "externalApplyLink": "https://www.bruyere.org/en/hr?job=17997",
    "companyDescription": "",
    "description": "The Bruyère Research Institute partners with Bruyère Continuing Care, the University of Ottawa and other stakeholders to conduct relevant and practical health sciences research related to medical education and improving the quality of life for the aging population and people requiring continuing care.\n  \n  \n  \n  \n Function Summary We are a research team led by Dr. Daniel Kobewka, who is an investigator at the Bruyère Research Institute (BRI) and is a clinical scientist at The Ottawa Hospital Research Institute (OHRI). Our team focuses on building evidence that informs care planning and shared decision-making, for older patients and those at the end of life.\n  \n  Our research team is focused on improving communication and decision making for people with serious illness and for those nearing the end of their lives. During serious illness treatments to prolong life may not work in some cases cause harm by increasing discomfort or prolonging suffering. For people with serious illness open communication about their goals and wishes is critical. Unfortunately, when communication does not happen, treatments that are inconsistent with their goals may be administered. Serious illness care needs to be informed by what matters most to the person and by realistic prognoses for the outcomes that matter most to people. Our lab works to create values clarification tools and prognostic models to inform serious illness decision making. Join us in this important work.\n  \n  We are looking for an experienced and motivated Research Associate to join our research team. This role participates in the conceptualization and development of the ongoing and future programs of research and team growth by contributing to all aspects of the research design, analysis and dissemination. These activities include coaching and mentorship of team members and collaborators, the development of research objectives, grant development, maintaining data integrity, and strong methodological contributions to planning and executing both qualitative/quantitative analyses.\n  \n  \n  \n  \n Main duties and responsibilities\n \n   Undertake and contribute to health research projects of varying complexity applying appropriate quantitative and/or qualitative research methods (e.g., literature reviews, interviews, surveys, and statistical models)\n   Produce high quality, well written research reports, data analysis plans, executive summaries, blogs, data visualizations, and proposals\n   Interpret data results with ease and clarity into key messages and visualizations for a range of audiences\n   Plan and write grant proposals – this includes but is not limited to budget planning, literature review, administrative grant tasks, collaborator meetings, updates, or requests for specific feedback\n   Plan budget for individual projects and programs of research – reviewing current budgets and estimating the required funds overtime\n   Maintain up-to-date administrative records of institutional research ethics and ICES privacy documentation for each ongoing and completed project\n   Support team cohesion and growth, which includes providing mentorship to team members to improve their skills, knowledge, independence, confidence, and/or provide experience in a new area\n   Manage the project – this may include both leading projects and coaching other project leads (e.g., collaborating clinical expert, junior team member, student, etc.) in planning a project (typically a manuscript within a series of projects) and helping ensure each step is executed according to timelines, budget, and research standards\n   Communicate effectively with team members, clinical collaborators, colleagues, research advisors, patient partners, and external stakeholders\n   Provide logistical support for research-related tasks – this may include scheduling, hosting, attending regular meetings, as well as ongoing administrative and collaborator correspondence\n   Communicate and coordinate with Research Institutes’ Finance and HR teams as it pertains to team management (namely for budgeting, staff hiring, and onboarding)\n   Develop and maintain systems to track progress of research projects and stakeholder outreach\n   Additional duties may be added as projects progress\n \n  Required Qualifications and competencies\n \n   Graduate degree (MSc or PhD) in biostatistics, epidemiology, or equivalent\n   Minimum four (4) years’ experience in clinical or health services research, including leading or managing multi-year studies\n   Demonstrated training and experience in quantitative study design and methodology \n  Experience in study or project management in an academic research environment \n  Experience with peer-mentorship or mentorship of research students and/or staff \n  Exceptional writing skills and ability to communicate effectively across a variety of audiences\n   Proven expertise leading research studies (e.g., peer-reviewed publications or other research products)\n   Demonstrated expertise with advanced data analysis techniques\n   Knowledge of computer software packages including Microsoft Word, Excel, PowerPoint\n   Ability to work independently and collaboratively\n   Strong organizational and interpersonal skills\n   Ability to set priorities, deliver high quality products and meet deadlines\n   Excellent communication skills, written and oral, in English\n   Fluent in French and English, an asset\n \n  Preferred Competencies\n \n   Experience with ICES data, either internally (analyst or student) or as collaborating researcher or research staff\n   Experience writing grants and peer-reviewed publications\n   Experience in designing studies, conducting statistical analyses (i.e., R-Programming, SAS, STATA, etc.) and interpreting the results\n   Proactive approach to study planning, with an understanding of the research lifecycle for both health services and clinical research projects\n   Experience in the following areas is an asset: predictive modelling, systematic reviews, clinical decision-making, older adult populations, end-of-life or long-term care research\n \n \n   If you are interested in this opportunity, please submit your cover letter and resume to\n \n \n   BRI-HR@bruyere.org\n \n \n   Attention Human Resources with subject line “Research Associate I – Dr. Kobewka”,\n \n \n   no later than October 6, 2023.\n \n \n   Please note that incomplete applications may not be reviewed.\n \n  Bruyère Research Institute is an equal opportunity employer and values diversity in its workplace. All qualified applicants will receive consideration for employment based on skills and experience as outlined in your CV and cover letter.\n  \n  Bruyère Research Institute is committed to developing inclusive, barrier-free selection processes and work environments. If contacted regarding this competition, please advise of the accommodation measures which may be required to enable you to be assessed in a fair and equitable manner.\n  \n  All researchers, employees and students of the Bruyère Research Institute who will work with long-term care homes, colleges, universities and other partners are required to comply with the vaccination policies of those external organizations to complete their work. Of note, vaccination policies are subject to change. The requirement to comply with those evolving policies does not change.\n  \n  We thank you for your interest in this position, however; only those chosen for an interview will be contacted.\n  \n  All Bruyère employees are required to provide proof of full vaccination as per our Enhanced COVID-19 Immunization policy. Extra Information:\n  \n  \n  \n \n \n  \n   \n    We are processing your submission.\n     \n    Please do not press back or refresh."
}