{
    "id": "28f9cdb3646f5e0f",
    "company": "University of Ottawa",
    "positionName": "Intermediate Specialist, Laboratory Support",
    "jobType": [],
    "location": "40 Ruskin St, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-06T02:05:12.927Z",
    "url": "https://www.indeed.ca/rc/clk?jk=28f9cdb3646f5e0f&from=jasx&tk=1hc6geptqk7pr800&vjs=3",
    "externalApplyLink": "https://uottawa.wd3.myworkdayjobs.com/en-US/uOttawa_External_Career_Site/job/Ottawa-ON/Intermediate-Specialist--Laboratory-Support_JR6525-1",
    "companyDescription": "",
    "description": "Job Type:\n  Employee\n \n \n   Duration in Months (for fixed-term jobs):\n  12\n \n \n   Job Family:\n  Laboratory Support\n \n \n   # of Open Positions:\n  1\n \n \n   Faculty/Service - Department:\n  Jane O'Reilly\n \n \n   Campus:\n  Main Campus\n \n \n   Union Affiliation:\n  SSUO\n \n \n   Date Posted:\n  October 05, 2023\n \n \n   Closing Date:\n  October 16, 2023\n \n   Note: Applications will be accepted until 11:59 PM on the day prior to the Posting End Date above\n \n \n \n   Hours per week:\n  35\n \n \n   Salary Grade:\n  SSUO Grade 10\n \n \n   Salary Range:\n  $75,743.00 - $95,678.00\n  About the Telfer School of Management\n  The Telfer School of Management at the University of Ottawa is located in the heart of Ottawa and is the proud academic home of some 4,300 students,200 faculty members, over 100 staff members, and over 30,000 alumni.\n  At Telfer, everything we do from teaching to research, to policy advice is firmly aligned with helping Canada reach its potential. We believe that better business practice means a better Canada and that a better Canada means a better world.\n \n \n   Position Purpose:\n \n \n   The incumbent oversees the day-to-day technical and administrative operations of the Triple-I Lab, a behavioural lab space equipped with observational research technology used primarily for social science research (e.g., management, communications, education, psychology). The lab is a collaborative initiative between the Telfer School of Management and the Faculty of Arts at the University of Ottawa. It will be used by faculty members, post-doctoral researchers, and graduate students, and research assistants across the University of Ottawa to conduct experiments on social behaviour and interactions.\n \n \n \n   In this role, your responsibilities will include:\n \n \n   Manages and oversees the daily operations of the laboratory including opening lab in the morning before study sessions, ensuring lab is secure and locked at end of day, providing guidance and assistance to authorized users regarding technical issues, helping users begin data collection, and supervising general laboratory usage.\n   Conducts periodic assessments of laboratory technology to ensure proper calibration and timed integration across various data collection tools. Troubleshoots potential problems with technology and communicates with key points of contact in IT and suppliers’ helpline to identify solutions to problems with technology. Informs Principal Investigators of potential issues with equipment.\n   Ensures users have required permissions and authority to use the lab prior to beginning data collection, including ensuring users have paid user fees, received formal training with equipment, and provided evidence of relevant Research Ethics Board approval.\n   Creates guiding documents for ethics approval and assists users on as needed basis with ethics applications.\n   Facilitates application process required to establish the lab as a core facility, including writing application materials and mandatory annual reports.\n   Develops and maintains computerized tracking system and record management systems to store and process data, such as personnel activities and schedules, user login credentials, users’ keys and key cards to access the lab and equipment used off site.\n \n \n \n   What you will bring\n \n \n   Master’s degree with thesis or higher in a discipline associated with social sciences.\n   At least two years of relevant experience conducting research in social sciences, or an equivalent combination of experience and educational qualifications.\n   Knowledge of, and experience working in a behavioural lab setting, including the use of observational software, interaction analysis software, and emotion recognition software.\n   Expertise in designing and setting up observational studies, including coordinating multiple simultaneous studies.\n   Experience creating training documents and planning and delivering training sessions.\n   Demonstration of interpersonal, collaboration, and problem-solving skills.\n   Demonstration of technical, scientific, and communications skills (written/oral).\n   Demonstration of organizational and prioritization skills.\n   The incumbent must be flexible to work some evenings and weekends to support research activities at several points throughout the year.\n   Advanced written and verbal skills in English or French. Bilingualism, spoken and written, is strongly preferred.\n \n \n \n   Key Competencies at uOttawa:\n   Here are the required competencies for all or our employees at uOttawa:\n   \n   Planning: Organize in time a series of actions or events in order to realize an objective or a project. Plan and organize own work and priorities in regular daily activities.\n   Initiative: Demonstrate creativity and initiative to suggest improvements and encourage positive results. Is proactive and self-starting. Show availability and willingness to go above and beyond whenever it is possible.\n   Client Service Orientation: Help or serve others to meet their needs. This implies anticipating and identifying the needs of internal and external clients and finding solutions on how to meet them.\n   Teamwork and Cooperation: Cooperate and work well with other members of the team to reach common goal(s). Accept and give constructive feedback. Able to adjust own behaviour to reach the goals of the team.\n   \n   The University of Ottawa embraces diversity and inclusion in the workplace. We are passionate about our people and committed to employment equity. We foster a culture of respect, teamwork and inclusion, where collaboration, innovation, and creativity fuel our quest for research and teaching excellence. While all qualified persons are invited to apply, we welcome applications from qualified Indigenous persons, racialized persons, persons with disabilities, women and LGBTQIA2S+ persons. The University is committed to creating and maintaining an accessible, barrier-free work environment. The University is also committed to working with applicants with disabilities requesting accommodation during the recruitment, assessment and selection processes. Applicants with disabilities may contact hrtalentmanagement@uottawa.ca to communicate the accommodation need. All qualified candidates are encouraged to apply; however, Canadians and permanent residents will be given priority.\n   \n   Note: if this is a union position: The hiring process will be governed by the current collective agreement related to the union affiliation noted above; you can click \n  \n   here\n   to find out more.\n   \n   \n  If this is a front-line position with responsibilities to interact with students, selected candidates must be rated at the Low Advanced proficiency level or higher for both oral comprehension and reading comprehension in their second official language. The rating is determined by a proficiency test designed by the Official Languages and Bilingualism Institute.\n \n \n \n   Prior to May 1, 2022, the University required all students, faculty, staff, and visitors (including contractors) to be fully vaccinated against Covid-19 as defined in Policy 129 – Covid-19 Vaccination. This policy was suspended effective May 1, 2022 but may be reinstated at any point in the future depending on public health guidelines and the recommendations of experts."
}