{
    "id": "29ecb2221aa63ad5",
    "company": "Evik Diagnostic Innovations",
    "positionName": "Research Associate (Freeze-drying and analytical testing)",
    "jobType": [],
    "location": "Kanata, ON",
    "salary": null,
    "postingDateParsed": "2023-09-06T06:49:14.836Z",
    "url": "https://www.indeed.ca/rc/clk?jk=29ecb2221aa63ad5&from=jasx&tk=1hb2v5rcfk7vv800&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=29ecb2221aa63ad5&atk=&xpse=SoAv67I3Ki2XVHQgUR0LbzkdCdPP",
    "companyDescription": "",
    "description": "WHO WE ARE: \n  As part of the team at EVIK Diagnostics Innovations you’ll discover meaningful work within the medical device industry. You’ll join a rapidly growing company where each day is different, and opportunities are approached with a team effort.\n  \n  \n  Evik was established in 2011 and is based in Kanata (in the same building as a brewery!) Our team are experts in the field of creating rapid, single-assay lyophilized beads for immunological and molecular diagnostics. Our DxSpheres are used for a wide variety of different testing applications including rapid PCR Covid test kits, and in environmental water testing laboratories. Our clients are located around the world and appreciate our transparency, communication, and ability to go the extra mile.\n  \n  \n  If you’d like to learn more about us and what we do, feel free to check out our website and watch our company video.\n  \n  \n  Evik Diagnostic Innovations is an Ottawa based ISO 13485:2016 certified manufacturer of rapid, single-assay, lyophilized beads for immunological and molecular diagnostics using dry reagent components. We provide exceptional customer service to our clients, and we are looking for a new team member to help us continue to exceed their expectations. You are an ideal candidate if you are looking to become part of a dynamic team.\n \n  JOB DESCRIPTION \n  The Research Associate is responsible for working directly with the Director of Technology to provide support for lyophilizing process development, optimization and scaling up. \n \n  \n KEY RESPONSIBILITIES \n  \n  Adhere to current good laboratory and manufacturing practices and maintain a safe and clean work environment. \n  Perform thermal analysis of complex reagent mixtures and dry reagents, using DSC, FDM and other analytical methods. \n  Setup automated stations dispense parameters assuring uniformity of the dispensed mixes and suspensions. \n  Collect client custom product characterization and packaging requirements and verify client instructions were followed. \n  Perform DSC and FDM methods, other material testing methods according to the standard protocols. \n  Measure, observe and document freeze-dry products morphology and physical properties. \n  Summarize thermal properties testing and analytical testing data and results of the experiments. \n  Understand freeze-dry cycles settings based on thermal and physical properties of lyophilized products. \n  Communicate results and collaborate with other professionals in the lab and clients. \n  Provide technical presentation and technical support for client’s projects. \n  Write and edit work instructions. \n  Maintain product development database and logbooks. \n  Process, organize and summarize data using a variety of word processing and spreadsheet software applications. \n  Perform related laboratory maintenance such as maintaining and cleaning equipment, ordering supplies, calibrating R&D equipment, and maintaining inventories of incoming materials and laboratory supplies. \n  Manage multiple tasks and changing priorities in a fast-paced environment. \n  Other tasks as required to support the smooth operation of the laboratory. \n  Participate in Process Improvement projects assigned by manager.\n \n  \n  \n  SKILLS AND QUALIFICATIONS \n  \n  Ability to work without direct supervision, paying close attention to detail and bearing independent responsibility for data accuracy. \n  Sound organizational and data management skills. \n  Ability to handle several responsibilities and work under tight time constraints. \n  Dedication to production quality and deadlines with a strong work ethic. \n  Proficiency in MS Word and MS Excel, including basic functions and formulas. \n  Ability to work well as part of a team. \n  A positive attitude and professional appearance and manner. \n  Good English language communication skills both written and oral.\n \n  \n  \n  EDUCATION, EXPERIENCE \n  \n  Master’s or Bachelor's degree in physics, physical chemistry, or material sciences. \n  Two to five years of industrial laboratory work experience. \n  Hands on experience with Differential Scanning Calorimetry and materials thermal analysis methods and techniques is an asset. \n  Deep understanding of underlying scientific principles. \n  Experience in freeze-dry protocols development considered as a big asset. \n  Experience with freeze-dry microscopy is an asset.\n \n  \n  \n  OTHER \n  \n  Applicants should be available for an on-site interview. \n  Applicants must include a resume and a cover letter in which they describe how they meet each of the requirements listed above."
}