{
    "id": "3180e92c8bf468c6",
    "company": "University of Ottawa",
    "positionName": "Specialist, Occupational Health and Safety",
    "jobType": [
        "Full-time"
    ],
    "location": "40 Ruskin St, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-05T03:12:16.311Z",
    "url": "https://www.indeed.ca/rc/clk?jk=3180e92c8bf468c6&from=jasx&tk=1hjm39h30jroo800&vjs=3",
    "externalApplyLink": "https://uottawa.wd3.myworkdayjobs.com/en-US/uOttawa_External_Career_Site/job/Ottawa-ON/Specialist--Occupational-Health-and-Safety_JR9071",
    "companyDescription": "",
    "description": "Job Type:\n  Employee\n \n \n   Duration in Months (for fixed-term jobs):\n  24\n \n \n   Job Family:\n  Environmental Health and Safety\n \n \n   # of Open Positions:\n  1\n \n \n   Faculty/Service - Department:\n  Health, Safety & Risk Management\n \n \n   Campus:\n  Roger Guindon Hall\n \n \n   Union Affiliation:\n  SSUO\n \n \n   Date Posted:\n  janvier 04, 2024\n \n \n   Closing Date:\n  janvier 15, 2024\n \n   Note: Applications will be accepted until 11:59 PM on the day prior to the Posting End Date above\n \n \n \n   Hours per week:\n  35\n \n \n   Salary Grade:\n  SSUO Grade 09\n \n \n   Salary Range:\n  $67,783.00 - $85,623.00\n  About the Faculty of Medicine\n  Welcome to the University of Ottawa Faculty of Medicine, the first and largest bilingual medical faculty in Canada. Our learners have access to state-of-the art facilities and specialized institutions as they learn alongside world-class physicians and scientists. Consistently ranked among the top 10 medical schools in Canada, our faculty is among the top faculties of medicine in the world for research impact in biomedical and health sciences.\n \n \n   Position purpose:\n \n \n   The incumbent manages administrative operational activities relating to the Faculty Environmental Health and Safety Risk Management System (EHSRMS) to ensure the safety of the environment and the health and safety of all persons working and studying at the Faculty of Medicine. Specific operational activities include planning and executing workplace inspections to identify health and safety issues, hazards and trends, and verifying compliance with federal, provincial and municipal acts & regulations, and uOttawa policies and guidelines. Communicates infractions to the responsible party and tracks future compliance.\n \n \n \n   In this role, your responsibilities will include:\n \n \n   Project Coordination : Plans, coordinates, conducts, and documents Workplace Health and Safety inspections for the Alta Vista Functional Occupational Health and Safety Committee (the Committee), ensuring a seamless coordination of this regulated inspection process with all involved parties. Identifies and communicates trends (good and bad) to influence health and safety messaging and training. Performs regular, frequent unannounced inspections as a means of identifying deficiencies in personnel performance and as well as the building’s infrastructure. Independently responds to action items by recommending safer working practices as well as by raising work orders, for example. Performs lower order risk assessments in support of the risk identification process at the faculty level.\n   Records Management: Utilizes multiple information management systems and software to maintain records/databases and compile reports identifying trends, areas of concern, and corrective measures to be implemented in order to improve health and safety of the community in accordance with University procedures. These systems include year-to-date Workplace Inspection performance, personnel training, chemical inventory, and chemical waste management, and our emergency management system. Keeps all pertinent information concerning changes in policy, hazard assessments, and the regulatory climate up-to-date. Formats documents and reports a necessary, many of which are technical in nature (symbols, formulae and graphics).\n   Waste Management: Counsels lab staff in the effective and safe management of hazardous waste by ensuring that practices comply with regulatory requirements and university procedures.\n   Access Card Management: Programs electronic building access cards for the Faculty to support onboarding of new staff and students, as well as contract extensions. If required, will support card processing demands for the Department of Anatomy and Animal Care & Veterinary Services (ACVS).\n   Program Support: Responsible for the Faculty’s Health and Safety website, including required updates and innovative design of new pages, as necessary, to enhance communications. Maintains Health and Safety bulletin boards, faculty first aid kits, and ensures emergency eyewash/safety shower stations are regularly inspected. Monitors the Health, Safety and Risk Management group email account and responds in a timely manner to correspondence by composing and sending letters and memos on behalf of the department. Produces letters related to more complex issues for review by the Manager, Environmental Health and Safety.\n   Community Engagement: Plans, facilitates, and participates in all aspects of workshops and events that harness a wide range of engagement techniques, such as “Take Your Kids to Work” day, Focus Santé, North American Occupational Safety and Health (NAOSH) week, Earth Day and Lunch & Learn sessions. Develops a strong rapport and relationships with stakeholders. Proactively works to build a positive image, increase reputation, prepares event schedules and makes all logistical arrangements such as catering, room bookings and parking. Manages the online registration process for workshops. Manages all workshop logistics, such as scheduling, room bookings and equipment reservations.\n \n \n \n   What you will bring:\n \n \n   Essential Qualifications\n \n \n   B.Sc. degree in Basic Science, Biology, Chemistry, or Engineering or other relevant discipline.\n   Minimum 3 years’ experience in a research lab environment or in a regulatory/consulting field emphasizing health, safety and environmental programs, or an equivalent combination of education and work experience.\n \n \n \n   Other Skills and Competencies\n \n \n   Knowledge of relevant federal, provincial, and municipal health and safety legislation, regulations and best practices.\n   Experience in interpretation of health and safety codes, standards, or legislation.\n   Experience in conducting inspections of environments typically found in a university setting.\n   Must be willing to immediately respond and participate as necessary to emergency incidents within the group’s remit (e.g., fire alarms, chemical spills).\n   Strong organizational skills and attention to detail in a fast-paced environment\n   Able to facilitate effective and diverse community consultations, programs, and initiatives.\n   Keen attention to discretion, confidentiality, and tact\n   Strong communication skills, including experience with web-design and creating content required to reach different stakeholder audiences.\n   Experience in database functions and tools (MS Access)\n   Bilingual, French and English, spoken and written\n \n \n \n   Key Competencies at uOttawa:\n   Here are the required competencies for all or our employees at uOttawa:\n   \n   Planning: Organize in time a series of actions or events in order to realize an objective or a project. Plan and organize own work and priorities in regular daily activities.\n   Initiative: Demonstrate creativity and initiative to suggest improvements and encourage positive results. Is proactive and self-starting. Show availability and willingness to go above and beyond whenever it is possible.\n   Client Service Orientation: Help or serve others to meet their needs. This implies anticipating and identifying the needs of internal and external clients and finding solutions on how to meet them.\n   Teamwork and Cooperation: Cooperate and work well with other members of the team to reach common goal(s). Accept and give constructive feedback. Able to adjust own behaviour to reach the goals of the team.\n   \n   The University of Ottawa embraces diversity and inclusion in the workplace. We are passionate about our people and committed to employment equity. We foster a culture of respect, teamwork and inclusion, where collaboration, innovation, and creativity fuel our quest for research and teaching excellence. While all qualified persons are invited to apply, we welcome applications from qualified Indigenous persons, racialized persons, persons with disabilities, women and LGBTQIA2S+ persons. The University is committed to creating and maintaining an accessible, barrier-free work environment. The University is also committed to working with applicants with disabilities requesting accommodation during the recruitment, assessment and selection processes. Applicants with disabilities may contact hrtalentmanagement@uottawa.ca to communicate the accommodation need. All qualified candidates are encouraged to apply; however, Canadians and permanent residents will be given priority.\n   \n   Note: if this is a union position: The hiring process will be governed by the current collective agreement related to the union affiliation noted above; you can click \n  \n   here\n   to find out more.\n   \n   \n  If this is a front-line position with responsibilities to interact with students, selected candidates must be rated at the Low Advanced proficiency level or higher for both oral comprehension and reading comprehension in their second official language. The rating is determined by a proficiency test designed by the Official Languages and Bilingualism Institute.\n \n \n \n   Prior to May 1, 2022, the University required all students, faculty, staff, and visitors (including contractors) to be fully vaccinated against Covid-19 as defined in Policy 129 – Covid-19 Vaccination. This policy was suspended effective May 1, 2022 but may be reinstated at any point in the future depending on public health guidelines and the recommendations of experts."
}