{
    "id": "3a312477eb3d65fe",
    "company": "Ranovus",
    "positionName": "Lab Manager",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-01T20:08:37.118Z",
    "url": "https://www.indeed.ca/rc/clk?jk=3a312477eb3d65fe&from=jasx&tk=1he3ljbsgk7v3800&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "Location: Ottawa, Ontario \n  Social networking, machine learning, artificial intelligence, and big data analytics demand ever-increasing network connectivity. With operations in the US, Canada, and Germany, RANOVUS is a solution provider for the next generation data center infrastructures. We aim to deliver advanced technology that maximizes data throughput and minimizes environmental impact through lower power dissipation. Working with world class fabrication partners, RANOVUS is the leader in the application of unique new technologies to fiber-optic communications products for data centers. \n  We are looking for an Ottawa Lab Manager to support R&D activities by maintaining lab facility infrastructure, hardware and providing on-site support to lab users. \n  Key Responsibilities: \n \n  Ensuring efficient and effective delivery of lab infrastructure for both on-site and remote users. \n  Ensuring lab operation meets requirements for high-reliability, stability, and security. \n  Ensuring efficient delivery of hardware installation services, operations, and support. \n  Ensuring ESD safe practices are being used in the lab. \n  Ensuring equipment inventory and calibration is current and assign preventative maintenance. \n  Deploying and maintaining design and test environments. \n  Mentoring and development of staff capabilities. \n  Leading change including future evolution of Lab Operations in Ottawa. \n  Ensuring good stakeholder relations in coordination with all lab users. \n  Ontario Health and Safety responsibility: Lab Site Crisis Management. \n  Purchasing and maintenance of lab equipment and supplies. \n  \n Required Skills and Experience: \n  \n  Bachelor’s degree in an engineering subject area or Electronic Technician with management experience. \n  5+ years of experience managing an electronic lab and / or working in product development. \n  Experience working within a service organization. \n  Knowledge of IT products, solutions, and Network architecture. \n  Excellent English language skills. \n  Experience interacting with stakeholders in an R&D lab environment. \n  Ability to work independently. \n  Excellent interpersonal skills. \n  \n Preferred Skills and Experience: \n  \n  Experience with Linux: use, development, and deployment. \n  Experience with modern development tools, e.g., issue/defect tracking. \n  Ability to use lab equipment such as oscilloscope, data analyzer, power meter. \n  Experience with HW Board Bring-up, Functional Test and debug with ability to read schematics. \n  Skills for PCBA modification, soldering, circuit repair. \n  Experience assembling various kinds of cables including digital, cable and power."
}