{
    "id": "3bacb80160ef1d93",
    "company": "Thermo Fisher Scientific",
    "positionName": "Field Service Engineer III",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-01T20:08:31.885Z",
    "url": "https://www.indeed.ca/rc/clk?jk=3bacb80160ef1d93&from=jasx&tk=1he3ljbsgk7v3800&vjs=3",
    "externalApplyLink": "https://jobs.thermofisher.com/global/en/job/R-01205489/Field-Service-Engineer-III-Mass-Spec?codes=INDEED",
    "companyDescription": "",
    "description": "As part of the Thermo Fisher Scientific team, you’ll discover meaningful work that makes a positive impact on a global scale. Join our colleagues in bringing our Mission to life every single day to enable our customers to make the world healthier, cleaner and safer. We provide our global teams with the resources needed to achieve individual career goals while helping to take science a step beyond by developing solutions for some of the world’s toughest challenges, like protecting the environment, making sure our food is safe or helping find cures for cancer.\n     \n      Location Specific Information\n      The ideal candidate must be based remotely in Alberta with 25-50% expected travel nationally.\n     \n      Discover Impactful Work:\n      As a Field Service Engineer and a member of our Service Team, you will be given the opportunity to lead all aspects of field service support and customer relationship management for our customers. You will provide complete services on Chromatography and Mass Spectrometry systems, including installation, repairs, preventative maintenance, and instrument qualifications. You must be customer oriented, an advocate for Thermo Fisher Scientific in customer laboratories, and be eager to drive growth.\n     \n      A Day in the Life:\n     \n       Represents our company in a positive, professional manner in all dealings with Thermo Fisher Scientific customers, both external and internal.\n       Receive customer service requests for installations, calibrations, preventive maintenance, and basic repairs, and promptly contact the customer to schedule services\n       Report daily activities in reporting tool for accurate record keeping, including closing service calls upon completion.\n       Maintain a high level of customer allegiance by building positive relationships and promoting an excellent customer experience.\n       Efficiently complete trainings and work with mentor to ensure timely certifications\n       Address opportunities and challenges with high energy and passion in a fast-paced environment\n       Strong focus on safety and be adaptable to customer lab environments\n       Arrange travel accommodations and submit expenses in a timely manner\n     \n     \n      Keys to Success:\n      Education\n     \n       Minimum education requirement is a certificate, diploma, associates or bachelor’s degree in chemistry, physical science, electronics, or equivalent education\n       Basic bench chemistry experience preferred\n     \n     \n      Experience\n     \n       2+ years’ experience and/or knowledge of Chromatography and or Mass Spectrometry Instruments (LCMS)\n       Experience with other analytical instrument is desirable\n     \n     \n      Knowledge, Skills, Abilities\n     \n       Customer service excellence in a fix the customer first environment\n       Ability to work independently diagnosing and solving problems with service manuals and other user documentation\n       Ability to consistently follow business procedures and meet performance metrics\n       Confirmed interpersonal/time leadership skills and ability to prioritize multiple priorities and administrative responsibilities independently\n       Ability to lift 50 lbs. with assistance, and carry 25-30 Lbs. continuously throughout the day\n       Must adhere to customer laboratory environments and wear appropriate PPE attire as required\n       Ability to drive frequently within territory and travel overnight if required\n       Must have a valid driver’s license and a safe driving record"
}