{
    "id": "3d669299eb293c3a",
    "company": "ADP",
    "positionName": "Bilingual Payroll Specialist",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-16T18:52:59.539Z",
    "url": "https://www.indeed.ca/rc/clk?jk=3d669299eb293c3a&from=jasx&tk=1hcvfn7eljiim800&vjs=3",
    "externalApplyLink": "https://click.appcast.io/track/hqymhpo-org?cs=5c&jg=5jky&bid=lUf2CslKyPxm6i440ZgUYA==&ittk=3N2S5YZRAI",
    "companyDescription": "",
    "description": "ADP is the leader in Human Capital Management. We support over 860,000 clients in 140+ countries. Did you know we have the number one rated and used HCM mobile app? Join our family of 58,000 associates to grow your career, leverage our technology, and put your expertise to work with one of the largest providers in HCM. \n  \n  ADP is hiring an experienced \n Bilingual \n Payroll Specialist. In this position, you'll help our clients leverage ADP's exceptional business solutions so they can focus on what matters most to them - growing their business.\n  \n  \n Responsibilities:\n  \n \n  Responsible & fully accountable for the payroll & audit function of multiple clients \n  Responsible for scheduling and running the assigned client payrolls by following standard operating procedures. \n  Maintains complete, accurate and timely client and employee records based on real time requests \n  Maintains complete and accurate client profile notes as well as processing instructions for each client \n  Balance respective payrolls based on year end calendar and remit all Third Party Remittances by defined due dates, complete all Year End balancing, filing & respective reporting \n  Utilize all internal tools & defined processes to ensure optimal productivity, service excellence and make recommendations for best practices to customers \n  Initiate pre and post production calls with clients \n  Performs quarterly & year-end audits including file \n  Answer client calls (dedicated clients, as well as other clients) \n  Provide critical and accurate statutory information to clients in the payroll area, such as tax filing. Use the various knowledge bases, resource materials and appropriate websites to locate answers and solutions for issues \n  Work with internal technical support, various production departments and additional ADP Service hubs as needed to identify a resolution \n  Provide feedback and suggestions on products, issues, processes and procedures to enhance efficiency and continuous improvement \n  Maintain NPI (National Payroll Institute) designation & attend all required departmental training sessions as well demonstrate proficiency in learning \n \n  \n  \n Qualifications Required:\n  \n \n  Minimum 5 years Canadian payroll processing experience \n  Minimum 5 years client service experience \n  Advanced Internet and MS Office Skills (Word/Excel) required \n  Excellent communication and analytical skills with the ability to translate analytical findings into actionable solutions/processes \n  Excellent customer service skill \n  Fluent in French and English is required \n \n  \n  \n Education:\n  \n \n  Post-secondary education preferred, or equivalent experience in administration/customer service/HR \n  Candidate should be working towards or have National Payroll Institute (NPI) certification (PCP, CPM) - Join our team and leverage our reimbursement programs including tuition reimbursement and annual membership reimbursement \n \n  \n  \n Medical benefits begin Day 1 of employment! Contribute to RRSP day one!\n  \n  \n NOTE TO APPLICANTS:\n  \n  Please note that any offer of employment will be subject to verification of employment background checks, including a criminal record check.\n  \n  \n Diversity, Equity, Inclusion & Equal Employment Opportunity at ADP: ADP affirms that inequality is detrimental to our associates, our clients, and the communities we serve. Our goal is to impact lasting change through our actions. Together, we unite for equality and equity. ADP is committed to equal employment opportunities regardless of any protected characteristic, including race, color, genetic information, creed, national origin, religion, sex, affectional or sexual orientation, gender identity or expression, lawful alien status, ancestry, age, marital status, or protected veteran status and will not discriminate against anyone on the basis of a disability. We support an inclusive workplace where associates excel based on personal merit, qualifications, experience, ability, and job performance.\n  \n  \n Ethics at ADP: ADP has a long, proud history of conducting business with the highest ethical standards and full compliance with all applicable laws. We also expect our people to uphold our values with the highest level of integrity and behave in a manner that fosters an honest and respectful workplace. Click https://jobs.adp.com/life-at-adp/ to learn more about ADP's culture and our full set of values."
}