{
    "id": "401762645a90854c",
    "company": "OHRI",
    "positionName": "Research Technician",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-09-13T22:41:48.481Z",
    "url": "https://www.indeed.ca/rc/clk?jk=401762645a90854c&from=jasx&tk=1haqc2kmdjoou800&vjs=3",
    "externalApplyLink": "https://www.ohri.ca/Careers/Details.aspx?CareerID=2934",
    "companyDescription": "",
    "description": "A research technician position is available immediately to join a team to study the therapeutic potentials of novel microbiome-based agents in mouse models of human diseases.\n  \n  \n Basic Requirements (Education/Experience):\n  \n \n  A three-year college diploma or a BSc degree\n  3 - 5 years’ experience working in a research laboratory\n \n  \n  Preferred Qualifications:\n  \n \n  Recent graduate (BSc or MSc) passionate about biomedical research.\n  Prior experience working with mice.\n \n  \n  Contract Details:\n  This is a 1-year full-time contract with the possibility of renewal.\n  Salary: Min:$21.278/hr - Max:$30.747/hr\n  \n  \n Comments to Applicant:\n  Please send a complete CV with description of research experience and names/contact of three referees:\n  \n  \n Contact Info:\n  Name: Dr. Johne Liu\n  Title: Senior Scientist\n  Program: Chronic Disease\n  Ottawa Hospital Research Institute\n  Address: 501 Smyth Road\n  Email: jliu@ohri.ca\n  Website: https://ohri.ca/profile/jliu\n  \n  The Ottawa Hospital Research Institute is committed to building and sustaining a welcoming and supportive culture that promotes equity, diversity and inclusion for trainees, researchers, and staff. We are devoted to identifying and removing barriers that limit equitable access to opportunities within our organization. The Ottawa Hospital Research Institute strongly supports initiatives that encourage the participation of all groups, in particular the four groups defined in the Employment Equity Act (women, Indigenous peoples, persons with disabilities and members of visible minorities).\n  \n  We thank all applicants for their interest. However, only those invited for an interview will be contacted. The Ottawa Hospital Research Institute is an equal-opportunity employer. Upon request, accommodations due to a disability are available throughout the selection process."
}