{
    "id": "410f8c1fdcb9a9d6",
    "company": "Welch LLP",
    "positionName": "Project Administrator",
    "jobType": [],
    "location": "123 Slater St 3 Fl, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-17T18:51:54.093Z",
    "url": "https://www.indeed.ca/rc/clk?jk=410f8c1fdcb9a9d6&from=jasx&tk=1hcvfkunqk7dc802&vjs=3",
    "externalApplyLink": "https://welchllp.com/careers/current-opportunities/project-administrator/",
    "companyDescription": "",
    "description": "LOCATION \n     \n      Ottawa\n      \n    \n    \n     CATEGORY \n     \n      Full-time Permanent\n      \n    \n    \n     TYPE \n     \n      Hybrid\n      \n    \n    \n     POSTED \n     \n      October 16, 2023\n     \n    \n    \n    \n      \n    \n   \n   \n   \n    \n     \n      CAREERS \n      \n       CURRENT OPPORTUNITIES\n       \n     \n    \n    Project Administrator \n    \n     \n      Headquartered in Ottawa, the key to Welch’s success is continually evolving to meet the needs of our employees, clients and the marketplace. With a full suite of professional services, ranging from traditional assurance to expert business advisory, our clients respect and value the firm’s expertise and commitment to exceptional service. Our clientele is as varied as the economic landscape, ranging from start-ups to large, multi-divisional privately-held companies, not-for- profit organizations and public sector entities. Supporting that client facing business is a diverse group of administrative departments. \n      Established in 1918, Welch evolved from a single office to the largest locally-owned and operated firm in the region. Welch ranks as the 14th largest accounting firm in Canada and continues to grow. With that growth we need to add motivated people to support our various departments from finance, administration, marketing and IT. \n      Grounded in our values of care, impact and empower, we are focused on creating a diverse and inclusive environment and supporting our surrounding communities. It is our people that enable Welch LLP to wonderful place to build your career. \n      About the Opportunity \n      Welch LLP is currently looking for a Project Administrator, who will play a critical role in planning, executing, and managing large client engagements within our firm. \n      Duties and Responsibilities \n      \n       Engage appropriate internal stakeholders to identify and manage required outcomes for large engagements. \n       Provide on-going communication to key internal stakeholders, to ensure they are aware of significant changes which impact requirements delivery against the overall initiative. \n       Assess and ensure that client and staff expectations and impacts are appropriately managed. \n       Ensure timely notification and escalation of possible issues/problems while assessing options and recommendations for prompt resolution. \n       Identify, document, and validate current state processes and work with the business and stakeholders to design the desired future state. \n       Build long-term trusting relationships with internal stakeholders. \n       Take ownership and communicate progress on assigned work, including requirements management, in a concise and timely manner, escalating issues where appropriate. \n       Develop efficient and effective solutions through analytical problem solving. \n       Provide clear, concise, and accurate recurring progress and impact reporting on engagements. \n       Oversee and record document flow to and from all necessary parties. \n       Drawing on your continuous improvement mindset, you will identify continuous improvement opportunities to increase efficiency, quality, and value to clients, through changes in processes, policy, or use of technology. \n      \n      Qualifications \n      \n       Post-secondary diploma or degree in project management, business administration, accounting or related field. \n       3+ years of project administration experience \n       Excellent verbal and written communication skills \n       Strong administration and organization skills \n       Ability to work with tight deadlines \n       Ability to work with various internal stakeholders at all levels \n       Strong computer skills including MS Office Suite. \n       Superior attention to detail and a commitment to quality, and excellence are key attributes. \n       Reliable, well organized, motivated, and self- managed. \n       \n      \n      If you are interested in a great career opportunity with a growing, flexible and dynamic organization, please apply! \n      Welch LLP welcomes and encourages applications from people with disabilities. If you require accommodation during any stage of the recruitment process, please indicate this in your application. \n      We thank all applicants for their interest but only those selected for an interview will be contacted."
}