{
    "id": "46e34efc327d8d60",
    "company": "Alberta Precision Labs",
    "positionName": "Medical Laboratory Assistant (Alberta, Canada)",
    "jobType": [],
    "location": "Ontario",
    "salary": null,
    "postingDateParsed": "2023-09-14T06:49:15.643Z",
    "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0BKoA0KjMB2_2SITHdZiKR2tLJiDQwQdMraFBOtj0fmnfR-Td6qATq9e8Dii-TEZmttxkF29KoVMomicbEbdo8mnwcyGUotTIf0wV1DxZBe_nj4g0BDCJNzF8mAErJuZgMTvqMC80EL98DVTmi4C73Ox8ljLHP1ZqOO73jiLk8AUmeuGfbKASmGe7wZZ7AHng38UUB5ljwwJJF24BHl6p9FBu3nAaSe2txUuvuHl224REUD9oOGnhuVhwJvWKf790Yayb6vsA1hK3RguHf4vRrjqI0R6KEP3Viy9kLwFtsd3iwD8DB9jvjfsRSkgiuWRcPvyi3NUjEoMzvJAeknXm31WnV8ezjlJiS6CnhG5BPkeE5nEOgNE_ayj53FDWigGpMPCBKoeW7PvvVpKhDuqHRqiu1dKp5CgLxsV92uSoR2tHLqz87b5DbSrdEb43L0ynqzpqynM--rqTNNzE5e_Rop9V7I935El3d6Kf8R1uwqN-5VoaIuph1jA1oJJnsWCFaWpisybNUBqWdi92Yqq7ZrD3cun9i1QP1e2Q71duL8yam02QieYY7JM6fpy94KZLc%3D&xkcb=SoDn-_M3K031gXSD1B0IbzkdCdPP&p=3&fvj=1&vjs=3&jsa=6831&tk=1hbkvuinuir0h801&from=jasx&wvign=1",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "Your Opportunity:\nAlberta Precision Laboratories (APL) is hiring multiple Medical Laboratory Assistants throughout Alberta.\nAPL delivers high-quality, responsive diagnostic lab services to Albertans as a part of the provincial healthcare system. With competitive salaries, opportunities for professional development, and comprehensive benefits, you can truly thrive. Make a difference in your own community as you help healthcare professionals and patients get the information that they need to improve, optimize, or maintain health.\nAs a successful candidate, you will have the opportunity to work both independently and as a member of our team where you may be responsible for performing all aspects within the scope of practice of a MLA including blood collection, specimen procurement and handling procedures, data entry, as well as Electrocardiogram (ECG) and Holter monitors, and urinalysis. You will have the opportunity to work in the community or hospital setting.\nWith a customer service focused approach, you build productive and respectful customer relations and take responsibility for customer satisfaction. You have an ability to encourage others, building positive, respectful and collaborative working relationships.\nJoin our professional and engaging team that encourages promoting a positive and respectful work environment consistent with the APL Values: kindness, inclusion, innovation, agility & accuracy.\nJob Description:\nAs an MLA, you will provide high quality service to clients of the clinical laboratory in an effective, efficient and safe manner. You will be responsible for a variety of laboratory functions including procurement, handling, processing, dispatching and testing of specimens, performing procedures and reporting results.\nQualifications:\nCompletion of an accredited Medical Laboratory Assistant program or equivalent.\nJob Types: Casual, Permanent, Part-time, Full-time, Fixed term contract\nSalary: $23.25-$28.98 per hour\nBenefits:\n\n Company pension\n Dental care\n Disability insurance\n Extended health care\n Life insurance\n Paid time off\n Vision care\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n Day shift\n Evening shift\n Night shift\n Weekends as needed\n\nWork Location: In person"
}