{
    "id": "484889db9ae87768",
    "company": "University of Ottawa Heart Institute",
    "positionName": "Academic Hypertension Specialist, Research Chair in Hypertension and Vascular Biology",
    "jobType": [],
    "location": "40 Ruskin St, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-01T20:09:50.233Z",
    "url": "https://www.indeed.ca/rc/clk?jk=484889db9ae87768&from=jasx&tk=1he3lmb38joqj800&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=484889db9ae87768&atk=&xpse=SoAp67I3IDjVENTWjh0LbzkdCdPP",
    "companyDescription": "",
    "description": "The Division of Cardiac Prevention and Rehabilitation at the University of Ottawa Heart Institute seeks one full-time academic hypertension specialist. The candidate would fulfil clinical academic roles as a clinician-scientist and hold the chair for hypertension and vascular biology at the University of Ottawa Heart Institute. \n    The University of Ottawa Heart Institute is a large tertiary centre providing cardiovascular care to Eastern Ontario and Western Quebec. The successful applicant would join a dynamic outpatient-based hypertension practice supported by dedicated nursing and administrative staff. \n    The City of Ottawa provides a thriving multicultural and bilingual environment. Ottawa boasts numerous cultural activities as well as readily accessible sporting and natural resources, making it an ideal family and healthy living environment. \n    Candidates must hold certification in internal medicine, cardiology, vascular medicine or nephrology, and training in hypertension. Certification as a hypertension specialist is highly desirable. Ability to interpret and report 24-hour ambulatory blood pressure monitoring results is required. Additional expertise in either women’s heart health/hypertension in women or cardiovascular prevention and rehabilitation is highly desirable, and congruent to divisional priorities. Applicants for this clinician-scientist, chair position must have a significant research background with publication and peer-review grant record in the domain of hypertension and vascular biology. \n    Clinical work will include leadership responsibilities and active participation in the outpatient hypertension clinic and reporting of 24-hour ambulatory blood pressure monitoring. Some participation in the outpatient women’s heart health or prevention and rehabilitation clinics is desirable and can be arranged based on the candidate’s expertise. \n    Academic appointment ranking will be based on qualifications and experience. \n    Interested applicants should forward their curriculum vitae and the names of three potential references (suitable candidates will later be asked to provide three letters of reference) to: \n    Thais Coutinho, MD Assistant Professor, Department of Medicine (Cardiology) Chief, Division of Cardiac Prevention and Rehabilitation Chair, Canadian Women’s Heart Health Centre University of Ottawa Heart Institute 40 Ruskin Street Ottawa, ON K1Y 4W7 tcoutinho@ottawaheart.ca \n    The University of Ottawa Heart Institute is committed to developing inclusive, barrier-free selection processes and work environments. Accommodations will be provided in all parts of the hiring process relating to any specialty requirements. Applicants should make their needs known in advance."
}