{
    "id": "487596a29f5e1235",
    "company": "Thermo Fisher Scientific",
    "positionName": "Bilingual Field Service Engineer II - Lab Equipment",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-09-18T22:41:02.553Z",
    "url": "https://www.indeed.ca/rc/clk?jk=487596a29f5e1235&from=jasx&tk=1haqc0qipjku7800&vjs=3",
    "externalApplyLink": "https://jobs.thermofisher.com/global/en/job/R-01199856/Bilingual-Field-Service-Engineer-II-Lab-Equipment?rx_a=0&rx_c=&rx_ch=jobp4p&rx_group=123525&rx_job=R-01199856-1&rx_medium=cpc&rx_r=none&rx_source=indeed&rx_ts=20230920T220802Z&rx_vp=cpc&utm_medium=ppc&utm_source=recruitics_indeedorganic&codes=INDEED&rx_p=DZUWWLVAQH&rx_viewer=cb9e2105580611eebe69af2d53518e280a847bcd19d84168aa19b2233c9fd6db",
    "companyDescription": "",
    "description": "Job Description\n \n  As part of the Thermo Fisher Scientific team, you’ll discover meaningful work that makes a positive impact on a global scale. Join our colleagues in bringing our Mission to life every single day to enable our customers to make the world healthier, cleaner and safer. We provide our global teams with the resources needed to achieve individual career goals while helping to take science a step beyond by developing solutions for some of the world’s toughest challenges, like protecting the environment, making sure our food is safe or helping find cures for cancer.\n \n  Discover Impactful Work:\n  As a Field Service Engineer, your tasks will include delivering and building service excellence over and above our customer expectations.\n \n  A Day in the Life:\n \n   Repair, install, and maintain a variety of laboratory equipment products including incubators, centrifuges, cold storage (refrigerators and freezers) and other equipment as needed\n   Schedules and completes thorough preventative maintenance service to assure peak uptime of customer equipment\n   Understand customers’ needs to best promote service contracts, services, and new equipment.\n   Managing expenses and spare parts inventory in a timely and accurate manner\n   Document daily service actions through the company work order database\n   Maintains courteous, and knowledgeable communication with customer to ensure alignment of all aspects of the service event (status, cost, scheduling, etc.) (add reference to scheduling autonomy)\n   Accept training on various equipment and product lines to provide stellar service to our customers.\n   Interact with numerous manufacturers for day to day warranty related instrument service\n \n  Keys to Success:\n  Education:\n \n   Post-secondary school diploma in electronics or similar military certification preferred\n \n  Experience:\n \n   2 years of relevant experience. On the job experience and training may be accepted in lieu of these requirements\n   Advanced knowledge working with basic test equipment such as DMM, tachometer, temperature devices, etc.\n   Demonstrated proficiency in (similar lab equipment) multiple vendor product lines with minimal supervision\n   Previous Field Experience preferred, supplemented with training courses\n   Strong electronic/electrical and mechanical background preferred, refrigeration experience a plus\n \n  Knowledge, Skills, Abilities\n \n   Requires proof of Covid-19 vaccination\n   Proven track record to mentor and train other engineers with difficult service calls that require technical expertise\n   Strong customer service skills\n   Strong communication skills\n   Ability to operate computers, smartphones and related software efficiently\n   Ability to work independently diagnosing and troubleshooting with schematics, diagrams, service manuals and other technical documentation\n   Ability to focus on customers and ensure partnering across Research Safety Division Field Team (regional/national) if support is needed\n   Must be fluently bilingual in French\n \n  Work Environment\n \n   Ability to lift 50 lbs with assistance, and carry 25-30 Lbs. continuously throughout the day\n   Must adhere to customer clean room environments and wear appropriate Personal Protective attire as required\n   Ability to drive frequently within territory and travel overnight if necessary\n   Must have a valid driver’s license and a safe driving record\n   Ability to travel internationally for training, as required (passport or appropriate work visa )\n \n  Our Mission is to enable our customers to make the world healthier, cleaner and safer. Watch as our colleagues explain 5 reasons to work with us. As one team of 100,000+ colleagues, we share a common set of values - Integrity, Intensity, Innovation and Involvement - working together to accelerate research, solve complex scientific challenges, drive technological innovation and support patients in need. #StartYourStory at Thermo Fisher Scientific, where diverse experiences, backgrounds and perspectives are valued.\n \n  Apply today! http://jobs.thermofisher.com"
}