{
    "id": "498b897790a0e19a",
    "company": "Algonquin College",
    "positionName": "Part-Time Esthetics Lab Instructors",
    "jobType": [],
    "location": "1385 Woodroffe Avenue, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-01T20:10:05.899Z",
    "url": "https://www.indeed.ca/rc/clk?jk=498b897790a0e19a&from=jasx&tk=1he3lmb38joqj800&vjs=3",
    "externalApplyLink": "https://algonquincollege.wd3.myworkdayjobs.com/en-US/CareerOpportunities/job/Part-Time-Esthetics-Lab-Instructors_R143927",
    "companyDescription": "",
    "description": "Please Note: If you are a current Algonquin College employee, apply to this job via the Workday application.\n \n \n \n   Department:\n  Hospitality and Tourism (Michael Tarnowski)\n \n \n   Position Type:\n  Part-Time\n \n \n   Salary Range:\n  $53.02-$90.06-Hourly\n \n \n   Scheduled Weekly Hours:\n  3\n \n \n   Anticipated Start Date:\n  September 06, 2022\n \n \n   Length of Contract:\n \n \n \n   Posting Information\n \n \n \n   Posting Closing Date:\n \n \n \n   Please note: jobs are posted until 12:01 am on the job closing date.\n \n \n \n   Job Description:\n \n \n   Please note this is an Evergreen posting - compensation is subject to change based on experience and weekly scheduled hours which vary for each assignment.\n \n \n \n   Algonquin College School of Hospitality is recruiting Esthetics industry professionals to help develop our future industry practitioners.\n \n \n \n   These part-time teaching opportunities are related to hands-on lab courses in Esthetics services, including manicures/pedicures, facials, body treatments and hair removal.\n \n \n \n   Under the direction of the Academic Chair, the Part-time instructor is responsible for facilitating and guiding learning and providing an effective learning environment for all students within our practical labs. The professional responsibilities include the teaching of assigned courses, plus:\n \n \n  \n   \n     providing a learning environment that effectively uses available resources, including educational technologies and the College approved Learning Management System.\n   \n  \n   \n     evaluating student progress/achievement and assuming responsibility for assessing the student’s work within assigned courses.\n   \n  \n   \n     the development and creation of a learning environment conducive to success for all students.\n   \n \n \n \n   Note: This job requires regular onsite work within our learning labs\n \n \n \n   Required Qualifications:\n \n \n  \n   \n     Diploma from an Esthetician program approved by the Ministry of Training Colleges and Universities 1,200-hour program or a related field of study; an equivalent combination of post-secondary education and related practical work experience may be considered;\n   \n  \n   \n     Minimum five (5) years of practical experience as an esthetician;\n   \n  \n   \n     Highly effective communication, presentation, and organizational skills;\n   \n  \n   \n     Knowledge of industry, including facial treatments, nail care, body treatments and hair removal;\n   \n  \n   \n     Experience in training and development of staff is considered an asset.\n   \n \n \n \n   Algonquin College values diversity and is an equal opportunity employer. We offer an inclusive work environment and encourage applications from all qualified individuals. Internal candidates will receive first consideration based on qualifications. If you require accommodation during the recruitment process please contact the Human Resources department at humanresources@algonquincollege.com. While we thank all those who apply, only those to be interviewed will be contacted."
}