{
    "id": "49af1c76fd9f79d2",
    "company": "SOTAX",
    "positionName": "Lab Technician (CDD)",
    "jobType": [],
    "location": "Orleans, ON",
    "salary": null,
    "postingDateParsed": "2023-11-03T20:18:38.943Z",
    "url": "https://www.indeed.ca/rc/clk?jk=49af1c76fd9f79d2&from=jasx&tk=1hgol9m42jjhg800&vjs=3",
    "externalApplyLink": "https://www.sotax.com/fileadmin//user_upload/PDFs_free/03_Jobs/2022/221121_Lab-Technician_FR-Orleans.pdf",
    "companyDescription": "",
    "description": "SOTAX est leader sur le marché des instruments de contrôle \n   dans le domaine des industries pharmaceutiques. SOTAX est \n   un groupe en pleine expansion. Grâce à notre organisation \n   internationale, nous commercialisons nos appareils et les \n   prestations de services associées à une échelle mondiale. \n   Afin d’accompagner la croissance de la société, notamment à l’international, SOTAX Pharma Services souhaite  aujourd’hui recruter au sein de ses laboratoires d’Orléans (France) un \n   \n   Technicien Chimiste H/F  (CDD)   \n   Contrat proposé : CDD 12 mois à temps plein, débouché en CDI probable \n   Rémunération envisagée : selon profil \n   Avantages : 13ème mois, restaurant d’entreprise (avec prise en charge employeur), mutuelle  (salarié isolé ou forfait famille, avec prise en charge employeur de 60%) \n   Lieu de Travail : Orléans (Loiret, Région Centre-Val de Loire) \n   Déplacements : très ponctuels \n   \n   Votre fonction \n   Votre mission principale consiste à assurer le suivi des analyses qui vous sont confiées. Ainsi, vous organisez et  participez à la conception, la réalisation, l’évaluation, la fiabilité et la communication des résultats des études  analytiques. \n   Au quotidien, cela se traduira par : \n   \n    Réalisation, en autonomie, des analyses selon des méthodes établies et en exploiter les résultats \n   (essais de dissolution, analyses HPLC, UV, KF, Dureté, Granulométrie…). \n   \n    Développement et validation des nouvelles méthodes analytiques et participation à la rédaction des méthodes \n   d’analyse, en coordination avec les Chefs de Projets. \n   \n    Rédaction des comptes-rendus sur les analyses effectuées et validation des résultats avant soumission au \n   responsable. \n   \n    Assurer la qualité et la fiabilité des données ainsi que leur traçabilité en appliquant le niveau de qualité requis \n   (BPF/ GMP). \n   \n    Interprétation des données obtenues et proposition, le cas échéant, de solutions. \n   \n   \n    Communication avec les Clients pendant le cycle de vie du projet (envois réguliers des résultats, rédaction \n   des rapports intermédiaires et de fin d'étude, etc…). \n   \n    Participation à des réunions \"projet\". \n   \n   De ce fait, vous prendrez donc part : \n   \n    A la revue des procédures (SOPs) en place, leur mise à jour et à l’implémentation de celles nécessaires à un \n   fonctionnement en accord avec les règlementations BPF/ GMP ; \n   \n    A l’installation et la qualification des équipements : suivi métrologique et statut de qualification ; \n   \n   \n    Au maintien des conditions du laboratoire par un entretien régulier \n   \n   \n    A la gestion des systèmes informatisés du laboratoire : validation, sauvegardes, etc… \n   \n   \n    A la gestion des stocks du laboratoire : commandes de réactifs, destructions des déchets, etc… \n   \n   \n    Aux actions de formation et ponctuellement à l’encadrement des stagiaires ; \n   \n   \n    A la gestion des achats. \n   \n   \n   www.sotax.com \n  \n \n \n \n  \n   Par ailleurs, vous serez directement impliqué dans la gestion du système qualité pharmaceutique en collaboration  avec l’équipe Assurance Qualité pour : \n   \n    Participation et support dans le cadre des audits/inspections et suivi des actions \n   \n   \n    Participation à l’amélioration continue des process et du niveau de qualité en accord avec les exigences et les \n   évolutions de celles-ci \n   Votre profil \n   \n    Vous êtes titulaire d’un DUT, BTS ou issu d’une Licence Pro, tous ces diplômes relevant du champ de la \n   chimie analytique ou des sciences de la vie. Idéalement, vous pouvez justifier d’une expérience passée dans \n    le domaine pharmaceutique (laboratoire de R&D ou Contrôle Qualité). \n   \n    Vous possédez de bonnes connaissances théoriques et pratiques de l’HPLC/ UPLC, des essais de dissolution \n   ainsi que des méthodes d’analyse (Spectro UV-Visible, IR, Karl Fischer, etc…). \n   \n    Votre maîtrise de l’anglais vous permet de comprendre et rédiger des documents techniques ainsi que \n   d’utiliser les différentes pharmacopées. \n   \n    Vous utilisez de manière courante les outils informatiques, notamment bureautiques. La connaissance des \n   logiciels Empower™ et / ou WinSOTAX®plus serait un plus. \n   \n    Autonomie, sens de l’organisation et esprit d’équipe seront des qualités nécessaires pour occuper cette \n   \n   fonction. \n   Intéressé? \n   Envoyer votre candidature détaillée (CV et lettre de motivation) : \n   \n    Par email : pharmaservices@sotax.com \n   \n   \n    Ou par courrier : SOTAX Pharma Services \n   3 rue Chateaubriand \n    45071 Orléans Cedex 2 \n    France \n   \n   www.sotax.com"
}