{
    "id": "4f64bf36316e2afe",
    "company": "Queensway Carleton Hospital",
    "positionName": "Director Quality, Patient Relations&Safety, IPAC - Full-Time",
    "jobType": [],
    "location": "3045 Baseline Road, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-08T02:02:31.395Z",
    "url": "https://www.indeed.ca/rc/clk?jk=4f64bf36316e2afe&from=jasx&tk=1hc6garcoih7o800&vjs=3",
    "externalApplyLink": "https://erecruiter.qch.on.ca/default.aspx?REQ_ID=12926",
    "companyDescription": "",
    "description": "General Posting Information\n \n \n  \n    \n   \n   \n   \n   \n    \n     \n      \n       POSITION:\n       \n      \n       Director, Quality, Patient Relations, Patient Safety and Infection Prevention and Control (IPAC)\n       \n     \n      \n     \n     \n      \n       DEPARTMENT:\n       \n      \n       Patient Care\n       \n     \n      \n     \n     \n      \n       CONDITIONS:\n       \n      \n       Full-time\n       \n     \n      \n     \n     \n      \n       SHIFTS:\n       \n      \n       \n        Days\n        \n       \n        7.5 hours per shift (subject to change)\n        \n       \n     \n      \n     \n     \n      \n       WAGE RANGE:\n       \n      \n       \n        Scale Minimum Maximum\n        \n       \n        NONU $75.02/hr $90.93/hr\n       \n      \n       \n     \n      \n    \n   \n  \n  \n  \n   JOB SUMMARY \n    Reporting to the Vice President, Patient Care and Chief Nurse Executive, the Director for Quality, Patient Relations and IPAC is responsible for strategically directing the planning, development, implementation, maintenance, and evaluation of the QCH quality improvement, quality assurance, risk management, client experience, clinical education and infection prevention and control (IPAC) programs. \n   \n  \n   RESPONSIBILITIES:\n   \n   \n   \n    \n     In addition to such other duties as may from time to time be assigned, and consistent with the prescribed practices, procedures, and policies of the department and the Hospital, the incumbent shall under the direction of the Vice President, Patient Care: \n      Operations Leadership \n      \n      Responsible for anticipating and scanning the environment for emerging problem infectious organisms and communicable diseases, to evaluate the impact in order to recommend prevention/control measures and advise Senior Administration of cost implications regarding up and coming legislation. \n      Responsible for proposing new programs and services, or changes to existing programs, to ensure optimal performance and compliance with changing guidelines, standards, and legislation. \n      Develop and maintain a robust set of hospital-wide policies, procedures, and guidelines that ensure regulatory compliance and best practices. \n      Champion a culture of patient safety, risk reduction, and error prevention across the organization. \n      Spearhead the hospital's accreditation endeavors, orchestrating a cohesive effort that encompasses coordination, consultation, implementation, review, and education. Ensure the organization meets and exceeds accreditation standards, demonstrating a commitment to excellence. \n      Promoting a culture of safety throughout the organization by fostering reporting of near misses, adverse events, and implementing initiatives to prevent errors. \n      \n     Operations Management \n      \n      Responsible for directing the clinical infection control program, which includes identifying, monitoring and analysing trends, advising and ensuring appropriate measures are taken by staff at all levels, and preparing and delivering statistical data and reports to the infection control committee. \n      Ensure compliance with IPAC guidelines and regulations, leading audits, and coordinating staff training to maintain a high standard of infection prevention across the organization. \n      Ensure the on-going quality, effectiveness, and regulatory compliance of services, policies, processes, and procedures. \n      Analyze clinical, statistical, financial and operational data to assist in on-going planning, evaluation, and enhancement of programs and budgets. \n      Assists with licensing/accreditation survey preparation as requested. \n      Monitor the execution of preventive measures and provide guidance to staff to ensure proper implementation of best practices and procedures \n      Maintain records of documented cases of infection and disease for monitoring, investigation and process improvement/prevention purposes and manage the database of surveillance data \n      Ensure maintenance of infection control standards and practices in accordance with current provincially and/or federally legislated requirements, as mandated by the Provincial Infectious Diseases Advisory Committee (PIDAC) and/or currently accepted professional guidelines and recommendations \n      Report designated communicable diseases to Ottawa Public Health \n      \n     Quality and Patient Safety Coordination and Collaboration \n      \n      Drive initiatives to cultivate a culture of patient safety, ensuring that quality care remains at the forefront of all operations. \n      Lead and facilitate the development, implementation, and evaluation of Quality Improvement Plans (QIP), driving measurable enhancements in patient care, safety, and experience. \n      Develop comprehensive, multi-year strategic plans to advance patient safety and quality objectives, considering industry trends and best practices. \n      Ensure representation on committees and task groups with a quality or patient safety mandate in carrying out their objectives (e.g. Morbidity and Mortality Committee, Safe Mobility Committee, Safe Medications Committee, Corporate Risk and Patient Safety) \n      Actively lead the organization’s accreditation efforts, including but not limited to coordination, consultation, implementation, review, and education. \n      Develop, implement, and evaluate the organizational patient safety plan. \n      Collaborate with HIROC (Healthcare Insurance Reciprocal of Canada) to leverage risk management expertise, fostering a proactive approach to patient safety. \n      Provide leadership and participate in the Quality Executive and Quality Council to drive collective efforts towards quality enhancement, sharing best practices, insights, and facilitating continuous learning. \n      \n     Patient Experience Management \n      \n      Responsible for overseeing patient relations, ensuring satisfactory resolution of patient/family concerns. \n      Support staff on the use of conflict management and alternative dispute resolution skills enabling all levels of staff to identify, intervene, and mediate patient satisfaction /service recovery in a timely fashion. \n      Report on data, trends and themes related to patient experience and satisfaction \n      Manage, coordinate, and facilitate complex projects to enhance the patient experience. \n      \n     Human Resources Management \n      \n      Responsible for educating staff at all levels and in all departments on infection prevention and control measures to ensure staff safety. \n      Liaise, coordinate, and communicate with internal and external individuals/organizations (including VP Patient Care/Organizational Effectiveness and Director Occupational Health and Safety) with respect to planning and on-going operations. \n      Ensure the application and adherence to legislative requirements, collective agreements, and hospital policies. \n      Select, coach, retain, and transfer knowledge to staff to ensure quality of care optimal in individual/team performance. \n      Develops educational materials that are relevant, useful and easily understood by both clinical and non-clinical staff members. \n      Advises and consults with physicians, nurses, and contracted personnel concerning precautions to be taken to protect patients, staff, and others from possible transmission of infection. \n      Serves as a knowledgeable and available resource on infection control practices and policies to patients, families, and staff. \n      Create and support a continuous learning culture \n      Promote participation in seminars, workshops and conferences \n      Ensure timely corporate communication of issues pertaining to infection control \n      \n     Special Projects and Initiatives \n      \n      Liaise with and lead/participate on internal (inter or intra) and external committees, task forces, networks and multidisciplinary project teams. \n      Participate and/or lead initiatives which are common to all Directors (i.e. cultural transition). \n      Participation in regional (Ottawa Infection Control Liaison Group and CHICA Ottawa Region) provincial and national (CHICA) infection prevention and control related groups to facilitate networking, benchmarking and sharing of resources. \n      Stay updated with industry regulations, guidelines, and emerging trends to ensure the organization remains at the forefront of best practices in the respective areas. \n      \n    \n   \n  \n  \n  \n   REQUIREMENTS:\n   \n   \n  \n   Education and Experience\n   \n  \n   \n    \n     \n      Master’s Degree in a Health-related program of Study \n      Advanced knowledge of microbiology, epidemiology, infection prevention and control principles \n      Demonstrated oversight and leadership of progressive Quality Care initiatives in a healthcare setting \n      5+ years progressive experience in healthcare/healthcare management \n      \n     Other Qualifications (Asset) \n      \n      Knowledge and experience of strategic planning, data analysis methods and risk management \n      Strategic, analytical, conceptual thinking, and continuous improvement skills to provide expertise to senior leaders \n      Ability to lead transformative change in line with the vision, mission and values of QCH \n      Ability to write clear, concise reports and briefings for senior management that includes strategic advice and recommendations on key issues \n      Experience as an Accreditation project leader for a medium-sized (or above) Hospital \n     \n     Preferred Qualifications \n      \n      Post-Graduate Degree/certification in Health Care Quality and Risk Management (preferred) \n      5+ years of experience as a leader in a healthcare setting \n      Project Management Professional Designation (PMP) \n      Change Management (PROSCI or other) \n      \n    \n   \n  \n  \n  \n   \n    \n     \n      Please note that according to the Ontario Health and Queensway Carleton Hospital Vaccination Policy, all applicants must be fully vaccinated unless they can provide the proof of a valid medical contraindication or exemption on the basis of protected grounds under the Ontario Human Rights Code in order to be considered for any staff or volunteer opportunities. Upon hiring, applicants must provide the proof of either government issued documentation proving they have been fully vaccinated, or present supporting documentation of a valid medical contraindication or exemption under Ontario Human Rights Code.\n     \n     \n       \n       \n       \n       \n        Thank you for your continued interest in Queensway Carleton Hospital. We deeply value and celebrate the principles of equity, diversity, inclusion, and belonging, as they are integral to the enrichment of our work environment. We believe that by fostering an inclusive and diverse community, we can achieve our mission of providing exceptional healthcare services to all individuals with compassion and respect. We encourage applicants from all backgrounds to apply. We welcome those who would contribute to the further diversification of our organization including, but not limited to women, racial or ethnic minorities, First Nations, Inuit, and Métis peoples, persons with Disabilities, and 2SLGBTQI+ communities. \n         At Queensway Carleton Hospital, we are committed to ensuring accessibility and accommodating the needs of all candidates throughout the entire selection process. Our dedicated recruitment team is readily available to assist individuals with any inquiries or concerns regarding accessibility and accommodations at any stage of our recruitment process. We invite you to reach out and let us know how we can best support you. We look forward to welcoming diverse talent into our team and continuing to make a positive impact in the lives of our patients and the communities we serve."
}