{
    "id": "562c5d58ae5e2534",
    "company": "NOKIA",
    "positionName": "Engineering Lab Technician Co-op/Intern",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-08-31T22:41:42.793Z",
    "url": "https://www.indeed.ca/rc/clk?jk=562c5d58ae5e2534&from=jasx&tk=1haqc2b4rirl8800&vjs=3",
    "externalApplyLink": "https://careers.nokia.com/jobs/engineering-lab-technician-co-op-intern-101753?src=JB-10760",
    "companyDescription": "",
    "description": "Engineering Lab Technician Co-op/Intern\n  \n  Duration: 4 months \n  Date: January – April, 2024 \n  Location: Hybrid\n  \n  Come create the technology that helps the world act together Nokia is committed to innovation and technology leadership across mobile, fixed and cloud networks. Your career here will have a positive impact on people’s lives and will help us build the capabilities needed for a more productive, sustainable, and inclusive world. We challenge ourselves to create an inclusive way of working where we are open to new ideas, empowered to take risks and fearless to bring our authentic selves to work. \n  The team you’ll be part of \n  Network Infrastructure The pandemic has highlighted how important telecoms networks are to society. Nokia’s Network Infrastructure group is at the heart of a revolution to bring more and faster network capacity to people worldwide through our ambition, innovation, and technical expertise. The NI Service group in Nokia is seeking a highly motivated Engineering Lab Support Technician to join its lab team. This team is responsible for supporting all the IP Platforms labs in Kanata. Candidates can expect a hands-on technical role with a focus on providing lab support to the R&D and Customer Support Teams. \n  Education Recommendations Currently enrolled in Computer Technician program a Bachelor’s/ Master's degree or diploma program with an accredited school in Canada. \n  What you will learn and contribute to: \n \n   As part of our team, you will:\n   \n  \n   Work with new products and technologies.\n   Troubleshoot and debug node configurations.\n   Install system configurations restoring and backing up databases.\n   Troubleshoot and upgrade cards.\n   Installation and configuration of new equipment into existing networks\n  \n \n   What is Nokia looking for from me: \n \n   You have:\n   \n  \n   Strong interpersonal and communication (both written and verbal) skills\n   Ability to successfully work in a team-oriented environment\n   Demonstrated ability to learn quickly and to work in a fast-paced, innovative environment\n  \n  \n \n   It would be nice if you also had:\n   \n  \n   Knowledge in IP networking, familiar with networking concepts.\n   Familiar or proficient with UNIX and LINUX\n   Scripting languages (i.e., PERL)\n  \n  \n  Why we’re awesome Nokia offers flexible and hybrid working schemes, continuous learning opportunities, well-being programs to support you mentally and physically, opportunities to join and get supported by employee resource groups, mentoring programs and highly diverse teams with an inclusive culture where people thrive and are empowered. Company Culture: We believe our people are our greatest asset and we aim to foster a fun, challenging, positive, and inclusive work environment. We offer 1-on-1 mentorship, learning and development opportunities, global impact and interaction, and flexible work/life balance. Meaningful Co-op Term: During your co-op term, you will have the opportunity to test out the latest technologies and work on innovative projects that could leave a global impact. You get to use skills learned in the classroom and apply it to real work situations while gaining professional hands-on experience. \n \n   Nokia is committed to inclusion and is an equal opportunity employer\n   Nokia has received the following recognitions for its commitment to inclusion & equality:\n   \n  \n   One of the World’s Most Ethical Companies by Ethisphere\n   Gender-Equality Index by Bloomberg\n   Workplace Pride Global Benchmark\n   LGBT+ equality & best place to work by HRC Foundation\n  \n  \n  At Nokia, we act inclusively and respect the uniqueness of people. Nokia’s employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law. We are committed to a culture of inclusion built upon our core value of respect. Join us and be part of a company where you will feel included and empowered to succeed.\n  \n  \n  Follow and engage with us on social media: \n LinkedIn | Facebook | Instagram | Twitter @NokiaCareers \n  Chat with our Nokia insiders to ask questions and learn more about us!"
}