{
    "id": "5661b645e9dddea2",
    "company": "Parsons",
    "positionName": "Senior Biologist",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-23T20:06:33.672Z",
    "url": "https://www.indeed.ca/rc/clk?jk=5661b645e9dddea2&from=jasx&tk=1he3lftbdk7tt800&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=5661b645e9dddea2&atk=&xpse=SoCe67I3IDjNfIRTn50LbzkdCdPP",
    "companyDescription": "",
    "description": "In a world of possibilities, pursue one with endless opportunities. Imagine Next! \n When it comes to what you want in your career, if you can imagine it, you can do it at Parsons. Imagine a career working with intelligent, diverse people sharing a common quest. Imagine a workplace where you can be yourself. Where you can thrive. Where you can find your next, right now. We’ve got what you’re looking for. \n \n Job Description: \n Senior Biologist \n Parsons is seeking Senior Biologist to compliment the Planning and Ecological Services Group in Ottawa and/or the Greater Toronto Area. Parson’s Planning and Ecological Services Group works both in support of other internal groups (primarily land development/transportation/streets and bridges, and stormwater management) and also as an independent unit completing ecological assessments and monitoring duties directly for various clients. \n \n Duties will include field investigations and inventories, impact assessment studies and mitigation plans, during and post-construction monitoring of environmental project components, and preparation of technical reports and memos. The successful candidate will be required to work in the field on projects primarily based in Eastern or Southern Ontario with flexible office work arrangements. \n \n Responsibilities: \n \n  Collects and records field data, performs data entry and management, analysis, and reporting. \n  Performs a variety of field and office tasks requiring the application of standard scientific principles and fundamental theories. \n \n \n  Performs background research of available resources for potential environmental constraints. \n  Undertakes and participates in biological field investigations and data collection (e.g., breeding bird and amphibian surveys, bat acoustic surveys, vegetation inventories and tree surveys, wildlife and species at risk surveys, Ecological Land Classification assessment, wetland evaluations, and fisheries assessments) following established protocols. \n  Preparation of maps, including vegetation community delineation, and management of field data using ArcGIS. \n  Provide mentoring to intermediate and junior staff members. \n \n \n The successful candidate will have a combination of the following education and experience: \n \n \n  7+ years of related work experience in environmental consulting and/or municipal, provincial, or federal environmental planning. \n  Post-secondary education in Ecology, Biology, Forestry and/or other Biological Science. \n  Current or past certification as an ISA Certified Arborist or Registered Professional Forester is considered an asset. \n  Experience in the collection, analysis, and reporting of field data following established protocols. \n  Knowledge of aquatic and terrestrial environments, vegetation, and wildlife of Ontario and relevant legislation (e.g., Fisheries Act, Endangered Species Act, 2007, Species at Risk Act, Migratory Birds Convention Act, Fish and Wildlife Conservation Act ). \n  Experience in the accurate identification of Ontario flora and fauna (trees, shrubs, wildflowers, grasses, birds, reptiles amphibians, mammals, and/or insects). \n  Experience on MTO projects and RAQS Certification (Nature Science) considered an asset or experience to obtain RAQS certification. \n  Strong knowledge of environmental permitting process at the municipal, provincial and federal level. \n  Strong knowledge of Species at Risk found in Ontario, including identification, habitat, and life-history. \n  Experience in completing Environmental Impact Assessment following municipal, provincial or federal policies or acts. \n  Maintaining and organizing accurate and detailed fieldnotes as well as photo documentation records. \n  Proficiency in the use of ArcGIS Software. \n  Excellent written and oral communications skills particularly technical report writing. French language written and oral communication skills considered an asset. \n  Ability to work independently with minimal supervision as well as within a team environment to meet tight deadlines. \n \n \n A job with the Ecological Services Group at Parsons may be waiting for you! \n \n Minimum Clearance Required to Start: Not Applicable/None \n This position is part of our Critical Infrastructure team. \n For more than 75 years, our experts have designed and delivered the critical infrastructure that connects and protects communities around the world. We work in diverse, collaborative teams, both within the company and with our partners and customers, to plan, design, build, and modernize infrastructure. We take special pride in projects and solutions that improve communities as well as people’s quality of life by promoting economic growth, enhancing mobility, and increasing sustainability and resiliency. Powered by our people, we provide the imagination necessary to support our customers’ visions—and to help them see new possibilities. \n We value our employees and want our employees to take care of their overall wellbeing, which is why we offer best-in-class benefits such as health, vision, dental, employer paid provincial care premiums, Defined Contribution Pension Plan (DCPP), Tax-Free Savings Account (TFSA), Registered Retirement Savings Plan (RRSP), life insurance, paid time off, sick leave, all province observed holidays off, and gym membership discounts to fit your busy lifestyle! \n \n The position may require a COVID vaccination or an approved accommodation/exemption for a disability/medical condition or religious belief as required by customer requirements and some cases federal, state, provincial or local mandates. \n Parsons is an equal opportunity employer committed to diversity, equity, inclusion, and accessibility in the workplace. Diversity is ingrained in who we are, how we do business, and is one of our company’s core values. Parsons equally employs representation at all job levels for minority, female, disabled, protected veteran and LGBTQ+. \n We truly invest and care about our employee’s wellbeing and provide endless growth opportunities as the sky is the limit, so aim for the stars! Imagine next and join the Parsons quest—APPLY TODAY!"
}