{
    "id": "5850b6ed8e7822ee",
    "company": "CBI Health",
    "positionName": "Registered Massage Therapist",
    "jobType": [],
    "location": "1400 St. Laurent Boulevard, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-17T05:14:22.089Z",
    "url": "https://www.indeed.ca/rc/clk?jk=5850b6ed8e7822ee&from=jasx&tk=1hkikkt0b2bf3001&bb=yhJIT6P4TthyluDALQ78dq85AcGAddXhEllrUVBvhCpzMZQ-ygs1h_Rcdub1X7YaahvHLc0rfGrxcijB9oaAsFb4naxTe7aHpoq7s7lD1iR6zKq3UZcQNg%3D%3D&xkcb=SoD867M3FShceOxytZ0MbzkdCdPP&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=5850b6ed8e7822ee&bb=sGBfaZiW0W1IZwtYbPTBPPeu1uteThhAQv__w7cwZuav1yEMdF8OK1Z3NI83T2JB&xkcb=SoDJ67M3FShbbxRd650LbzkdCdPP&xpse=SoAc67I3FShbMtydT50LbzkdCdPP",
    "companyDescription": "",
    "description": "Registered Massage Therapist – Ottawa, ON \n  CBI Health is Canada’s leading community healthcare provider, and our passionate team is at the heart of what we do. Every day, our 13,000 staff make a meaningful difference in our clients’ lives as we live the core values that define us: heart, respect, reliability, teamwork and innovation. Along with mentoring and continuous learning opportunities to help advance your career, we are building a culture of inspiration, recognition and celebration for the meaningful work our team does every day, all across the country. Join the new CBI Health and find where your better begins. \n  About this opportunity \n  Are you looking to build your practice alongside a company that supports innovative, evidence-based approaches to rehabilitation? If so, CBI Health has a great opportunity for you to work with our interdisciplinary team! As a Registered Massage Therapist based at our Ottawa St. Laurent Health Centre, you’ll have ample opportunity to build and grow your massage therapy business as an independent contractor in a well-supported rehabilitation setting. \n  Take an inside look at what you’ll do each day \n  \n  Perform assessments and treat clients who are referred directly for massage therapy \n  Contribute to a team that provides massage therapy to clients as part of their overall rehabilitation \n  Communicates goals and expectations of the treatment to the clients and the rest of the treatment team \n  Maintains records of massage therapy assessments and treatment notes \n  \n What you need to be successful \n  \n  Registration in good standing with the College of Massage Therapists of Ontario (CMTO) or equivalent \n  The ability to work both independently and as part of a team \n  The ability to facilitate our clients' needs by exceeding their expectations. \n  Relevant experience is a definite an asset. \n  \n What CBI Health offers you \n  \n  Competitive compensation \n  Excellent administrative support, so you can focus on your patients \n  Flexible hours, which allow work-life balance and focus on quality of life \n  \n About Us \n  For millions of Canadians, CBI Health is where better begins. We are Canada’s leading community healthcare provider, reliably delivering innovative rehabilitation and home care programs that help our clients achieve their health goals. With 250+ locations and supporting more than 800 communities, people are at the heart of what we do. Every day, all across the country, our 13,000 staff work together to make a meaningful difference in our clients’ lives and help shape healthcare for the better. Learn more at cbihealth.ca. \n  CBI Health is proud to be recognized by Deloitte as one of Canada’s Best Managed Companies for the 15th year in a row. A huge thank you to all our team members, whose dedication, passion, and innovation have enabled us to achieve this recognition year after year. \n  CBI Health is committed to providing a diverse, equitable, and inclusive workplace where everyone feels safe and accepted as their authentic selves. We actively seek qualified candidates who share our commitment to equity and inclusion and contribute to the diversification of ideas and perspectives that help us innovate and provide the best possible care to our clients. \n We are committed to fostering a positive experience for all Indigenous applicants whether you’re First Nations (status or non-status), Inuit or Metis and welcome applications from all individuals regardless of race, colour, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or any other characteristics that make each of us different. \n  In accordance with the Ontario Human Rights Code, Accessibility for Ontarians with Disabilities Act and CBI Policies on Accommodation, a request for accommodation will be accepted as part of our hiring process. Please inform your recruiter if you have any accommodation requests."
}