{
    "id": "5e0c5e7e0c3f7ff8",
    "company": "GettaTutor.com",
    "positionName": "English Tutor",
    "jobType": [],
    "location": "Gatineau, QC",
    "salary": null,
    "postingDateParsed": "2023-10-07T02:03:48.099Z",
    "url": "https://www.indeed.ca/rc/clk?jk=5e0c5e7e0c3f7ff8&from=jasx&tk=1hc6gcllqltfi801&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "For this role we are looking for candidates interested in tutoring any course at the high school level. This can include math, physics, chemistry, biology, English, French, social studies. The more versatile and capable you are the better.\nWe are always looking for patient, well-spoken, educated individuals to help mold the minds, study habits, and self esteem of the students they work with. As a company we tutor all subjects, at all levels from kindergarten to grade 12. We provide support to students who need help studying for exams, who may be falling behind in their classes, or those who just want to excel. Our focus is helping our students learn the subject matter they are struggling with.\nOur ideal candidate will have the following qualities and aspirations:\n\n Have an interest in tutoring students part-time while they might be employed full time elsewhere or attending university.\n Patient, understanding, easy going and amiable.\n The ability to teach or instruct others in a helpful and comprehensible manner.\n Enjoy helping others learn and take pride in watching them reach their goals.\n Ability to read, write, spell, and speak clearly in English.\n Previous tutoring experience would be an asset.\n Have an interest in becoming a teacher.\n\nThe successful applicant will be required to administer and execute their own schedule, and should be:\n\n A motivated, self-starter\n Organized\n Punctual\n Reliable\n Trustworthy\n Dependable\n\nRequired education:\n\n A university degree or currently working towards a degree at an accredited academic institution with a minimum of 2 years completed.\n\nWe offer great pay, lots of support, and the ability to work at your own pace, set your own schedule and work as much or as little as you like. If this interests you, and you are excited about the opportunity to share your knowledge and skills with others, please submit your resumé via Indeed.\nJob Type: Part-time\nSalary: $20.00 per hour\nSchedule:\n\n Day shift\n\nWork Location: On the road"
}