{
    "id": "629491e280ec0e14",
    "company": "Leisure Days RV Group",
    "positionName": "Sales Professional",
    "jobType": [
        "Full-time"
    ],
    "location": "4815 Bank Street, Gloucester, ON",
    "salary": "$50,000–$70,000 a year",
    "postingDateParsed": "2024-01-25T12:16:10.631Z",
    "url": "https://www.indeed.ca/rc/clk?jk=629491e280ec0e14&from=jasx&tk=1hl5di2e1lllk800&bb=zpJiOyyz_0fgQiL3EewKgHv8EHOTlEtcFhLiwVpmMbiNb_iLvLLDFkylWS-nCZGEUXxJhCjjcTBw_W_bSLfP0vGvjGHIMn1XbmrK76faH7cOLh1JAx0Ilw%3D%3D&xkcb=SoBx67M3FlTHimWfyB0HbzkdCdPP&vjs=3",
    "externalApplyLink": null,
    "companyDescription": null,
    "description": "Leisure Days RV Group is the 4th largest RV dealership group in North America, and largest RV Dealership group in Canada with over 36 dealerships in 4 provinces - British Columbia, Ontario, Nova Scotia, and New Brunswick.\nOttawa Camping Trailers (a subsidiary of Leisure Days RV Group Inc.) is seeking an effective and charismatic RV Sales Professional to join its store. This is a full-time, commission-based position.\nIf you are motivated by the thrill of a sale or a win, you may be just the person we are looking for!\nOverview:\nThe RV Sales Professional matches customers with the best recreational vehicle (RV) for their travel and lifestyle needs. As with all positions within dealerships, sales professionals are expected to uphold the highest ethical standards. People working within the automotive retail industry often must work extended hours, evenings, and weekends to achieve their goals.\nThis position is eligible for company benefits, and fully compensated with salary + commission pay, with annual earnings in the range of $50,000 - $70,000.\nReports to: General Manager, Ottawa Camping Trailers\nKey Responsibilities & Accountabilities:\n\n Ensure an unforgettable client experience by connecting on a personal level with the client to make every interaction meaningful.\n Assist customers to select the right RV for their lifestyle and individual needs through an exceptional sales and service process.\n Highlight and educate customers on the features and benefits of various RV's during sales presentations.\n Help clients, enthusiastic about the product, and ready to close successful deal.\n Build rapport with customers, answer inquiries and competently resolve any concerns.\n Complete necessary documentation accurately\n Follow up with customers to build trust and confidence.\n Grow sales and profit within customer base.\n Highly motivated and ambitious\n Dedicated to deliver incredible results to clients.\n\nEssential Skills:\n\n Be a problem-solving champion, by listening and asking questions and leading with empathy any of the client concerns.\n Solid understanding of finance and payment plans\n Possess entrepreneurial mindset, by acting like an owner, taking accountability for issues, and knowing when to collaborate and use your team to find the right solutions.\n Deeply understand the products offered by the dealership, and proactively recommend products that will help achieve their financial goals.\n Reliable, strong work ethic, professional appearance is a must.\n Strong communication skills, verbal and written, with the ability to listen and provide solutions to customer issues.\n Should have a passion to do a great job and strive to exceed expectation.\n Must possess strong conflict resolution skills.\n Highly motivated and ambitious.\n Dedicated to deliver incredible results to clients.\n\nQualifications:\n\n Minimum High School Diploma or Equivalent.\n Outside sales: 1 year (preferred), and sales: 1 year (preferred).\n Valid G driver's license with clean and acceptable driving record.\n RV and/or automotive sales experience an asset.\n Provincially licensed, or able to be licensed, as recognized by the MVDA (OMVIC).\n Willing to work evening and weekend shifts.\n\nAll qualified individuals will receive consideration for employment without regard to race, color, age, sex, sexual orientation, gender identity, religion, national origin, disability, genetic information, or any other criteria protected by governing law.\nWe would like to thank all applicants for applying; however, only those applicants selected for an interview will be contacted. Applications received will be maintained on file for a period of 6 months and may be referenced for future staffing requirements.\nJob Type: Full-time\nSalary: $50,000.00-$70,000.00 per year\nBenefits:\n\n Company events\n Dental care\n Employee assistance program\n Extended health care\n Life insurance\n On-site parking\n Paid time off\n RRSP match\n Work from home\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n 8 hour shift\n Evening shift\n Every Weekend\n\nSupplemental pay types:\n\n Bonus pay\n Commission pay\n Overtime pay\n\nExperience:\n\n Outside sales: 1 year (preferred)\n Inside sales: 1 year (preferred)\n\nLicence/Certification:\n\n Driving Licence (preferred)\n\nAbility to Commute:\n\n Gloucester, ON K1X 1G6 (required)\n\nWork Location: In person"
}