{
    "id": "640bf8338d348ab5",
    "company": "CIMA+",
    "positionName": "Senior Project Manager, Environment - Hybrid",
    "jobType": [
        "Permanent"
    ],
    "location": "Gatineau, QC",
    "salary": null,
    "postingDateParsed": "2024-01-24T12:18:20.442Z",
    "url": "https://www.indeed.ca/rc/clk?jk=640bf8338d348ab5&from=jasx&tk=1hl5dm5j5kc37800&bb=oevkGIDXh7gG1VwZljrf78K-eqMy8iM6XkZq74VU_UyFQ-jpRXALNw9oUiHb7RzJaWCq9LKTre72rmSah2aOeztLUn8PJaL-Na5tVyVFxUVctq8fQLwwtQ%3D%3D&xkcb=SoB667M3FlTXbXRRp50HbzkdCdPP&vjs=3",
    "externalApplyLink": "https://jobs.smartrecruiters.com/CIMA2/743999962694582-senior-project-manager-environment-hybrid",
    "companyDescription": "With more than 30 offices across the country and over 2,600 employees, 60% of which share ownership in the company, CIMA+ is one of Canada’s largest private consulting engineering firms and a “Best Employer” according to the Kincentric survey. \r\n\r\nFor more than 30 years, our multidisciplinary teams have been offering clients a complete range of solutions in the building, energy and resources, municipal infrastructure, telecommunications and transportation sectors. We also offer a multitude of complementary services, including environmental and project management services. Innovative and integrated solutions that place people at the centre of engineering, reflect our values and our corporate culture.",
    "description": "Company Description\n  Welcome to a place where people are at the heart of everything we do.\n  Welcome to people with an inspiring vision and who seek stimulating challenges. At CIMA+, you’ll find a place where you’ll have many opportunities to learn and develop while working on engaging projects.\n  We are a firm 100% owned by its employees and we value a collaborative and entrepreneurial mindset. You will have the flexibility to manage your work on your own terms and define what work-life balance means to you.\n  When you join CIMA+, we welcome you to a place that you can call home.\n  Job Description\n  Mission\n  As a project manager, you will coordinate and monitor characterization, rehabilitation and environmental monitoring work for our many clients in different regions. You will be in the front-row seat to interact with the various clients, whether on internal multidisciplinary projects or with external clients. You will benefit from the support of professionals of all levels, you will be playing a technical role at all stages of the implementation process, and you will participate in the growth of the Environment sector team.\n  Primary Responsibilities\n \n   Oversee mandates and environmental assessment studies for phases I and II and environmental rehabilitations\n   Supervise rehabilitation and characterization projects involving internal and external resources and ensure collaboration between clients, government authorities, employees, subcontractors, suppliers, laboratories, etc.\n   Collect data, interpret results and make recommendations related to the mandate\n   Manage project budgets and timelines\n   Write or review technical reports\n   Participate in business development through service proposals, and coordinate the activities of technicians and professionals involved in projects\n \n  \n  Qualifications\n  \n \n   University Diploma in Geological, Civil, Geology Engineering or equivalent\n   A minimum of five years of relevant experience in environmental characterization and rehabilitation\n   Knowledge of applicable legislation, regulations, guides, guidelines, policies and other reference materials\n   Demonstrated ability to write reports and popularize technical concepts\n   Fluency in oral and written French: excellent writing skills in French\n   Completed health and safety training on construction sites (ASP Construction Card)\n   Agility to evolve in multidisciplinary projects\n \n  Contact Hamid Farahani\n  #LI-Hybrid\n  Additional Information\n \n  Ethics and integrity are fundamental values at CIMA+, and we are looking for people who uphold these principles. We are committed to creating opportunities for all our talents to contribute to the firm’s success, develop and grow, regardless of cultural or other differences. We fully endorse employment equity principles and encourage women, visible minorities, indigenous peoples, and individuals with disabilities to apply for any position offered at CIMA+. Adaptation measures are provided upon request to facilitate participation in the recruitment process."
}