{
    "id": "688272224233725d",
    "company": "Walmart",
    "positionName": "Directs Store Delivery Associate",
    "jobType": [],
    "location": "5357 Fernbank Rd, Stittsville, ON",
    "salary": null,
    "postingDateParsed": "2024-01-19T05:10:56.721Z",
    "url": "https://www.indeed.ca/rc/clk?jk=688272224233725d&from=jasx&tk=1hkikdadhih1j800&bb=EhOb8wC-jg2wt5IuI5mDXen_STJK_WGa3RQZ17_szvVLBNHUYHRvWYo3FGWUkwDMQs7hS3S1pmjSkHeT-ZaSHr0zEPAukUQDMOYuXNXzHL6wFVpbsZkfnw%3D%3D&xkcb=SoBC67M3FSg6inQ9SB0PbzkdCdPP&vjs=3",
    "externalApplyLink": "https://walmart.wd5.myworkdayjobs.com/en-US/WalmartExternal/job/Stittsville-ON/XMLNAME--CAN--Directs-Store-Delivery-Associate_R-1769000-1?codes=1-INDEED",
    "companyDescription": "",
    "description": "Position Summary... Working as a Directs Store Delivery Associate at Walmart Canada is a great way to develop your skills in the retail industry. A Directs Store Delivery Associate coordinates and efficiently processes direct and local merchandise for delivery to the salesfloor in order to ensure a positive shopping experience to drive customer loyalty. If you are looking for an exciting job in customer service or retail, working as a Directs Store Delivery Associate may be a great fit for you! \n \n What you'll do... \n 1. Ensures high-ticket merchandise is properly secured in a designated location.  2. Processes direct and local shipments promptly, including OMNI merchandise, and alcohol and receiving of warehouse trailers.  3. Trains other DSD Associates to follow all receiving area processes.  4. Ensures a clean receiving area by preparing returns, claims, MTR'S for prompt shipment with all necessary documentation.  5. Follows and promotes safety rules for lifting procedures, box blades, pallet jacks, ladders etc.  6. Works closely with the Operations Manager, Office Support Associate to effectively correct any problems or discrepancies.  7. Safeguards backdoor and key controls to ensure compliance with Company guidelines.  8. Follows guidelines for cold chain compliance to ensure quality assurance including documenting all necessary information on the Receiving Temperature Log / Sure Check App. ‎ \n \n Minimum Qualifications... \n Outlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications. \n Age - 16 or older \n \n Preferred Qualifications... \n Outlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications. \n \n Walmart will accommodate the disability-related needs of applicants and associates as required by law. \n \n Primary Location… 5357 FERNBANK RD, STITTSVILLE, ON K2S 0T7, Canada"
}