{
    "id": "6953cc0cfa87bf28",
    "company": "AECOM",
    "positionName": "Lead Electrical Engineer - Laboratory Facilities Projects",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-11-22T20:15:29.117Z",
    "url": "https://www.indeed.ca/rc/clk?jk=6953cc0cfa87bf28&from=jasx&tk=1hgol2euhk7i3800&vjs=3",
    "externalApplyLink": "https://jobs.smartrecruiters.com/AECOM2/743999945786262-lead-electrical-engineer-laboratory-facilities-projects",
    "companyDescription": "",
    "description": "Company Description\n  At AECOM, we’re delivering a better world.\n  We believe infrastructure creates opportunity for everyone. Whether it’s improving your commute, keeping the lights on, providing access to clean water or transforming skylines, our work helps people and communities thrive.\n  Our clients trust us to bring together the best people, ideas, technical expertise and digital solutions to our work in transportation, buildings, water, the environment and new energy. We’re one global team – 47,000 strong – driven by a common purpose to deliver a better world.\n  Here, you will have freedom to grow in a world of opportunity.\n  We will give you the flexibility you need to do your best work with hybrid work options. Whether you’re working from an AECOM office, remote location or at a client site, you will be working in a dynamic environment where your integrity, entrepreneurial spirit and pioneering mindset are championed.\n  You will help us foster a culture of equity, diversity and inclusion – a safe and respectful workplace, where we invite everyone to bring their whole selves to work using their unique talents, backgrounds and expertise to create transformational outcomes for our clients.\n  We will encourage you to grow and develop your career with us through our technical and professional development programs and diverse career opportunities. We believe in leadership at all levels. No matter where you sit in the organization you can make a lasting impact on the projects you work on, the teams and committees you join and our business.\n  We offer competitive pay and benefits, well-being programs to support you and your family, and the development resources you need to advance your career.\n  When you join us, you will connect and collaborate with a global network of experts – planners, designers, engineers, scientists, consultants, program and construction managers – leading the change toward a more sustainable and equitable future. Join us and let’s get started.\n \n \n\n Job Description\n  AECOM Buildings + Places is building a pipeline of qualified Senior Electrical Engineer candidates to potentially hire from to work on federal government laboratory facilities projects in the Ottawa and/or Montreal area.\n  Major Responsibilities:\n  The Senior Electrical engineer will be expected to:\n  Be able to conduct on-site review at any existing Lab facilities, to prepare an electrical risk and hazard assessment of existing operations.\n  Analyse the electrical requirements and available capacity from existing substation or available electric service providers of projects.\n  Provide an analysis of how to carry electrical service to site and any necessary and/or recommended upgrades needed.\n  Analyse the requirements for new emergency and UPS power.\n  Analyse the requirements for the new telecom cabling: fibre and copper.\n  Confirm of the electrical supply authority’s requirements and supply line capacity, including configuration of the supply network (e.g., lines, switch gear, vault access, etc.) and confirm of supply authority’s fees, disbursements, and timelines for network engineering and construction/reconfiguration.\n  Confirm required lighting levels based on the Project’s program requirements, validating that building, Site, and security-related lighting requirements meet the Canada Occupational Health and Safety Regulations, as referenced in the RLDF (Chapter 4) and Illuminating Engineering Society of North America.\n  Identify scope, assumptions, analysis process(es), and whole-building energy analysis, and energy Models meeting the ASHRAE 140 Standard, using software approved by the DR, to evaluate SD and DD options and determine best-value measures for optimal energy performance.\n  Review requirements for, inter-disciplinary input to, calculation frequency of, systems and overall Project LCA and LCCA, in accordance with provided Sustainability Analysis.\n  Indicate proposed normal, emergency and UPS electrical distribution requirements and provide a narrative description of the new electrical requirements including, in coordination with the architectural lighting, sustainability, and mechanical disciplines:\n  Include future loads for building including the Site and Site lighting and provision for electrical car charging stations in parking areas.\n  Indicate of the opportunities related to innovation and requirements to achieve integrated building, sub-system, and localized energy metering systems and integration of new intelligent building technologies.\n  Provide a narrative description and sketches of findings and incorporate into the Model. Include physical constraints on proposed distribution (i.e., Site infrastructure, building layouts, conduits, and chases).\n \n  Model and provide narrative explanation of the approach and guidelines for temporary power systems for construction operations, including within enclosed scaffolding. Confirm power supply limitations, tie-in locations, and capacities.\n  Identify lighting, security and Site lighting and related control requirements, and provide narrative of the new requirements: proposed lighting control system(s), their spatial requirements, and incorporate proposed control systems into the Model. Describe building and security and Site lighting control requirements and functionality, location of central control station(s), and integration with the control and metering of other power systems.\n  Demonstrated record of successful cost management on large construction projects\n \n \n \n\n Qualifications\n  Minimum Requirements:\n  In order to be considered, applicants must possess no less than the following:\n  University Degree in Electrical Engineering + eight (8) years of experience in the electrical design of science & technology buildings (ie. laboratories, research areas and facilities.)\n  Demonstrated equivalency of experience and/or education may be considered.\n  Professional Engineering license.\n  Preferred Requirements:\n  Prefer fifteen (15)+ years of experience experience in the electrical design of science & technology buildings (ie. laboratories, research areas and facilities)\n  Additional Information\n  \n \n   Relocation is not available for this position.\n   Sponsorship for Canadian employment authorization is not available for this position.\n   Offered rate of compensation will be based on individual education, qualifications, experience, and work location. The salary range for this position is $176,000 - $218,000.\n \n \n  About AECOM\n  AECOM is the world’s trusted infrastructure consulting firm, delivering professional services throughout the project lifecycle – from advisory, planning, design and engineering to program and construction management. On projects spanning transportation, buildings, water, new energy and the environment, our public- and private-sector clients trust us to solve their most complex challenges. Our teams are driven by a common purpose to deliver a better world through our unrivaled technical and digital expertise, a culture of equity, diversity and inclusion, and a commitment to environmental, social and governance priorities. AECOM is a Fortune 500 firm and its Professional Services business had revenue of $13.1 billion in fiscal year 2022. See how we are delivering sustainable legacies for generations to come at aecom.com and @AECOM.\n \n  Freedom to Grow in a World of Opportunity\n  You will have the flexibility you need to do your best work with hybrid work options. Whether you’re working from an AECOM office, remote location or at a client site, you will be working in a dynamic environment where your integrity, entrepreneurial spirit and pioneering mindset are championed.\n  You will help us foster a culture of equity, diversity and inclusion – a safe and respectful workplace, where we invite everyone to bring their whole selves to work using their unique talents, backgrounds and expertise to create transformational outcomes for our clients.\n  AECOM provides a wide array of compensation and benefits programs to meet the diverse needs of our employees and their families. We also provide a robust global well-being program. We’re the world’s trusted global infrastructure firm, and we’re in this together – your growth and success are ours too.\n  Join us, and you’ll get all the benefits of being a part of a global, publicly traded firm – access to industry-leading technology and thinking and transformational work with big impact and work flexibility. As an Equal Opportunity Employer, we believe in each person’s potential, and we’ll help you reach yours.\n  All your information will be kept confidential according to EEO guidelines."
}