{
    "id": "6b32c482c965ea88",
    "company": "National Research Council Canada",
    "positionName": "Real Property & Science Strategic Advisor",
    "jobType": [],
    "location": "1200 Montreal Rd, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-17T05:12:22.996Z",
    "url": "https://www.indeed.ca/rc/clk?jk=6b32c482c965ea88&from=jasx&tk=1hkikh137kp3h801&bb=MbdkWoTc0uPjBzci8Lm-JT3M-wkBwl4kbFgkiIrRDpxIGS6TFkj4Kk5JyqvY4hWJJm2TNt2Mzc-ekCJBmL_tii7bkCrLku2gGSCHExYE23xBFvyh06BdTQ%3D%3D&xkcb=SoBk67M3FShL_WzU3h0bbzkdCdPP&vjs=3",
    "externalApplyLink": "https://recruitment-recrutement.nrc-cnrc.gc.ca/job/Ottawa-Real-Property-&-Science-Strategic-Advisor-ON/570332017/",
    "companyDescription": "",
    "description": "Great Minds. One Goal. Canada's Success.\n     \n     \n    Help bring research to life and drive your career forward with the National Research Council of Canada (NRC), Canada's largest research and technology organization.\n     \n     \n    We are looking for a Real Property and Science Strategic Advisor to support our Real Property Planning and Management Branch. The Real Property and Science Strategic Advisor would be someone who shares our core values of Integrity, Excellence, Respect and Creativity.\n     \n     \n    The position of Real Property and Science Strategic Advisor offers a unique opportunity to play a significant role leading the development of Real Property science asset portfolio-level strategies, planning and advice that help the NRC achieve a high-quality, affordable and flexible portfolio via modernization, transformation and performance improvement.\n     \n     \n    The incumbent will be responsible for contributing to investment planning for all of the NRC’s real property holdings but of particular strategic importance is the ability to understand the research facilities to support prioritization of investment in the NRC’s science building assets based on, functionality and utilization. The incumbent will work closely with the Real Property Technical Advisor to ensure that the real property portfolio effectively supports the science undertaken at the NRC.\n     \n     \n    The incumbent will play a key role in transforming the NRC sites from coast to coast from 1950's and 1960’s campuses, to a vibrant, state-of-the-art science campus that is a transit-oriented, mixed use sustainable community for the 21st Century. \n   \n  \n  \n   \n     Screening Criteria \n   \n   \n     Applicants must demonstrate within the content of their application that they meet the following screening criteria in order to be given further consideration as candidates: \n   \n  \n  \n   \n     Education \n   \n   \n     A Bachelor's degree in a related discipline such as Engineering, Architecture, Science and Business Administration.\n     \n     \n    For information on certificates and diplomas issued abroad, please see Degree equivalency \n   \n  \n  \n   \n     Experience \n   \n   \n    \n     Experience developing new and novel approaches and methods to measure the effectiveness of the real property portfolio. \n     Significant* experience providing strategic and recommendations in planning and conducting cost benefit analyses and risk management considerations of research facilities; \n     Significant* experience facilitating effective engagement and coordination among different stakeholders during the planning process; \n     Significant* experience using software tools and disparate data sets to substantiate and illustrate findings and recommendations that help senior management make key strategic planning decisions.\n    \n     \n     \n    \n     Significant – 2 to 6 years\n    \n     \n    The following experience might be considered as an asset for this role:\n     \n     \n    \n     Experience working for a science-based company, university science department or science-based Government Department/Agency; \n     Experience mentoring junior staff and evaluating staff performance. \n    \n   \n  \n  \n   \n    Condition of Employment \n   \n   \n     Reliability Status \n   \n  \n  \n   \n     Language Requirements \n   \n   \n     English \n   \n  \n  \n   \n     Assessment Criteria \n   \n   \n     Candidates must clearly demonstrate in their cover letter how they meet the education and experience factors listed on the poster. Candidates must use the education/experience criteria as a header and then write one or two paragraphs demonstrating how they meet them by providing concrete examples. In addition, the candidate is encouraged to describe in detail when, where and how he/she gained the experience. Failure to provide an appropriate cover letter will result in the rejection of your application. Candidates will not be solicited for incomplete or possible missing information.\n     \n     \n    Candidates will be assessed on the basis of the following criteria: \n   \n  \n  \n   \n     Technical Competencies \n   \n   \n    \n     Advanced analytical skills including experience gathering, summarizing and presenting large amounts of data and information in a meaningful way to be used for decision making purposes, which can include cost approach to value, cost-benefit analysis techniques, financial analysis techniques, risk management techniques and modelling and forecasting methods. \n     Advanced knowledge of risk management principles and practices as well as an understanding of life cycle portfolio management; \n     Solid knowledge of trends and recent developments in research laboratory design and construction; \n     Solid knowledge of strategic and project planning principles as well as in investment analysis and a proven ability to convey this information to a diverse audience. \n    \n   \n  \n  \n   \n    Behavioural Competencies \n   \n   \n    Management services - Communication (Level 4) \n    Management services - Conceptual and analytical ability (Level 4) \n    Management services - Networking (Level 3) \n    Management services - Organizational and environmental awareness (Level 3) \n    Management services - Results orientation (Level 3) \n   \n  \n  \n   \n    Competency Profile(s) \n   \n   \n     For this position, the NRC will evaluate candidates using the following competency profile: Management Services\n     \n     \n   \n  \n  \n   \n     Compensation \n   \n   \n     Salary under review.\n     \n     \n    The intent of this hiring action is to staff this position at the RCO-3 level, which is a mid-career level position with a salary range of $105,785 to $123,393.\n     \n     \n    NOTE: Please note that the full RO/RCO salary scale has five levels. Salary determination will be based on a review of the candidate’s expertise, outcomes and impacts of their previous work experience relative to the requirements of the level. As such, the initial salary could be within another level of the RO/RCO salary scale (i.e. above or below the intended level for this position).\n     \n     \n    NRC employees enjoy a wide-range of competitive benefits including comprehensive health and dental plans, vacation, sick, and other leave entitlements, disability insurance and pension plans. \n   \n  \n  \n   \n    The NRC Advantage \n   \n   \n     The National Research Council of Canada (NRC) is the Government of Canada's largest research organization supporting industrial innovation, the advancement of knowledge and technology development. We collaborate with over 70 colleges, universities and hospitals annually, work with 800 companies on their projects, and provide advice or funding to over 8000 Small and Medium-sized Enterprises (SMEs) each year. \n    We bring together the brightest minds to deliver tangible impacts on the lives of Canadians and people around the world. And now, we want to partner with you. Let your expertise and inspirations make an impact by joining the NRC. \n    At the NRC Employee wellness matters. We offer flexible work schedules as well as part-time work to help employees maintain work-life balance. We are one of the few federal organizations that close our offices during the December holiday season. We offer professional learning and development opportunities such as conferences, workshops, and a suite of mentorship, award and recognition programs. Diversity enables creativity and innovation. Fostering a diverse, inclusive, welcoming and supportive workplace is important to us, and contributes to a more inclusive Canadian innovation system. We welcome all qualified applicants and encourage you to complete the employment equity self-declaration questions during the job application process. Please let us know of any accommodation measures required to help you to be assessed in a fair and equitable manner. Please note that the information you provide will be treated confidentially. \n    Help us solve problems for Canada. Grow your career with us today! \n   \n  \n  \n   \n     Notes \n   \n   \n    \n     Candidates must clearly demonstrate in their cover letter how they meet the education and experience factors listed on the poster. Candidates must use the education/experience criteria as a header and then write one or two paragraphs demonstrating how they meet them by providing concrete examples. In addition, the candidate is encouraged to describe in detail when, where and how he/she gained the experience. Failure to provide an appropriate cover letter will result in the rejection of your application. Candidates will not be solicited for incomplete or possible missing information. \n     Travel across Canada may be required. \n     Relocation assistance will be determined in accordance with the NRC's directives. \n     A pre-qualified list may be established for similar positions for a one year period. \n     Preference will be given to Canadian Citizens and Permanent Residents of Canada. Please include citizenship information in your application. \n     The incumbent must adhere to safe workplace practices at all times. \n     We thank all those who apply, however only those selected for further consideration will be contacted.\n    \n   \n  \n \n  \n  \n Please direct your questions, with the requisition number (19148) to: \n E-mail: NRC.NRCHiring-EmbaucheCNRC.CNRC@nrc-cnrc.gc.ca \n Telephone: 514-258-1653 \n Closing Date: 9 February 2024 - 23:59 Eastern Time"
}