{
    "id": "6edb2a8a0640ec38",
    "company": "AstenJohnson Holdings",
    "positionName": "Quality - CIT Specialist",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-17T18:51:40.049Z",
    "url": "https://www.indeed.ca/rc/clk?jk=6edb2a8a0640ec38&from=jasx&tk=1hcvfkunqk7dc802&vjs=3",
    "externalApplyLink": "https://globalus231.dayforcehcm.com/CandidatePortal/en-US/ajholdingsltd/Posting/View/203?source=Indeed",
    "companyDescription": "",
    "description": "AstenJohnson is the leader in technical fabrics. Our drive to provide the best products and service in our industry is fueled by our associates and their drive to innovate. We want our associates to build careers here and become part of the fabric of our 230 year old company. We offer competitive pay, excellent benefits and a workplace built on respect and purpose. \n\n \nGeneral Scope of Responsibilities:\n The Continuous Improvement Team is an integral part of the Kanata dryer manufacturing team and monitors product quality and process conformance. The team also works closely with internal and external customers. \nUnder the direction of the Continuous Improvement Team Leader, this position is responsible for liaising with manufacturing teams daily to ensure that quality standards are met and that roadblocks are removed. The specialist will also be responsible for supporting various aspects of CI operations such as New Product Development, Innovation, Lean Manufacturing, Non-Conformances, Corrective Actions, Customer Complaints, Best Practices and Operational Excellence. \n__________________________________________________________________________ \n\n \nSpecific Responsibilities:\n \n \n Technical Support for manufacturing teams, product managers, dryer champions and field associates \n Lean Manufacturing projects or special projects that are aligned with key business objectives \n Investigate and address customer complaints \n Root cause analysis and disposition of product or process non-conformances \n Data collection and analysis \n Production card verification and approval \n Other CIT duties as required or assigned \n \nPreferable Position Requirements:\nPosition Requirements:\n \n \n Ability to serve as a team member, presenter, facilitator and trainer as the team role warrants \n Be a self-starter with excellent organizational skills in planning and handling multiple tasks concurrently \n Strong attention to details, self-motivation, innovation and ability to operate autonomously \n Good troubleshooting skills \n Data analysis \n Passion for continuous improvement \n Works well with internal and external customers \n \nEducation & Years of Experience:\n \n \n College diploma in Quality Assurance, Engineering Technology or equivalent working / industry experience. \n \nSkills & Attributes:\n \n \n Experience in a Continuous Improvement function \n Lean Six Sigma Certified Green or Black Belt \n Proficient with Microsoft Excel, Word, PowerPoint, \n Strong verbal and written communication skills \n Dependable and adaptable \n Experience with SharePoint and JD Edwards \n Understanding of manufacturing steps and dryer fabric products \n We are an equal opportunity employer and considers all qualified applicants equally without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran status, or disability status."
}