{
    "id": "742bd11e98db7a13",
    "company": "Canadian Blood Services",
    "positionName": "Laboratory Assistant",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-09-14T22:40:42.845Z",
    "url": "https://www.indeed.ca/rc/clk?jk=742bd11e98db7a13&from=jasx&tk=1haqc0qipjku7800&vjs=3",
    "externalApplyLink": "https://careers.blood.ca/job/Ottawa-Laboratory-Assistant-ON-K2E-8A6/574026017/?feedId=335117&utm_source=Indeed&utm_campaign=CABloodServices_Indeed",
    "companyDescription": "",
    "description": "Job category: Laboratory and phlebotomy Job posting ID: 5023\n \n  Employment status: Regular part-time Position's anticipated start date: 2023-10-02 Possible schedule/FTE: .5\n \n  Classification: BT OPSEU 477 Salary/Rate of pay: 23.31\n \n  Application deadline: 2023-09-22\n \n  Do you currently work for Canadian Blood Services? All employees must apply via the internal career page.\n \n  Together, we can make all the difference in the lives of others.\n \n  Be part of a dynamic, collaborative and caring organization committed to saving and improving lives. Thousands of patients depend on us every day for reliable access to safe blood, plasma, stem cells and organs and tissues.\n \n  If you are looking for a rewarding experience with a values and mission-driven team, join Canada’s Lifeline and make a meaningful difference.\n \n  We acknowledge that the work of Canadian Blood Services spans many Territories and Treaty areas across the country, and we are grateful for the Traditional Knowledge Keepers and Elders who have guided us in this important work. We recognize the land and waters that have inspired our work and offer gratitude to those Indigenous peoples on whose territory we work, live and play.\n \n \n  \n   \n     About the role\n   \n   \n     Canadian Blood Services is looking for a Regular part-time Laboratory Assistant - Distribution to join our dynamic Supply Chain Operations East team.\n    \n     The Supply Chain Operations East team is responsible for supporting Canadian Blood Services by providing technical assistance and maintaining the laboratory, all laboratory equipment and test instruments.\n   \n  \n  \n   \n     Formula for success\n   \n   \n   \n     \n    \n      Drawing on your knowledge or experience in laboratory functions, you will prepare, produce and/or modify all blood components as well as maintain proper storage of whole blood and blood components.\n      Utilizing your superior interpersonal and communication skills you will assist in the laboratory by performing para-technical duties, under the close supervision of a technologist (e.g. sorting banks, opening specimens, writing worksheets, and recording results).\n      You will prepare available inventory, issue and outdate counts of blood and components on a daily basis.\n      You will receive orders, select, issue, dispatch and my be assigned to pack blood, blood components and fractionation products to hospitals according to Standard Operating Procedures.\n      You will also perform cleaning and preventative maintenance of equipment used in the laboratory. \n    \n   \n  \n  \n   \n     Desired education and skills\n   \n   \n   \n     \n    \n      Completion of secondary education. Completion of an accredited training program or College Diploma would be considered an asset.\n      Minimum 1 year laboratory experience.\n      Experience in food processing, pharmaceutical or biologics manufacturing is a strong asset.\n      Ability to learn required technical skills.\n      Must have good oral and written communication skills.\n    \n   \n  \n  \n   \n     What we offer you\n   \n   \n   \n     \n    \n      Payment in lieu of vacation, holidays, benefits and sick time.\n      Premiums paid according to the collective agreement.\n      Defined benefit pension plan.\n      Employee discounts, wellness program, professional resources.\n    \n   \n  \n  \n   \n     What you can expect\n   \n   \n   \n     \n    \n      Shifts/hours - must be flexible to accommodate assigned shifts which are based on operational needs; length of shifts varies according to the event which takes place at Canadian Blood Services fixed and mobile donor centers. Shifts include days, evenings, overnights, weekends, and statutory holidays.\n      Physical requirements - ability to lift weight up to 10 kg (22 lbs.).\n    \n   \n  \n \n  This position must meet the Trustworthiness and Reliability Verification requirements of the Canadian Nuclear Safety Commission and is subject to criminal records and employment verification checks.\n \n  Diversity and inclusion play a vital role in ensuring health equity for patients across Canada. We are committed to reflecting Canada’s population in our organization and fostering an environment where all employees can be their authentic selves, with equal opportunities to succeed and contribute.\n \n  Canadian Blood Services requires that all employees be fully vaccinated (COVID 19 vaccine doses as approved by Health Canada), subject to any medical or other human rights considerations. Persons who have been vaccinated outside of Canada must contact their local Public Health Unit in order to obtain a vaccine equivalency certificate.\n \n  If this role resonates with you, we encourage you to apply! This could be your first step towards a meaningful and inspiring career. Come to work each day knowing that you save lives.\n \n  We thank all applicants for their interest. However, only those considered for an interview or those invited to participate in an assessment will be contacted. Applicants who require accommodation should discuss their needs with us."
}