{
    "id": "74822ee9486d60df",
    "company": "GBatteries",
    "positionName": "Battery Lab Technician",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-11-03T20:17:17.949Z",
    "url": "https://www.indeed.ca/rc/clk?jk=74822ee9486d60df&from=jasx&tk=1hgol75cilemg800&vjs=3",
    "externalApplyLink": "https://jobs.lever.co/gbatteries/9bc32e37-f36e-41d0-bc8d-9582b6a55a62?lever-source=Indeed",
    "companyDescription": "",
    "description": "A BIT ABOUT US\n \n \n   GBatteries was founded nine years ago to tackle one of the world’s most pressing issues: the transition to a cleaner future through electrification. We are pioneering battery technology which enables ultra-fast charging of Li-ion batteries without compromising battery life — and without changing the battery’s chemistry or manufacturing process. Ultimately, our mission is to accelerate the mass adoption of electric vehicles.\n \n \n   We are working on some of the biggest challenges in energy storage, and are looking for the right people to join us as we develop our technology and continue to scale.\n \n \n \n   THE OPPORTUNITY AND THE ROLE\n \n \n   As a Battery Lab Technician, you'll be working alongside R&D team to produce consistent, high quality batteries for our research on next generation high energy density lithium-metal and lithium-ion cells. You will manage and perform pouch cell assembly, operate lab equipment, manage assembly component inventory, and resolve yield / quality issues. You will be also preparing and maintaining written procedures for various operations relevant to cell assembly and supporting our engineers with setting up and monitoring battery cycling tests.\n \n  \n \n \n   THE TEAM\n \n \n   You’ll join a small but growing R&D team where everyone is committed to continuous learning and advancing our understanding of chemical processes and systems, with the ultimate goal of developing reliable and innovative products. As we continue to grow and navigate new challenges, we pride ourselves on our collaborative spirit. We believe in supporting each other and stepping in whenever issues arise, fostering an environment of mutual respect and shared success.\n \n  \n \n \n   THE SKILL SET\n \n \n \n   Must haves:\n \n \n  College diploma in chemical laboratory technology, chemical engineering technician or equivalent.\n  Previous experience in at least 1 laboratory technician role in industry.\n  Experience handling chemicals with basic laboratory tools (e.g. pipette, volumetric flask)\n  Knowledge of safety procedures in a chemical laboratory.\n \n \n \n   Nice to haves:\n \n \n  Experience with coin/pouch battery cell assembly and working with glovebox.\n  Knowledge of the internal components of lithium-ion batteries.\n  Experience with operating oscilloscope and potentiostat.\n \n \n \n   WITHIN 3 MONTH, YOU'LL...\n \n \n  Familiarize yourself with glovebox operation, cell assembly and formation process.\n  Operate and maintain cell production equipment.\n  Perform quality checks on cells and investigate causes of performance issues.\n \n \n \n   WITHIN 6 MONTHS, YOU'LL...\n \n \n  Recommend and implement improvements to cell assembly and equipment maintenance processes.\n  Assist with creation and maintenance of inventory management systems and cell quality control.\n \n \n \n   WITHIN 12 MONTHS, YOU'LL...\n \n \n  Be heavily involved in selection and commissioning of new equipment for a battery production pilot.\n \n  \n \n \n   WHAT WE OFFER\n \n \n   We are working on many exciting projects towards our ultimate goal of breaking down the final barrier preventing the adoption of electric vehicles; range anxiety. We’re a growing company working with some of the largest manufacturers in the world, and there’s still a huge amount to do. You’ll be able to see the impact of your work from day one, and have the opportunity to see the final effect on real world products. We encourage unconventional thinking, and seek resilient problem solvers who aren’t afraid to get their hands dirty.\n \n \n \n   Of course, we also offer other great benefits:\n \n \n   Inclusive parking, a renovated and spacious office, and fridge and pantry filled with drinks and snacks. We’re conveniently located near the 417 highway with easy access via major public transit routes, right beside a small park and an assortment of shops and restaurants.\n  \n \n  HOW TO APPLY\n \n \n   Is the idea of enabling the global mass adoption of electric vehicles exciting to you? We’d love to hear from you! To apply please include a short message addressed to Henry Rearden within the application below; no cover letter necessary. If you have any questions, or just want to say hello, feel free to reach out to Vlad Belov on LinkedIn.\n \n  \n \n \n   We particularly value diversity, and we know that experience comes in many forms. If your unique experience is close to what we’re looking for, please still consider applying."
}