{
    "id": "7a90f20fdc5aba78",
    "company": "BWX Technologies",
    "positionName": "Quality Assurance Manager",
    "jobType": [],
    "location": "447 March Road, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-09-01T06:50:38.249Z",
    "url": "https://www.indeed.ca/rc/clk?jk=7a90f20fdc5aba78&from=jasx&tk=1hbl00rvqkp1k800&vjs=3",
    "externalApplyLink": "https://careers.bwxt.com/job/Ottawa-Quality-Assurance-Manager-ON/1047615900/?jobPipeline=Indeed",
    "companyDescription": "",
    "description": "BWXT Medical Ltd. provides its customers, who conduct life-saving medical procedures for patients around the world, the benefit of decades of experience in the development, manufacturing, packaging and delivery of medical isotopes and radiopharmaceuticals. Headquartered in Kanata, Ontario, BWXT Medical Ltd. employs over 300 highly-skilled people in Kanata and Vancouver, British Columbia. BWXT Medical Ltd. is part of the BWXT nuclear power segment (NPG) of BWX Technologies, Inc.\n  \n  \n BWXT Medical Ltd., is hiring a Quality Assurance Manager at our production facility in Ottawa, Ontario, Canada.\n  \n  \n Position Summary: \n Reporting to the Director, Quality Assurance, the Quality Assurance (QA) Manager is responsible for ensuring that all performance targets and regulatory obligations to support compliance and reliability of operations and manufactured products are met. This position will provide technical guidance to new product and process development, and will participate as a member of development teams. \n \n  Applying a full working level of knowledge in Quality Assurance and Quality Management System procedures, the QA Manager is responsible for maintenance of various elements of the Quality Management system and procedures; \n  The QA Manager will perform batch release of products, and ensure high product quality; \n  Responsible to ensure the Quality Control functions are in compliance with Good Manufacturing Practices (GMP); \n  Responsible for hiring, supervising and evaluating QC Technicians responsible for microbiological and/or chemical analyses; \n  Other duties will include performing internal audits, hosting outside auditors, and providing GMP guidance to research and development;\n \n  \n  \n Position Qualifications / Requirements: \n \n  Bachelor of Science degree in Chemistry or Microbiology; must have at least one university level course in microbiology; \n  Minimum of 5-7 years’ work experience in quality assurance and/or quality control, preferably from a pharmaceutical or medical device industry; \n  Possess excellent judgment and ability to maintain excellent working relationships with internal and external customers; \n  Excellent written and verbal communication skills; \n  Ability to effectively analyze and make decisions within tight timelines; \n  Excellent organizational and leadership skills;\n \n  \n  \n Other: \n \n  This position is Nuclear Energy Worker; \n  Ability to work shift work when needed;\n \n  \n  \n Why join BWXT Medical? \n \n  Work within the growing and exciting nuclear medicine industry as well as with highly skilled employees. \n  Competitive salaries. \n  Company match pension plan. \n  Comprehenstive health and dental benefits. \n  Education reimbursement program. \n  Life insurance. \n  Collaborative work environment... and so much more!\n \n  \n  \n \n BWXT Medical Ltd. embraces diversity of thought, values individuality, encourages new perspectives and provides equal opportunity in employment for all qualified employees and applicants without regard to race, national or ethnic origin, colour, religion, age, sex, sexual orientation, marital status, family status, disability, a conviction for which a pardon has been granted or a record suspended or any other category protected by federal law."
}