{
    "id": "7be67a486b9a85c4",
    "company": "GFL Environmental Inc.",
    "positionName": "Chemical Technician (Day Shift)",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-09-21T06:48:36.467Z",
    "url": "https://www.indeed.ca/rc/clk?jk=7be67a486b9a85c4&from=jasx&tk=1hbkvt5cukf2u802&vjs=3",
    "externalApplyLink": "https://wd3.myworkdaysite.com/recruiting/gflenv/Careers/job/Ottawa-Ontario/Chemical-Technician--Day-Shift-_R10318?source=Indeed",
    "companyDescription": "",
    "description": "The Chemical Technician (job title: Chemical Operator) is responsible for day-to-day operations with respect to waste receiving, sampling, handling, processing, and disposal. Client site visits to complete lab packing of waste, classification and sampling of waste products and preparing materials for transportation and disposal. Assisting Industrial Operations, Customer Service Representatives with projects as needed.\n \n \n   Who we are:\n \n \n  \n   \n    \n      GFL Environmental is the only major diversified environmental services company in North America; operating across Canada and the United States; offering services in solid waste management, liquid waste management, and infrastructure development.\n     \n      Recognized by our signature fleet of bright green trucks and equipment, we offer a wide range of environmental and industrial services to businesses, communities, and households, providing a consolidated and sophisticated approach to meeting our customers’ needs.\n     \n      GFL Benefits:\n     \n       Our industry leading benefits package (100% employer paid)\n       RRSP Matching: We support your future goals by matching your RRSP contributions\n       An environment to encourage professional growth and development\n       Be a part of the Full-Cycle Project initiative – a way to give back to the community\n     \n    \n   \n  \n \n  Key Responsibilities:\n \n   Receive all client waste – both bulk liquids/solids and containerized.\n   Take samples from waste vehicles and containers for lab analysis.\n   Load and unload waste vehicles including vacuum trucks, tankers, straight trucks, and van trailers.\n   Operate plant machinery and assist with general maintenance as needed.\n   Perform wastewater treatment and discharge according to our site-specific Environmental Certificate of Approvals (ECAs) and associated compliance requirements pertaining to treatment and discharge issued by the Region of Peel.\n   Perform acid/base neutralizations efficiently, safely, and effectively.\n   Assist with preparing shipments of hazardous and non-hazardous waste for transport.\n   Notify the Shift Supervisor/General Manager of any defects, damages, mistakes, errors, contamination, spills, other incidents, or accidents that are identified.\n \n \n  Knowledge, Skills & Competencies: \n \n  Post-Secondary education in Chemistry/Chemical Engineering/Technology or Internship in a related field.\n   Familiarity with waste management regulations, Ontario regulation 347, Transportation of Dangerous Goods is an asset.\n   Previous hazardous and non-hazardous waste management experience is an asset.\n   Must be comfortable working in a mostly outdoor environment.\n   Ability to lift upwards of 50 lbs.\n   Emergency response availability including evenings and weekends.\n \n \n  #GFLTalent\n \n  We thank you for your interest. Only those selected for an interview will be contacted. \n \n GFL Environmental is an equal opportunity employer and encourages women, Aboriginal people, persons with disabilities and members of visible minorities to apply. We seek to hire individuals with diverse characteristics, backgrounds and perspectives. We strongly believe that world-class talent makes no distinctions based on gender, ethnic or national origin, sexual identity and orientation, age, religion or disability, but enriches itself through these differences. GFL will provide accommodations to job applicants with disabilities throughout the recruitment process. If you require an accommodation, please notify us and we will work with you to meet your needs."
}