{
    "id": "7dc2a2353052d14a",
    "company": "University of Ottawa Heart Institute",
    "positionName": "Postdoctoral Researcher",
    "jobType": [],
    "location": "40 Ruskin St, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-09-01T06:49:20.819Z",
    "url": "https://www.indeed.ca/rc/clk?jk=7dc2a2353052d14a&from=jasx&tk=1hbkvuh1oj32s803&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "POSTDOCTORAL FELLOW Division of Cardiac Prevention & Rehabilitation Cardiac Rehabilitation Exercise Physiology and Cardiovascular Health Lab \nUniversity of Ottawa Heart Institute \nThe University of Ottawa Heart Institute is Canada's largest and foremost cardiovascular health centre dedicated to understanding, treating, and preventing heart disease. The Division of Cardiac Prevention & Rehabilitation has a unique array of initiatives and programs, with a particular emphasis on innovative approaches to preventing(primary and secondary) and managing cardiovascular disease. The Division is home to our Cardiac Rehabilitation program, one of the largest in Canada, and the Exercise Physiology and Cardiovascular Health Lab.\nThis fellowship affords the opportunity to acquire and contribute knowledge to the areas of cardiovascular rehabilitation, clinical exercise physiology, big data, and clinical trial conduct and management. Some of the current research projects include: (1) OPPORTUNITY – an RCT investigating the impact of different forms of exercise training in patients with atrial fibrillation; (2) CANSURVEY-AF – a multi-site observational cohort study examining the physical activity levels of patients with atrial fibrillation; (3) EXCEED – an RCT examining the effects of exercise programs delivered virtually in women with cardiovascular disease; and, (4) various projects examining practical approaches to prescribing physical activity and monitoring exercise intensity in patients with cardiovascular disease, with a focus on sex and gender differences.\nThe selected candidate will be expected to lead a large-scale / big-data evaluation of cardiac rehabilitation programming to advance quality of care, closely collaborating with scientists and healthcare professionals to develop and apply advanced data science methodologies. Access to several large integrated clinical and research databases spanning 15+ years is available and will serve as the foundation for publication and presentation opportunities. The fellowship also offers the opportunity to enhance and develop clinical exercise physiology / kinesiology skills (e.g., leading exercise training sessions, cardiopulmonary exercise testing, functional capacity testing) in patients with a range of cardiovascular conditions including, but not limited to, atrial fibrillation, coronary artery disease, heart failure (if the candidate possesses the minimum required education and qualifications, see below).\nIt is expected that the successful candidate will assume responsibility for the preparation and publication of manuscripts and assist with the submission of research grant applications. The fellow will also participate in training and educational activities (e.g., Grand Rounds, Cardiac Rehabilitation Rounds, Work-in-Progress Rounds, conferences), and may obtain additional support from our Research Services Department, medical librarian, andCardiovascular Methods Centre.\nThe successful candidate will possess: \n\n Ph.D. degree in a data science (statistics/computer science/engineering) or health-related (exercise physiology/kinesiology preferred, epidemiology) field, or M.D. degree.\n R. Kin, ACSM RCEP, CSEP CEP, or equivalent (preferred if contributing to clinical exercise physiology / kinesiology activities).\n A strong understanding of clinical research design, research methodology, and data analysis.\n Advanced statistical training and knowledge of statistical software packages.\n Demonstrated experience programming in statistical software (e.g., SPSS, SAS, R, Python).\n Evidence of experience in the preparation and publication of manuscripts.\n Excellent oral communication and technical writing skills in English.\n The ability to take guided initiatives and to work in an organized fashion within a fast-paced research environment, including flexibility in shifting between independent and collaborative work.\n The ability to work collegially in an exciting and dynamic research environment.\n\nThe position is a two-year fellowship with the possibility of a 1-year renewal contingent on performance and funding. Up to two positions may be available. While funding for this position(s) has been secured through theUniversity of Ottawa Heart Institute Foundation (Jan & Ian Craig Fellowship), the Canadian Institutes of HealthResearch, and the Heart and Stroke Foundation of Canada, successful applicants will be encouraged to apply for independent postdoctoral fellowships. Please send a letter of application including a 1-2 page description of research experience and interests, updated curriculum vitae, and names & contact information of three referees to Dr. Jennifer Reed, jreed@ottawaheart.ca (video and audio recordings of the application package are also acceptable). Applicants are encouraged to prepare their application materials following DORA guidelines to define their research contributions. A description of any barriers that may have limited their research contributions to date are encouraged. Applications are encouraged to reach out should they have questions regarding the application requirements. Applications will be reviewed as received.\n\n We are committed to a continued focus on equitable hiring, training, operations, and policies. We don’t just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our research and clinical programs. \n\nJob Type: Full-time\nSalary: $50,000.00-$60,000.00 per year\nBenefits:\n\n Flexible schedule\n\nSchedule:\n\n Monday to Friday\n Weekends as needed\n\nEducation:\n\n Doctoral Degree (preferred)\n\nWork Location: In person"
}