{
    "id": "7e0af9d9dca9e1ed",
    "company": "Eurofins Canada Environment Testing",
    "positionName": "Laboratory Technician _Organics _ Eurofins Environment Testing",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-08-25T06:50:40.837Z",
    "url": "https://www.indeed.ca/rc/clk?jk=7e0af9d9dca9e1ed&from=jasx&tk=1hb2v8b7g2ap3005&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=7e0af9d9dca9e1ed&atk=&xpse=SoBf67I3Ki2syqQSJJ0LbzkdCdPP",
    "companyDescription": "",
    "description": "Company Description\n  Eurofins Scientific is an international life sciences company, providing a unique range of analytical testing services to clients across multiple industries, to make life and our environment safer, healthier and more sustainable. From the food you eat, to the water you drink, to the medicines you rely on, Eurofins works with the biggest companies in the world to ensure the products they supply are safe, their ingredients are authentic and labelling is accurate. Eurofins believes it is a global leader in food, environmental, pharmaceutical and cosmetics products testing and in agroscience CRO services. It is also one of the global independent market leaders in certain testing and laboratory services for genomics, discovery pharmacology, forensics, CDMO, advanced material sciences and in the support of clinical studies.\n  In over just 30 years, Eurofins has grown from one laboratory in Nantes, France to over 58,000 staff across a network of more than 1 000 independent companies in over 54 countries and operating more than 900 laboratories. Eurofins offers a portfolio of over 200,000 analytical methods to evaluate the safety, identity, composition, authenticity, origin, traceability and purity of biological substances and products, as well as providing innovative clinical diagnostic testing services, as one of the leading global emerging players in specialised clinical diagnostics testing.\n  In 2021, Eurofins generated total revenues of EUR € 6.7 billion, and has been among the best performing stocks in Europe over the past 20 years.\n \n \n\n Job Description\n  Primary Purpose: Under direct supervision of the Laboratory Supervisor, this position is responsible for conducting sample preparation and analysis using the appropriate analytical methods.\n \n   Perform sample extractions according to applicable SOPs and test methods;\n   Perform sample analysis, integration, and data entry into the LIMS system;\n   Perform method validation procedures for applicable test methods;\n   Maintain good laboratory housekeeping at all times;\n   Perform regular instrument maintenance, troubleshooting and calibration;\n   Keep track of consumables inventory and request supplies for ordering, as required;\n \n \n   Follow the Quality System as documented in the Quality Assurance Manual; and\n   Other related duties as assigned.\n \n \n \n\n Qualifications\n  \n \n   University degree or college diploma in a chemistry-related field;\n   Basic computer literacy;\n   Experience with GCs and organics testing an asset;\n   Laboratory safety and WHMIS training;\n   Troubleshooting skills required for instrument maintenance;\n   Technical knowledge of applicable test methods; and\n   Weekend and/or evening shifts may be required.\n \n  Additional Information\n  temporary position\n  37.5 hours per week"
}