{
    "id": "80a7fefbbe0cedad",
    "company": "University of Ottawa Heart Institute",
    "positionName": "Postdoctoral Fellow in Health Psychology",
    "jobType": [
        "Full-time"
    ],
    "location": "40 Ruskin St, Ottawa, ON",
    "salary": "$60,000 a year",
    "postingDateParsed": "2024-01-27T12:12:18.042Z",
    "url": "https://www.indeed.ca/rc/clk?jk=80a7fefbbe0cedad&from=jasx&tk=1hl5db43ij458800&bb=KvwRMHBYecBH_BhsdnvHhoZ9DBcIUHHCXQUeg0ckdb6xYzbklZdjgmy9-YUDLt2-mijWTU7xZJjUcO7ZLmSnPtRbBark4vbG9lvGsuNYHVrIMMZ3LesBPA%3D%3D&xkcb=SoBV67M3FlSjXfRcgp0MbzkdCdPP&vjs=3",
    "externalApplyLink": "https://www.ottawaheart.ca/career-opportunity/postdoctoral-fellow-health-psychology",
    "companyDescription": "L'Université d'Ottawa, également connue sous le nom de uOttawa, est une institution bilingue dynamique et vibrante située au cœur de la ville de la capitale du Canada, Ottawa. Avec plus de 40 000 étudiants inscrits dans une grande variété de programmes, uOttawa est l'une des plus grandes et des plus diversifiées universités du pays.\r\n\r\nÀ uOttawa, nous sommes fiers de notre engagement envers l'excellence dans l'enseignement, la recherche et l'engagement communautaire. Nos membres du corps professoral sont des leaders dans leurs domaines, et nos étudiants bénéficient de petites tailles de classe, d'une attention personnalisée et d'opportunités d'apprentissage pratique.\r\n\r\nEn tant qu'employeur, uOttawa s'engage à fournir un environnement de travail favorable et inclusif qui valorise la diversité, l'équité et l'inclusion. Nous offrons des salaires et des avantages compétitifs, des opportunités de développement professionnel et de promotion de carrière, ainsi qu'une gamme de programmes et services de bien-être pour les employés.\r\n\r\nQue vous cherchiez à rejoindre notre corps professoral en tant que chercheur ou enseignant, ou à travailler dans l'un de nos rôles administratifs ou de soutien, uOttawa offre un environnement de travail dynamique et enrichissant où vous pouvez faire une réelle différence dans la vie de nos étudiants, de notre communauté et du monde entier.\r\n\r\n\r\n____________________________________________________________________\r\n\r\n\r\nThe University of Ottawa, also known as uOttawa, is a dynamic and vibrant bilingual institution located in the heart of Canada's capital city, Ottawa. With over 40,000 students enrolled in a wide variety of programs, uOttawa is one of the largest and most diverse universities in the country.\r\n\r\nAt uOttawa, we pride ourselves on our commitment to excellence in teaching, research, and community engagement. Our faculty members are leaders in their fields, and our students benefit from small class sizes, personalized attention, and hands-on learning opportunities.\r\n\r\nAs an employer, uOttawa is committed to providing a supportive and inclusive workplace environment that values diversity, equity, and inclusion. We offer competitive salaries and benefits, opportunities for professional development and career advancement, and a range of employee wellness programs and services.\r\n\r\nWhether you are looking to join our faculty as a researcher or teacher, or to work in one of our administrative or support roles, uOttawa offers a dynamic and rewarding work environment where you can make a real difference in the lives of our students, our community, and the world at large.\r\n",
    "description": "Term \n    Two-year contract, with the possibility of extension, contingent on interest and performance. \n    Start date \n    As soon as possible. Applications will be accepted and offers given on a first-come, first-served basis. The start date is flexible. \n    The University of Ottawa Heart Institute \n    UOHI is Canada’s largest and foremost cardiovascular health centre dedicated to understanding, treating and preventing heart disease. Investigators in the Division of Prevention and Rehabilitation have a unique array of initiatives and programmes with a particular emphasis on innovative approaches to prevention (primary and secondary) and treatment of cardiovascular disease. \n    Cardiovascular Health Psychology Laboratory \n    This fellowship offers the opportunity to gain and contribute knowledge to the areas of health psychology, social relationships, women’s health, behavioural medicine, cardiac rehabilitation, and clinical outcomes. \n    Current research projects include: \n    \n    \n     Social Relationships – research investigating the impact of relationships on the physical and mental health, including an evaluation of the Healing Hearts Together intervention on clinical outcomes;\n     \n    \n     Women’s health – the psychological profile, clinical outcomes, and intervention needs of female patients with cardiovascular disease (e.g., spontaneous coronary artery dissection);\n     \n    \n     Health services for patients with heart failure and women; and,\n     \n    \n     Various projects in behavioural medicine, mental health, and quality improvement of clinical services.\n     \n    \n   This postdoctoral fellowship is ideally suited to those who wish to pursue a career as a Scientist or Clinician-Scientist For Clinical Psychology applicants, supervision for licensure with the College of Psychologists of Ontario is available in the following competency areas: Clinical, Health and Rehabilitation. \n    It is expected that the successful candidate will assume responsibility for the preparation and publication of manuscripts as well as assist in the submission of research grant applications. The fellow will work closely with investigators, research coordinators, research assistants, and our multidisciplinary team of clinicians and researchers. Opportunities to collaborate with highly respected clinicians and scientists at the national and international level are also available. Supervision of research staff and students is also a possibility. The fellow may obtain additional support from our Research Services Department, medical librarian, and Cardiovascular Methods Centre. \n    The position is a two-year fellowship that may be renewed contingent on funding, interest and performance. The stipend is commensurate with experience and includes paid holidays and benefits. The fellowship includes contribution to statutory benefits (e.g. Employment Insurance and Canada Pension Plan) and enrollment in the Ottawa Heart Institute Research Corporation’s PDF Health and Dental benefit plan. \n    The successful candidate will possess: \n   \n    PhD in the social sciences (psychology, sociology, education), health sciences (health sciences, nursing, MD), or similar from a recognized, accredited program \n    Previous research experience within a team environment, demonstrating outstanding collegiality and professionalism \n    Excellent interpersonal and communication skills \n    A strong understanding of clinical research design, research methodology and data analysis \n    Previous experience analyzing quantitative datasets \n    Evidence of experience in preparation and publication of manuscripts; strong technical writing skills \n    Excellent computer skills (Microsoft Office, EndNote, SPSS) \n    Ability to take guided initiative and to work in an organized fashion within a fast-paced environment, including flexibility in shifting between independent and collaborative work \n    Previous experience in health psychology, mental health, or social relationships an asset \n   \n   To apply \n    Please send a cover letter and curriculum vitae to Dr. Heather Tulloch at hetulloch@ottawaheart.ca. \n    Applications from Indigenous persons, members of racialized minorities, persons with disabilities, women, members of the LGBTQ+ community, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse and inclusive communities are strongly encouraged. \n    According to government policy, all qualified candidates are invited to apply; however, preference will be given to Canadians and permanent residents. When submitting your application, please indicate if you are legally entitled to work in Canada. \n    The University of Ottawa Heart Institute is committed to ensuring barrier-free selection processes and work environments. Accommodations will be provided in all parts of the hiring process relating to any specialty requirements. Please notify us of any accommodations that you require – any information you provide will be handled respectfully and in complete confidence. \n    The successful candidate will be required, prior to the start of employment, to complete mandatory organizational training available online, and provide the following: an official piece of photo identification and a satisfactory Criminal Record Check and proof of two doses of COVID-19 vaccine."
}