{
    "id": "80df6e7f49810e6f",
    "company": "The Royal Ottawa Mental Health Centre",
    "positionName": "Executive Assistant I (RFT 1.0 FTE)",
    "jobType": [],
    "location": "1145 Carling Avenue, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-06T02:04:57.510Z",
    "url": "https://www.indeed.ca/rc/clk?jk=80df6e7f49810e6f&from=jasx&tk=1hc6geptqk7pr800&vjs=3",
    "externalApplyLink": "https://www.theroyal.ca/careers/external-postings?p=job/o8HIofwF&nl=1",
    "companyDescription": "",
    "description": "Position Information\n  \n \n  \n   \n    \n     Posting Number:\n     \n    \n     ROM23-380E\n     \n   \n    \n   \n    \n     Title:\n     \n    \n     Executive Assistant I (RFT 1.0 FTE)\n     \n   \n    \n   \n    \n     Position Status:\n     \n    \n     Regular Full-time\n     \n   \n    \n   \n    \n     FTE:\n     \n    \n     1.0\n     \n   \n    \n   \n    \n     Job Schedule:\n     \n    \n     Days\n     \n   \n    \n   \n    \n     Department:\n     \n    \n     Administration\n     \n   \n    \n   \n    \n     Union:\n     \n    \n     Non-union \n    \n   \n    \n   \n    \n     Site:\n     \n    \n     Royal Ottawa Mental Health Centre\n    \n   \n   \n   \n     \n   \n    \n  \n \n \n \n  About The Royal\n  \n As one of Canada’s foremost mental health care and academic health science centres, The Royal has a clear purpose: to get more people living with mental illness into recovery faster. This is at the core of everything we do and it is driven by the passion, focus and dedication of our employees. Every day, the work that we do transforms the lives of people with mental illness through specialized mental healthcare, advocacy, research and education. \n \n This position provides professional administrative support and office management to the Associate Chief, the Vice President Patient Care Services & Chief Nursing Executive, and the Vice President Patient Care Services & Community Mental Health; to ensure efficient and effective administration of the department/program.\n  Duties:\n  Accountability #1: Administrative support/Office management\n \n   Responsible for organization & scheduling of meetings, including collection of agenda items, follow up on action items, preparation and distribution of agenda packages, recording, production and distribution of minutes\n   Manages calendars and assists with time management\n   Drafts and types correspondence, receives/sends mail, including email\n   Responds to queries from the general public, hospital departments, external organizations \n  Screens and actions incoming mail, emails and telephone calls using own judgment and knowledge\n   Makes travel arrangements & completes expense reports as required\n   Ensures all deadlines are met, including project tracking, information gathering, report production, etc.\n   Schedules staff meetings\n   Provides office and automated systems orientation and training for new staff members\n   Prepares invoices/requisitions as required for ordering office supplies, materials, repairs, etc.\n   Prepares Personnel Action Forms of reporting staff and other documents, as required\n   Provides daily schedule including preparation of background information for the days’ meetings\n   Maintains bring forward system and organizes/maintains an effective filing system\n   Maintains OREO pages for department/program\n   Coordinates site visits\n   Arranges interviews and prepares information for potential and new physicians, composes offer letters and gathers appropriate information for credentialing\n   Ensures sessionals/stipends are paid accurately\n   Requests cheques for physicians not paid through Medco Services\n   Prepares & drafts PowerPoint presentations and other presentations as required\n   Schedules on-call services physicians\n   Liaises with senior management teams, directors and their administrative assistants\n   Liaises with pharmaceutical representatives to plan and schedule continuing mental health education sessions; plan, advertise, evaluate feedback, follow up for conferences\n \n  Accountability #2: Budgeting responsibilities\n \n   Assists with annual budget preparation\n   Assists with budget planning; monitors and tracks budget expenses – operating and salary\n   Audits payroll, sick leave, vacation and labour distribution reports and reports variances\n \n  Accountability #3: Data Management\n \n   Organizes/maintains major legal, financial and administrative documents\n   Assists in gathering, compilation and dissemination of data and statistics\n   Maintains the corporate files of the program/department\n   Maintains accurate leave records for staff\n   Ensures confidentiality of sensitive information – patient correspondence, public enquires, patient/family complaints\n   Processes bi-weekly pay cards and maintains appropriate supporting documentation\n   Maintains a copy of all policies and procedures and updates as new polices/procedures become available\n   Facilitates completion of annual performance appraisals of reporting staff\n   Processes and maintains billing for the Associate Chief and Physicians\n \n  Accountability #4: Other Duties\n \n   Assists with projects as needed\n   Works in a manner that is in compliance with staff and patient/client safety practices, policies and procedures of The Royal.\n   Ensures a work environment that is conducive to The Royal’s Harassment-Free Workplace and Occupational Health and Safety policies.\n   Undertakes special assignments/projects and other duties as assigned.\n \n  Qualifications:\n \n   Post-secondary level education, preferably a two (2) year community college diploma in Office Administration or equivalent experience\n   Minimum of five years recent, related secretarial/administrative experience supporting senior level management\n   Typing speed – minimum of 60 words per minute with high accuracy.\n   Demonstrated experience in windows-based applications including a high level of competency with Outlook, Microsoft Office Suite (Word, PowerPoint, and Excel). \n  Planning, prioritization and organization skills to ensure that tasks are completed; work well under pressure\n   Power B1 system knowledge would be an asset\n   Demonstrate interpersonal skills and proficiency in business vocabulary\n   Time management skills to plan, manage and coordinate activities\n   Attention to detail and decision-making skills to respond to high-pressure situations\n   Demonstrate ability to handle confidential/sensitive information\n   Prepare clear, concise and accurate documentation\n   Establish and maintain effective working relationships\n   Ability to work independently in the completion of assigned tasks\n   Ability to meet deadlines, established objectives with multiple interruptions\n   Excellent communication skills – verbal and written\n   Strong problem-solving and analytical skills and the ability to handle multiple responsibilities effectively\n   Ability to coordinate and manage small administrative projects\n   English level A- is mandatory in oral expression, comprehension, reading & writing. Bilingual (French/English) is considered an asset\n  \n \n  \n \n  Additional Information\n  \n \n  All applicants must provide a recent resume that clearly indicate that they meet the required qualifications. \n  The Royal sincerely thanks all applicants for their interest in a career with us; however, only those applicants selected for an interview will be contacted. \n  All new hires will be required to obtain a clear and valid Criminal Record or Vulnerable Sector Records Check as a pre-condition of employment. \n  The Royal is an equal opportunity employer. Upon request, accommodations due to a disability are available throughout the recruitment process."
}