{
    "id": "9497a71a8d606679",
    "company": "University of Ottawa Heart Institute",
    "positionName": "Chemistry Technologist I",
    "jobType": [],
    "location": "40 Ruskin St, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-09-23T06:48:34.228Z",
    "url": "https://www.indeed.ca/rc/clk?jk=9497a71a8d606679&from=jasx&tk=1hb2v4hd2is3q800&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=9497a71a8d606679&atk=&xpse=SoAJ67I3Ki2cc4RysR0LbzkdCdPP",
    "companyDescription": "",
    "description": "Start date \n    As soon as possible. \n    Purpose of position \n    Provide laboratory assistance in the daily operations of the Cardiac P.E.T. Radiochemistry laboratory by : \n    \n    Assisting with the daily production of radiopharmaceuticals using specialized radio-chemistry laboratory equipment. \n    Analysing all radiopharmaceuticals and maintain results (documentation) produced by the radio-chemistry laboratory. \n   \n   Responsibilities \n   \n    Daily production of radiopharmaceuticals. \n    Carry out the functions in the production of radiopharmaceuticals by preparing solutions, properly identifying, labeling, packaging for transportation. \n    Monitor production of radiopharmaceuticals, recognize problems and initiate established corrective protocols. \n    Run the cyclotron for producing radiopharmaceutical. \n    Work with the radio-chemists in developing technical protocols. \n    Quality control procedures, analysis, report all deficiencies, create and maintain current database per isotope and detector for the cyclotron. \n    Participate in research projects as directed. \n    Assist in the implementation of new techniques and protocols. \n   \n   Requirements \n   \n    BSc Chemistry or equivalent \n    2 years experience in a progressive chemical laboratory \n    Working experience with radioactive materials is considered an asset \n   \n   Preferred qualifications \n    Knowledge of: \n    \n    General laboratory equipment (HPLC, thin-layer chromatography, osmometer, gas chromatograph, radioactivity detectors) and their applications along with standard procedures. \n    Procedure instrumentation. \n    Legislated requirements related to practice and equipment operation relevant to job function. \n    Ability to troubleshoot to component level. \n   \n   To apply \n    To apply, please send your cover letter and CV to jobpostings@ottawaheart.ca. \n    Applications from Indigenous persons, members of racialized minorities, persons with disabilities, women, members of the LGBTQ+ community, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse and inclusive communities are strongly encouraged. \n    According to government policy, all qualified candidates are invited to apply; however, preference will be given to Canadians and permanent residents. When submitting your application, please indicate if you are legally entitled to work in Canada. \n    The University of Ottawa Heart Institute is committed to ensuring barrier-free selection processes and work environments. Accommodations will be provided in all parts of the hiring process relating to any specialty requirements. Please notify us of any accommodations that you require – any information you provide will be handled respectfully and in complete confidence. \n    The successful candidate will be required, prior to the start of employment, to complete mandatory organizational training available online, and provide the following: an official piece of photo identification and a satisfactory Criminal Record Check and proof of two doses of COVID-19 vaccine."
}