{
    "id": "94e8d1184a298868",
    "company": "LightHouse Counselling and Wellness",
    "positionName": "Psychotherapy Clinic Administrative Assistant",
    "jobType": [],
    "location": "260 Hearst Way, Kanata, ON",
    "salary": null,
    "postingDateParsed": "2024-01-17T05:13:47.401Z",
    "url": "https://www.indeed.ca/rc/clk?jk=94e8d1184a298868&from=jasx&tk=1hkikipjiii32800&bb=g3LG73kDIG2DKbipZ3VbGJ_4Wwin9SHxQtjPgcW0fzejgcT2jiSd_0DOevTV3EodKYJBiFN5zXBA-yU6xDSYFaVrSeS5Ae6zDtUoGsZJXZXNSGJBWCTaYg%3D%3D&xkcb=SoC567M3FShE7dQ2y50KbzkdCdPP&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "LightHouse Counselling and Wellness\nWe are seeking an outgoing, detail-oriented, efficient person to join our amazing Admin Team in providing front desk support to our Psychotherapy practice. The ideal candidate is skilled at prioritizing, multi-tasking, and has a warm, positive attitude. This Candidate is willing to learn and grow with us! This role reports to the Owner of the Company.\nPay: $20/hr\nShifts may include:\n8:00am-2:30pm Monday - Friday\n2:00pm-8:30pm Monday - Thursday\nAbout Us\nAt LightHouse, our mission is to help people through their darkest moments, shining a light to guide them on their journey to feeling their best and living their best life. At the heart of our practice is the belief that every single human being wants to do well and can do well with the right support.\nWe provide non-judgemental psychotherapeutic support to children, youth, adults, families, and couples who are experiencing emotional, behavioural, social, and/or relational challenges.\nBy creating an environment where everyone feels safe, connected, and understood, our clients embark on a journey to improving their mental health and wellness. As an administrator, you will be joining a team of supportive, empathetic, and caring mental health practitioners, all dedicated to helping people on their journey to improved mental health and wellness.\nOur MissionHelping people through their darkest moments.\nOur Core Values\nCompassion, Connection, Understanding, Growth\nTo succeed in this role …..\nYou will rock this role if you are warm, compassionate, possess excellent communication skills, and have the ability to lead and promote the mission of the clinic. You must be able to stay extremely organized, thinking 10 steps ahead, and the ability to see the big picture with an entrepreneurial mindset. You have a passion for helping others, as you will be communicating directly with our clients and will often be the client’s first experience with LightHouse.\nConveniently located:\nIn Kanata, at 260 Hearst Way. Next to the OC Transpo Kanata Park & Ride. Across from the Town Centre and a nice walk to the Kanata Centrum.\nSoon to be located conveniently next to Tanger Outlets in Kanata at the Panorama Wellness Centre.\nQualifications:\n\n 2-3 years of experience in Client Care and Customer Service (preferably in a medical office at the front desk)\n Psychology graduates are welcome!\n Skilled in Microsoft Office Suite, including Excel, teams, outlook, planner\n Experience using Janeapp is an asset.\n\nResponsibilities\n\n Supporting Psychotherapists with client bookings, payments, administrating intake & consent forms, etc.\n Client support: welcoming clients to the office, answering client calls and emails, processing payments at the end of sessions\n Maintaining Quality Assurance (follow up to payments, securing payment information, uploading secure documents, managing the booking software including schedules and treatments offered)\n Maintenance of office area, office supplies, and clinical files\n Communication and social media\n\nSkills & Attributes of our ideal candidate….\n\n Dynamic, self-motivated individual with the ability to work independently, proactively and well under pressure\n Strong communication skills, ability to communicate professionally, with compassion, and with patience when dealing with all clients\n Confidence to share ideas and constructive criticism to help us grow\n Juggling multiple projects and to-do’s simultaneously is no problem for you — you work well under pressure, meet deadlines and keep promises\n Tech savvy (we are paperless and everything is online)\n An appetite for innovation and simplicity, someone who is highly process oriented\n Working autonomously comes easy to you but you also love collaborating with a talented team\n Considerable experience using the Microsoft Office Suite, including Excel, Teams, Outlook, Planner\n Experience using Mac\n Knowledge of Jane practice management scheduling software is an asset\n\nApplication Process:\nIn addition to submitting a resume and cover letter:\n\n Please complete the Big 5 personality test (https://www.123test.com/personality-test/) and share your results during the hiring process.\n\nWe thank all applicants for their interest: Only those under consideration will be contacted.\nFor more info on our practice, check out our website: www.lighthousecw.ca\nJob Type: Part-time\nSalary: $20.00 per hour\nExpected hours: 25 – 30 per week\nBenefits:\n\n On-site parking\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n Evening shift\n Monday to Friday\n Morning shift\n Weekends as needed\n\nWork Location: In person\nExpected start date: 2024-03-01"
}