{
    "id": "9b7252c361bf9ff9",
    "company": "CIMA+",
    "positionName": "Geotechnical and Environmental Technician - Hybrid",
    "jobType": [
        "Permanent"
    ],
    "location": "Gatineau, QC",
    "salary": null,
    "postingDateParsed": "2024-01-24T12:18:36.080Z",
    "url": "https://www.indeed.ca/rc/clk?jk=9b7252c361bf9ff9&from=jasx&tk=1hl5dm5j5kc37800&bb=oevkGIDXh7gG1VwZljrf78LG9gJT6E5NAuSlSdfWemZc26qgIb-U329jsGDNWMWw0w2a7242LJc0nQTgsxQ-628RS2C_yUBykhypkguCdLN__iu1kpi67A%3D%3D&xkcb=SoCA67M3FlTXbXRRp50MbzkdCdPP&vjs=3",
    "externalApplyLink": "https://jobs.smartrecruiters.com/CIMA2/743999962510552-geotechnical-and-environmental-technician-hybrid",
    "companyDescription": "With more than 30 offices across the country and over 2,600 employees, 60% of which share ownership in the company, CIMA+ is one of Canada’s largest private consulting engineering firms and a “Best Employer” according to the Kincentric survey. \r\n\r\nFor more than 30 years, our multidisciplinary teams have been offering clients a complete range of solutions in the building, energy and resources, municipal infrastructure, telecommunications and transportation sectors. We also offer a multitude of complementary services, including environmental and project management services. Innovative and integrated solutions that place people at the centre of engineering, reflect our values and our corporate culture.",
    "description": "Company Description\n  Welcome to a place where people are at the heart of everything we do.\n  Welcome to people with an inspiring vision and who seek stimulating challenges. At CIMA+, you’ll find a place where you’ll have many opportunities to learn and develop while working on engaging projects.\n  We are a firm 100% owned by its employees and we value a collaborative and entrepreneurial mindset. You will have the flexibility to manage your work on your own terms and define what work-life balance means to you.\n  When you join CIMA+, we welcome you to a place that you can call home.\n  Job Description\n  Mission\n  We are looking for a technician to join our Earth and Environment Department. Under the supervision of the project managers’ team, the successful candidate’s primary task will be to perform field work such as geotechnical investigations, environmental characterization, earthworks construction, and possibly activities related to concrete. These activities will be part of various multidisciplinary projects for the design, rehabilitation or construction of buildings, roads, engineering, and hydraulic structures, as well as earthworks, soil or rock slope stability, soil dynamics, etc.\n  The successful candidate may work in a hybrid mode in Quebec and may also support projects in Ontario. He or she may also work in dedicated office spaces and facilities located in Gatineau for the Earth and Environmental Team.\n  Primary Responsibilities\n \n   Participate in engineering projects as part of geotechnical studies, environmental characterization, and concrete durability.\n   Plan and supervise investigation works.\n   Perform, analyze, and compile laboratory tests on soil and materials.\n   Act as the responsible supervisor for the construction of civil earthworks.\n   Geotechnical and Environmental aspects:\n   \n     Supervise field investigation work for geotechnical and environmental boring, exploratory trenches, and manual boring.\n     Collect soil and water samples for chemical analysis.\n     Perform in situ testing (SPT, Nilcon scissometer, etc.).\n     Install observation wells, vibrating wire piezometers, etc.\n     Perform laboratory tests on soils and materials (particle size analysis, Atterberg limits, Proctor tests, moisture content).\n     Write daily field work reports, including soil and rock description.\n   \n   Concrete characterization:\n   \n     Supervise concrete coring work.\n     Conduct non-destructive tests (corrosion potential, ground-penetrating radar, ultrasound)\n   \n   Ensure proper equipment functioning.\n   Coordinate and verify field and warehouse material inventory.\n \n  This position involves a combination of office and field work, as well as telework.\n  Qualifications\n  \n \n   Diploma of college studies (DCS) in mineral technology, civil engineering, or equivalent training.\n   One (1) or more years of internship or work experience in the field of civil engineering, geotechnics, soils and materials, or mining exploration.\n   ASP Construction card\n   Interest and motivation in geotechnics, rock mechanics, environment, soils, and materials.\n   The person may be required, on a non-routine basis, to lift a maximum of 25kg, work standing, at heights, at night, and outdoors in winter, or voluntarily in remote regions.\n   Valid Class 5 driver’s licence, and access to a vehicle for travelling across the province of Quebec and possibly in Ontario.\n   Autonomy, resourcefulness, organizational skills, and strong experience of field investigation work.\n   Excellent spoken and written French communication skills.\n   Knowledge of drawing software (Civil 3D, AutoCAD) is an asset.\n   Excellent practical knowledge of the MS Office environment.\n \n  Contact Hamid Farahani\n  #LI-Hybrid\n  Additional Information\n \n  Ethics and integrity are fundamental values at CIMA+, and we are looking for people who uphold these principles. We are committed to creating opportunities for all our talents to contribute to the firm’s success, develop and grow, regardless of cultural or other differences. We fully endorse employment equity principles and encourage women, visible minorities, indigenous peoples, and individuals with disabilities to apply for any position offered at CIMA+. Adaptation measures are provided upon request to facilitate participation in the recruitment process."
}