{
    "id": "a1c0f48b86b616ba",
    "company": "Recovery Care",
    "positionName": "Physician Assistant",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-17T05:13:44.326Z",
    "url": "https://www.indeed.ca/rc/clk?jk=a1c0f48b86b616ba&from=jasx&tk=1hkikipjiii32800&bb=g3LG73kDIG2DKbipZ3VbGKKdEZ40uU6_DEa2N1ndRc0Vb-6nxh90pXwJJgUbVDipE60FLvRodq6G3_cX2IDeziqjIeQCofzVprUAgWMfXiJCluTWqKok5Q%3D%3D&xkcb=SoAk67M3FShE7dQ2y50JbzkdCdPP&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "Position Overview:As an integral role in Recovery Care’s service delivery model, the Physician Assistant will join a large group of healthcare professionals and administrative staff which includes physicians, nurses, counsellors, medical office assistants and social service workers. The Physician Assistant provides a wide range of services under the supervision of licensed physicians including comprehensive triage, medical assessment, diagnosis, crisis support and treatment to patients with varied health, social, cultural, and economic barriers. The focus will be in the provision of primary care, mental health, infectious disease treatment, substance use management and harm reduction. The Physician Assistant will also have the opportunity to participate in new program development and evaluation.\nFor this position, we are also offering a dedicated CME budget, additional paid days off for CME, a yearly UpToDate subscription and a $5000 signing bonus!\nThe company is currently assessing vendors for a Retirement Savings Plan and plans to have this in place by the end of the year\nStart Date:ASAP\nApplication Deadline:Open until filled\nHours:Weekdays, 8 Hour Shifts, Days\n** those interested in part-time hours are also welcome to apply\nRoles & Responsibilities:\n\n Obtain comprehensive and focused health histories as appropriate.\n Conduct comprehensive, focused physical and mental health assessments and interpret findings. This includes assessment of vital signs and examination of all major body systems. Conduct and lead rapid assessments of critical events on-site (i.e., overdose, intoxication, psychosis, etc.).\n Order and interpret necessary diagnostic testing which may include, but are not limited to, hematology, microbiology, chemistry, serology, urinalysis and imaging. The PA will also be expected to interpret on-site ECG and Fibroscan (training provided).\n Perform the following diagnostic procedures on-site: ECG, dried blood spotting, HCV point-of-care testing, urine drug screening, collection of specimens and fluid for analysis, Fibroscan (training provided), incision and drainage, suture placement and removal, staple removal. The aforementioned list is non-exhaustive.\n Formulate and activate treatment and management plans based on assessment and/or investigations.\n Provide Primary Care and walk-in based services to Recovery Care and Safer Supply Ottawa patients.\n Work collaboratively with the interdisciplinary team to provide the best outcomes for the patients\n Provide low barrier, patient-centered care for patients.\n Work collaboratively with addiction physicians to provide cross coverage for patients in treatment for Opioid Substitution, Alcohol Use Disorder, and Safer Supply.\n Work collaboratively with community partners.\n\nQualifications and Skills:\n\n Certified or eligible to be certified through the Physician Assistant Certification Council of Canada (PACCC) or certification with the National Commission on Certification of Physician Assistants (NCCPA).\n Physician Assistant degree (BScPA, BHScPA, MPAS, etc) from a Canadian accredited program or from a program accredited by ARC-PA (US).\n Active membership in good standing with the Canadian Association of Physician Assistants.\n Current BLS or must obtain within 6 months of hire.\n Knowledge and awareness of principles and issues related to delivery of primary care.\n Excellent written and verbal communication skills.\n Excellent interpersonal skills.\n Ability to work effectively as an active member of an interprofessional team.\n Superior initiative and ability to prioritize, organize and work independently.\n Knowledge of quality improvement measures and willingness to actively participate in continuous quality improvement activities/initiatives.\n Knowledge of harm reduction strategies, trauma-informed care, addiction medicine, and the social determinants of health.\n Knowledge of Opioid Agonist Treatment, including current and emerging practices.\n Knowledge of emerging, promising, and best practices for persons who use drugs.\n Knowledge and awareness related to cultural competence.\n In-depth knowledge of health assessments and interventions in the context of primary care and addictions medicine.\n Knowledge of the acts and legislation that govern practice: Personal Health Information Protection Act, Protection for Persons in Care Act, Mental Health Act, Workplace Hazardous Material Information System (WHMIS), Principles of routine practices (universal precautions), Child Protection Act etc.\n Strong understanding of professional practice obligations.\n Excellent communication skills and ability to adapt communication styles to meet the needs of clients, health team members and community partners.\n Ability to work with people with concurrent disorders.\n Ability to work under stress with multiple demands.\n\nInterested? Apply today! Interested applicants must submit a resume as well as cover letter to this job posting.\nJob Types: Full-time, Permanent\nSalary: $96,000.00-$116,689.00 per year\nBenefits:\n\n Casual dress\n Dental care\n Extended health care\n On-site parking\n Paid time off\n RRSP match\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n 8 hour shift\n Monday to Friday\n\nSupplemental pay types:\n\n Signing bonus\n\nEducation:\n\n Bachelor's Degree (required)\n\nLicence/Certification:\n\n CCPA (Canada) or PA-C (US) (required)\n Membership with the CAPA (preferred)\n\nWork Location: In person"
}