{
    "id": "a24b54eda16c3948",
    "company": "University of Ottawa",
    "positionName": "Assistant, Associate or Full Professor in Physical Chemistry",
    "jobType": [],
    "location": "40 Ruskin St, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-08-25T06:50:55.294Z",
    "url": "https://www.indeed.ca/rc/clk?jk=a24b54eda16c3948&from=jasx&tk=1hb2v8b7g2ap3005&vjs=3",
    "externalApplyLink": "https://uottawa.wd3.myworkdayjobs.com/en-US/uOttawa_External_Career_Site/job/Ottawa-ON/Assistant--Associate-or-Full-Professor-in-Physical-Chemistry_JR4387",
    "companyDescription": "",
    "description": "Job Family:\n  Academic Leadership and Faculty\n \n   Union affiliation:\n \n  APUO\n \n \n   Faculty/Department:\n  Department of Chemistry and Biomolecular Sciences_FT\n \n \n   Campus:\n  STEM\n \n \n   Date Posted:\n  août 22, 2023\n \n \n   Closing Date:\n \n \n   Note: Applications will be accepted until 11:59 PM on the day prior to the Posting End Date above\n \n \n \n   Assistant, Associate or Full Professor in Physical Chemistry\n \n \n \n   The University of Ottawa invites applications for a professor in Physical Chemistry. Candidates are sought whose interests are at the interface of photonics and multidimensional spectroscopy, and who propose to develop (or are already actively engaged in) a research program in physical chemistry. The successful candidate will have access to the world-class Centre for Advanced Computing, and benefit from facilities part of the Centre for Catalysis Research and Innovation and world-class photonics research and facilities in the Advanced Research Complex. The Department of Chemistry and Biomolecular Sciences at the University of Ottawa is currently ranked #5 in Canada and is one of the top 125 departments worldwide (according to QS) and currently hosts two winners of the Herzberg Canada Gold Medal, five Canada Research Chairs, and five University Research Chairs.\n \n \n \n   Required qualifications and work experience: PhD or equivalent in Chemistry and postdoctoral experience is mandatory. Candidates should demonstrate an excellent research track record in physical chemistry with an emphasis on photonics and/or multidimensional spectroscopy. In addition, candidates must demonstrate an enthusiasm for teaching and graduate training, a strong track record and commitment to interdisciplinary collaboration, the ability to secure external research funding, and excellent communication skills in English and French are assets. An interest in teaching in French is essential. Tenure is conditional on active knowledge of Canada's other official language.\n \n \n \n   Title of the position: Assistant, Associate or Full Professor\n \n \n \n   Rank and salary: Regular tenure-track academic appointment in the Faculty of Science, with a salary consistent with the collective agreement of the Association of Professors of the University of Ottawa.\n \n \n \n   Application Package:\n \n \n   A cover letter;\n   A curriculum vitae (if applicable, explain any career interruptions that might have affected research productivity);\n   A research plan demonstrating a strong commitment to research excellence;\n   A statement of equity, diversity, and inclusion training and mentorship plan\n   A teaching philosophy statement; and\n   The names and contact information of three people who may be contacted by the University for letters of reference.\n \n \n \n   Deadline: August 31, 2023\n \n \n \n   The selection process will begin in early September and continue until the position is filled. Only candidates selected for an interview will be contacted.\n \n \n \n   The application package should be submitted electronically through the uOttawa Academic Careers website (\n  \n   Academic and Executive Careers\n  ) and address the cover letter to :\n \n \n \n   Prof. John Pezacki, Chair\n \n \n   Department of Chemistry and Biomolecular Sciences\n \n \n   University of Ottawa\n \n \n   10 Marie Curie (DRO108)\n \n \n   Ottawa, ON Canada K1N 6N5\n \n \n   Ph 1-613-562-3346\n \n \n   Fax 1-613-562-5193\n \n \n  \n    CHMChair@uottawa.ca\n  \n \n \n \n   Location of work: Department of Chemistry and Biomolecular Sciences, University of Ottawa, DRO Complex, 10 Marie Curie, Ottawa, ON K1N 6N5\n \n \n   The University of Ottawa is committed to ensuring equity, diversity and inclusion in the scholarly and leadership environments of our students, staff, and faculty. Accordingly, we strongly encourage applications from Indigenous Peoples in Canada, visible minorities members (racialized persons), persons with disabilities, women, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse and inclusive communities. Candidates who wish to be considered as a member of one or more designated groups are asked to complete the confidential Self-Identiﬁcation Questionnaire, to be completed at the time of application.\n \n \n   According to government policy, all qualified candidates are invited to apply; however, preference will be given to Canadians and permanent residents. When submitting your application, please indicate if you are legally entitled to work in Canada.\n \n \n \n   The University of Ottawa provides accommodations for applicants with disabilities throughout the recruitment process. If you are invited to proceed in the selection process, please notify us of any accommodations that you require by contacting the Office of the Vice-Provost, Faculty Relations by email at \n  \n   vra.affairesprofessorales@uottawa.ca\n  . Any information you send us will be handled respectfully and in complete confidence.\n \n \n \n   The University of Ottawa is justly proud of its 160-year tradition of bilingualism. Through its Official Languages and Bilingualism Institute, the University provides training to staff members and their spouses in their second official language. At the time of tenure, professors are expected to be able to function in a bilingual setting. In certain cases, professors must have the ability to teach in both official languages to be granted tenure.\n \n \n \n   The University of Ottawa is committed to ensuring equity, diversity, and inclusion in the scholarly and leadership environments of our students, staff, and faculty. Accordingly, we strongly encourage applications from Indigenous Peoples in Canada, visible minorities members (racialized persons), persons with disabilities, women, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse, and inclusive communities. Candidates who wish to be considered as a member of one or more designated groups are asked to complete the confidential Self-Identification Questionnaire, to be completed at the time of application.\n \n \n \n   All qualified candidates are invited to apply; however, preference will be given to Canadians and permanent residents. When submitting your application, please indicate if you are legally entitled to work in Canada\n \n \n \n   The University of Ottawa provides accommodations for applicants with disabilities throughout the recruitment process. If you are invited to proceed in the selection process, please notify us of any accommodations that you require by contacting the Office of the Vice-Provost, Faculty Relations by email at \n  \n   vra.affairesprofessorales@uottawa.ca\n  . Any information you send us will be handled respectfully and in complete confidence.\n \n \n \n   The University of Ottawa is proud of its 160-year tradition of bilingualism. Through its Official Languages and Bilingualism Institute, the University provides training to staff members and to their spouses in their second official language.\n \n \n \n   Prior to May 1, 2022, the University required all students, faculty, staff, and visitors (including contractors) to be fully vaccinated against Covid-19 as defined in Policy 129 – Covid-19 Vaccination. This policy was suspended effective May 1, 2022 but may be reinstated at any point in the future depending on public health guidelines and the recommendations of experts."
}