{
    "id": "a37b822fe05042c7",
    "company": "CIMA+",
    "positionName": "Team Leader - Biologist - Hybrid",
    "jobType": [],
    "location": "201-420 Boul Maloney E, Gatineau, QC",
    "salary": null,
    "postingDateParsed": "2023-11-03T20:17:19.367Z",
    "url": "https://www.indeed.ca/rc/clk?jk=a37b822fe05042c7&from=jasx&tk=1hgol75cilemg800&vjs=3",
    "externalApplyLink": "https://recruiting.ultipro.ca/CIM5000CIMAP/JobBoard/44fd8303-fcd5-48d6-931a-1798dcf0d2bb/OpportunityDetail?opportunityId=32b8d127-25a3-4d38-93fa-9291c1aea277&postingId=5c881982-510b-4040-9a0f-c9146e877ead",
    "companyDescription": "",
    "description": "Welcome to a place where people are at the heart of everything we do. \n  Welcome to people with an inspiring vision and who seek stimulating challenges. At CIMA+, you’ll find a place where you’ll have many opportunities to learn and develop while working on engaging projects. \n  We are a firm 100% owned by its employees and we value a collaborative and entrepreneurial mindset. You will have the flexibility to manage your work on your own terms and define what work-life balance means to you. \n  When you join CIMA+, we welcome you to a place that you can call home. \n  Mission \n Reporting to the Regional Director – Environment, the Team Leader’s mandate is to develop and ensure the profitability of services related to the characterization of natural environments through the sound management of human and material resources. You will collaborate with the existing team on a daily basis with a view to supporting its growth. \n  Primary Responsibilities \n  \n  Manage financial and material resources for the team \n  Manage human resources for the team: Take part in the hiring and training of personnel, work distribution, performance assessment, approval of time sheets, etc. \n  Maintain harmonious relationships with existing clients and take part in business development for the activity sector \n  Provide coordination and supervision services, and ensure that Company policies, standards and procedures are respected, especially in the areas of Health and Safety, Ethics and Quality Assurance \n  Oversee the execution and management of projects within the related area of expertise \n  Prepare and supervise professional services proposals \n  Take part in preparing project specifications, prepare expert reports and draft / revise technical reports \n  Collaborate with members of the CIMA+ Environment team across Canada and with other areas of expertise \n  \n  Profile \n  \n  Bachelor of Science or degree in a relevant field \n  10 years of relevant experience in ecological studies and environmental authorizations \n  Leadership skills and ability to mobilize a team \n  Thorough and meticulous, with an analytical spirit and ability to work as part of a team \n  Experience in team management, quality control and budget monitoring \n  Strong command of the French language, spoken and written \n  \n Ethics and integrity are fundamental values at CIMA+, and we are looking for people who uphold these principles. We are committed to creating opportunities for all our talents to contribute to the firm’s success, develop and grow, regardless of cultural or other differences. We fully endorse employment equity principles and encourage women, members of visible minorities, Indigenous people, and persons with disabilities to apply for any position offered at CIMA+. Adaptation measures are provided upon request to facilitate participation in the recruitment process. \n  Contact Alexandra Doroshenko \n  #LI-Hybrid"
}