{
    "id": "a991983f0f987b92",
    "company": "Salas O'Brien",
    "positionName": "Mechanical Engineer in Training (Ottawa)",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-17T05:14:04.024Z",
    "url": "https://www.indeed.ca/rc/clk?jk=a991983f0f987b92&from=jasx&tk=1hkikh137kp3h801&bb=MbdkWoTc0uPjBzci8Lm-JW-zqxHDiT5GFr63LvdwAoTc1wtZOqGRTZRvybugpDgGtvEaHwDjgvO2X9OjuD1QeDLXJVwgf62MrBED9fBw18VA-1B-SpFbMA%3D%3D&xkcb=SoBQ67M3FShL_WzU3h0AbzkdCdPP&vjs=3",
    "externalApplyLink": "https://salasobrien.com/careers/careers-listing/?gnk=job&gni=8a78839e8cf533a1018d146fd53c2afb&gns=Indeed+Free",
    "companyDescription": "",
    "description": "Mechanical Engineer in Training\n  \n \n \n  At Salas O’Brien we tell our clients that we’re engineered for impact. This passion for making a difference applies just as much to our team as it does to our projects. That’s why we’re committed to living our values every day: inspiring, achieving, and connecting as shared owners of our success with a focus on a sustainable future.\n  \n \n \n  Building for the long-term means that all of our team members can expect to work on amazing projects with a people-first approach to problem solving. It also means that each member of our team has truly limitless potential to build a unique, meaningful, and high-impact career—and they’ll receive great total rewards along the way.\n  \n \n \n  About Us:\n  \n \n  Founded in 1975, Salas O’Brien is an employee-owned engineering and professional services firm focused on achieving impact for our clients, our team, and the world. We know that tomorrow’s requirements are today’s opportunities, and we are here to design lasting solutions for pressing challenges.\n  \n \n \n  We work across a variety of industries providing integrated engineering and consulting services. Our specialized experience includes design for data centers, healthcare, science and technology, high-rise buildings, clean energy, education, and other building types as well as structural and building sciences, infrastructure asset management, advanced robotics, and more.\n  \n \n  Our technical expertise is paired with an exceptional team of business development, human resources, finance and accounting, information technology, and marketing professionals, all of whom play a key role in bringing our commitments to life every day.\n  \n \n \n  Job Summary:\n  \n \n  We are searching for a Mechanical Engineer in Training to assist in the design and preparation of mechanical building systems drawings.\n  \n \n \n  In this role you will: you will have responsibility for assisting project teams with the design of mechanical systems for various building facilities including heating, ventilation, air conditioning, piping, plumbing, drainage, fire protection and other specialty systems. You will have responsibility for performing design calculations, selecting equipment, preparing mechanical drawings utilizing Revit, and designing layouts.\n  \n \n \n  You will be a great fit if: you have an interest in pursuing a career in Building Design as a Mechanical Engineer in Training.\n  \n \n \n  Skills/abilities:\n  \n \n  University Degree in Mechanical Engineering with a focus on the following courses, HVAC, Fluid Dynamics, and Thermodynamics. \n  Practical experience designing mechanical systems for commercial, institutional or industrial buildings. \n  Certification or eligibility to register with PEO as an Engineer in Training (E.I.T.) is preferred. \n  Demonstrated experience using AutoDesk Revit. \n  Working knowledge of MS Office Suite (Outlook/Word/Excel/PowerPoint). \n  Strong written, verbal communication and presentation skills teamed with your ability to problem solve and make timely and well thought out decisions. \n  Ability to work cohesively in a team-based environment. \n  Ability to handle multiple concurrent projects, focused project schedules and meet timelines. \n  Valid Ontario's Driver's Licence and access to a vehicle. \n \n \n  Location: Toronto or Ottawa, ON – In-office position\n  \n \n  Travel: Little to no travel required.\n  \n \n \n  Equal Opportunity Employment Statement\n  \n \n  Salas O’Brien provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, colour, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state/provincial, or local laws. Salas O’Brien will accommodate the disability-related needs of applicants as required by law."
}