{
    "id": "aaa4530860a931e5",
    "company": "The Princeton Review",
    "positionName": "MCAT Biology Instructor",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-01T20:10:01.095Z",
    "url": "https://www.indeed.ca/rc/clk?jk=aaa4530860a931e5&from=jasx&tk=1he3lmb38joqj800&vjs=3",
    "externalApplyLink": "https://jobs.lever.co/review/ee37a2b5-98a6-4018-a9f2-3002ff0bd2b3?lever-source=Indeed&sid=20",
    "companyDescription": "",
    "description": "Are you looking to make an impact? Do you have a strong background in science? We are looking for passionate, energetic, detail-orientated individuals to help students in their journeys to become doctors. You don’t need experience with the MCAT; at The Princeton Review we look for subject matter experts to specialize in the various science sections of the test. You might be a strong presenter and discussion leader, or you could even have formal experience teaching and tutoring. Either way, our superior training and comprehensive curriculum will give you the skills you need to lead and support students through their test prep.\n  \n As a Biology instructor, you will be expected to:\n \n   Instruct students in a dynamic and supportive manner, adapting to students’ needs and keeping them engaged with the material\n   Motivate your students through a results oriented, time-tested Princeton Review curriculum in order to build stronger, more confident learners\n   Model professionalism and accountability at all times by showing up to class on time, replying to students in a timely manner, and holding students accountable for assignments\n   Create an open, safe, and positive learning environment\n \n  Requirements\n \n   Bachelor’s degree or pursuing one\n   Confident and engaging discussion leader\n   Excellent oral and communication skills\n   Availability on nights and/or weekends\n   Interest in teaching both online and in-person\n   Expected to work in-person programs when requested\n   Applicants must pass a qualifying exam\n   Access to a reliable internet connection and computer in a reliably quiet location\n \n  Why you want to teach for The Princeton Review:\n \n   Paid comprehensive training and lesson preparation\n   Competitive hourly teaching rates\n   Flexible hours, work when you’re available to work\n   Work opportunities for both online and in-person instruction\n   No curriculum development or grading\n   Performance and merit-based raises and bonuses\n \n \n \n   Compensation:\n \n \n   Pay: $30-$50 per hour, based on credentials and geographic location\n \n \n   The company does not provide benefits for this position.\n \n \n \n   About The Princeton Review:\n \n \n   The Princeton Review is a leading tutoring, test prep, and college admission services company. Every year, it helps millions of students bound for college and graduate school to achieve their education and career goals through online and in-person courses delivered by a network of more than 4,000 teachers and tutors, online resources, and its more than 150 print and digital books published by Penguin Random House. The company’s Tutor.com brand is one of the largest online tutoring services in the U.S. It comprises a community of thousands of tutors who have delivered more than 19 million one-to-one tutoring sessions. The Princeton Review is headquartered in New York, NY. Follow the company on LinkedIn, YouTube and Instagram.\n \n \n \n   The Princeton Review is an equal employment opportunity employer. The Princeton Review’s policy is not to discriminate against any applicant or employee based on race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, marital status, disability, military status, genetic information, or any other basis protected by applicable law. The Princeton Review also prohibits harassment of applicants or employees based on any of these protected categories. It is also The Princeton Review’s policy to comply with all applicable laws respecting consideration of unemployment status in making hiring decisions.\n \n \n \n   The Princeton Review is a drug-free workplace."
}