{
    "id": "aca01d3fa0e3e9af",
    "company": "EDC",
    "positionName": "Vice President, Risk Quantification and Enterprise Risk",
    "jobType": [
        "Permanent",
        "Full-time"
    ],
    "location": "Ottawa, ON",
    "salary": "$205,734–$272,697 a year",
    "postingDateParsed": "2024-01-24T12:17:36.487Z",
    "url": "https://www.indeed.ca/rc/clk?jk=aca01d3fa0e3e9af&from=jasx&tk=1hl5dju1ci4nl800&bb=gCzgXPzOG1uTP-CnMJvHBeKuHbW-idMBUD73tpkVOKqzmYJ13q7eFBkCSh0uBxZfOpe7-GDgFJPpop9KDmCefPgOT7MSKUSmKBbptYd7aB3ISANLuqgz7g%3D%3D&xkcb=SoCI67M3FlTAH9xNAp0ObzkdCdPP&vjs=3",
    "externalApplyLink": "https://edc.taleo.net/careersection/corporate_2020/jobdetail.ftl?job=91231&src=JB-10300",
    "companyDescription": null,
    "description": "Posting Date: Jan 23, 2024, 3:27:57 PM\n \n \n   Primary Location: Ontario-Ottawa\n \n \n   Job Type: Permanent\n \n \n   Schedule: Full-time\n \n \n \n   Export Development Canada (EDC) is a financial Crown corporation dedicated to helping Canadian businesses make an impact at home and abroad. EDC offers financial products and knowledge to help Canadian businesses confidently enter new markets, reduce financial risk, and grow their business. \n  When you join our team, you’ll be helping Canadian businesses learn the endless possibilities that open to them through export and help bring their vision, passion, and innovation to the world. Your knowledge and expertise will support more than 25,000 Canadian businesses and their customers in as many as 200 markets worldwide. You’ll work amongst the best and brightest in an inclusive, collaborative environment that fosters professional development and success. And you’ll know that you’re making an impact every day – for businesses, for Canada and for the people you work with. \n   Are you ready to make an impact? Join EDC, recognized as a Top 100 and Top Family-Friendly Employer, as we take on the risk so Canadian businesses can take on the world. #LI-Hybrid \n   Team & Job Overview \n   This new role of Vice President, Risk Quantification and Enterprise Risk is a prominent position with significant responsibility and a high degree of exposure to senior leaders across the organization up to the Board of Directors. Reporting to the Senior Vice President & Chief Risk and Sustainability Officer, the Vice President will lead the capital management, stress testing, climate scenario analysis, credit market liquidity and insurance risk model development, and enterprise risk management functions within the Global Risk & Sustainability Group. Responsibility will include evolving the risk maturity of these functions and being a delegate for the Chief Risk and Sustainability Officer. \n  The Vice President is responsible for setting the vision and strategic plan for the team, and delivering on the strategy, using exceptional leadership skills, a network of internal and external stakeholders, as well as strong technical and business experience. This role requires excellent communication and interpersonal skills to engage and consult with business areas and define risk practices and solutions adapted to EDC’s size, complexity and specific mandate. \n  Success will be linked to the ability to lead effectively, think critically, solve problems, and balance the management of risks with creating business opportunities in line with EDC’s strategy. \n   Most of the team members are located in Ottawa and therefore relocation to Ottawa is preferred but not essential. Being present with the team and peers in Ottawa periodically is essential. \n  Key Responsibilities \n   Strategy | Capital Management | Risk Models & Limits | Stress Testing | Climate Scenarios | Enterprise Risk Management | Governance \n   Strategy \n   \n   Participate in corporate business and strategy formulation, assess the underlying risks of the corporate strategy and conduct risk-based effective challenge of strategic objectives. \n   Develop and maintain the Risk Appetite framework including the development of Risk Appetite metrics, measurement, monitoring and reporting. \n   Stay abreast of emerging risks and trends within geographies and industries of business interest and ensure EDC’s strategy is well adapted. \n   \n  Capital Management \n   \n   Responsible for the management and operations of EDC’s economic capital framework (Internal Capital Adequacy Assessment Process) and dividend policy, and ownership of related policies, guidelines and standards. \n   Lead the internal capital target setting process and internal capital adequacy assessment process (ICAAP) as well as the development and management of capital management and dividend policies, standards/guidelines and standards. \n   Develop and oversee risk-based performance management and pricing methodologies. \n   Work closely with the lines of business to develop capital-based tools or allocations to enhance business decision making at the transaction and portfolio level. \n   \n  Models and Limits - Credit, Market, Liquidity & Insurance Risks \n   \n   Owner for credit, market, liquidity and insurance risk models. \n   Oversee market and liquidity risks, including monitoring and reporting on EDC’s exposures, and active participation at the Asset and Liability Committee (ALCO). \n   Lead the development, management and oversight of risk models for all products including: \n    \n     Economic capital models \n     Credit risk models including IFRS9 compliant models \n     Insurance risk models, including IFRS17 compliant models \n    \n   Advance the thinking on the quantification of operational and strategic risks, and other non-financial risks as required. \n   Work with Model Governance to ensure that a strong governance framework is in place to manage the end-to-end lifecycle for all risk models. \n   Ensure the integrity of EDC’s credit risk limits framework including quantifying risk exposure relative to limits, and updating the limits framework as required and in line with EDC’s strategy. \n   \n  Stress Testing, Climate Scenario Analysis \n  \n   Lead the annual enterprise-wide stress testing for financial and non-financial risks. \n   Lead the annual climate scenarios exercise in line with Task Force on Climate Disclosures (TCFD) and other regulatory guidance. \n   Lead the discussion on insights from the stress testing and climate scenario work to ensure that actions are pursued by the relevant accountable party (typically CRSO, CFO or COO). \n   Oversee a centralized portfolio analytics function to provide a view of portfolio risk under various scenarios to support business strategy. \n   \n  Enterprise Risk Management \n   \n   Oversee and mature the enterprise risk management function. \n   Develop and monitor enterprise risk framework, policies, standards and guidelines, reporting on and monitoring EDC’s strategic and operational risks. \n   Provide specialized advice and support actions to independently oversee, challenge and remediate risk findings from quality assurance activities. \n   Responsible for enterprise-wide risk reporting and monitoring function; \n   Actively monitor EDC’s risk profile across all risk types and business lines. \n   Continue maturing the emerging risks program. \n   \n  Governance \n   \n   Responsible for developing and monitoring risk policies, standards and guidelines related to EDC’s strategic, operational and financial risks within the risk governance framework. \n   Oversee the Risk Appetite framework, including metrics definition, measurement, monitoring and reporting and ongoing evolution to stay current with emerging risks. \n   Further develop second line functionality (oversight), ensuring clear roles and responsibilities between first and second lines, appropriate tools and reporting. \n   Support the CRSO in managing key risk committees, including the Management Risk Management Committee and the Board Risk Management Committee. \n   \n  Qualifications \n   Experience \n   \n   A minimum of 15 years of related work experience in the financial services industry including at least 10 years of leading quantitative and analytical teams \n   A deep expertise in either/all of financial, operational, and strategic risk practices from a financial services perspective and with an emphasis on quantitative analytics. \n   Proficient knowledge in the areas of controls, data, quantitative analysis and technology skills. \n   Proficient knowledge of current regulatory requirements in the financial services industry. \n   Advanced knowledge of policies, procedures, practices used in the financial services industry to ensure a well governed risk management function. \n   Experience in Enterprise Risk Management (including various models and organizational structures). \n   An understanding of ESG fundamentals and the connection with risk management. \n   Experience in interpreting trends in the financial services and regulatory environments to make practical changes to the risk function in support of the enterprise strategy. \n   \n  Leadership \n  \n   Excellent leadership skills demonstrated through providing sound guidance and coaching to other leaders, positively influencing organizational culture, and high integrity. \n   Exceptional relationship building skills, and the ability to hold others accountable without direct authority. \n   Strong oral and written communication skills and the ability to communicate complex subject matter clearly at all levels of the organization up to the Board. \n   Ability to present ideas in a clear, succinct and organized manner. \n   Ability to proactively identify creative solutions for taking on and managing risk that support the enterprise strategy and enable the business to develop differentiated value propositions \n   Technically strong with numeracy and financial awareness, yet able to see the bigger picture and not get stuck in the details. \n   A growth mindset, and the ability to build, sustain and improve enterprise risk practices. \n   \n  Education \n   \n   Undergraduate degree in actuarial science, finance, math, accounting, business or related field. \n   \n  Bilingual in both official languages. \n   Assets \n   \n   Transactional experience including assessing credit and non-credit risks. \n   Masters degree in actuarial science, finance, math, accounting, business or related field. \n   Relevant credentials: CFA, PRM, FRM, ASA/FSA, MBA. \n   \n  Salary Range: \n   \n   Salaries are based on qualifications and experience and typically range from $205,734 to $272,697 plus a STI and LTI performance-based incentive. \n   \n  \n   Location\n    \n    \n    Export Development Canada is a hybrid work environment. \n    This role may be performed from EDC’s headquarters in Ottawa or Toronto or Montreal. \n    Relocation assistance is available for eligible candidates. \n    \n   EDC's Commitment to Employment Equity \n   EDC is committed to employment equity and achieving a diverse workforce. EDC actively encourages applications from women, Aboriginal peoples, visible minorities, persons with disabilities and members of the 2SLGBTQI+ community. If selected for an interview, please advise us if you need any special accommodation. \n  \n \n \n   How to apply \n   \n   \n  Only candidates selected for an interview will be contacted.\n   \n  \n   Application deadline on www.edc.ca/careers : Feb 9, 2024, 10:59:00 PM\n   \n   If selected for an interview, please advise us if you require special accommodation.\n   \n  \n   Candidates must meet the requisite government security screening requirements."
}