{
    "id": "b2bf24b6bfaa9b79",
    "company": "SurveyMonkey",
    "positionName": "Associate Localization Program Manager",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-20T05:09:34.583Z",
    "url": "https://www.indeed.ca/rc/clk?jk=b2bf24b6bfaa9b79&from=jasx&tk=1hkikauqrkp0g800&bb=0cjRAupgChq89StZWKF-xJ1FV178kvVIpWOyhQb88A7aL5ooB2U-B81ojNl6g2SK9FxO3PVJxHQptE97XG2vfCpfIYNG8kYw33e-3HTsPNcU2QaPhvAuZA%3D%3D&xkcb=SoAw67M3FSgkBuyCcx0GbzkdCdPP&vjs=3",
    "externalApplyLink": "https://boards.greenhouse.io/surveymonkey/jobs/5616760?gh_src=6015b80c1us",
    "companyDescription": "",
    "description": "SurveyMonkey is a global leader in online surveys and forms that empowers people with the insights they need to make decisions with speed and confidence. Our fast, intuitive feedback management platform connects millions of users worldwide with real-time AI-powered insights that drive meaningful decisions. We provide answers to more than 20 million questions every day so that people and organizations can attract new audiences, delight customers, create advocates, and extend their competitive advantage in the marketplace. Our vision is to raise the bar for human experiences by amplifying individual voices. Learn more at surveymonkey.com.\n \n  More about our Global Experience & Localization team \n  We are a small but mighty in-house localization team distributed between the US and Ireland. Our team manages all content types across the business, including product, marketing, sales, help, and legal materials. We believe in close, transparent collaboration with our vendor partners and building scalable and efficient localization solutions. We operate in a highly collaborative and supportive environment and are passionate about creating an excellent user experience for our global customers. \n  What we are looking for \n  You have a blend of program management and localization expertise and are excited about working in a cross-functional environment together with product, engineering, web, marketing, and sales teams. This is an exciting opportunity to take on a critical role in the localization team to advance and scale our localization maturity and advocate for best practices. You are passionate about customer experience, and you seek ownership and accountability. You will report to the Head of Global Experience & Localization and will work closely with other localization program managers, language managers and vendors to support our mission to empower our global customers with high-quality products and content in their own language. \n  What you'll be working on \n  \n  Represent the localization team in meetings with stakeholders, provide guidance on cultural considerations, and advocate for localization and internationalization best practices. \n  Partner with other teams across the organization to support product or marketing global launches and campaigns. \n  Manage a variety of localization tasks from concept level to go-live, with a focus on marketing initiatives and web content, always ensuring a great global customer experience, excellent language quality and speedy time to market. \n  Define, manage, and continuously improve marketing localization processes in collaboration with the Marketing Localization Manager and cross-functional team members as well as external vendors. \n  Audit content to ensure it is localization-ready and suitable for the target audience. \n  Help create, localize, and publish global web pages. \n  Coordinate localization and linguistic QA for various content types. Manage vendor and stakeholder queries. \n  Coordinate content creation and SEO optimization of web content in collaboration with our SEO team. \n  Work with Jira, Smartling, WordPress and other systems. \n  \n We'd love to hear from people with \n  \n  3+ years experience in localization project or program management, ideally in a stakeholder or client-facing role. \n  Third-level qualification in translation/localization or equivalent relevant experience. \n  Excellent understanding on how to build highly efficient marketing localization processes and solutions. \n  Ability to collaborate with and get buy-in from marketing, engineering and other stakeholder teams to drive business outcomes. \n  Cultural sensitivity, and love to engage with others across cultural, functional and geographic lines. \n  Excellent communication and organization skills. The ability to explain complex concepts simply and provide high-level summaries and drill-downs to the details, when necessary. \n  Experience using project management tools (e.g. Jira) and content management systems (e.g. WordPress). \n  Multilingual SEO experience an advantage. \n  \n #LI-remote\n \n   Why SurveyMonkey? We're glad you asked \n   SurveyMonkey is a place where the curious come to grow. We're building an inclusive workplace where people of every background can excel no matter their time zone. At SurveyMonkey, we weave employee feedback into everything we do to create forward-looking benefits policies, employee programs, and an award-winning culture, including best workplace for parents, our annual holiday refresh, our annual week of service, and our C.H.O.I.C.E Fund. In addition, we've reimagined the way we work to allow employees to choose what works best for them - working in-person, fully remote, or a hybrid model that combines the two through our Choice Model. \n   Our commitment to an inclusive workplace \n   SurveyMonkey is an equal opportunity employer committed to providing a workplace free from harassment and discrimination. We celebrate the unique differences of our employees because that is what drives curiosity, innovation, and the success of our business. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, gender identity or expression, age, marital status, veteran status, disability status, pregnancy, parental status, genetic information, political affiliation, or any other status protected by the laws or regulations in the locations where we operate. Accommodations are available for applicants with disabilities."
}