{
    "id": "b5898f15808d660d",
    "company": "GardaWorld",
    "positionName": "Quality Oversight Manager",
    "jobType": null,
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-26T12:14:00.317Z",
    "url": "https://www.indeed.ca/rc/clk?jk=b5898f15808d660d&from=jasx&tk=1hl5dcuan2fci002&bb=meFSaZ2jpWfCb2DCBnnuQCFvyBe9Hux9UKW7KWpXZlzqVJjm4MxVsLSSBX4rBYAe-SR5__lBnC1XU11-LOWfq-MDe0Yv7LoazLcLSt4yog1ud3xBsH4ZeQ%3D%3D&xkcb=SoAR67M3FlS8FtXIwZ0IbzkdCdPP&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=b5898f15808d660d&bb=8kUEDTgXKruMnogXuRXxIfn1Ody4mKDNTznNIM214KGzG8g2agmCokEMmFkCFiOg&xkcb=SoBw67M3FlS1iATOkx0LbzkdCdPP&xpse=SoC367I3FlS1WQ2YG50LbzkdCdPP",
    "companyDescription": "GardaWorld is one of the largest privately owned integrated security, cash solutions and risk management companies in the world.​\r\n\r\nOur expertise includes physical and virtual security operations, ​\r\nintegrated cash management solutions, security risk management including consulting & crisis response and premiere executive protection, all on a global scale. Our operations take us from our Montreal head office to the oil fields in Iraq, embassies in Africa, leading financial institutions in the United States, and major airports in Canada. ​\r\n\r\nOur proven experience and actionable intelligence give us on-the-ground traction across a variety of sectors, including financial services, infrastructure, natural resources, retail and many more. We are a partner ​\r\nof choice for private companies, governments, humanitarian organizations ​\r\nand multinationals all over the world.",
    "description": "Reporting to the Regional Quality Assurance Manager, the Quality Oversight Manager (QOM) is responsible for overseeing compliance to Standard Operating Procedures (SOP) and ensuring the operation is meeting client expectations at all levels. Thorough and observant with a keen eye for detail, Quality Oversight Manager works closely with the frontline and administrative teams to ensure all continuous improvement objectives are met through a combination of oversight and internal audits. They must fully understand the SOP have a sense of responsibility towards the client as well as the operation. \n TASKS AND DUTIES \n \n  Perform audits and engage in active oversight to SOP compliance and checkpoint performance\n   Oversee and document compliance with CATSA's SOPs and GardaWorld BMS across the region\n   Provide feedback to Screening Officers and inform Screening Point Managers of findings in a timely manner\n   Intervene immediately if parts of the screening process were not completed or if critical aspects of the screening process were performed incorrectly\n   Conduct and/or assist audits (CATSA, CGSB, ISO and/or Internal Audits)\n   Conduct site inspections, breach investigations and infiltration test investigations\n   Observe work procedures independently of the Screening Point Managers and follows through on any SOP not met or understood\n   Oversee uniform wear consistent with CATSA's SOPs and inspects each employee during roll call and throughout each shift\n   Assist various departments with continuous improvement initiatives\n   Identify opportunities for improvement and provide follow-up, positive and constructive feedback\n   Assist with the development, issuance and tracking of Corrective Action Plans based on performance evaluations or incidents\n   Collect data to measure SOP compliance and Screening Officer performance\n   Highlight issues, inconsistencies, and trends in scorecard data to assist departments with continuous improvement and root-cause analysis and internal Performance Improvement Plans\n   Other duties as required\n \n  REQUIRED SKILLS \n \n  University or College degree in Business Management or Auditing and Assurance preferred\n   Previous experience in aviation industry preferred\n   Proficiency in Microsoft Office (Microsoft Word, Microsoft Excel, and Microsoft Outlook, in particular)\n   Excellent written, verbal and communication skills\n   Able to meet deadlines while working in a fast-paced environment\n   Ability to work independently and be a self-starter\n   Strong data analysis and analytical skills\n   Strong organizational and planning skills in a fast-paced environment\n   Excellent time management skills and ability to multi-task and prioritize work\n   Familiarity with internal systems, such as GSKED and CATSA's LMS system is an asset\n   Previous experience in auditing in an asset\n   Previous experience working in a unionized environment is an asset\n   Bilingual in English and French is an asset\n   Have a clean criminal record & eligible to obtain a RAIC (security clearance)"
}