{
    "id": "b70ba5403c510e15",
    "company": "1595769 Ontario Ltd. O/A eDecree",
    "positionName": "English Transcriptionist (Ottawa Only)",
    "jobType": [],
    "location": "116 Albert St Ste 200, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-16T18:53:01.620Z",
    "url": "https://www.indeed.ca/rc/clk?jk=b70ba5403c510e15&from=jasx&tk=1hcvfn7eljiim800&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "Please apply directly through this link: https://www.surveymonkey.com/r/englishtranscriptiontest\nWe are currently looking to hire several long term part-time and full-time legal transcription typists. This position is in office with both part-time and full-time opportunities. This job involves both standard transcription work as well as performing quality assurance audio reviews of completed transcripts. These are employee roles, not contractors.\nResponsibilities\n\n Typing verbatim transcripts of pre-recorded audio and video legal proceedings.\n Learning and following client house rules (i.e. client-specific preferences in formatting, spelling, capitalization, and editing conventions)\n Holding all third-party (client) information in the strictest confidentiality\n Reviewing completed work to identify potential areas of self-improvement\n\nRequirements\n\n Strong English grammar and comprehension\n Ability to understand global accents\n Minimum 80 Words per Minute typing speed\n Computer literacy with strong MS Word skills\n Ability to understand at least one or more of the following accents in the English language is required:\n West African (including Nigeria, Ghana, Liberia, Mali)\n East African (including Sudan, South Sudan, Kenya, Uganda, Ethiopia, Eritrea, Djibouti, Somalia)\n South Asian accents (including India, Pakistan, Bangladesh, Sri Lanka, Afghanistan)\n East Asian accents (including China, Korea, Japan, Thailand, Indonesia)\n Middle Eastern accents (including Iran, Iraq, Turkey)\n Eastern Bloc European accents (including Russia, Romania, Georgia)\n Latin American accents (including Mexico, Chile, Brazil, Venezuela)\n French accents (including Quebec, France, Congo, Cameroon)\n Strong command of a second language beyond English is preferred\n Previous transcription experience is not a requirement, we will train successful candidates.\n At least 18 years of age due to violent and graphic content.\n Current RCMP criminal background check Level 1 upon hiring.\n Eligible candidates are required to have lived in Canada for the last 5 years\n\nPlease Note: Content being processed contains graphic details of sexual and physical violence. Successful candidates need to be comfortable with this content. The interview process will screen for ability to handle such content.\nWork Location & Hours\n\n Office located at 116 Albert Street, Suite 200 & 300, Ottawa ON, K1P 5G3, Canada\n Open from Monday to Friday\n Open from 8:00 a.m. to 5:00 p.m\n\nCompensation\n\n Starts at $18/hour, and can go up to $21/hour depending on performance\n If you have 5 years or more of verifiable transcription experience, your base hourly rate will begin at $21/hr\n Three month probation\n Vacation as per ESA standards, and is paid out on each pay cheque\n Full health benefits are provided, including pharma, dental, eye, chiro, physio, etc., after three months of probation, for all staff working at least 32 hours per week.\n\nJob Types: Permanent, Part-time, Full-timePart-time hours: 24 - 37.5 per week\nSalary: $18.00-$21.00 per hour\nBenefits:\n\n Casual dress\n Dental care\n Extended health care\n Vision care\n\nSchedule:\n\n 8 hour shift\n Day shift\n Evening shift\n Monday to Friday\n Morning shift\n Weekends as needed\n\nCOVID-19 considerations:All staff must wear masks in the office. If you are sick in any capacity, you will be asked to stay home and provide us with negative COVID 19 test.\nWork Location: In person"
}