{
    "id": "b8813e8a725f5043",
    "company": "Oxford Learning Centres, Inc.",
    "positionName": "High School Math & Science Teacher",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-09-01T06:50:49.738Z",
    "url": "https://www.indeed.ca/rc/clk?jk=b8813e8a725f5043&from=jasx&tk=1hbl00rvqkp1k800&vjs=3",
    "externalApplyLink": "https://oxfordlearning.talentnest.com/en/posting/141754/location/170589?source=indeed",
    "companyDescription": "",
    "description": "High School Math & Science Teacher/Tutor Wanted \n Motivated by mathematics? Sharp with science? Excited by equations in both fields? Eager to help students succeed in math and science? \n  Oxford Learning Rockcliffe is currently seeking part-time teacher-tutors for a role in our learning centre. This position is perfect for anyone who loves working with students, enjoys numbers and equations, and is passionate about helping others build their skills in these areas. \n  Tutor-teachers at Oxford Learning do not have to lesson plan before class, as all lessons are pre-planned. Applicants will be fully trained in our proprietary philosophy and methods. \n  Position Requirements \n  All Teacher-Tutors at Oxford Learning work during after-school and evening hours evening hours (3:00pm - 7:00pm) as well as some Saturdays (10:00am - 3:00pm). A commitment until the end of the term in June is preferred. Continuing through the summer is even better. Your students will love working with you, and being reliable is a must. \n  This role is in-person. You must be able to commute to this location. This is not an online position. Vulnerable sector screening is mandatory. \n  We encourage you to apply if you have the majority of the following requirements: \n  Education: \n  \n  Bachelor’s degree or similar certification in a relevant field \n  Fourth year university students with extensive tutoring experience will be considered \n  Teaching certification an asset \n  Good knowledge of the current Grades 9-12 math and science curriculum, particularly senior math and including, but not limited to, Advanced Functions, Algebra, Trigonometry and Calculus, and Vectors, Physics, Chemistry, and Biology. \n  \n Experience: \n  \n  Some experience teaching/tutoring math at a Grade 9 to 12 (or equivalent) level \n  Strong English written and oral communication skills \n  Strong math skills and ability to guide students’ understanding \n  Ability to multitask and balance working with up to three students at a time \n  \n Responsibilities (Position Details) \n  You will work directly with students as an Interactive Coach with the following responsibilities: \n  \n  Teaching up to 3 students at a time at different levels \n  Teaching online and in-person \n  Following the Oxford Learning methodologies and philosophies \n  Filling in post-lesson notes \n  Completing daily student communication updates \n  Maintaining a friendly and professional manner at all times \n  \n Smiles, High-Fives & Happy Students \n  In this position, you will play a key role in helping students develop their self-confidence and self-esteem. The rewards of helping children overcome academic hurdles and realize their inner potential can be very fulfilling. You will be rewarded with smiling faces and high-fives during every shift. Other rewards of the role include: \n  \n  fun staff events \n  ongoing training opportunities \n  frequent check-ins and feedback \n  company growth opportunities \n  hands-on development of your teaching skills \n  \n Job Type: Part-time \n  Salary Range: $16 - $18 / hour \n  Schedule: \n  \n  Evenings \n  Monday to Friday \n  Saturday availability \n  \n About Oxford Learning \n  Oxford Learning is a Canadian supplemental education provider helping students get better grades since 1984. Offering a full range of programs for students of all ages and abilities, Oxford Learning uses the science of cognitive learning to help all students develop stronger learning skills they can rely on for life! \n  Are you the superstar teacher-tutor we have been searching for? Apply now! \n  Oxford Learning Rockcliffe \n  359 St Laurent Blvd, Ottawa, ON \n  Tel: (613) 288-2138 \n  We thank all applicants for their interest in joining the team at Oxford Learning Rockcliffe. However, only those selected for the interview process will be contacted."
}