{
    "id": "b892905c6fd35632",
    "company": "Ciena",
    "positionName": "DSP / Research Scientist Engineer",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-01T20:09:00.798Z",
    "url": "https://www.indeed.ca/rc/clk?jk=b892905c6fd35632&from=jasx&tk=1he3lkogbirpe800&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=b892905c6fd35632&atk=&xpse=SoAq67I3IDjbaNgVDT0LbzkdCdPP",
    "companyDescription": "",
    "description": "Ciena is committed to our people-first philosophy. Our teams enjoy a culture focused on prioritizing a personalized and flexible work environment that empowers an individual’s passions, growth, wellbeing and belonging. We’re a technology company that leads with our humanity—driving our business priorities alongside meaningful social, community, and societal impact. \n \n Achieve your ideal career at the forefront of innovation with Ciena. We know the importance of life outside of work, which is why our employees enjoy unlimited paid time off and the freedom of working remotely. Ciena empowers our teams with competitive salaries and incentives, community volunteer programs, professional development resources, and support for our mental and physical health—all experienced within a diverse and inclusive culture. To put it simply, we’re a technology company driven by our humanity.\n  How You Will Contribute:\n  Ciena is a leading supplier of optical line and transmission equipment. Join a diverse science and engineering team that invents, designs, and verifies Ciena’s next coherent transceivers.\n \n  Reporting to Senior Director, Optical Engineering and as a member of the WaveLogic science team you will contribute by means your ideation, design, modelling and coding skills in communication theory, statistics, digital signal processing, forward error correction, optical physics and/or optical transmission & performance measurements. We provide a learning environment that enables rapid progression to contributing membership in the team.\n \n  DSP and optical performance design responsibilities \n \n  Create and analyze digital algorithms for next-generation high-speed optical communication systems.\n   Work closely with the Modem Signal Processing Team on the implementation of digital algorithms in Ciena products.\n \n \n  General Activities\n \n   Analyze questions in your areas of knowledge which would be a subset of: optical physics, communications theory, probability, control theory, and high-speed algorithms.\n   Create innovative solutions that can be implemented in CMOS.\n   Model in MATLAB.\n   Independently plan and schedule work and document results.\n   Review and communicate designs and solutions with- and to- the wider development team\n   Support development and testing at 800 Gb/s and beyond in the lab.\n   Learn new mathematical areas.\n \n \n  Experience\n \n   Post-graduate degree in Math, Physics, or Engineering with focus on optical physics and quantum electronics, signal processing, communications, statistics and control theory.\n   Must have MATLAB experience.\n   C, C++, Python experience would be an asset.\n \n \n  Overall: Collaboration with stakeholders\n \n   Interface and collaborate with DSP, hardware, firmware, electro-optic, systems and lab teams.\n   Provide feedback & suggestions on existing designs; contribute ideas to improve design procedures.\n   Share expertise and best practices with lab teams.\n \n \n  Areas of Impact\n \n   Key DSP technology to enable state-of-the-art coherent optical modem and DWDM systems.\n   Verified models and supporting measurements that predict modem performance and define modem specifications, respectively.\n \n \n  #LI-PG1\n \n  At Ciena, we are committed to building and fostering an environment in which our employees feel respected, valued, and heard. Ciena values the diversity of its workforce and respects its employees as individuals. We do not tolerate any form of discrimination.\n \n  If contacted in relation to a job opportunity, please advise Ciena of any accommodation measures you may require."
}