{
    "id": "ba47cd6fdb26cb10",
    "company": "Baird & Associates",
    "positionName": "Coastal Engineering Intern",
    "jobType": [
        "Full-time",
        "Internship / Co-op"
    ],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-24T12:17:17.013Z",
    "url": "https://www.indeed.ca/rc/clk?jk=ba47cd6fdb26cb10&from=jasx&tk=1hl5dju1ci4nl800&bb=gCzgXPzOG1uTP-CnMJvHBVwr9P3mOygqz1AoJ9QbCGQRsgWBzMwTpw22XPz2MHN3Qag_WQ02n7J_vXWwv6-G_jG9yqI7qzciK_Lkngmg8btbcOl9FSiW4w%3D%3D&xkcb=SoBh67M3FlTAH9xNAp0BbzkdCdPP&vjs=3",
    "externalApplyLink": "https://jobs.smartrecruiters.com/BairdAssociates/743999962914402-coastal-engineering-intern",
    "companyDescription": null,
    "description": "Company Description\n  W.F. Baird & Associates Coastal Engineers Ltd. (Baird) provides professional engineering and technical services related to the design of coastal structures and facilities that interact with the world’s oceans, lakes, and rivers. Baird is recognized for the successful completion of innovative and practical projects throughout North and South America, the Caribbean, Middle East, Africa, and Southeast Asia.\n  We provide a stimulating work environment, with opportunities for domestic and international travel, professional development, and ownership potential within the company. Baird is a 100-person engineering firm specializing in coastal, marine, and riverine engineering with offices in the U.S., Canada, Barbados, Chile, and Australia. We are one of the only firms in the world dedicated exclusively to marine and coastal projects, and we encourage you to visit our website (www.baird.com) to gain additional insight into our company, capabilities, and experience.\n  Job Description\n  W.F. Baird & Associates is seeking a motivated and personable engineering student to join our team as an Intern in our Ottawa, ON office for Spring 2024. The selected candidate will be involved with various design and construction aspects associated with marine, coastal, and waterfront engineering projects. This position will support multiple offices worldwide.\n  Job Responsibilities:\n \n   Working under supervising professional engineers, the candidate will:\n   \n     Participate in field data collection\n     Perform engineering analyses and design of coastal structures\n     Assist with the preparation of project deliverables including technical reports, calculations, cost estimates, and drawings\n     Assist with construction administration tasks for projects currently being constructed\n   \n   Work across our different offices and time zones\n   Other duties as assigned\n \n  \n  Qualifications\n  \n \n   Ability to work full-time during the summer break\n   Junior, Senior, or Graduate student standing in an ABET accredited engineering program\n   Specializing in water resources, coastal, civil, structural, geological, or geotechnical engineering\n   Proficient skills in Microsoft Office Suite software\n   Excellent interpersonal, verbal, and written communication skills (English)\n   Flexible work style, with the ability to thrive in a dynamic work environment, meet challenging deadlines and client needs\n \n  Nice to Have Qualifications:\n \n   Previous experience as an intern in an engineering consulting firm\n   Knowledge and experience with AutoCAD\n \n  \n  Additional Information\n \n  Baird is an equal-opportunity employer. All qualified applicants will receive consideration for employment without regard to race, colour, religion, sex (including pregnancy), sexual orientation, gender identity and/or expression, national origin, protected veteran status, disability, genetics, or citizenship status (when otherwise legally authorized to work) and will not be discriminated against based on such characteristics or any other status protected by the laws or regulations in the locations where Baird operates.\n  We thank all candidates for their interest. Baird is a diverse and inclusive workplace that is welcoming to all backgrounds and walks of life. We encourage you to apply even if you don't match all of our job requirements!\n  Disclaimer: The above information in this description has been designed to indicate the general nature and level of work performed by employees with this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this position."
}