{
    "id": "bb516cdebd435520",
    "company": "TendTo.",
    "positionName": "Senior Caregiver/Companion",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-18T05:11:52.308Z",
    "url": "https://www.indeed.ca/rc/clk?jk=bb516cdebd435520&from=jasx&tk=1hkikfdo3kecu801&bb=WxOhatT4U5HJji5qaEXltDBrS-P0IsJF6P6_n3ITv6bLZ_dsMXOHFmge-gPKZOpn_ecESDp1UzR8ocYlVnhnnn82A8eZOn_RDnNtvctRLPuoUHxKyomEQw%3D%3D&xkcb=SoA267M3FSgyYCQ9SB0ObzkdCdPP&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "Job Title: Senior Caregiver/Companion\nCompany: TendTo\nLocation: Ottawa, ON\nJob Type: Casual/Part-Time\nAbout Us:\nAt TendTo, we're on a mission to redefine home care with a strong focus on providing compassionate, personalized, and flexible support to our clients. As we continue to expand, we're seeking empathetic and dedicated PSWs and Senior Caregivers to join our team. If you're passionate about making a difference in the lives of those who need it most, we'd love to have you on board.\nPosition Overview:\nAs Caregiver with TendTo, you'll be an essential part of our clients' lives, offering assistance with daily activities, promoting independence, and improving their overall quality of life. This flexible, part-time position allows you to choose your working hours, providing a fulfilling way to help others while accommodating your schedule.\nKey Responsibilities:\n\n Deliver personalized care, companionship, and support to clients in the comfort of their homes.\n Assist clients with activities of daily living, including bathing, dressing, grooming, and meal preparation.\n Assisting with medications and keeping a watchful eye on the health status of clients as required.\n Engage in meaningful conversations and provide emotional support/companionship to enhance their well-being.\n Maintain accurate records of care provided and promptly report any changes in a client's condition.\n Ensure the safety and comfort of clients in your care.\n\nQualifications:\n\n Valid certificate as a Personal Support Worker, Internationally Trained Nurse, Health Care Aid, Home Support Worker, or have completed the first year and are currently enrolled in a Nursing program.\n A deep commitment to delivering high-quality care with empathy and compassion.\n Exceptional communication and interpersonal skills.\n Reliable and self-motivated, with the ability to work independently and manage your time accordingly..\n Possession of a valid driver's license and access to reliable transportation, if needed.\n A clean criminal background and a recent vulnerable sector screening.\n\nBenefits:\n\n Extremely competitive hourly pay (25$-28$/h)\n Flexibility to choose your working hours\n Opportunities for ongoing professional development and growth.\n A supportive, collaborative team environment.\n The chance to be part of a dynamic company that's changing the future of home care.\n Incentive/reward program for highest performing team members\n\nConclusion\nIf you're a caring and passionate individual committed to enhancing the lives of seniors and individuals with disabilities, we invite you to apply. Join our team at TendTo and be part of our mission to provide exceptional home care services with a focus on flexibility and empathy.\nTo apply, please submit your resume along with a brief video introduction detailing your qualifications and your drive to become an PSW with TendTo. We look forward to welcoming you to our team.\nTendTo is an equal opportunity employer, dedicated to fostering a diverse and inclusive workforce. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.\nJob Type: Casual\nSalary: From $28.00 per hour\nBenefits:\n\n Flexible schedule\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n Day shift\n Evening shift\n Morning shift\n Night shift\n On call\n Weekends as needed\n\nSupplemental pay types:\n\n Overtime pay\n Retention bonus\n\nApplication question(s):\n\n Are you willing to work part time, in addition to any current position, while we build up your portfolio of clients?\n\nEducation:\n\n Secondary School (preferred)\n\nExperience:\n\n Caregiving: 5 years (required)\n\nLicence/Certification:\n\n PSW Certificate or completion of a similar program? (required)\n PSW/Care Provider Insurance (required)\n\nWork Location: On the road\nApplication deadline: 2023-12-02Expected start date: 2024-02-01"
}