{
    "id": "bfa3a34e17f9593f",
    "company": "Blyth Academy",
    "positionName": "Senior Science Teacher",
    "jobType": [],
    "location": "983 Bank St, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-09-01T06:51:00.518Z",
    "url": "https://www.indeed.ca/rc/clk?jk=bfa3a34e17f9593f&from=jasx&tk=1hbl00rvqkp1k800&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "Job description\nBlyth Academy is a private high school looking for a qualified senior science teacher to join our school team. We are looking for someone who is familiar with the Ontario curriculum and is adept at engaging students in meaningful and creative ways. The ideal candidate will be passionate about teaching and inspiring students.\nResponsibilities:\n\n Design and implement lesson plans, including engaging and educational content\n Establish and maintain a positive classroom environment that encourages learning, creativity, and engagement\n Provide instruction in all areas of Biology and Chemistry\n Use a variety of teaching methods, including hands-on learning, media, interactive games, and extended writing/oral work\n Maintain a safe, clean lab environment and follow all school policies and procedures\n Attend class meetings and trainings, as required\n Attend teacher meetings and trainings, as required\n Run, participate in extracurricular activities, as required\n\nQualifications:\n\n Bachelor’s degree in Education, science (chemistry and/or biology) or related field preferred. Related field experience is acceptable.\n Previous experience teaching high school students preferred. A combination of classroom experience and training is required.\n\nJob Types: Part-time, Full-time, Fixed term contractPart-time hours: 35 per week\nSalary: $20.00-$45.00 per hour\nSchedule:\n\n Day shift\n Monday to Friday\n\nAbility to commute/relocate:\n\n Ottawa, ON K1S 3W7: reliably commute or plan to relocate before starting work (required)\n\nEducation:\n\n Bachelor's Degree (required)\n\nExperience:\n\n teaching: 1 year (preferred)\n\nWork Location: In person\nExpected start date: 2023-08-31"
}