{
    "id": "c4b0ebbf483162ad",
    "company": "National Research Council Canada",
    "positionName": "Technical Officer, Contaminated Sites",
    "jobType": [],
    "location": "1200 Montreal Rd, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-17T20:07:13.662Z",
    "url": "https://www.indeed.ca/rc/clk?jk=c4b0ebbf483162ad&from=jasx&tk=1he3lhhfqk265803&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=c4b0ebbf483162ad&atk=&xpse=SoBX67I3IDjIXuQd7p0LbzkdCdPP",
    "companyDescription": "",
    "description": "Help bring research to life and drive your career forward with the National Research Council of Canada (NRC), Canada’s largest research and technology organization. \n\n We are looking for a Technical Officer, Specialist in Contaminated Sites. The selected candidate would be someone who shares our core values of Integrity, Excellence, Respect and Creativity. \n\n Do you love variety in your day and enjoy responding to the unexpected while working to achieve your work objectives? \n\n Are you a people person, passionate about improving health, safety and environmental management in the work place? \n\n \nDo your peers or colleagues describe you as: results-oriented;a team player; and having strong communication and problem-solving skills? \n\n If you answered, “Yes”, … Consider joining our team. We may have the job for you! \n\n The National Research Council operates labs and research facilities across the country, each with its own unique challenges related to health, safety and environmental management. NRC is involved with innovative research in transportation, engineering, life and medical sciences, and emerging technologies in computer science, electronics, astronomy and nanotechnology. Each area presents a wide and exciting variety of health, safety and environment related aspects ranging from worker health and protection, to animal safety, biosafety, radiation safety, hazardous materials management, noise and air emissions, waste waters, species at risk, and the list goes on. \n\n NRC’s Health, Safety and Environment Branch (HSE) proactively establishes, promotes and implements best practices in health, safety and environmental management. The HSE Branch provides enabling and support services to NRC’s Research & Development activities, assuring the health and safety of our employees, our neighbouring communities and our environment. \n\n As a team member within the NRC HSE Branch, you will proactively provide leadership by advising and guiding researchers, trades people, engineers, managers and contractors using HSE best management practices. You will also work closely with regulatory authorities to help ensure the NRC’s operations are compliant with applicable federal, provincial and municipal laws and policies. \n\n Contaminated Sites Group; a one-stop shop that touches all aspects of contaminated sites management. Working with technical and administrative staff, consultants, and other NRC business units, you will be responsible for the co-ordination of NRC’s contaminated sites projects and supporting programs. You will gain practical experience in assessment and remediation and risk management of contaminated sites, strategic planning, operations, procurement and contract management, program management, technical review, financial management, and stakeholder relations. \nScreening Criteria \nApplicants must demonstrate within the content of their application that they meet the following screening criteria in order to be given further consideration as candidates: \nEducation \nUniversity degree from a recognized post-secondary institution in Science or Engineering, with acceptable specialization relevant to the position (e.g. chemistry, geology, physics, biology, ecology, biochemistry, environmental science or environmental, chemical or civil engineering). \n\n Equivalency \n\n College diploma and significant relevant experience in the field of expertise may also be considered. \n\n For information on certificates and diplomas issued abroad, please see Degree equivalency \nExperience \n\n Significant* and recent** experience in interpreting, assessing compliance or applying federal, provincial and municipal legislation and regulations related to Health, Safety and the Environment (e.g., Canadian Environmental Protection Act and related regulations, Species at Risk Act, Impact Assessment Act , Canada Labour Code, environmental emergencies, Treasury Board Policies). \n\n Significant* experience in performing fieldwork related to environmental field surveys, environmental site assessments, or inspections for health, safety and environmental audits. \n\n Significant* experience in planning, writing or evaluating technical documentation. \n\n Significant* and recent** experience in management of regulated health, safety and environmental aspects, such as halocarbons, petroleum storage tanks, wastewater, air and noise emissions, hazardous materials, hazardous waste, spill response and species at risk or contaminated sites. \n\n Significant* experience in managing and providing oversight of investigation, characterization, remediation, and risk management projects. \n\n \nAsset:\n \n \n Recent** experience with program reporting in the context of the Federal Contaminated Sites Action Plan (FCSAP) may be considered an asset. \n Significant experience is defined as more than 2 years of experience. \n **Recent experience is defined as experience gained within the last 6 years. \n\n Condition of Employment \nReliability Status \nLanguage Requirements \nEnglish or Bilingual Imperative BBB/BBB \n\n Information on language requirements and self-assessment tests \nAssessment Criteria \nCandidates will be assessed on the basis of the following criteria: \nTechnical Competencies \n\n Knowledge of federal, provincial, and municipal regulations and policies related to Health, Safety and Environment. \n\n Ability to research, analyze and synthesize complex information from multiple sources, identifying issues of key relevance and providing sound recommendations to complex problems. \n\n Ability to conduct risk assessments and to provide relevant technical advice on the health, safety and environmental implications of an initiative/project. \n\n Ability to develop and produce reports, provide sound recommendations and to present subjects concisely using high quality written and oral briefings to acquire the necessary support(s). \n\n Ability to develop work plans that include time and cost estimates for the corresponding initiatives. \n\n Behavioural Competencies \nTechnology support - Client focus (Level 2) \nTechnology support - Communication (Level 2) \nTechnology support - Conceptual and analytical ability (Level 2) \nTechnology support - Initiative (Level 2) \nTechnology support - Results orientation (Level 2) \nTechnology support - Self-knowing and self-development (Level 2) \nTechnology support - Teamwork (Level 2) Competency Profile(s) \nFor this position, the NRC will evaluate candidates using the following competency profile(s): Technology Support \n\n Relocation \nRelocation assistance will be determined in accordance with the NRC's directives. \nCompensation \n\n Salary under review \n\n From $73,744 to $94,839 per annum. \n\n In addition, the incumbent in a bilingual imperative position will receive the Bilingualism Bonus of $800 per year. \n\n NRC employees enjoy a wide-range of competitive benefits including comprehensive health and dental plans, pension and insurance plans, vacation and other leave entitlements. \nNotes \n\n How your answers are provided is instrumental in selecting the candidates for assessment. Please be aware that the assessment board cannot and will not make assumptions about your Education and Experience. Therefore, clearly answer all application questions providing concrete examples with significant details to explain WHEN, WHERE and HOW you acquired each experience. Please be sure to include substantiating details that clearly outline the breadth of experience as well as relevant timelines. The length of time can be important so please include how many months or years you did this work. Resumes will only be used as a secondary source to validate the experience described in the answers to the screening questions. If you are the successful candidate, we will validate the information that you provided by contacting your relevant references at the end of the process. \n\n Failure to answer the screening questions or provide appropriate or factual information in the application may result in the rejection of your application. \n\n Please note that we are unable to contact candidates for incomplete or possible missing information. \n\n A pre-qualified list may be established for a one year period for similar positions of various tenures and Bilingual and English essential linguistic profiles. \n\n NRC employees enjoy a wide-range of benefits including comprehensive health and dental plans, pension and insurance plans, vacation and other leave entitlements. \n\n Preference will be given to Canadian Citizens and Permanent Residents of Canada. Please include citizenship information in your application. \n\n The incumbent must adhere to safe workplace practices at all times. \n\n The working conditions are those found in an ordinary office environment. \n\n \nMust be willing to occasionally: travel, handle hazardous materials and/or situations, visit industrial laboratory and/or component test cell environment, work with the presence of enhanced noise levels and perform occasional inspections at construction sites. \n\n We thank all those who apply, however only those selected for further consideration will be contacted. \n\n Please direct your questions, with the requisition number ( 20662 ) to: \n\n \nE-mail: NRC.NRCHiring-EmbaucheCNRC.CNRC@nrc-cnrc.gc.ca \n\n \nTelephone : 613-298-5697 \n\n \nClosing Date: Tuesday 7 November - 23:59 Eastern Time"
}