{
    "id": "c7a4762b555baf4b",
    "company": "exp",
    "positionName": "Lab Technician",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-09-15T06:49:54.187Z",
    "url": "https://www.indeed.ca/rc/clk?jk=c7a4762b555baf4b&from=jasx&tk=1hbkvuh1oj32s803&vjs=3",
    "externalApplyLink": "https://elcn.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX/job/106961",
    "companyDescription": "",
    "description": "Lab Technician (Contract until 2023) \n Ottawa, ON \n \n At EXP, we’re driven to provide innovative solutions for the world’s built and natural environments. As a team of engineers, architects, designers, scientists, creators and a community of professionals, we bring diverse and talented people together to solve the world’s most complex challenges. Here, you join a team that leverages differences, harnesses their entrepreneurial spirit in an employee-owned company, that believes diversity is what gives us strength, seeks sustainable results and shares ambitions for each other, our clients and the communities we are part of and serve. To be a part of EXP means to have your own experience, while staying connected to a global network of professionals, who believe we are a part of something bigger. Together, we are EXP. \n Are you ready to design your future? \n Be our next Lab Technician ! \n \n Your work environment at EXP \n EXP is currently searching for a Lab Technician to join our Earth and Environment group. This is a contract position until the end of 2023 with a possibility of extension. \n \n What a day at EXP has in store for you \n The successful candidate will spend their time in the material laboratory completing construction materials tests. \n \n  Lab based position – process concrete cylinders, conduct aggregate and soil testing Interact with other lab & field staff, engineers, etc. \n \n \n The Skills, Knowledge and Abilities We Seek \n \n  Must have strong people skills, and ability to work with wide variety of staff and clients \n  Must be able to communicate (verbally/writing) in English for field and formal reports \n  Ideally concrete/soils/asphalt testing experience would be advantageous \n  Strong general math skills \n  Diploma from an accredited Civil Technology program or equivalent would be an asset \n  Must have a valid Canadian driver’s license (Having access to a vehicle is an asset) Able to lift a minimum of 25kg \n \n \n #LI-AH1\n \n\n\n Our story   With a mission to understand, innovate, partner and deliver, EXP provides engineering, architecture, design and consulting services to the world’s built and natural environments. \n Our heritage dates back to 1906, when the earliest of EXP’s predecessor companies started its engineering infrastructure practice. Today, thousands of creative professionals across EXP work together to deliver extraordinary experiences year after year. \n What makes us different \n The passion, enthusiasm, diversity and industry-leading capabilities of our employees make us who we are. We’re committed to providing a challenging work environment that cultivates career growth, encourages creativity and rewards excellence. \n Find out more about life at EXP by visiting www.exp.com ."
}