{
    "id": "c8334c7cac050eb5",
    "company": "Roberts/Smart Centre",
    "positionName": "Director of Programs and Quality/Directeur des programmes et de la qualité",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-17T05:13:15.166Z",
    "url": "https://www.indeed.ca/rc/clk?jk=c8334c7cac050eb5&from=jasx&tk=1hkikituvitnn800&bb=wVO1fWneEL8E3fFenywj_l5bVDFuxbzVEX5xRs3Zp_jHz8kkRQcye6iHMmgrhs9GzzuxZr5bwQF-vt0O1CKPRAkqxYNE3KrivdLcWwiDDXgyeI1Cs4GDxw%3D%3D&xkcb=SoAQ67M3FShEGrw23Z0LbzkdCdPP&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "At the Roberts/Smart Centre, we are all about making a difference in the lives of the most vulnerable youth in the province.\nThe youth and families we have the privilege of serving deal with severe mental health and behavioural challenges. We help them by providing exceptional mental health services in a welcoming, supportive, inclusive, bilingual, and culturally safe environment. We also do everything to give them the tools, confidence, and support system they need to lead happy, productive, and fulfilling lives.\nWe are expanding programs and our team is growing! The Roberts/Smart Centre is currently looking for a Director of Programs and Quality.\nAbout the Position\nWorking under the direction of the Chief Executive Officer, the Director of Programs and Quality is responsible for all our programs, quality assurance, program risk management, and many community collaboration efforts on behalf of RSC. This key member of the senior management team will also play a part in the planning and overall direction of the Centre.\nThe Director of Programs and Quality will:\n- Lead the development and evaluation of the Roberts/Smart Centre programs.\n- Lead and supervise Program Managers.\n- Oversee key performance indicators and quality improvement initiatives as they relate to programs and serve as an ad hoc (non-voting) member of the RSC Board of Directors Quality Committee.\n- Lead and grow current evidence-based and leading practices within RSC programs and expand RSC services.\n- Work collaboratively with key stakeholders, including Ministry representatives, local and provincial community partners, youth, and families.\n- Represent the organization at community functions as required, developing and maintaining community relationships and partnerships that promote the client-centred direction of RSC.\nOur Ideal Candidate\nThe right person for this job will be a compassionate team player with a passion for youth mental health who can demonstrate that they have:\n- Proven abilities in program development, management, change management and organizational growth and capacity building.\n- Several years of experience at a senior management level in a tertiary care mental health setting.\n- Advanced working knowledge of the youth mental health sector, including organization and community context, clinical environment, and evidence informed approaches.\n- A demonstrated ability to build strong relationships with key stakeholders, including Ministry representatives, local and provincial community partners, youth and families, and senior leaders across multiple organizations, both virtually and in-person.\n- Strong communication (verbal and written) in both official languages and administrative organizational skills.\nOther criteria that could set a candidate apart include:\n- A master’s degree in health administration, Health Sciences, Public Health, Social Work or relevant field of study.\n- A well-developed and broad network within the community of mental health/addictions, health, and community service providers.\nHow to Apply\nAre you interested in joining our team as our new Director of Programs and Quality? That’s terrific!\nTo apply, send us your resume attached, and answer the following questions:\n1. What excites you most about this position?\n2. What makes you an ideal candidate?\n3. Why would you be a valuable addition to the Roberts/Smart Centre team?\nWe look forward to hearing from you.\n________________________________________________________________________________________\nAu Centre Roberts/Smart, nous nous efforçons de déclencher un changement positif dans la vie des jeunes les plus vulnérables de la province.\nLes jeunes et les familles que nous avons le privilège de servir sont confrontés à de graves problèmes de santé mentale et de comportement. Nous les aidons en leur fournissant des services en santé mentale de qualité exceptionnelle dans un environnement accueillant, solidaire, inclusif, bilingue et culturellement sain. Nous faisons également tout ce qui est en notre pouvoir pour leur donner les outils, la confiance et un système de soutien dont ils auront besoin pour vivre heureux, de façon productive et épanouie.\nNous sommes en pleine expansion de nos programmes et notre équipe est en croissance. Le Centre Roberts/Smart est présentement à la recherche d’un directeur ou d’une directrice des programmes et de la qualité.\nCe poste\nSous la direction de la directrice générale, le directeur ou la directrice des programmes et de la qualité est responsable de tous nos programmes, de l’assurance de la qualité, de la gestion du risque des programmes et des nombreux efforts de collaboration avec la communauté au nom du CRS. Ce membre clé de l’équipe de direction jouera également un rôle dans la planification et l’orientation générale du Centre.\nLe directeur ou la directrice des programmes et de la qualité :\n- Diriger le développement et l’évaluation des programmes du Centre Roberts/Smart.\n- Diriger et superviser les gestionnaires des programmes.\n- Superviser les indicateurs clés de performance et d’amélioration de la qualité en ce qui concerne les programmes et agir en tant que membre ad hoc (sans droit de vote) du comité de la qualité du conseil d’administration du CRS.\n- Diriger et renforcer les pratiques courantes fondées sur des données probantes et les pratiques exemplaires dans les programmes du CRS et développer les services du CRS.\n- Travailler en collaboration avec les principaux parties prenantes, y compris les représentants du ministère, les partenaires communautaires locaux et provinciaux, les jeunes et les familles.\n- Représenter l’organisation lors d’activités communautaires, au besoin, en établissant et en maintenant des relations et des partenariats communautaires qui promeuvent l’orientation axée sur le client du CRS.\nLa personne idéale pour occuper ce poste\nLa meilleure personne pour ce poste sera un joueur d’équipe attentionné, passionné par la santé mentale des jeunes et qui démontrera qu’il a :\n- Des compétences avérées en matière d’élaboration de programmes, de gestion, de gestion du changement, de croissance organisationnelle et de renforcement des capacités.\n- Plusieurs années d’expérience à un poste de direction dans un établissement de soins tertiaires en santé mentale.\n- Des connaissances approfondies du secteur de la santé mentale des jeunes, notamment du contexte organisationnel et communautaire, de l’environnement clinique et des approches fondées sur des données probantes.\n- Une capacité avérée à établir des relations solides avec les principales parties prenantes, y compris les représentants du ministère, les partenaires communautaires locaux et provinciaux, les jeunes et les familles, et les hauts responsables de plusieurs organisations, à la fois virtuellement et en personne.\n- De solides compétences en communication (orale et écrite) dans les deux langues officielles et des compétences organisationnelles en matière d’administration.\nD’autres critères peuvent permettre à un candidat ou une candidate de se démarquer:\n- Une maitrise en administration de la santé, en sciences de la santé, en santé publique, en travail social ou dans un domaine d’étude pertinent.\n- Disposer d’un vaste réseau bien développé au sein de la communauté des prestataires de services de santé mentale et de toxicomanie, de santé et de services communautaires.\nComment postuler\nVous souhaitez vous joindre à notre équipe en tant que nouveau directeur ou nouvelle directrice des programmes et de la qualité ? C’est formidable !\nPour postuler, envoyez-nous votre CV, et répondez aux questions suivantes :\n1. Qu’est-ce qui vous intéresse le plus dans ce poste ?\n2. Qu’est-ce qui fait de vous une candidate idéale ou un candidat idéal ?\n3. Pourquoi seriez-vous un atout pour l’équipe du Centre Roberts/Smart ?\nJob Types: Full-time, Permanent\nSalary: $91,152.95-$98,591.03 per year\nBenefits:\n\n Casual dress\n Company pension\n Dental care\n Disability insurance\n Extended health care\n Life insurance\n On-site parking\n Paid time off\n Vision care\n Wellness program\n\nSchedule:\n\n Monday to Friday\n On call\n\nExperience:\n\n Senior level /Tertiary Care Mental Health: 5 years (preferred)\n\nWork Location: In person"
}