{
    "id": "cca93104cf2035f0",
    "company": "GM Health Care Canada",
    "positionName": "Pharmacist",
    "jobType": [],
    "location": "2430 Don Reid Dr, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-08T02:04:21.110Z",
    "url": "https://www.indeed.ca/rc/clk?jk=cca93104cf2035f0&from=jasx&tk=1hc6garcoih7o800&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "Partner needed ASAP\nNew Pharmacy, In Doctors clinic with family doctors and specialists.\nPlease contact: info@gm-healthcare.ca\n```Responsibilities:- Dispense medications accurately and efficiently- Review and interpret prescription orders- Collaborate with healthcare professionals to ensure appropriate medication therapy- Provide medication counseling to patients- Monitor patient medication profiles for drug interactions and allergies- Ensure compliance with all legal and regulatory requirements- Maintain accurate and complete patient records- Participate in quality improvement initiatives\nExperience:- Doctor of Pharmacy (Pharm.D.) degree from an accredited college of pharmacy- Current state pharmacist license in good standing- Previous experience working in a hospital setting is preferred- Strong knowledge of medications, drug interactions, and pharmaceutical calculations- Excellent communication and interpersonal skills- Attention to detail and strong organizational skills\nAs a Pharmacist in a hospital setting, you will play a vital role in ensuring the safe and effective use of medications for patients. Your expertise in medication therapy management will contribute to the overall quality of patient care. Join our team of dedicated healthcare professionals and make a difference in the lives of our patients.```\nJob Type: Full-time\nSalary: From $50.00 per hour\nBenefits:\n\n Dental care\n Paid time off\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n Monday to Friday\n\nAbility to commute/relocate:\n\n Ottawa, ON K1H 1E1: reliably commute or plan to relocate before starting work (required)\n\nExperience:\n\n pharmacist: 1 year (preferred)\n\nLicence/Certification:\n\n Pharmacy License (preferred)\n\nWork Location: In person\nExpected start date: 2023-11-10"
}