{
    "id": "d08f962c13c986e8",
    "company": "VetCare Canada",
    "positionName": "Locum Veterinarian (DVM) - Bilingual - FT, Gatineau Chelsea",
    "jobType": [],
    "location": "Chelsea, QC",
    "salary": null,
    "postingDateParsed": "2023-10-17T18:53:52.596Z",
    "url": "https://www.indeed.ca/rc/clk?jk=d08f962c13c986e8&from=jasx&tk=1hcvfkunqk7dc802&vjs=3",
    "externalApplyLink": "https://vetcare.applytojob.com/apply/NuKmoLk4fx/Locum-Veterinarian-DVM-Bilingual-FT-Gatineau-Chelsea?source=INDE",
    "companyDescription": "",
    "description": "The Gatineau Veterinary Clinic (gatineauvet.ca) is located in Chelsea, Quebec. We are committed to the highest standards of patient care, providing medical and surgical services in an exceptional collaborative environment of compassionate and friendly professionals. Our team values work-life balance, offering flexible schedules and a vibrant work environment.\n \n  About The Role\n  The ideal veterinarian will demonstrate exemplary professionalism in the practice of medicine with patients, with compassion and kindness. The incumbent of this position will be largely responsible for office work and will combine medical expertise and emotional intelligence with a leadership spirit to promote excellence in veterinary medicine. This position also requires communication skills in both French and English.\n \n  Here's what we offer you:\n \n  Competitive base salary\n  Signing and relocation bonuses\n  Continuing education opportunities with access to annual conferences and seminars, and continuing education stipend\n  Networking, collaboration and knowledge exchange with other veterinarians within our practices.\n  Continued investments in new technologies, advanced diagnostics and modern facilities,\n  including digital x-rays, digital dental x-rays, modern ultrasounds and in-house laboratory tests.\n  \n \n  Comprehensive benefits package: Medical, dental and life insurance\n  Variable remuneration program (bonus)\n  Flexible hours\n  College contributions and fees paid\n  Vacation and paid leave\n \n \n  Here at VetCare:\n  Proud of its Canadian origins, VetCare, headquartered in Vancouver, is a company that acquires and manages veterinary practices. Passionate people make up our team across Canada. Our commitment to care is at the heart of our work, whether guiding our talented medical and operations teams, supporting practice owners through seamless transitions, or providing the highest quality patient care in our community-focused practices.\n \n  \n  \n NuKmoLk4fx"
}