{
    "id": "d17255b2d829aff5",
    "company": "LGS, une Société IBM / an IBM Company",
    "positionName": "Oracle Cloud HCM Functional Analyst",
    "jobType": [
        "Full-time"
    ],
    "location": "1 Rue De Ville-Marie, Gatineau, QC",
    "salary": null,
    "postingDateParsed": "2024-01-05T03:14:33.746Z",
    "url": "https://www.indeed.ca/rc/clk?jk=d17255b2d829aff5&from=jasx&tk=1hjm3csar2cja000&vjs=3",
    "externalApplyLink": "https://can232.dayforcehcm.com/CandidatePortal/en-US/lgs/Posting/View/713?source=Indeed",
    "companyDescription": "",
    "description": "At LGS, we strive to provide a workplace that values your professional growth. Our company culture fosters diversity and inclusivity, and we welcome talents from both local and international backgrounds. \n\n As a team member, you will play a crucial role in driving major projects that propel our clients’ businesses forward and improve people’s lives. You will be at the heart of collaborative large-scale digital transformation projects in both the public and private sectors. \n\n The IBM Client Innovation Centre Quebec (CIC), at LGS, employs professionals who collaborate on projects within technology practices, offering local and remote services. Our employees, regardless of their level of experience, are paired with a coach to support their professional growth. As part of IBM’s global network, we have offices in Montreal, Gatineau, Rimouski, and Quebec City. \n\n \nThe benefits of joining our team:\n \n \n Learn every day: access IBM's intellectual capital and trainings on a diverse range of cutting-edge technologies. \n For your well-being: a group insurance bundle including telemedicine, a retirement savings plan with employer’s contribution, access to IBM shares at discounted rates, and a wellness package! \n To enjoy quality time: annual vacations, additional company days off and special life events leaves! \n To have fun with your colleagues: an active community and a social committee with regular activities to keep us all connected! \n Join our team as an Oracle Cloud Functional Analyst! \nHere is how you will be involved \n\n \n Leading and participating in workshops to determine and analyze your clients' functional requirements \n Advise your clients, taking into account best practices for the chosen solution \n Establish parameterization requirements and configure the application \n Provide support during the various phases of testing and post-implementation of the solution \n Supervise more junior members of your team \n Your experience \n\n \n University degree or college diploma in an appropriate discipline and a minimum of 4 years experience in a similar position (Oracle Cloud modules HCM, Finance or SCM) \n Good knowledge of Oracle Cloud finance, procurement, human resources or other modules and how they work \n Exposure to projects involving the implementation of business software packages or Oracle management solutions. \n You stand out for \n\n \n Your outstanding ability to grasp business processes, to understand their current applications and to envisage their potential evolution based on the possibilities offered by the technological solution \n Your talent for proposing and developing new ideas as well as conceptualizing innovative approaches and solutions \n Your excellent interpersonal and results-oriented communication skills \n Your interest in linking business and technology \n Your French and English bilingualism will allow you to collaborate with resources outside the province of Quebec. \n #CICJOBS #IBMJOBS \n\n Be yourself at LGS \n\n LGS is committed to considering all qualified applicants without regard to ethnicity, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, neurodiversity, age, veteran status or other characteristics. \n\n If you are not a Canadian permanent resident or citizen, please consult with your talent acquisition consultant as this role may require the use of technologies that are regulated by export sanctions."
}