{
    "id": "d3d479b95a1050d6",
    "company": "Evik Diagnostic Innovations",
    "positionName": "Research Scientist",
    "jobType": [],
    "location": "Kanata, ON",
    "salary": null,
    "postingDateParsed": "2023-08-21T22:43:30.184Z",
    "url": "https://www.indeed.ca/rc/clk?jk=d3d479b95a1050d6&from=jasx&tk=1haqc5utpii1b800&vjs=3",
    "externalApplyLink": "https://evikdiagnostic.bamboohr.com/careers/52?source=indeed&src=indeed&postedDate=2023-08-14",
    "companyDescription": "",
    "description": "WHO WE ARE: \n  As part of the team at EVIK Diagnostics Innovations you’ll discover meaningful work within the medical device industry. You’ll join a rapidly growing company where each day is different, and opportunities are approached with a team effort.\n  \n  \n  Evik was established in 2011 and is based in Kanata (in the same building as a brewery!) Our team are experts in the field of creating rapid, single-assay lyophilized beads for immunological and molecular diagnostics. Our DxSpheres are used for a wide variety of different testing applications including rapid PCR Covid test kits, and in environmental water testing laboratories. Our clients are located around the world and appreciate our transparency, communication, and ability to go the extra mile.\n  \n  \n  If you’d like to learn more about us and what we do, feel free to check out our website and watch our company video.\n  \n  \n  Evik Diagnostic Innovations is an Ottawa based ISO 13485:2016 certified manufacturer of rapid, single-assay, lyophilized beads for immunological and molecular diagnostics using dry reagent components. We provide exceptional customer service to our clients, and we are looking for a new team member to help us continue to exceed their expectations. You are an ideal candidate if you are looking to become part of a dynamic team.\n  \n  \n  JOB DESCRIPTION \n  The Research Scientist is working directly with other members of the R&D team and with customers to develop new lyophilized diagnostic assay products. – ONSITE Position\n  \n  \n  KEY RESPONSIBILITIES \n  \n  Maintain relations with Evik customers on a high professional level. Quickly respond to customer inquiries and technical questions. Most of Evik clients are Medical Device and Diagnostic Manufacturers. \n  Support Evik client’s development process with technical expertise in diagnostic assay development, freeze-dry excipients selection, formulation and lyophilization cycle optimizing. \n  Lead and coordinate multiple projects and experiments turnaround, customer meetings, data summaries etc. \n  Design experiments and assist Evik clients with design experiments on dispensing and freeze-drying diagnostic assays. \n  Run various analytical methods, collect data, analyze experimental results, prepare data summaries and presentations. \n  Organize and lead customer meetings, presenting data summaries. \n  Advise customers on assay formulating, reagent selection and compatibility with lyophilizing process. \n  Executing experiments (hands-on) on rapid assays formulation, dispensing and freeze-drying. \n  Leading the effort on new product validation, verification, and scaling up. \n  Verify dispense plans and dispenses setup for Laboratory Technicians, monitor dispense process. \n  Trending analytical metrics to confirm method reproducibility and consistency. \n  Writing and reviewing protocols and reports describing analytical assays, contributing to quality control procedures. \n  Writing and reviewing new product manufacturing procedures. \n  Transferring methods to other internal or external partners and supporting the collaboration through timely result analysis. \n  Communicating project progress and experimental results to peers and leadership to support decision-making and collaborating with Production and Business Development teams to support goals and timelines. \n  Managing multiple tasks and changing priorities in a fast-paced environment. \n  Lead or participate in process improvement projects assigned by manager. \n  \n \n EDUCATION, EXPERIENCE \n  \n  D. in chemistry, biochemistry, molecular biology, biophysics, bioengineering, or MS with 5+ years of industrial laboratory experience in a in the field of in-vitro diagnostics with a focus on point of care implementation. \n  Outstanding verbal and writing communication skills. \n  Ability to organize processes and work environment. \n  Experience in formulating, producing, and testing different assay methods. Proven success working with bimolecular reactions, assay design, and/or product development. \n  Deep knowledge of molecular diagnostics, enzymatic and immunoassay principles \n  Proven track record of assays development success \n  Ability to multitask, handle frequently changing job functions, and rapidly learn new techniques and approaches. \n  Ability to communicate results and concepts clearly. \n  \n  \n The following are considered to be assets: \n  \n  Familiarity with ISO13485/GMPs/CE/FDA for Medical Devices \n  Experience in formulation design for various active ingredients with selected excipients and stabilizers, especially for stabilizing enzymes in “dry chemistry” or freeze-dried/lyophilized form. \n  Familiarity with multidisciplinary teams working to achieve challenging research goals"
}