{
    "id": "d61dfbe789a573b7",
    "company": "Morrison Hershfield",
    "positionName": "Environmental Engineer",
    "jobType": [],
    "location": "2932 Baseline Rd, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-11-10T20:16:39.728Z",
    "url": "https://www.indeed.ca/rc/clk?jk=d61dfbe789a573b7&from=jasx&tk=1hgol57rgk5r3800&vjs=3",
    "externalApplyLink": "https://morrisonhershfield.wd3.myworkdayjobs.com/en-US/morrisonhershfieldcareers/job/Ottawa-ON/Environmental-Engineer_R2023-408?mode=job&iis=Advertising&iisn=Indeed",
    "companyDescription": "",
    "description": "Morrison Hershfield is a multi-disciplinary consulting engineering and management firm located throughout the US and Canada. We are a dynamic, employee-owned, team-oriented firm with a diverse project list that ensures you will be working on exciting, high-profile and challenging projects. For more than 75 years, the people at Morrison Hershfield have been the leading force behind our continuous growth and the expansion of our services.\n \n \n \n   Here at Morrison Hershfield, we are committed to providing flexible work arrangements, to assist employees in fulfilling their multiple responsibilities at work, at home and in the community. Flexible work arrangements provide additional options for work schedules and locations. As we focus on project delivery, clients and staff, we have several working options available for working at Morrison Hershfield.\n \n  Morrison Hershfield (MH) is a leading provider of engineering, planning, environmental services and sustainable design, and we have a wide range of federal, provincial, municipal and private clients. We provide practical environmental solutions for interesting and complex projects across Canada.\n  \n  Our Environmental services are broad reaching and integrated with our multi-disciplinary teams. Through environmental planning and management, we work towards net positive impacts of our clients’ projects, increasingly with a focus on sustainability and making a difference on climate. Through environmental engineering, geoscience, and ecology we delve into and solve problems over wide ranging scales and with a broad geographic coverage.\n  \n  Our Environmental Business Unit with a staff of approximately 70 in 5 Canadian provinces, provides a wide range of services across multiple sectors (waste, transportation, infrastructure, real estate, etc.). Our Environmental Engineering & Geoscience, East department is a group of 13 based in Ottawa and the GTA, specializing in contaminated sites/excess soils, hydrogeology, and environmental health and safety.\n \n \n   We are currently seeking an Intermediate Environmental Engineer to complement our team in the Ottawa office. The ideal candidate is someone that is interested in being a key member of our growing Environmental Engineering and Geosciences team with a strong focus on contaminated sites/excess soils\n \n \n \n   Responsibilities:\n \n \n   Manage and conduct projects in contaminated sites assessment and remediation, excess soils, and/or contaminant hydrogeology.\n   Conduct and supervise field investigations including drilling and test pitting programs, soil, groundwater and surface water sampling, remedial excavations, and others.\n   Manage project planning and coordination, including arranging utility clearances, scheduling subcontractors, client meetings and communication, liaison with regulatory authorities, etc.\n   Prepare reports and assist with proposal submissions, and mentor more junior staff.\n   Manage projects from the proposal stage through to project delivery, including schedule and budget control, client communication, and invoicing.\n   Participate, under the supervision of senior staff, in client engagement, business development, and long-term business strategies.\n   Ability to travel to sites and to clients across Canada\n \n \n \n   Qualifications:\n \n \n   University degree in Engineering, Geology, Environmental Science, or related field of study.\n   Registered as a Professional Engineer or Geoscientist.\n   Minimum 4+ years of directly related experience, working with projects under various jurisdictions (municipal, provincial, and federal).\n   Demonstrated ability as a project leader and team player.\n   Excellent working knowledge of provincial and federal environmental legislation.\n   Detailed working knowledge and hands-on experience in environmental field investigation and sampling methods.\n \n \n \n   Job Type:\n  Regular\n \n   Job Profile: For internal use\n  Environmental Engineering III\n \n \n   Morrison Hershfield is committed to having an inclusive and diverse workforce, with recruitment free of discrimination, ensuring all candidates are given a fair opportunity for employment. We are committed to working with and providing reasonable accommodation to applicants with disabilities.\n \n \n \n   Attention Staffing & Recruitment Agencies: Morrison Hershfield will not pay fees for recruitment activities related to the hiring of a candidate unless a written service agreement has been established between a duly authorized representative of our Corporate Human Resources department and the recruitment/placement firm. In addition, in order to qualify for recruitment fees, all candidate resumes must be submitted to Morrison Hershfield through our Corporate Human Resources department. Resumes and profiles sent to our managers without the express agreement of our Corporate Human Resources department will not be eligible for a fee."
}