{
    "id": "d6de632147174397",
    "company": "Tony Graham Automotive Group",
    "positionName": "Detailer - 299 West Hunt Club Road",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-20T05:07:57.729Z",
    "url": "https://www.indeed.ca/rc/clk?jk=d6de632147174397&from=jasx&tk=1hkik8vp5k633800&bb=3fcFSWL0Q64YUe5hx9GNdrqfuVDPKpKMm-aHv7dyagoZmQ8pkcfu9FRmlmOWogiP7F_m29XEFGyKZ-hAyV9I4tplYb6VCrt-Sn1caY49w57_bhpWmlOlAA%3D%3D&xkcb=SoB_67M3FSgsJ0AB1z0BbzkdCdPP&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "Tony Graham Automotive Group \nJob Title \nDetailer\nReport to \nService Manager\nLocation \n299 West Hunt Club Road Ottawa, ON K2E 1A6 – On-Site\nEmployment Status \nFull-time permanent\nClosing Date\nUntil filled\nWho We Are? \nThe Tony Graham Automotive Group (TGAG) is a reputable and established business, with over 50 years in the Ottawa area. Our group consists of Tony Graham Toyota, Tony Graham Lexus, Kanata Toyota, Tony Graham AutoEdge, Collision Center, and AADA Leasing. We recognize that our employees define us; we cannot deliver a great customer experience without a talented team. The car industry is a constantly changing, fast-paced industry that offers fulfilling careers and competitive salaries. It is a huge industry with jobs available in all segments, room for growth, and a wide array of choices for both those who are looking to jumpstart an exciting career or change career paths. We offer a unique, diverse, and dynamic work environment.\nJob Summary \nDetail vehicles as per the requirements and quality assurance program determined by Lexus Reflections. This includes washing, waxing and/or polishing the exterior of the vehicle, and cleaning/shampooing the interior of the vehicle, as required satisfying customer needs and dealership expectations of high quality and workmanship.\nWhat we offer You will work in a dynamic workplace with people who live the values of our organization and will enjoy many of the benefits and opportunities at Tony Graham Automotive Group, including:\n\n Participation in TGAG group benefit plan after three months and participation in the\n RRSP/DPSP after two years\n Reimbursement of recertification and designation costs\n Professional development opportunities\n Staff discounts on new and used car sales and parts and service rates\n Paid birthday leave\n Employees can purchase parts on behalf of their family members and obtain the employee discount\n\nReasons why you’ll enjoy working with Tony Graham Automotive Group \n\n Career Development: Internal hiring is a big part of our recruitment process. We encourage our employees to strive for more challenging roles in the workplace\n The safety of our employees is our top priority. We ensure that we stay compliant with the Ontario Occupational Health & Safety Act and Regulations\n Paid Training/Professional development opportunities\n Paid birthday leave – We offer our employees to have the opportunity to take their birthday off paid\n Welcoming work culture & great workplace environment\n\nWhat you offer \nGeneral Responsibilities: \n\n Clean customer vehicles inside and out as per Lexus Reflections and/or Service Advisor guidelines\n Valet vehicles neatly and with care in delivery area or on lot in accordance with policy and best practices\n Maintain all clean-up areas including floors and benches, etc. in a clean, organized and safe fashion\n Return equipment to its appropriate place in good working order and condition\n Report to management any circumstance or condition that compromises the integrity or safety of the dealership, personnel, or customers\n Show common courtesy to all customers and dealership personnel and promote every aspect of the Tony Graham Automotive Group to the client\n Use the supplies and materials in a safe, practical, and economical manner\n Maintain a good work attitude and cooperate with the managers and fellow employees in the positive spirit of teamwork\n Work in compliance with all applicable policies, procedures and legislation\n Any other duties, as assigned\n\nThe successful candidate will have the following: \nEducation and Qualification \n\n Completion of Secondary School\n Valid Driver’s Licence and acceptable Driver’s Abstract\n Clean driving record, and reporting to management any circumstances regarding the status of this license\n\nLanguage \n\n Fluent in English, oral and written\n Bilingualism, an asset\n\nSkills & Abilities \n\n Mature personality and sound judgement skills\n Effective interpersonal and communication skills\n Automotive background required\n Ability to drive both standard and automatic transmissions\n Ability to maintain professionalism at all times\n Ability to work in a fast-paced environment and ensure attention to detail\n Good initiative, ambitious\n Strong team player with the ability to work independently\n Reliable, professional and responsible;\n\nSchedule: \nMonday – Friday:\nOpening Hours: 8:00 am – 5:00 pm\nOccasional Seasonal Saturday\nPay Structure: \n$16.55 - $18.00 per hour based on experience in the field\nPlus Production Bonus\n(Estimated Annual Income - $40,000)\nJob Types: Full-time, Permanent\nSalary: $16.55-$18.00 per hour\nBenefits:\n\n Company events\n Dental care\n Disability insurance\n Discounted or free food\n Employee assistance program\n Extended health care\n Life insurance\n On-site parking\n Paid time off\n RRSP match\n Store discount\n Vision care\n Wellness program\n\nSchedule:\n\n Day shift\n Monday to Friday\n Weekends as needed\n\nSupplemental pay types:\n\n Bonus pay\n\nAbility to Commute:\n\n Ottawa, ON (required)\n\nWork Location: In person"
}