{
    "id": "d88455d3a999456e",
    "company": "CBCL Limited",
    "positionName": "Intermediate Environmental Biologist/Scientist",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-01T20:09:04.311Z",
    "url": "https://www.indeed.ca/rc/clk?jk=d88455d3a999456e&from=jasx&tk=1he3lkogbirpe800&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=d88455d3a999456e&atk=&xpse=SoAE67I3IDja0EyimB0LbzkdCdPP",
    "companyDescription": "",
    "description": "We have an exciting opportunity in our Ottawa office for an Intermediate Biologist / Environmental Scientist specializing in Natural Science and Impact Assessment with expertise and experience in one or more of the following specialized areas: species at risk, wetlands, terrestrial, avian and aquatic biology, or climate change adaption. We are looking for someone to be part of our diverse and multi-disciplinary Environmental Sciences Team. At CBCL, we work as a collaborative team, and foster development of new skills and growing together. \n At CBCL Limited, we are a successful, dynamic, and multi-disciplined engineering and environmental firm, looking to grow our Ottawa team. Our employee-owned organization is driven by the values and passion of our employees. CBCL’s culture is shaped by our Atlantic Canadian roots, and our experience extends throughout Canada and the world. We are looking for someone with an entrepreneurial spirit that shares our corporate values of diversity, inclusion and improving the communities where we live and work. \n \n  \n Your Key Responsibilities: \n  \n  Provide consulting services in the capacity of an Intermediate Biologist related to the areas of expertise provided above including conducting field surveys and report preparation. \n \n \n  Support our clients with their Federal, Provincial and Municipal environmental legislation and policy requirements. \n  Provide technical direction and leadership to environmental project teams to achieve compliance with quality standards and relevant regulations. \n  Collaboration with other environmental team members and project managers from our various other engineering departments. \n \n \n  Mentor and direct some junior staff and collaborate with other environmental professionals on our Team. \n \n \n  Provide input related to growth opportunities, business development and planning. \n  Build and/or support client relationships. \n \n \n  Lead preparation of proposal submissions, including development of project scope, schedule, and budget, as appropriate. \n \n \n  Potential for travel throughout Ontario, Canada, and international locations. \n  Uphold CBCL’s safety culture and adhere to company safety protocols and programs and applicable health and safety regulations. Maintain compliance with specific client, and site-specific health and safety protocols and programs, as required. \n  \n \n Your Capabilities & Credentials \n  \n  A Bachelor’s or Master’s degree in Biology, Ecology, Zoology, Botany, or other Environmental/Applied Science. \n  Minimum of 5 years’ experience in environmental consulting or relevant environmental industry, including prior field experience such as wetland delineation and functional assessments, stream and culvert assessments, vegetation surveys, aquatic invertebrate collection and identification. \n \n \n  Biological Training and certifications relevant to one’s areas of practice, such as: \n   \n    Ontario Wetland Evaluation System (OWES) \n    Ecological Land Classification (ELC) \n    Butternut Health Assessment Expert and/or Experience \n    Ontario Stream Assessment Protocol (OSAP) \n    Ontario Benthos Biomonitoring Network (OBBN) \n    Electro-fishing certification \n   \n \n \n  Experience with Ontario Class Environmental Assessments. \n \n \n  Experience with the Natural Heritage Assessment under the Provincial Policy statements. \n \n \n  Strong team player with excellent interpersonal skills and strong oral and written communication skills \n  Strong analytical skills, attention to detail, problem solving, and decision-making capabilities. \n  Strong interpersonal, organization, and time management skills. \n  Highly professional demeanor with emphasis on client service and client profile management. \n  Eligible to obtain security requirements for contracting with the Government of Canada. \n  Applicant must have a valid Class G driver’s license. \n \n \n  Experience working on Canadian Federal Impact Assessments is considered a strong asset.\n \n  \n  \n  What we can offer you: A competitive compensation package effective on your first day of employment: \n  \n  \n   \n    Comprehensive health and dental benefits \n    Defined Contribution Pension Plan with employer contributions \n    Generous vacation allowance commensurate with experience \n   \n  Respect for work-life balance with flexible environment and remote work options \n  Employee ownership potential \n  Employer contributions towards maternity leave top up \n  Health and wellness incentive \n  Membership dues reimbursement \n  Education and lifelong learning subsidization \n  Community volunteering incentive \n  Employee Family Assistance Program\n \n  \n  \n  In addition to the above benefits, we offer: \n  \n  Flexible hours and locations to support work/life balance, including hybrid or remote options; \n  Diverse team with a wide range of experience and expertise; \n  Exposure to a variety of projects; \n  Support to develop skills and pursue projects related to your own interests; \n  Collaboration between multiple disciplines and levels of expertise; \n  Mentoring opportunities to foster your personal and professional development; \n  Accessible and central offices in Ottawa and Atlantic Canada; \n  Access to training opportunities in areas ranging from technical development to leadership skills.\n \n  \n  \n  About Us \n  As an employee-owned firm, at CBCL, our people are everything. We are committed to promoting inclusivity and diversity for a workplace where everyone can thrive, and we build long-term relationships with our clients while providing them with innovative solutions. \n \n  \n We have earned recognition as one of Canada’s Top 100 Employers and one of Canada’s Best Managed Companies. Our multitalented group of professionals offer consulting in the Infrastructure, Water and Wastewater, Buildings, Industrial, and Earth and Environment sectors. We value our people, our communities, and our history and look forward to continuing our steady growth.\n \n  Along with our commitment to reducing our carbon footprint corporately, CBCL develops and implements sustainable engineering solutions that respect the current social and environmental impacts, as well as future implications of our designs.\n  \n  \n  CBCL operates from its twelve offices in Ottawa, ON, Halifax and Sydney, NS; Charlottetown, PE; Saint John, Fredericton and Moncton, NB; and St. John's, NL,\n  \n  \n  CBCL Limited strives to provide a diverse workplace that is inclusive, accessible and celebrates individuals and what makes us unique. \n Accommodations are available upon request for candidates taking part in all aspects of the recruitment process. Please contact hr@cbcl.ca.\n  \n  \n We thank all applicants for their interest, but only those applicants who are selected to interview will be contacted."
}