{
    "id": "da75da556e1f3e0e",
    "company": "Fellow",
    "positionName": "Executive Assistant to the CEO",
    "jobType": [
        "Full-time"
    ],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-26T12:14:14.352Z",
    "url": "https://www.indeed.ca/rc/clk?jk=da75da556e1f3e0e&from=jasx&tk=1hl5dcuan2fci002&bb=meFSaZ2jpWfCb2DCBnnuQMc3KQwIZ6pZiNiHSk-yVuFLCloJ5ptDRvVP35uv6ylpZw_-nZOMtCYkRdI69eIfIk5aEL3qPz3YvPvngVm4MaG1B-R9jcjgcA%3D%3D&xkcb=SoA467M3FlS8FtXIwZ0KbzkdCdPP&vjs=3",
    "externalApplyLink": "https://fellowapp.bamboohr.com/careers/87?source=indeed&src=indeed&postedDate=2024-01-25",
    "companyDescription": null,
    "description": "Ottawa (Remote)\n \n  Executive Assistant to the CEO\n \n  Hey there I'm Aydin, Co-Founder and CEO at Fellow.\n \n  We are seeking a highly motivated and detail-oriented Executive Assistant to join our team and provide comprehensive support to our President and CEO.\n \n  This candidate will be highly professional and confidential with a proactive mindset, resourcefulness in problem-solving, and thrive in a fast-paced environment. They are exceptionally capable of prioritizing and managing a wide range of administrative and strategic tasks efficiently and with a high degree of confidentiality. This role will provide executive and administrative support in planning and overseeing projects, meetings, communications and travel requirements established by the CEO.\n \n  We're hiring remotely across Canada, but have offices and co-working spaces available in Ottawa, Montreal, and Toronto where you can pop in to work with other Fellow employees when you want some in-person time! We have a preference for candidates in Ottawa where most of our staff is currently located but will consider other Canadian locations as well.\n \n  Key Responsibilities:\n  \n \n  \n   Provide high-level executive administrative and strategic support to the CEO \n  Ensure strict confidentiality and the utmost discretion is maintained in the handling of sensitive information, and in communicating with all stakeholders \n  Schedule and coordinate meetings, appointments, and travel arrangements \n  Maintain an organized filing system for easy retrieval of files on Google Drive \n  Help manage the social media accounts for the CEO (Twitter, LinkedIn, Instagram). \n  Help in managing the CEOs email inbox and calendar / schedule. \n  Organize and coordinate client events, team meetings and workshop sessions \n  Use professional judgment to screen, prioritize and determine actions for incoming inquiries \n  Adopt a continuous improvement mindset and look for ways to improve administrative ways of working \n  Help in facilitating and preparing for meetings and presentations\n \n  \n  \n  What we are Looking for: \n  \n  Proven experience as an executive assistant or similar role, with experience supporting C-level executives \n  Strong written and verbal communication skills \n  Proficiency in social media management (Twitter, LinkedIn, Instagram) \n  Easily and agilely pivot between competing priorities \n  Strong interpersonal skills with the ability to build relationships at all levels \n  Sense of urgency and the desire to deliver \n  Exceptional organizational and multitasking abilities \n  Strongly proficient in Google Suite and other relevant software \n  Ability to work independently and handle confidential information with discretion \n  Bachelor's degree or equivalent experience preferred\n \n  \n  \n  What is Fellow? \n  Fellow.app is a software company that helps teams and organizations level-up their meeting habits to drive productivity, engagement, and accountability—before, during, and after every meeting.\n \n  With Fellow, great meetings are just the start. Our product is the #1 meeting management software on G2, and is trusted by the world’s best teams.\n \n  Established in 2017, our team works remotely from cities across Canada, guided by our mission: Make Work Better for Everyone—and that includes our own employees! We’re an ambitious team building the next big thing and we'd love to have you on this journey with us.\n \n  Equal Opportunity Employer \n  At Fellow, we understand the value of having a diverse team. That’s why we believe in providing equal opportunity employment regardless of race, national or ethnic origin, colour, religion, age, sex, sexual orientation, gender identity or expression, marital status, family status, genetic characteristics, disability, and conviction. Please let us know if you require accommodation during the recruitment process."
}