{
    "id": "e19e23f089fb553b",
    "company": "Isologic Innovative Radiopharmaceuticals",
    "positionName": "Night Shift Lab Technologist - Radiopharmacy - Lab Technician",
    "jobType": [],
    "location": "1053 Carling Ave, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-08-25T06:50:52.262Z",
    "url": "https://www.indeed.ca/rc/clk?jk=e19e23f089fb553b&from=jasx&tk=1hb2v8b7g2ap3005&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "ISOLOGIC Innovative Radiopharmaceuticals is a nationwide radiopharmaceutical company, dedicated to nuclear medicine and the science of Radiopharmaceutical production. Our commitment to these fields extends to the communities we serve. We utilize our significant experience, expertise and networks in Nuclear Pharmacy to provide our customers and patients with reliable; safe and high quality radiopharmaceutical products and services. This position is for a full-time permanent role with rotating shifts (8am to 4pm, 2:45am to 11:15am, 4am to 12:20pm).\nKey Duties & Responsibilities\n\n Sets up, prepares and dispenses radiopharmaceuticals\n Handles and packages radiopharmaceuticals and hazardous materials in compliance with Company policies, corporate standards and Health and Safety rules\n Exemplifies compliance with all regulations, Company policies, Corporate standards and Health and Safety rules\n Processes returned medical waste and maintains returned reusable supplies in compliance with all regulations and Company policies\n Maintains cleanliness of the laboratory in accordance with the facility housekeeping schedules\n Manages bio-hazardous waste and prepares paperwork for its ultimate disposal\n Performs inventory control by reviewing and documenting/verbalizing stock needs to pharmacy personnel\n Completes radiation wipes and surveys on shipping containers, pharmacy supplies, incoming packages, work spaces and vehicles\n Actively participates in maintaining a safe work environment by completing required training, providing suggestions for improving the Quality and EHS program\n Performs quality control tests on equipment and prepared products\n Performs leukocyte labeling procedures\n Supports Facility Operations by performing data entry into computer system\n Follows aseptic garbing, personnel hygiene and aseptic control procedure at all times while working in the restricted area\n Complies with Quality Manual, Quality Management System, Quality Management Policy, applicable laws and regulation, as they apply to this role\n Completes all required Quality & Compliance training within the defined deadlines\n Identifies and reports any Quality & Compliance concerns to on-site Manager, Quality\n Receives and processes radiopharmaceutical Active Pharmaceutical Ingredients (API), when required\n\nExperience and Education Required\n\n College diploma in a related field\n Certified Nuclear Medicine Technologist (CNMT) or current enrollment in an accredited Nuclear Medicine Technologist Program, an asset\n Experience in handling radioactive materials\n Experience in the preparation, dispensing, shipping and receipt of radiopharmaceuticals, an asset\n Ability to accommodate shift changes based on business needs, variable hours starting from: 8am to 4pm, 2:45am to 11:15am, and 4am to 12:20pm\n Strong interpersonal skills with an emphasis on effective communications and ability to work with diverse personalities and skill levels.\n\nJoining the ISOLOGIC team means adhering to a friendly, productive and stimulating work environment while enjoying favorable conditions such as a dynamic and flexible environment for continuous improvement, where your new ideas and know-how will be encouraged; Challenges up to your talent that will make a real difference;\nJoin our talent team and send us your resume as soon as possible\nBenefits:\n- Location offers onsite cafeteria and coffee shops\n- Central location in Ottawa\nOnly those candidates selected for interviews will be contacted.\nWe are an equal opportunity employer.\nOUR VALUESDRIVE OUR DAILY ACTIONS AND DECISIONS\nETHICS AND INTEGRITY, CUSTOMER FOCUS, COLLABORATION, INNOVATION, PASSION, EXCELLENCE\nJob Types: Permanent, Full-time\nBenefits:\n\n Dental care\n Disability insurance\n Employee assistance program\n Extended health care\n Life insurance\n On-site gym\n On-site parking\n RRSP match\n Vision care\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n 8 hour shift\n Night shift\n\nSupplemental pay types:\n\n Overtime pay\n\nCOVID-19 considerations:Isologic maintains an aseptic environment in the laboratory and has measures in place to follow the recommended Public Health guidelines for Covid-19.\nWork Location: In person"
}