{
    "id": "e654aa8967c0f0fd",
    "company": "Serco North America",
    "positionName": "Sr. Marine Electrical Engineer",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-17T18:51:20.402Z",
    "url": "https://www.indeed.ca/rc/clk?jk=e654aa8967c0f0fd&from=jasx&tk=1hcvfjcolkedt800&vjs=3",
    "externalApplyLink": "https://careers-sercocanada.icims.com/jobs/60781/job?utm_source=indeed_integration&iis=Job%20Board&iisn=Indeed&indeed-apply-token=73a2d2b2a8d6d5c0a62696875eaebd669103652d3f0c2cd5445d3e66b1592b0f",
    "companyDescription": "",
    "description": "Position Description : \n \n   Are you seeking a hybrid opportunity working in a fast paced, team based multi disciplined environment, while collaborating with others and supporting the navy, coast guard, and commercial customer? Serco has a great opportunity for you!\n \n \n \n   This position is contingent upon your ability to obtain/maintain Canadian Security Clearance (Reliability/Controlled Good or higher).\n \n \n \n   The Electrical Engineer will work with teams of less experienced and more experienced technical staff to which the individual is assigned and applies knowledge of marine electrical engineering to perform routine analyses and prepare deliverables in support of the design and analysis of ships, craft, and other floating structures.\n \n \n \n   Serco supports multiple customers including government customers and shipyards in designing ship, craft and other floating structures.\n \n \n \n   You will be part of a team working for a Ship Design Manager or Engineering Manager designing ships, or ship systems and working closely with the customer and other Serco teams.\n \n \n \n   You will apply basic electrical engineering knowledge in accordance with applicable regulatory body rules, regulations, and industry standards, and will use electrical engineering tools and software to develop analyses and products in one or more technical areas.\n \n \n \n   In this role, you will:\n \n \n   Apply basic electrical engineering knowledge in accordance with applicable regulatory body rules, regulations, and industry standards to develop analyses and products in one or more technical areas.\n   Work in a collaborative environment providing technical support coordinating design components with a multi-disciplinary team, stakeholders, and customers to generate integrated reports, drawings, and analyses.\n   Support the design, develop, and evaluate design components related to electric propulsion systems, propulsion and machinery control systems, power generation and distribution systems, various auxiliary electrical systems, and related equipment of marine vessels. Support design products and deliverables such as electric plant load analysis; fault current calculations; circuit breaker coordination studies; transient stability analysis; various electrical diagrams including power, lighting, communications; electrical system and equipment specifications for ship new construction, modification, and/or repair.\n   Provide electrical engineering project support as needed with clients, equipment vendors, and shipyards.\n   Travel occasionally for ship checks, ship visits and surveys and shipyard Design Reviews.\n   Work in per person at any customer’s premises or support them remotely as per the project requirements.\n   Provide support to marine electrical designer team members.\n   Mentor younger less experienced Electrical Engineers.\n   Ensure primary consideration is given to Health, Safety, and Environmental issues in all activities undertaken within areas of responsibility.\n   Participate in scheduled project review sessions and meetings with representatives from other engineering disciplines and customers on technical and engineering issues.\n   Prepare documentation, reports, and project plans to describe activities planned and accomplished, status reports, letters, memoranda, messages, and contact reports.\n   Preparation and presentation of formal briefings and staff seminars\n   Complies with all corporate policies and procedures, including quality assurance and security procedures, in the performance of duties.\n  Qualifications : \n \n   To be successful in this role, you will have:\n \n \n   A Bachelor’s Degree in Electrical Engineering or related engineering field and up to 4 years relative work experience is required in the design of marine electrical systems with a professional engineering firm, shipyard, or marine electrical contractor developing products related to the electrical drawings, electrical distribution system analyses, and supervision of work being undertaken by junior electrical engineers. (In some cases, educational requirements may be adjusted or waived for more than 7 years applicable work experience.)\n   Must be able to obtain Canadian Security Clearances (Reliability/Controlled Good or higher) maybe considered an asset or maybe required for the role.\n   Must have experience with ship checks, ship visits and surveys and shipyard Design Reviews.\n   Travel may be required up to 25%.\n \n \n   Knowledge, Skills, and Abilities:\n \n \n   Ability to apply basic electrical engineering knowledge in accordance with applicable regulatory body rules, regulations, and industry standards to develop analyses and products in one or more technical areas.\n \n \n   Additional desired experience and skills:\n \n \n   Possessing a Professional Engineer’s designation is considered an asset.\n \n \n   If you are interested in supporting and working with a diverse and passionate Serco team- then submit your application now for immediate consideration. It only takes a few minutes and could change your career!\n \n \n \n   **Serco Inc. is using this posting for the purpose of responding to a proposal. We are seeking qualified candidates in the event of a contract award. This position is not currently funded/active. Should Serco be awarded the contract, and you meet the qualifications of the position, you will be considered in the selection process. **\n  Company Overview : \n \n   Serco Inc. (Serco) is the Americas division of Serco Group, plc. In North America, Serco’s 9,000+ employees strive to make an impact every day across 100+ sites in the areas of Defense, Citizen Services, and Transportation. We help our clients deliver vital services more efficiently while increasing the satisfaction of their end customers. Serco serves every branch of the U.S. military, numerous U.S. Federal civilian agencies, the Intelligence Community, the Canadian government, state, provincial and local governments, and commercial clients. While your place may look a little different depending on your role, we know you will find yours here. Wherever you work and whatever you do, we invite you to discover your place in our world. Serco is a place you can count on and where you can make an impact because every contribution matters.\n \n \n \n   To review Serco benefits please visit: https://www.serco.com/na/careers/benefits-of-choosing-serco. If you require an accommodation with the application process please email: careers@serco-na.com or call the HR Service Desk at 800-628-6458, option 1. Please note, due to EEOC/OFCCP compliance, Serco is unable to accept resumes by email.\n \n \n \n   Candidates may be asked to present proof of identify during the selection process. If requested, this will require presentation of a government-issued I.D. (with photo) with name and address that match the information entered on the application. Serco will not take possession of or retain/store the information provided as proof of identity. For more information on how Serco uses your information, please see our Applicant Privacy Policy and Notice.\n \n \n \n   Serco does not accept unsolicited resumes through or from search firms or staffing agencies without being a contracted approved vendor. All unsolicited resumes will be considered the property of Serco and will not be obligated to pay a placement or contract fee. If you are interested in becoming an approved vendor at Serco, please email Agencies@serco-na.com.\n \n \n \n   Serco is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics."
}