{
    "id": "e6c8debc5eb90b6a",
    "company": "FedEx Ground Careers Canada",
    "positionName": "Ops Manager - Station PT",
    "jobType": [],
    "location": "1031 Moodie Drive, Nepean, ON",
    "salary": null,
    "postingDateParsed": "2023-10-07T02:03:52.641Z",
    "url": "https://www.indeed.ca/rc/clk?jk=e6c8debc5eb90b6a&from=jasx&tk=1hc6gclvdih64800&vjs=3",
    "externalApplyLink": "https://groundcareers.fedex.ca/groundcareerscanada/jobs/25736-598428?lang=en-ca&codes=Indeed",
    "companyDescription": "",
    "description": "Position Title: Ops Manager - Station PT\n  \n  Job Summary\n  This is a frontline manager position that supports the FedEx Ground (FXG) Safety Above All Culture and manages specific day-to-day operations and an assigned staff within a station or hub. Responsible for ensuring safe and efficient package sortation through the management of Package Handlers. The Operations Manager may also manage administrative employees and functions and ensures administrative processes are compliant with FXG policies and procedures and governmental regulations.\n  Essential Functions\n  • Management responsibilities include, but are not limited to: hiring, terminations, coaching, skills development, recognition and rewards, performance evaluation and management, discipline, addressing employee concerns and staff productivity • Plans, organizes, staffs, directs and controls the day-to-day operations of the hub • Responsible for managing and assigning employees to ensure the efficient sortation of packages through the facility, minimizing operational cost and maximizing operational quality, including (in conjunction with the linehaul department) the movement, tracking and administration of trailers • Analyzes operational performance through direct observation, interpretation of reports and collaboration with others. • Determines opportunities for improvement of key metrics and executes action plans to achieve results Educates hub staff, including other management employees, and ensures compliance with all FXG policies/procedures and applicable governmental regulations. • Leads daily employee and/or planning meetings to ensure workforce communication and understanding of operational updates and daily goals • Participates in the development of and responsible for administering company employee relations strategies, including maintaining the confidentiality of such material and matters • Investigates, resolves and/or escalates customer service issues, as appropriate. • Responsible for training new employees regarding job duties and performance expectations and ensuring compliance with FXG policies, procedures and other training requirements, including but not limited to training related to quality assurance, SWAK, hazardous materials, and dock safety.\n  Minimum Education\n \n  High school diploma or GED required; Bachelor’s degree in Business, Logistics or a related area preferred.\n \n  Minimum Experience\n  • 6 months experience as a Package Handler at FedEx Ground OR • 6 months experience working in a fast-paced environment such as retail, hospitality, fulfillment center, warehouse, dock, or stock room/stock functions OR • Military experience with honorable discharge OR • Supervisory experience OR • Certification program or Associate’s degree in a related area or 2+ years of college courses towards a degree (in lieu of experience) • Prefer candidates with a Bachelor’s degree\n  Required Skills, Abilities and / or Licensure\n  • Ability to inspire a shared vision and empower and motivate a team • Demonstrated ability to build professional rapport, effectively lead a team and positively influence diverse groups • Proven ability to apply sound business judgment to establish and accomplish goals • Customer service skills necessary to effectively and professionally respond to requests and issues verbal and written communication skills necessary to communicate with various audiences and ability to effectively provide employees instruction on process and practice • Ability to read, interpret and draw conclusions from numerical data and written information • Software skills, including use of Microsoft Office software and web-based applications • Ability to maintain a working knowledge of relevant technology-based projects, including various devices and computer-based applications • Ability to mentor, coach and act as a knowledge resource to other employees.\n  Address: 1031 MOODIE DR\n  \n City: NEPEAN\n  \n State: Ontario\n  \n Zip Code: K2R 1H4\n  \n Domicile Location: FXG-CAN/CAN/Q6114/Nepean\n  \n Auto req ID: 397376BR\n  \n Position Type: Full time\n  \n Employee Type: Non-Exempt\n  \n  Other Job Description Information\n  Ops Manager Schedule: Monday to Wednesday: 2.30 am to 11:00 am Saturday: 1:00pm to 7:30 pm  This is a Permanent Part Time position. This job is being reposted today and previously applied candidates need not reapply again.\n  EEO Statement: FedEx Ground is an equal opportunity employer"
}