{
    "id": "ec85158ef7d47154",
    "company": "Chemistry Industry Association of Canada",
    "positionName": "POLICY MANAGER, CHEMICAL HEALTH & DATA MANAGEMENT",
    "jobType": [],
    "location": "45 O'Connor Street, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-11-17T20:15:19.708Z",
    "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0D_-rtxMQueR7L_4Z_qOlRSnTmRo416G9BMeJ2Vbt_ot5NM3O_df7cYCwKpv9Qj2L2_0L6bBOQVDkLJgqIUFpCvqaZvRlsoOfSy_7arhif3d0GkaTS_l01FCgYbc65y9MBw5ZdLec06r5HXAjouTKXljMh184J3xXRMmawTaW-FBR3V7myXwD42givRj7Ciltn6UgbezNaBY0PDt9ie6mjoOr9tknVe5kpvdamczuUZFIdWwPv8aNUZykp7cX1QtjqiDAaVPNXv9RXzMPVqP9gV-ZiBcavzXdFHAQZTa_I_0NPEag-C7BA9kTGO8IbQFZJPXYULPfijGocH_dqkXPejNG7-ovCEU3L4UBRcHm4rFOeIdrWOeY1YZ9WMQrrfyNWGES8DZa3cKot_5sbschdj5aQJnu8YhOfhyry5m5I6lyREhDuq0e-XqyuxSfBcCvkW0Btgqa69UtGgT55wWdFlDoEx8J_yQh5M0Jzr_OWBL30AeKwOE9dv4WvaC7ClTN1dL4_W6K8UZH4RSwa7xM_JhSG-DbG8M07ZMMC4LgGaGkQGwt8EPP5YR5jLLT3IgytuadCuubGd6o2Yt7ucIU9P0ODq837wjEWfdM3Ln39AzK2hcoSN-m98psivaX527ywPOsUL8IlqslEohzWPm18yEhC4O29DP6wIlaHyMTqV1Wd4CNxPQILo&xkcb=SoDU-_M3HYiGO6QY9B0NbzkdCdPP&p=6&fvj=1&vjs=3&jsa=6529&tk=1hgol2euhk7i3800&from=jasx&wvign=1",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "Issue Awareness\nIdentify, interpret, and communicate to CIAC staff and member companies’ new developments in the chemicals, health and environment fields including actual or proposed policy initiatives by federal or provincial governments likely to have an impact on the chemical sector.\n· Build a sound knowledge of the health and environmental Acts, policies and regulations that affect the chemical sector (e.g., CEPA (Canadian Environmental Protection Act)).\n· Obtain an in-depth knowledge of the member and partner companies and their key personnel, their products, and environment and health data.\nPolicy Advocacy\n· Work closely with the Vice President, Policy to align CIAC advocacy and policy outreach.\n· Establish and maintain relationships with key officials in federal and provincial departments, such as Health Canada, Environment and Climate Change Canada, Ontario Ministry of Environment and Climate Change, etc., to stay abreast of government’s intentions with respect to chemical, environment, and health issues within Canada and internationally.\n· Contribute to the visibility and credibility of CIAC and the chemistry industry as responsible stewards in chemical safety and environment.\n· Manage key current issues that are of importance to CIAC: GHS (Global Harmonized System), CEPA and CMP (Chemicals Management Plan) (Canadian Environmental Protection Act and Chemical Management Plan).\n· Work with Regional Directors and their environmental quality committees (Alberta, Ontario, and Quebec) to ensure that the members are kept informed on the latest information related to the environment and that regional issues are managed consistent with national policy.\n· Work with the Plastics Division on those issues where chemicals and plastics policy and regulations intersect.\nInformation Gathering and Analysis\n· Build an awareness of the information sources available with respect to the health and environmental issues of the Canadian chemistry industry.\n· Understand and provide analysis as needed for CIAC’s NERM (National Emissions Reduction Measures) data as well as additional data from key sources such as Statistics Canada, the American Chemistry Council (ACC) and the European Chemistry Industry Association (CEFIC).\n· Follow and notify members of any relevant notices in the Canada Gazette related to chemicals, health, and environment.\nSupporting Policy Development\n· Building on issue awareness and information gathering activities, provide input to CIAC Technical Management Committee, and related regional groups, their CIAC leads and Chairs.\n· Provide administrative support (including agenda setting and document management) to CIAC’s environment and health committees including the Technical Management Committee.\n· Through participation on such committees and groups, translate member company inputs into draft positions / messages for further consideration and refinement by the issue leads and members.\n· Refine and finalize policy positions, submissions, communications and supporting analysis to facilitate CIAC engagement in the advocacy process.\n· Prepare written materials (reports, presentations, briefing notes, etc.) to support issue leads’ engagement in the advocacy process.\nCommunications\nEnsure CIAC activities, outputs, positions, and advocacy are regularly and accurately included in CIAC’s broader communications activities.\nJob Types: Full-time, Permanent\nSalary: $80,000.00-$90,000.00 per year\nBenefits:\n\n Commuter benefits\n Dental care\n Disability insurance\n Employee assistance program\n Extended health care\n Language training provided\n Life insurance\n Paid time off\n RRSP match\n Tuition reimbursement\n Work from home\n\nSchedule:\n\n Monday to Friday\n\nSupplemental pay types:\n\n Bonus pay\n\nEducation:\n\n Master's Degree (preferred)\n\nWork Location: Hybrid remote in Ottawa, ON K1P 1A4"
}