{
    "id": "f26e9cc521035a7d",
    "company": "Dynacare",
    "positionName": "Maintenance Coordinator",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-17T18:52:36.057Z",
    "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0CteEWC8UOe8di1Viq7t7vWxBuOVoI1Zb0qscJbkr2nD-C-nnwRu8o2YKgq3QcvygInARS4dp4bbuxtJs2rFCydpsZKSr3t4GOx2YDuMGvey0EgH_UbRErVh9gac6P5DdFpklwmN1gC9Cb9HIyzzKBevxhJhP7QfCCtbKIoDy0Ot6AvOS9Zh8_MqwApntbmX_r3mmXMkCSjou3OSDa3NbaIX5LheCuMhTEdTfP525Q92G5yfZK44cMS882WTYZsyJ2Ele3so22GTdCIw07HFjmph_lPf2JI3Wo8izmv2AKpndXJdpSTod2gcQmPPeovT13lndXwHEJzbWduy-YSUeLGqyuCazazdIiDs_Q3PwVa7tU9zcN0Rw034U-ugwriG8ieGrR1tvdNyf699nZalqd-GpZ9mhl6CCDKHLgyOXJ_LTs_Tyxzjje_uwNaPgmFIjqEXUtSRiB3vW96z4SeHhYCih19uaNkdzvOj-PE_4_jBcdCPS2dxLJ4Yb43RaunbAF8sRD13rQHoTVyTYVGtxdPjS4QIdbpntycXoJ5tGDR29YMpdCrhPPU_yv-TYWwMtk5ogG4JBxYC5cJ84uo7IiUC8cs-s6H4jfnD7QciAolQKEZnEJnWztC6iM5SS0OPbIFpvECi2w1G48zdJwBJLj8jegqVGIv7YIw-T7gSPNtcrB6UiaE1fVphU2C_OvjzjEa5ZB4YP1EB4pi0XammMwGJGKswk5YA7TKOBX0bdba-w%3D%3D&xkcb=SoAo-_M3JfXU1FAfDL0KbzkdCdPP&p=1&fvj=1&vjs=3&jsa=3806&tk=1hcvfmobuk25q800&from=jasx&wvign=1",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "Dynacare is currently looking to hire a Maintenance Coordinator to join our team in Ottawa, Ontario. This is a Permanent Full-Time (Benefit eligible) opportunity working Monday-Friday, 8:30 am - 4:30 pm (shift change and weekends work - may be subject to change to meet the operational needs of the department).\nJOB SUMMARY:\nThis role is responsible to oversee all aspect of the operation, maintenance and repair of all critical and non-critical base-building mechanical, electrical, plumbing, life-safety and security infrastructure, including all Lab and office spaces, and other support spaces. Under the supervision of the Facilities Manager, this role will manage outside contractors, including maintaining records, contracts, coordinating project activities, and providing scheduling support.\nKEY RESPONSIBILITIES/ACCOUNTABILITIES:\n\n Coordinate, supervise and perform preventative and corrective maintenance activities on all facilities critical and on-critical infrastructure base-building mechanical, electrical, plumbing, life-safety and security infrastructure, including all office spaces, external parking facilities and other support spaces. Maintain equipment & furniture.\n Respond to maintenance request from departments and perform routine maintenance and handyman duties in main laboratory and stations including minor plumbing and electrical work in a timely manner.\n Perform security badge and access assignments and related database management tasks, coordinate and organize building maintenance and office records.\n Under the supervision of the Facilities Manager, manage all outside contractors in support of the Facilities Department, including maintaining records and contracts, coordinating project activities, and providing scheduling support.\n Ensure that the main laboratory premises are kept clean and safe by supervising and monitoring the activities of the contract daytime cleaner to ensure that the schedule is followed, including contact them to respond to any issues that may occur.\n Set up chairs, tables, overhead projectors, video screens and white boards as and when required.\n Support Snow and ice removal from drive and walkways as required.\n Act as key Health, Safety and Environmental emergency response team member\n\nKNOWLEDGE, EDUCATION AND EXPERIENCE:\n\n In-depth knowledge of base building infrastructure systems and equipment: all critical and non-critical base-building mechanical, electrical, plumbing, life-safety and security infrastructure, including all office spaces, external parking facilities and other support spaces.\n Post-Secondary school education in a Community College or University or Trades-School preferred\n Proficient in operating building automation systems, managing and maintaining Heating, Ventilation and Air Conditioning systems.\n Basic computer skills as well as knowledge\n Experience in operating Computerized Maintenance Management Systems (CMMS – ServiceNow), the Building Management Systems (BAS), and security access control systems (Access control, CCTV, etc.), an asset\n Ability to read and interpret blueprints, drawings and specifications.\n Valid driver’s License\n\nSocial Process Skills\n\n Excellent communication skills required.\n Customer-focused and customer-service oriented\n Ability to multi-task in a complex laboratory and office environment\n Ability to deal with others effectively.\n Demonstrated ability to work independently and apply sound decision-making principles.\n Demonstrated high level of interpersonal skills required to succeed in a collaborative working environment.\n Demonstrated ability to self-manage and prioritize in a result driven environment.\n Pro-active team player\n\nWORKING CONDITIONS:\n\n Normal office environment\n Medical laboratory environment\n Exposure to infectious and hazardous materials, dirt, fumes, garbage in the laboratories\n Exposure to extreme temperatures\n Road conditions (driving to stations)\n Supervise all aspects of building cleaning, landscaping, snow removal and upkeep.\n Clean-up of all types of spills including chemicals if a member of the spill team is not available.\n\n_*Please note that a Criminal background verification & clear drivers abstract must be met as a condition of employment*_DNA of an Ideal Dynacare EmployeeI make a difference in people’s lives. I am a caring, collaborative team-player who is passionate about quality and continuous improvement.\n\n Caring - I demonstrate strong empathy and genuine concern for my colleagues, patients and customers.\n Collaborative Team Player - I know I play a key role in helping the Dynacare team achieve success. I am comfortable in a changing environment, and I can easily manage multiple priorities.\n Passion for Quality and Continuous Improvement - I am always looking to learn and solve problems. I am detailed oriented, adaptable and find ways to make things better.\n\nDynacare has been a “Top Employer” for many years and there is a reason why. We are a great place to work.\nAt Dynacare, we’re proud to hire the best people. If you are looking for a meaningful career where you can support healthy lives with commitment and care – we would like to meet you. To apply for this position, you will be asked to submit your resume and complete the application process.\nIf your qualifications and experience fit with this position, we will contact you to learn more. We offer competitive pay and great benefits, along with the opportunity to grow and thrive with a dynamic, successful company. We hope you will join us in our journey to become Canada’s health and wellness solutions leader.\nDynacare is proud to be an equal opportunity employer committed to the attraction, selection, advancement and fair treatment of all individuals. We believe that our diversity is our strength so we employ a diverse workforce and respect the needs of all our employees.\nIn accordance with the Ontario Human Rights Code, Accessibility for Ontarians with Disabilities Act and the Dynacare Accommodation Policy a request for accommodation will be accepted as part of the Dynacare hiring process.\nJob Type: Full-time\nBenefits:\n\n Dental care\n Employee assistance program\n Extended health care\n Life insurance\n On-site parking\n Paid time off\n RRSP match\n\nSchedule:\n\n Day shift\n Monday to Friday\n Weekends as needed\n\nApplication question(s):\n\n What are your salary expectation range?\n\nLanguage:\n\n French (preferred)\n English (preferred)\n\nWork Location: On the road"
}