{
    "id": "f897e426ddc5dd9a",
    "company": "Le Petit Salon",
    "positionName": "Client Experience Manager",
    "jobType": [
        "Permanent",
        "Full-time"
    ],
    "location": "380 Elgin Street, Ottawa, ON",
    "salary": "$50,000 a year",
    "postingDateParsed": "2024-01-25T12:16:12.382Z",
    "url": "https://www.indeed.ca/rc/clk?jk=f897e426ddc5dd9a&from=jasx&tk=1hl5di2e1lllk800&bb=zpJiOyyz_0fgQiL3EewKgKCw5xRuRFYpqHN1PF0O8YAlL0-uhCIDPCC4skJpsG-n0lFm5HsTygxfUAN7XwOsGkPM3nemQ8sNs7nB5l-KQuV0xXBwr_a4nw%3D%3D&xkcb=SoBL67M3FlTHimWfyB0BbzkdCdPP&vjs=3",
    "externalApplyLink": null,
    "companyDescription": null,
    "description": "ROLE OVERVIEW\nAs the Client Experience Manager at Le Petit Salon, your mission is to cultivate an exceptional salon atmosphere that stands out in the beauty industry. This role goes beyond managing operations and dives into creating an environment where each client's visit is not just an appointment but a high-end and personalized retreat.\nYour leadership and strategic vision are crucial in setting the tone for a premium client experience. You will ensure that every detail, from the greeting at the door to the final farewell, is carefully curated to reflect the salon's commitment to luxury and individual attention. Your role is to empower your team to deliver services that not only meet but surpass client expectations, turning every visit into a memorable and transformative experience.\nYour focus on nurturing a culture of excellence and attention to detail will make Le Petit Salon the go-to destination for clients seeking a blend of top-tier beauty services and an unrivaled salon journey.\nKEY RESPONSIBILITIES\nClient Experience Strategy:\n\n Design and implement strategies to elevate the client journey, ensuring a seamless, luxurious, and personalized experience.\n\nTeam Leadership:\n\n Lead and motivate the support staff, instilling a culture of excellence, teamwork, and ongoing improvement.\n Treat all clients, co-workers, and management with respect, professionalism, and kindness.\n\nService Quality Assurance:\n\n Uphold the highest service standards, swiftly addressing issues to maintain client loyalty.\n\nTraining and Development:\n\n Equip support staff with the necessary skills and knowledge to deliver outstanding service.\n Participate in training sessions and team meetings.\n Develop and continuously improve the client experience by updating procedures and training material.\n\nClient Feedback Management:\n\n Collect and utilize client feedback to enhance service quality and satisfaction.\n\nOperational Efficiency:\n\n Oversee client-facing salon operations, including appointment management, reception duties, and overall salon upkeep.\n\nClient Relationship Management:\n\n Cultivate, nurture and maintain relationships with clients, promoting loyalty and repeat business.\n\nStaff Management & Coordination:\n\n Ensure cohesive teamwork between support staff and stylists to meet client expectations effectively.\n Conduct regular staff evaluations and provide constructive feedback.\n\nCustomer Service:\n\n o Work hands-on at the reception desk and perform duties that meet and exceed Le Petit Salon’s client experience standards.\n\nDriving Sales:\n\n Implement strategies and techniques to boost salon sales and promote upselling of products and services.\n\nLabour Management:\n\n Optimize staff scheduling and workload distribution to ensure operational efficiency without compromising service quality.\n\nAdministrative Duties, Payroll, and Scheduling:\n\n Manage administrative tasks, payroll processing, and support staff schedules.\n Manage time-off and vacation requests without impacting salon operations.\n\nBusiness Development:\n\n Identify growth opportunities and spearhead new business initiatives through client relationship management tactics.\n\nProblem-Solving and Conflict Resolution:\n\n Consistently exhibit a solution-oriented attitude when facing challenges.\n Address and resolve internal conflicts swiftly, ensuring a harmonious work environment.\n\nSocial Media Management:\n\n Engage with and expand the online community by managing Le Petit Salon's social media platforms, ensuring consistent, brand-aligned content creation, prompt responses to inquiries, and active participation in relevant conversations.\n\nMiscellaneous \n\n Exhibit flexibility, handling tasks or responsibilities as assigned by ownership.\n Handle money and company property with respect and the highest level of honesty and integrity.\n\nQUALIFICATIONS AND SKILLS\n\n Previous Experience: Previous management experience in a salon environment.\n Effective Leadership and Team Management: Proven capability in leading a team, fostering a supportive and growth-oriented environment.\n Passion for Customer Service: Demonstrated enthusiasm for cultivating customer loyalty through best-in-class service experiences.\n High School Diploma or Equivalent\n Active Listening: Effectively understanding and addressing customer needs based on their verbal and non-verbal cues.\n Sales Ability: Knowledgeable in suggesting additional products/services to guests, improving their experience and the establishment's sales.\n Customer Service Expertise: Extensive experience in customer service or client relations, particularly in a luxury or high-end service setting.\n Communication Skills: Exceptional ability in engaging with clients and staff, ensuring clear, positive, and effective communication.\n Industry Knowledge: Understanding of salon services, operations, and market trends.\n Technical Proficiency: Skilled in using salon management software and modern tools for efficient operation.\n Organizational Skills: Aptitude for managing various tasks, ensuring smooth salon operations and client satisfaction\n\nPERSONAL QUALITIES\n\n Solution-Oriented: Ability to approach challenges with a positive, problem-solving mindset.\n Strong Leadership: Lead by example, inspiring trust and confidence among the team.\n Detail-Oriented: Maintain a keen eye for detail in every aspect of salon operations.\n Excellent Communication: Ability to communicate effectively with staff, clients, and Upper Management.\n Integrity: Uphold the highest standards of honesty and ethical behavior.\n Commitment to Growth: A strong believer in continuous personal and professional development.\n Customer-Centric: Always Prioritize and champion the wellbeing and loyalty of clients.\n Openness to Feedback: Welcomes feedback, seeing it as an avenue for personal growth and excellence.\n Stress Resilience: Maintains composure during busy or high-pressure situations.\n Engaging Personality: Easily establishes rapport with clients, making their experience feel personalized.\n Team Spirit: Works harmoniously with the entire Le Petit Salon team\n Passion for Learning: Eager to expand knowledge on the latest industry trends.\n Adaptability: Flexible in responding to the dynamic needs of the salon and client requests.\n\nJob Types: Full-time, Permanent\nSalary: $50,000.00 per year\nBenefits:\n\n Dental care\n Disability insurance\n Extended health care\n Life insurance\n Paid time off\n Vision care\n\nSchedule:\n\n 10 hour shift\n 8 hour shift\n Day shift\n Evening shift\n Monday to Friday\n Morning shift\n Weekends as needed\n\nSupplemental pay types:\n\n Bonus pay\n\nApplication question(s):\n\n Do you live in the Ottawa-Gatineau area?\n\nExperience:\n\n Customer service: 1 year (required)\n Hair styling: 1 year (required)\n\nLanguage:\n\n English (required)\n\nAbility to Commute:\n\n Ottawa, ON K2P 1N1 (required)\n\nWork Location: In person\nExpected start date: 2024-02-05"
}