{
    "id": "f9a1dc315fdb8cc8",
    "company": "Aramark",
    "positionName": "Office Support Supervisor - CTC PREM - ADMIN",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-19T05:10:54.963Z",
    "url": "https://www.indeed.ca/rc/clk?jk=f9a1dc315fdb8cc8&from=jasx&tk=1hkikdavvii12803&bb=Z_xYV__n_sQAK0ynFsc1LgWleYvbMk2HLgfW0Y8LFkNk5vhih-GOCe7Z9MS3OIGTl75ceW3wtekJ_B23VjbpKO1zjCHecLy5Y2FwedpWdDmZMquS72Rl6Q%3D%3D&xkcb=SoDG67M3FSg6uFQ22p0BbzkdCdPP&vjs=3",
    "externalApplyLink": "https://aramarkcareers.com/Canada/job/Ottawa-Office-Support-Supervisor-CTC-PREM-ADMIN-ON-K2V-1A4/1120775300/?feedId=339900&utm_source=Indeed&utm_campaign=Aramark_Indeed&jobPipeline=Indeed",
    "companyDescription": "",
    "description": "Job Description\n  \n  \n    The Office Support Supervisor will be responsible for the supervision and control of general office functions: payroll, A/P, A/R, sales reporting, inventory, and operating statements. Supervises day-to-day data collection and completes basic accounting reports.\n  \n \n \n  \n    Job Responsibilities\n  \n  \n   \n    Analyses and coordinates office operations and procedures such as typing, accounts payable, accounts receivable, payroll, flow of correspondence, filing, requisition of supplies, and other clerical services.\n    Evaluates office production, revises procedures, or devises new forms to improve efficiency of workflow.\n    Establishes uniform correspondence procedures\n    Formulates procedures for detailed retention, protection, retrieval, transfer, and disposal of records.\n    Reviews clerical and personnel records to ensure completeness, accuracy, and timeliness.\n    Prepares activities reports for mentorship of management, using computer.\n    Coordinates activities of various clerical departments or workers with department.\n    Assists unit management in the preparation of organizational invoices and monthly financial and other accounting responsibilities as needed.\n    May compile, store, and retrieve managerial data, using computer.\n    Help coordinate and supervise meetings within the office.\n    Responsible for maintaining inventory for office supplies and stocking daily.\n    Responsible for being the point person in the office for resolution to IT glitches and outages that effect the entire office.\n    Responsible for ensuring office is well maintained and being tended to accurately by maintenance and janitorial staff.\n    Other duties as needed.\n   \n    At Aramark, developing new skills and doing what it takes to get the job done make a positive impact for our employees and for our customers. In order to meet our commitments, job duties may change or new ones may be assigned without formal notice.\n  \n \n \n  \n    Qualifications\n  \n  \n   \n    Use logical thinking to perform a variety of office tasks that require special skills and knowledge\n    Make decisions based on company policy and good judgment\n    Follow instructions without close supervision\n    Speak and write clearly and accurately\n    Plan your own work and sometimes the work of others\n    Proficient with all Microsoft Applications\n    Requires basic accounting skills.\n    Must have developed language skills to the point to be able to: Write announcements, letters, summaries, and reports, using prescribed format\n    Minimum 2 years experience preferred 4 years exirience.\n   \n    This role may have physical demands including, but not limited to, lifting, bending, pushing, pulling and/or extended walking and standing. This role may also require uniforms and/or usage of Personal Protective equipment (PPE).\n  \n \n \n  \n    Education\n  \n \n \n \n  \n    About Aramark\n  \n  \n    Our Mission\n    Rooted in service and united by our purpose, we strive to do great things for each other, our partners, our communities, and our planet.\n    At Aramark, we believe that every employee should enjoy equal employment opportunity and be free to participate in all aspects of the company. We do not discriminate on the basis of race, color, religion, national origin, age, sex, gender, pregnancy, disability, sexual orientation, gender identity, genetic information, military status, protected veteran status or other characteristics protected by applicable law. \n   About Aramark\n    The people of Aramark proudly serve millions of guests every day through food, facilities, and uniform services in 19 countries around the world. Rooted in service and united by our purpose, we strive to do great things for each other, our partners, our communities, and our planet. We believe a career should develop your talents, fuel your passions, and empower your professional growth. So, no matter what you're pursuing - a new challenge, a sense of belonging, or just a great place to work - our focus is helping you reach your full potential. Learn more about working here at http://www.aramarkcareers.com or connect with us on Facebook, Instagram and Twitter."
}