{
    "id": "fc5003fd8a602b86",
    "company": "CIMA+",
    "positionName": "EIT Civil Engineering - Hybrid",
    "jobType": [
        "Permanent"
    ],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-24T12:17:27.563Z",
    "url": "https://www.indeed.ca/rc/clk?jk=fc5003fd8a602b86&from=jasx&tk=1hl5djsk1h7hv800&bb=xjPBkK6OIlrxY1Te1w3p5TB1TWyWawmP0Yi9ijBXGeoRHtg7H0_n9yVVp3CUn9V_4dnj5z8PwfWs53vi2_wQVyZiBBzbHRBJrX1F4W4Vvzt16rPqD2nnpg%3D%3D&xkcb=SoDU67M3FlTATHzAAx0DbzkdCdPP&vjs=3",
    "externalApplyLink": "https://jobs.smartrecruiters.com/CIMA2/743999962433654-eit-civil-engineering-hybrid",
    "companyDescription": "With more than 30 offices across the country and over 2,600 employees, 60% of which share ownership in the company, CIMA+ is one of Canada’s largest private consulting engineering firms and a “Best Employer” according to the Kincentric survey. \r\n\r\nFor more than 30 years, our multidisciplinary teams have been offering clients a complete range of solutions in the building, energy and resources, municipal infrastructure, telecommunications and transportation sectors. We also offer a multitude of complementary services, including environmental and project management services. Innovative and integrated solutions that place people at the centre of engineering, reflect our values and our corporate culture.",
    "description": "Company Description\n  Welcome to a place where people are at the heart of everything we do.\n  Welcome to people with an inspiring vision and who seek stimulating challenges. At CIMA+, you’ll find a place where you’ll have many opportunities to learn and develop while working on engaging projects.\n  We are a firm 100% owned by its employees and we value a collaborative and entrepreneurial mindset. You will have the flexibility to manage your work on your own terms and define what work-life balance means to you.\n  When you join CIMA+, we welcome you to a place that you can call home.\n  Job Description\n  Mission\n  Join our Infrastructure Team in Ottawa that supports commercial and residential development projects as our next EIT Civil Engineer. You will work on project management, planning and engineering design for commercial and residential development infrastructure (parkings, sewers, watermains, storm water management, etc.) as well as municipal linear .\n  You will have the opportunity to take part in our hybrid work model that includes flexible work hours, working from home and our Ottawa office.\n  Primary Responsibilities\n \n   Working on a team with other project engineers and designers on preliminary, detailed design, and construction support\n   Working closely with Project Managers, Project Engineers and other professional staff on project coordination tasks including preparing engineering drawings and documents, reports and memos preparation, calculations, project scheduling, proposal preparation, client interaction and quality control and assurance\n   Design for the preparation of civil works drawings under direction from Project Engineer or Project Manager\n \n  \n  Qualifications\n  \n \n   Bachelor’s degree in Civil or other applicable Engineering discipline\n   Registration with Professional Engineers Ontario (EIT) or ability to obtain\n   2 years of experience in design and project coordination for Civil and infrastructure projects (an asset)\n   Excellent communications skills in English (both spoken and written)\n   Excellent skills in the use of Microsoft Office software\n   Knowledge in AutoCAD/Civil3D (an asset)\n   Valid class G driver's licence\n \n \n  Contact Corine Tchakoute\n  #LI-Hybrid\n  Additional Information\n \n  Ethics and integrity are fundamental values at CIMA+, and we are looking for people who uphold these principles. We are committed to creating opportunities for all our talents to contribute to the firm’s success, develop and grow, regardless of cultural or other differences. We fully endorse employment equity principles and encourage women, visible minorities, indigenous peoples, and individuals with disabilities to apply for any position offered at CIMA+. Adaptation measures are provided upon request to facilitate participation in the recruitment process."
}