{
    "id": "fcf8fbe2253867b5",
    "company": "National Research Council Canada",
    "positionName": "Technical Officer, Instrumentation Support",
    "jobType": [
        "Part-time"
    ],
    "location": "1200 Montreal Rd, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-06T03:11:40.022Z",
    "url": "https://www.indeed.ca/rc/clk?jk=fcf8fbe2253867b5&from=jasx&tk=1hjm37mkfk628803&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/applystart?jk=fcf8fbe2253867b5&from=vj&pos=top&mvj=0&spon=0&sjdu=o7sfz71MPdMgyiV0LZq0d4DDplm6SwWjHcxyoDIphKlqJWImdhkUgvDiXut-iwwoVv5CC8Wu7qGPad2Xzboognitp06QfXOVKl6uIVE89rRt1LyMcg8h7DKSBi4S0DxWZUesmcKCxTmJ9SJ9BP2fCzC_JUV1TwLR9d8icOcD2fteXwnylBnVW6A3QqxgDJK4w9_XINGINv7OnqX9-Wv1cg&vjfrom=serp&log=1&astse=5b06aa0a17de9f94&assa=9498",
    "companyDescription": "",
    "description": "Great Minds. One Goal. Canada's Success.\n     \n     \n    Help bring research to life and drive your career forward with the National Research Council of Canada (NRC), Canada's largest research and technology organization.\n     \n     \n    We are looking for a Technical Officer, Instrumentation Support to support the Ocean, Coastal and River Engineering (OCRE) Research Centre. The selected candidate would be someone who shares our core values Integrity, Excellence, Respect and Creativity.\n     \n     Do you want to be part of a team working to find solutions to protect infrastructure, property and people from severe weather events and other environmental risks while also meeting the challenges of climate change?\n     \n     At OCRE, the researchers are using physical modelling techniques to find real world solutions to ongoing challenges present in the natural world. The primary purpose of the position is to provide electronic technical support services in installing, maintaining, troubleshooting and calibrating laboratory instrumentation of various physical model experiments. The incumbent should be able to design, build electronic equipment and install and maintain data acquisition equipment in support of the laboratory physical model experiments. Upon completion of the experimental setup the employee ensures the continuous operation of the instrumentation throughout the project. The employee may be asked to coordinate or assist with the production of technical reports and users’ manuals. The incumbent will also be involved in the regular maintenance, upgrade and development of OCRE’s testing facilities instrumentation.\n     \n     NRC’s main campus on Montreal Road offers free parking and easy access for runners, walkers and in-line skaters to break away during the day and enjoy the beautiful surroundings. Most buildings have shower and locker facilities, in addition to an on-campus Fitness Centre. There are also areas for soccer, volleyball and even beach volleyball during the summer! There are ample picnic areas and easy access to a shopping centre, grocery store and pharmacy, as well as numerous restaurants. \n   \n  \n  \n   \n     Screening Criteria \n   \n   \n     Applicants must demonstrate within the content of their application that they meet the following screening criteria in order to be given further consideration as candidates: \n   \n  \n  \n   \n     Education \n   \n   \n     Completion of post-secondary education in an electronic engineering/technology program or other technical, engineering or scientific discipline related to the position, or equivalent combination of work-related experience, training and education.\n     \n     \n    For information on certificates and diplomas issued abroad, please see Degree equivalency \n   \n  \n  \n   \n     Experience \n   \n   \n    \n     Recent experience in providing electronic technical expertise by installing, maintaining, troubleshooting, and calibrating laboratory instrumentation; \n     Experience in installing and maintaining data acquisition equipment for support of laboratory physical model studies; \n     Experience in providing programming assistance for ongoing laboratory real-time software development including programming and interfacing data acquisition hardware and control systems. \n     Experience in using computers to analyze data, and present test results. \n     Experience in working in a multidisciplinary team environment. \n     Experience operating machinery such as skid steers and/or forklift would be an asset. \n    \n   \n  \n  \n   \n    Condition of Employment \n   \n   \n     Secret (II) \n   \n  \n  \n   \n     Language Requirements \n   \n   \n     English\n     \n     \n    Information on language requirements and self-assessment tests \n   \n  \n  \n   \n     Assessment Criteria \n   \n   \n     Candidates will be assessed on the basis of the following criteria: \n   \n  \n  \n   \n     Technical Competencies \n   \n   \n    \n     Ability to work independently, and with others, under the general guidance of project engineers to meet objectives and deadlines \n     Ability to use computers and research laboratory instrumentation devices and their application, set-up, calibration, and use for control of facilities and equipment, for data acquisition, analysis and processing. \n     Ability in the application, use, and interpretation of results from instruments and gauges for measuring wave heights, flows, displacements, accelerations, and other physical quantities. \n     Knowledge of preparation of calibration reports and operational procedures \n     Ability to apply reading and interpretation skills to review technical drawings, instructions and specifications. \n     Knowledge of Occupational Health & Safety regulations and legislation required to create and maintain a safe and healthy environment. \n     Ability to work with CAD software (AutoCAD, Solid Works) considered an asset. \n    \n   \n  \n  \n   \n    Behavioural Competencies \n   \n   \n    Technology support - Communication (Level 2) \n    Technology support - Conceptual and analytical ability (Level 2) \n    Technology support - Results orientation (Level 2) \n    Technology support - Self-knowing and self-development (Level 2) \n    Technology support - Teamwork (Level 2) \n   \n  \n  \n   \n    Competency Profile(s) \n   \n   \n     For this position, the NRC will evaluate candidates using the following competency profile: Technology Support\n     \n     \n   \n  \n  \n   \n     Compensation \n   \n   \n     Salary under review.\n     \n     \n    From $58,445 to $80,040 per annum.\n     \n     \n    NRC employees enjoy a wide-range of competitive benefits including comprehensive health and dental plans, vacation, sick, and other leave entitlements, disability insurance and pension plans. \n   \n  \n  \n   \n     The NRC Advantage \n   \n   \n     The National Research Council of Canada (NRC) is the Government of Canada's largest research organization supporting industrial innovation, the advancement of knowledge and technology development. We collaborate with over 70 colleges, universities and hospitals annually, work with 800 companies on their projects, and provide advice or funding to over 8000 Small and Medium-sized Enterprises (SMEs) each year.\n     \n     \n    We bring together the brightest minds to deliver tangible impacts on the lives of Canadians and people around the world. And now, we want to partner with you. Let your expertise and inspirations make an impact by joining the NRC.\n     \n     \n    At the NRC Employee wellness matters. We offer flexible work schedules as well as part-time work to help employees maintain work-life balance. We are one of the few federal organizations that close our offices during the December holiday season. We offer professional learning and development opportunities such as conferences, workshops, and a suite of mentorship, award and recognition programs. Diversity enables creativity and innovation. Fostering a diverse, inclusive, welcoming and supportive workplace is important to us, and contributes to a more inclusive Canadian innovation system. We welcome all qualified applicants and encourage you to complete the employment equity self-declaration questions during the job application process. Please let us know of any accommodation measures required to help you to be assessed in a fair and equitable manner. Please note that the information you provide will be treated confidentially.\n     \n     \n    Help us solve problems for Canada. Grow your career with us today! \n   \n  \n  \n   \n     Notes \n   \n   \n    \n     Relocation assistance will be determined in accordance with the NRC's directives. \n     Overtime will sometimes be required. \n     Work typically requires daily intermittent periods of standing, walking and sitting at a work bench; working in awkward positions; bending and stretching; moving lightweight objects and large, awkward and heavier objects on occasion; operating hand and power tools and forklifts; climbing stairs and ladders on occasion. \n     Work is typically performed in a laboratory, plant or shop environment that includes daily exposure to background noise from tools and equipment, and regular exposure to chemicals, dirt, noise, noxious odors, hazardous equipment and substances, extreme temperatures or other awkward conditions. Work can be performed indoors and outdoors, extreme weather conditions, and working on uneven terrain and from heights. \n     A pre-qualified list may be established for similar positions for a one year period. \n     Preference will be given to Canadian Citizens and Permanent Residents of Canada. Please include citizenship information in your application. \n     The incumbent must adhere to safe workplace practices at all times. \n     We thank all those who apply, however only those selected for further consideration will be contacted.\n    \n   \n  \n \n  \n  \n Please direct your questions, with the requisition number (19859) to: \n E-mail: NRC.NRCHiring-EmbaucheCNRC.CNRC@nrc-cnrc.gc.ca \n Telephone: 343-550-0290 \n Closing Date: 19 January 2024 - 23:59 Eastern Time"
}