{
    "id": "bd5b5c480c429adc",
    "companyDescription": "",
    "description": "At Boeing, we innovate and collaborate to make the world a better place. From the seabed to outer space, you can contribute to work that matters with a company where diversity, equity and inclusion are shared values. We’re committed to fostering an environment for every teammate that’s welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us.\n  Boeing Canada Operations Ltd. is seeking Financial Analyst, reporting to the Finance Manager, working out of the Ottawa office.\n \n  The Financial Analyst will join the Business Operations team within the MHLH Program. The MHLH Program is responsible for providing comprehensive In-Service Support to the CH147F Chinook fleet of the Royal Canadian Air Force. This support includes program management, spares and tooling, integrated logistics, training, engineering, as well deployment support.\n \n  The Financial Analyst will develop resource forecasts and/or Estimates at Completion (EACs) for control accounts, budgets, functions or pools; financial EACs for contracts or programs as well as initiate analysis of: resource forecasts and/or control account EACs; financial EACs. This position also includes to compile data from multiple sources, develop performance reports, initiate variance analyses and provide understanding of operational and financial performance to management. The Material Cost Analyst will make recommendations to management on financial performance projections using financial and business knowledge and experience.\n \n \n   Position Responsibilities:\n   \n  \n   Collects, organizes, synthesizes, and analyze data; summarize findings; develop conclusions and recommendations from appropriate data sources.\n   Use various budgeting tools (e.g., cost benefit analysis, estimates-at-completion [EAC], management estimate-at-completion [MEAC]) and estimating techniques (e.g., improvement curve theory, parametric estimates, standard hour estimates, zero-base estimates).\n   Review, compare, and analyze cost performance against the baseline program plan (e.g., baseline, Estimate at Completion [EAC]).\n   Define and communicate cost trends and project cost performance for program management attention and action.\n   Defines the project, design and plan the project, and manage the project team.\n   Control and deliver project deliverables, project accounting and appraisal, and optimize the contribution of the people involved.\n   Obtains information and identifies key issues and relationships relevant to achieving a long-range goal or vision; commits to a course of action to accomplish a long-range goal or vision after developing alternatives based on logical assumptions, facts, available resources, constraints, and organizational values.\n   Develops, reviews, analyzes and maintains cost and/or schedule performance measurement baselines, including earned value, and variance analyses and communicates cost and/or schedule trends.\n   Develops business cases using appropriate indices.\n  \n \n \n  This position is hybrid. This means that the selected candidate will be required to perform some work onsite at one of the listed location options. This is at the hiring team’s discretion and could potentially change in the future.\n \n  Employer will not sponsor applicants for employment visa status.\n \n \n   Basic Qualifications (Required Skills/Experience):\n   \n  \n   Must be legally able to work in Canada\n   5+ years of experience in financial analysis and reporting\n   Must be eligible to handle US export-controlled data\n   Must consent to Canadian Government Controlled Goods Program (CGP) assessment\n   Individual must not pose a risk for safeguarding of controlled goods\n   Must be eligible for Secret Level II clearance\n  \n \n \n \n   Preferred Qualifications (Education/Experience):\n   \n  \n   Post-secondary education\n   Experience with budgeting tools (e.g., cost benefit analysis, estimates-at-completion [EAC])\n   Active Secret Clearance\n  \n \n \n  Typical Education and Experience: Education/experience typically acquired through advanced education (e.g. Bachelor) and typically 6 or more years' related work experience or an equivalent combination of education and experience (e.g. Master+4 years' related work experience, 10 years' related work experience, etc.).\n \n  Relocation: Relocation assistance is not a negotiable benefit for this position. Candidates must live in the immediate area or relocate at their own expense.\n \n  Additional Information: This requisition is for a, locally hired position in Canada. The employer is Boeing Canada. Candidates must be legally authorized to work in Canada. Benefits and pay are determined by Canada and are not on Boeing US-based payroll. This is not an expatriate assignment.\n \n  This position requires the ability to obtain and maintain a secret security clearance Level II from the Canadian government. Requirements to obtain a secret security clearance can be found at:\n  http://www.tpsgc-pwgsc.gc.ca/esc-src/personnel/information-eng.html#a1.1\n \n  To review the Canadian Controlled Goods and Public Service and Procurement Canada requirements please go to the following government pages below:\n  https://www.tpsgc-pwgsc.gc.ca/pmc-cgp/enregistrement-register/lignedirectrice-rd-guideline-do-eng.html  https://www.tpsgc-pwgsc.gc.ca/esc-src/personnel/pdcf-rsrp-eng.html\n  Export Control Requirements: Not an export control position\n  Equal Opportunity Employer:\n  We are an equal opportunity employer. We do not accept unlawful discrimination in our recruitment or employment practices on any grounds including but not limited to; race, color, ethnicity, religion, national origin, gender, sexual orientation, gender identity, age, physical or mental disability, genetic factors, military and veteran status, or other characteristics covered by applicable law.\n  We have teams in more than 65 countries, and each person plays a role in helping us become one of the world’s most innovative, diverse and inclusive companies. We are proud members of the Valuable 500 and welcome applications from candidates with disabilities. Applicants are encouraged to share with our recruitment team any accommodations required during the recruitment process. Accommodations may include but are not limited to: conducting interviews in accessible locations that accommodate mobility needs, encouraging candidates to bring and use any existing assistive technology such as screen readers and offering flexible interview formats such as virtual or phone interviews.",
    "preprocessed_description": "At Boeing, we innovate and collaborate to make the world a better place. From the seabed to outer space, you can contribute to work that matters with a company where diversity, equity and inclusion are shared values. We're committed to fostering an environment for every teammate that is welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us. Boeing Canada Operations Ltd. is seeking Financial Analyst, reporting to the Finance Manager, working out of the Ottawa office. The Financial Analyst will join the Business Operations team within the MHLH Program. The MHLH Program is responsible for providing comprehensive In-Service Support to the CH147F Chinook fleet of the Royal Canadian Air Force. This support includes program management, spares and tooling, integrated logistics, training, engineering, as well deployment support. The Financial Analyst will develop resource forecasts and/or Estimates at Completion (EACs) for control accounts, budgets, functions or pools; financial EACs for contracts or programs as well as initiate analysis of: resource forecasts and/or control account EACs; financial EACs. This position also includes to compile data from multiple sources, develop performance reports, initiate variance analyses and provide understanding of operational and financial performance to management. The Material Cost Analyst will make recommendations to management on financial performance projections using financial and business knowledge and experience. Position Responsibilities: Collects, organizes, synthesizes, and analyze data; summarize findings; develop conclusions and recommendations from appropriate data sources. Use various budgeting tools (e.g., cost benefit analysis, estimates-at-completion [EAC], management estimate-at-completion [MEAC]) and estimating techniques (e.g., improvement curve theory, parametric estimates, standard hour estimates, zero-base estimates). Review, compare, and analyze cost performance against the baseline program plan (e.g., baseline, Estimate at Completion [EAC]). Define and communicate cost trends and project cost performance for program management attention and action. Defines the project, design and plan the project, and manage the project team. Control and deliver project deliverables, project accounting and appraisal, and optimize the contribution of the people involved. Obtains information and identifies key issues and relationships relevant to achieving a long-range goal or vision; commits to a course of action to accomplish a long-range goal or vision after developing alternatives based on logical assumptions, facts, available resources, constraints, and organizational values. Develops, reviews, analyzes and maintains cost and/or schedule performance measurement baselines, including earned value, and variance analyses and communicates cost and/or schedule trends. Develops business cases using appropriate indices. This position is hybrid. This means that the selected candidate will be required to perform some work onsite at one of the listed location options. This is at the hiring team's discretion and could potentially change in the future. Employer will not sponsor applicants for employment visa status. Basic Qualifications (Required Skills/Experience): Must be legally able to work in Canada 5+ years of experience in financial analysis and reporting Must be eligible to handle US export-controlled data Must consent to Canadian Government Controlled Goods Program (CGP) assessment Individual must not pose a risk for safeguarding of controlled goods Must be eligible for Secret Level II clearance Preferred Qualifications (Education/Experience): Post-secondary education Experience with budgeting tools (e.g., cost benefit analysis, estimates-at-completion [EAC]) Active Secret Clearance Typical Education and Experience: Education/experience typically acquired through advanced education (e.g. Bachelor) and typically 6 or more years' related work experience or an equivalent combination of education and experience (e.g. Master+4 years' related work experience, 10 years' related work experience, etc.). Relocation: Relocation assistance is not a negotiable benefit for this position. Candidates must live in the immediate area or relocate at their own expense. Additional Information: This requisition is for a, locally hired position in Canada. The employer is Boeing Canada. Candidates must be legally authorized to work in Canada. Benefits and pay are determined by Canada and are not on Boeing US-based payroll. This is not an expatriate assignment. This position requires the ability to obtain and maintain a secret security clearance Level II from the Canadian government. Requirements to obtain a secret security clearance can be found at: http://www.tpsgc-pwgsc.gc.ca/esc-src/personnel/information-eng.html#a1.1 To review the Canadian Controlled Goods and Public Service and Procurement Canada requirements please go to the following government pages below: https://www.tpsgc-pwgsc.gc.ca/pmc-cgp/enregistrement-register/lignedirectrice-rd-guideline-do-eng.html https://www.tpsgc-pwgsc.gc.ca/esc-src/personnel/pdcf-rsrp-eng.html Export Control Requirements: Not an export control position Equal Opportunity Employer: We are an equal opportunity employer. We do not accept unlawful discrimination in our recruitment or employment practices on any grounds including but not limited to; race, color, ethnicity, religion, national origin, gender, sexual orientation, gender identity, age, physical or mental disability, genetic factors, military and veteran status, or other characteristics covered by applicable law. We have teams in more than 65 countries, and each person plays a role in helping us become one of the world's most innovative, diverse and inclusive companies. We are proud members of the Valuable 500 and welcome applications from candidates with disabilities. Applicants are encouraged to share with our recruitment team any accommodations required during the recruitment process. Accommodations may include but are not limited to: conducting interviews in accessible locations that accommodate mobility needs, encouraging candidates to bring and use any existing assistive technology such as screen readers and offering flexible interview formats such as virtual or phone interviews.",
    "processed_description": "innovate collaborate place . seabed outer space contribute matter company diversity equity inclusion shared . committed foster environment teammate respectful inclusive great professional growth . find future . seek Financial Analyst report Finance Manager office . Financial Analyst join Business Operations team . responsible provide comprehensive Service Support CH147F Chinook fleet . support include program management spare tooling integrate logistic training engineering deployment support . Financial Analyst develop resource forecast estimate Completion EACs control account budget function pool financial EACs contract program initiate analysis resource forecast control account EACs financial EACs . position include compile datum multiple source develop performance report initiate variance analysis provide understanding operational financial performance management . Material Cost analyst recommendation management financial performance projection financial business knowledge . position responsibility collect organize synthesize analyze datum summarize finding develop conclusion recommendation appropriate datum source . budgeting tool e.g. cost benefit analysis estimate completion management estimate completion MEAC estimate technique e.g. improvement curve theory parametric estimate standard hour estimate zero base estimate . review compare analyze cost performance baseline program plan e.g. baseline Estimate Completion . define communicate cost trend project cost performance program management attention action . define project design plan project manage project team . control deliver project deliverable project accounting appraisal optimize contribution people involve . information identify key issue relationship relevant achieve long range goal vision commit course action accomplish long range goal vision develop alternative base logical assumption fact resource constraint organizational . develop review analyze maintain cost schedule performance measurement baseline include earn variance analysis communicate cost schedule trend . develop business case appropriate index . position hybrid . select require perform onsite list location option . hire team's discretion change future . employer sponsor applicant employment visa status . Basic Qualifications Required Skills legally financial analysis reporting eligible handle export control datum consent Canadian Government Controlled Goods Program CGP assessment Individual pose risk safeguarding control good eligible clearance Preferred Qualifications Education post secondary education budgeting tool e.g. cost benefit analysis estimate completion Active Secret Clearance Typical Education education typically acquire advanced education e.g. Bachelor typically year' equivalent combination education e.g. master+ year' relate year' . . relocation relocation assistance negotiable benefit position . live area relocate expense . additional information requisition locally hire position . employer . legally authorize . benefit pay determine Boeing base payroll . expatriate assignment . position require maintain secret security clearance Level II canadian government . requirement secret security clearance find review Canadian Controlled Goods Public Service Procurement requirement follow government equal employer . accept unlawful discrimination recruitment employment practice ground include limit race color ethnicity religion national origin gender sexual orientation gender identity age physical mental genetic factor military veteran status characteristic cover applicable law . team country person play role help world's innovative diverse inclusive company . valuable application . applicant encourage share recruitment team accommodation require recruitment process . accommodation include limit conduct interview accessible location accommodate mobility encourage bring exist assistive technology screen reader offer flexible interview format virtual phone interview .",
    "results_group": {
        "extracted_noun_chunks": [
            "limit conduct interview accessible location",
            "e.g. cost benefit analysis estimate completion Active Secret Clearance Typical Education education",
            "limit",
            "support",
            "e.g. baseline Estimate Completion",
            "review",
            "applicant",
            "employer sponsor applicant employment visa status",
            "datum multiple source",
            "expense",
            "Financial Analyst report Finance Manager office",
            "accommodation",
            "performance report",
            "conclusion recommendation appropriate datum source",
            "operational financial performance management",
            "Business Operations team",
            "perform onsite list location option",
            "relocation relocation assistance negotiable benefit position",
            "comprehensive Service Support CH147F Chinook fleet",
            "cost performance baseline program plan",
            "eligible handle export control datum consent Canadian Government Controlled Goods Program CGP assessment Individual",
            "Material Cost analyst recommendation management financial performance projection financial business knowledge",
            "share recruitment team accommodation",
            "government equal employer",
            "program management spare tooling",
            "communicate cost trend project cost performance program management attention action",
            "Basic Qualifications Required Skills legally financial analysis",
            "long range goal vision",
            "team country person",
            "matter company diversity equity inclusion",
            "benefit pay",
            "e.g. Bachelor typically year' equivalent combination education",
            "Completion EACs control account budget function pool financial EACs contract program",
            "business case appropriate index",
            "flexible interview format virtual phone interview",
            "additional information requisition",
            "recruitment process",
            "financial EACs",
            "outer space",
            "future",
            "budgeting tool e.g. cost benefit analysis estimate completion management estimate completion MEAC estimate technique",
            "secret security clearance",
            "project design plan project",
            "Financial Analyst",
            "project team",
            "secret security clearance Level II canadian government",
            "people",
            "review analyze",
            "unlawful discrimination recruitment employment practice ground",
            "resource forecast estimate",
            "information",
            "variance analysis",
            "gender sexual orientation gender identity age physical mental genetic factor military veteran status",
            "project deliverable project accounting appraisal optimize contribution",
            "live area",
            "race color ethnicity religion national origin",
            "key issue relationship",
            "advanced education",
            "position",
            "role help",
            "cost schedule performance measurement baseline",
            "respectful inclusive great professional growth",
            "world's innovative diverse inclusive company",
            "committed foster environment teammate",
            "risk safeguarding control good eligible clearance Preferred Qualifications Education post secondary education budgeting tool",
            "cost schedule trend",
            "valuable application",
            "analysis resource forecast control account EACs",
            "control",
            "applicable law",
            "place",
            "logistic training engineering deployment support",
            "synthesize",
            "position responsibility",
            "datum",
            "employer",
            "Boeing base payroll",
            "exist assistive technology screen reader",
            "improvement curve theory parametric estimate standard hour estimate zero base estimate",
            "expatriate assignment",
            "course action"
        ],
        "combined_lemmatized_tokens": "innovate collaborate place . seabed outer space contribute matter company diversity equity inclusion shared . committed foster environment teammate respectful inclusive great professional growth . find future . seek Financial Analyst report Finance Manager office . Financial Analyst join Business Operations team . responsible provide comprehensive Service Support CH147F Chinook fleet . support include program management spare tooling integrate logistic training engineering deployment support . Financial Analyst develop resource forecast estimate Completion EACs control account budget function pool financial EACs contract program initiate analysis resource forecast control account EACs financial EACs . position include compile datum multiple source develop performance report initiate variance analysis provide understanding operational financial performance management . Material Cost analyst recommendation management financial performance projection financial business knowledge . position responsibility collect organize synthesize analyze datum summarize finding develop conclusion recommendation appropriate datum source . budgeting tool e.g. cost benefit analysis estimate completion management estimate completion MEAC estimate technique e.g. improvement curve theory parametric estimate standard hour estimate zero base estimate . review compare analyze cost performance baseline program plan e.g. baseline Estimate Completion . define communicate cost trend project cost performance program management attention action . define project design plan project manage project team . control deliver project deliverable project accounting appraisal optimize contribution people involve . information identify key issue relationship relevant achieve long range goal vision commit course action accomplish long range goal vision develop alternative base logical assumption fact resource constraint organizational . develop review analyze maintain cost schedule performance measurement baseline include earn variance analysis communicate cost schedule trend . develop business case appropriate index . position hybrid . select require perform onsite list location option . hire team's discretion change future . employer sponsor applicant employment visa status . Basic Qualifications Required Skills legally financial analysis reporting eligible handle export control datum consent Canadian Government Controlled Goods Program CGP assessment Individual pose risk safeguarding control good eligible clearance Preferred Qualifications Education post secondary education budgeting tool e.g. cost benefit analysis estimate completion Active Secret Clearance Typical Education education typically acquire advanced education e.g. Bachelor typically year' equivalent combination education e.g. master+ year' relate year' . . relocation relocation assistance negotiable benefit position . live area relocate expense . additional information requisition locally hire position . employer . legally authorize . benefit pay determine Boeing base payroll . expatriate assignment . position require maintain secret security clearance Level II canadian government . requirement secret security clearance find review Canadian Controlled Goods Public Service Procurement requirement follow government equal employer . accept unlawful discrimination recruitment employment practice ground include limit race color ethnicity religion national origin gender sexual orientation gender identity age physical mental genetic factor military veteran status characteristic cover applicable law . team country person play role help world's innovative diverse inclusive company . valuable application . applicant encourage share recruitment team accommodation require recruitment process . accommodation include limit conduct interview accessible location accommodate mobility encourage bring exist assistive technology screen reader offer flexible interview format virtual phone interview ."
    }
}