{
    "id": "330a6c30756a7e64",
    "company": "The Ottawa Hospital",
    "positionName": "Registered Nurse, Transitional Care Unit",
    "jobType": [
        "Full-time"
    ],
    "location": "Ottawa, ON",
    "salary": "$37.93–$54.37 an hour",
    "postingDateParsed": "2024-01-26T12:15:33.205Z",
    "url": "https://www.indeed.ca/rc/clk?jk=330a6c30756a7e64&from=jasx&tk=1hl5dg16dk7ek800&bb=tMKIoX8lf2spUOlVC2NDMG-OixAUVk4pNJ9g41YSTBYAXh5nT_TxfAh-wOGd34a_dLqL4xKdSJjbx7x9s-QiSzeAPRoc-z-OPN2F6m13orGVJs731TSy5A%3D%3D&xkcb=SoBq67M3FlTP8hgNR70NbzkdCdPP&vjs=3",
    "externalApplyLink": "https://ohhcmdmzweb01.ottawahospital.on.ca/psc/HRPRD/?cmd=login&errorPg=ckreq&languageCd=ENG",
    "companyDescription": "The Ottawa Hospital is one of Canada’s largest learning and research hospitals, with more than 1,100 beds, approximately 12,000 staff members and an annual budget of about $1.2 billion. \r\n\r\nOur focus on learning and research helps us develop new and innovative ways to treat patients and improve care. As a multi-campus hospital affiliated with the University of Ottawa, we deliver specialized care to the Eastern Ontario region, but our techniques and research discoveries are adopted around the world. We engage the community at all levels to support our vision for better patient care.\r\n\r\nFrom the compassion of our people to the relentless pursuit of new discoveries, The Ottawa Hospital never stops seeking solutions to the most complex health-care challenges.",
    "description": "About The Ottawa Hospital \n    \n    \n    \n     \n      Inspired by research and driven by compassion!\n     \n      \n     \n     \n       The Ottawa Hospital (TOH) is one of Canada’s largest learning and research multi-campus hospitals. With more than 1,100 beds and approximately 12,000 staff members, we deliver specialized care to the Eastern Ontario region. \n     \n      \n     \n     \n      From the compassion of our people to the relentless pursuit of new discoveries, The Ottawa Hospital never stops seeking solutions to the most complex health-care challenges while continually engaging with the community to support our vision for better patient care.\n     \n      \n     \n     \n       Working together with its research institute, the University of Ottawa, and other partners, the hospital is continually gaining national and international recognition for high-quality patient care, teaching and research, while striving to meet the needs of the culturally diverse community we serve.\n      \n    \n   \n  \n \n \n  \n   Position Information \n    \n    \n    \n     \n      This position will be located on the E5 Unit.\n      \n    \n   \n  \n \n \n  \n   Rotation/Shifts \n    \n    \n    \n     \n      Days and nights, including weekends, 12 hour shifts. \n     \n     \n      For information purposes only - The Hospital reserves the right to change.\n      \n    \n   \n  \n \n \n  \n   Basic Requirements \n    \n    \n    \n     \n      \n       \n        Certificate of registration from the College of Nurses of Ontario;\n        \n      \n       \n        Minimum of three (3) months of general nursing experience;\n        \n      \n       \n        Demonstrates theoretical knowledge of the nursing process as it relates to the general medicine patient and the ability to apply this knowledge in a clinical setting;\n        \n      \n       \n        Theoretical knowledge of the care of the geriatric patient, and ability to apply this knowledge in a clinical setting;\n        \n      \n       \n        Demonstrates the ability to assess the patient's learning needs and ability to plan appropriate teaching;\n        \n      \n       \n        Demonstrates the ability to work effectively in a collaborative multidisciplinary approach to patient care;\n        \n      \n       \n        Demonstrates the ability to assess the patient's discharge needs and participates in the planning process;\n        \n      \n       \n        Demonstrates the ability to communicate effectively in an oral and written format with patients, public, colleagues and other health discipline;\n        \n      \n       \n        Demonstrates interpersonal and problem solving skills;\n        \n      \n       \n        Identifies a commitment to personal continuing education activities;\n        \n      \n       \n        Demonstrates an understanding and a willingness to participate in self-evaluation;\n        \n      \n       \n        Demonstrates an understanding of the application and relevance of the Quality Assurance Program and participates in unit activities;\n        \n      \n       \n        Must be eligible to work in Canada.\n        \n     \n    \n   \n  \n \n \n  \n   Preferred Qualifications \n    \n    \n    \n     \n      A degree in Nursing.\n      \n    \n   \n  \n \n \n  \n   What you can expect from us \n    \n    \n    \n     \n      The Ottawa Hospital is committed to providing a healthy, safe, and inclusive work environment for everyone. We are driven by our purpose to provide each patient with the world-class care, exceptional service and compassion we would want for our loved ones.\n     \n      \n     \n     \n       We offer an attractive and equitable compensation package including a comprehensive benefits package, a Defined Benefit Pension (DBP) plan, and insurance protection. We also offer discounts from choice providers on a variety of products and services. \n     \n      \n     \n     \n      The Ottawa Hospital provides various Health and Wellness resources as well as opportunities for personal and professional development opportunities from our in-house Learning and Leadership Development team to help align your goals with your career objectives.\n      \n    \n   \n  \n \n \n  \n   Interested? Apply today! \n    \n    \n    \n     \n      If you are passionate about what you do, motivated by improving the health of the community, excited by leading-edge medical technology, and as committed to excellence, quality and patient safety as we are, we would like to hear from you. Please submit an on-line application for the position you are interested in. We thank all those who apply but only those selected for further consideration will be contacted.\n       The Ottawa Hospital is an equal opportunity employer. Upon request, accommodations due to a disability are available throughout the recruitment process."
}