{
    "id": "9c22e1c4ac0d1e34",
    "company": "Aramark",
    "positionName": "Food Service Worker - Carleton",
    "jobType": [
        "Part-time",
        "Full-time"
    ],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-07T03:10:56.696Z",
    "url": "https://www.indeed.ca/rc/clk?jk=9c22e1c4ac0d1e34&from=jasx&tk=1hjm370eqjm5s800&vjs=3",
    "externalApplyLink": "https://aramarkcareers.com/Canada/job/Ottawa-Food-Service-Worker-Carleton-ON-K1S-5B6/1115461600/?feedId=339900&utm_source=Indeed&utm_campaign=Aramark_Indeed&jobPipeline=Indeed",
    "companyDescription": "",
    "description": "Job Description\n  \n  \n    Are you looking for a fun, fast-paced, and rewarding experience? Are you looking for a position in a company that can provide career growth and opportunity? Carleton Dining Services would love to have you on our team!\n    We are hiring part-time Food Service Workers to join our team at various locations on Carleton University campus (Tim Hortons, Subway, etc.). Our Food Service Workers assist with food preparation, portioning of food and serving customers.\n  \n \n \n  \n    What We Offer\n  \n  \n   \n     Health and Dental benefits after 3 months of employment for full-time employees\n     Meal program allows you to eat at a discounted price\n     Employee Stock Purchase plan program\n     Group RRSP for qualifying individuals\n     Employee Referral Program\n     Training and development\n     Position advancement opportunities\n     Employee recognition programs including service awards\n     Strong focus on a safe and healthy work environment\n     Diverse and inclusive workforce\n     Aramark Scholarship Program which gives scholarship opportunities for dependents of full-time employees\n   \n  \n \n \n  \n    About the Job\n  \n  \n   \n     Provide excellent customer service while preparing food and fulfilling orders\n     Compile orders accurately and in a timely fashion\n     Receive payment by cash, debit/credit card and campus card\n     Stock shelves, refrigerators and/or salad bars\n     Assist with opening/closing of the location\n     Keep stations clean and replenished at all times\n     Clean counters and tables\n     Empty garbage\n     Ensure adherence to all of Aramark Policies and Procedures\n     May perform other job duties as required\n   \n  \n \n \n  \n    About You\n  \n  \n   \n     Experience in the restaurant/food service industry an asset\n     Strong customer service skills\n     Enjoy working with others in a team setting\n     Ability to follow direction and work with minimal supervision\n     Cash handling experience an asset\n   \n    The selected candidate for this position will need to complete and successfully pass a Criminal Background Check.\n  \n \n \n  \n    About Aramark\n  \n  \n    Our Mission\n    Rooted in service and united by our purpose, we strive to do great things for each other, our partners, our communities, and our planet.\n   \n    At Aramark, we believe that every employee should enjoy equal employment opportunity and be free to participate in all aspects of the company. We do not discriminate on the basis of race, color, religion, national origin, age, sex, gender, pregnancy, disability, sexual orientation, gender identity, genetic information, military status, protected veteran status or other characteristics protected by applicable law.\n   \n    About Aramark\n    The people of Aramark proudly serve millions of guests every day through food, facilities, and uniform services in 19 countries around the world. Rooted in service and united by our purpose, we strive to do great things for each other, our partners, our communities, and our planet. We believe a career should develop your talents, fuel your passions, and empower your professional growth. So, no matter what you're pursuing - a new challenge, a sense of belonging, or just a great place to work - our focus is helping you reach your full potential. Learn more about working here at http://www.aramarkcareers.com or connect with us on Facebook, Instagram and Twitter."
}