{
    "id": "0c200c5f91ea7fc9",
    "companyDescription": "",
    "description": "OVERVIEW \n  A Sales Associate contributes to driving sales through providing a genuine experience to each customer. \n  RESPONSIBILITIES \n  Brand Experience \n  \n  Acts as a brand representative reflective of the company values \n  Initiates conversation, shares advice and product knowledge to interact with the customer in a personalized way \n  Utilizes technology to be well-informed on company priorities and promotions in-store and online; delivers a seamless, omni channel shopping experience through utilization of the tools available to service the customer (i.e. MPOS, POS, In-Store & Curbside Pick Up) \n  \n Teamwork + Communication \n  \n  Contributes to the store by being positive, respectful, and helpful to others \n  Collaborates with peers and leadership, sharing ideas and jumping in to support the needs of the team \n  Exhibits a willingness to learn and adapt; is flexible to change and open to try new ways of doing things \n  \n Visual + Business Operations \n  \n  Maintains Urban Outfitters’ visual and operational standards while keeping the focus on the customer \n  Supports the shipment process to gain awareness of product including what’s new and what’s already on the floor; contributes to completion of omni order fulfillment processes \n  Adheres to store’s safety standards, inventory accuracy, reduction of product loss, and upholds all company policy and procedures to support the profitability of the store \n  \n QUALIFICATIONS \n  \n  Passion for UO brand \n  Experience in customer service \n  Experience being a team player \n  Ability to work flexible hours to meet the needs of the store including nights, weekends, and holidays\n \n  \n  \n  Urban Outfitters, Inc. celebrates diversity and is committed to creating an inclusive environment for all employees. We are proud to provide equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, sex (including gender, pregnancy, sexual orientation, and gender identity or expression), religion, creed, age, physical or mental disability, national origin or ancestry, ethnicity, citizenship, service in the uniformed services, genetic information, or any other protected characteristic as established by law. We believe strongly in fostering a safe, fair and respectful work environment. To ensure compliance with our non-discrimination and anti-harassment policies, we offer anti-harassment training to managers and employees.",
    "preprocessed_description": "OVERVIEW A Sales Associate contributes to driving sales through providing a genuine experience to each customer. RESPONSIBILITIES Brand Experience Acts as a brand representative reflective of the company values Initiates conversation, shares advice and product knowledge to interact with the customer in a personalized way Utilizes technology to be well-informed on company priorities and promotions in-store and online; delivers a seamless, omni channel shopping experience through utilization of the tools available to service the customer (i.e. MPOS, POS, In-Store & Curbside Pick Up) Teamwork + Communication Contributes to the store by being positive, respectful, and helpful to others Collaborates with peers and leadership, sharing ideas and jumping in to support the needs of the team Exhibits a willingness to learn and adapt; is flexible to change and open to try new ways of doing things Visual + Business Operations Maintains Urban Outfitters' visual and operational standards while keeping the focus on the customer Supports the shipment process to gain awareness of product including what is new and what is already on the floor; contributes to completion of omni order fulfillment processes Adheres to store's safety standards, inventory accuracy, reduction of product loss, and upholds all company policy and procedures to support the profitability of the store QUALIFICATIONS Passion for UO brand Experience in customer service Experience being a team player Ability to work flexible hours to meet the needs of the store including nights, weekends, and holidays Urban Outfitters, Inc. celebrates diversity and is committed to creating an inclusive environment for all employees. We are proud to provide equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, sex (including gender, pregnancy, sexual orientation, and gender identity or expression), religion, creed, age, physical or mental disability, national origin or ancestry, ethnicity, citizenship, service in the uniformed services, genetic information, or any other protected characteristic as established by law. We believe strongly in fostering a safe, fair and respectful work environment. To ensure compliance with our non-discrimination and anti-harassment policies, we offer anti-harassment training to managers and employees.",
    "processed_description": "overview Sales Associate contribute drive sale provide genuine customer . responsibility brand brand representative reflective company Initiates conversation share advice product knowledge interact customer personalized utilize technology inform company priority promotion store online deliver seamless omni channel shopping utilization tool service customer i.e. MPOS POS Store Curbside pick teamwork + communication contribute store positive respectful helpful collaborate peer leadership share idea jump support team exhibit willingness learn adapt flexible change open thing visual + Business Operations maintain Urban Outfitters' visual operational standard focus customer support shipment process gain awareness product include floor contribute completion omni order fulfillment process Adheres store's safety standard inventory accuracy reduction product loss uphold company policy procedure support profitability store qualification passion UO brand customer service team player flexible hour meet store include night celebrate diversity commit create inclusive environment employee . provide equal employment EEO employee applicant employment regard race color sex include gender pregnancy sexual orientation gender identity expression religion creed age physical mental national origin ancestry ethnicity citizenship service uniformed service genetic information protect characteristic establish law . foster safe fair respectful environment . ensure compliance discrimination anti harassment policy offer anti harassment training manager employee .",
    "results_group": {
        "extracted_noun_chunks": [
            "equal employment EEO employee applicant employment regard race color sex",
            "i.e. MPOS",
            "store",
            "company priority promotion store",
            "night",
            "Sales Associate contribute drive sale",
            "genuine customer",
            "Business Operations",
            "gender pregnancy sexual orientation gender identity expression religion",
            "company policy procedure support profitability store qualification passion",
            "age physical mental national origin ancestry ethnicity citizenship service uniformed service genetic information",
            "flexible change open thing",
            "overview",
            "awareness product",
            "POS Store Curbside",
            "communication",
            "anti harassment training manager employee",
            "diversity commit",
            "law",
            "Adheres store's safety standard inventory accuracy reduction product loss",
            "safe fair respectful environment",
            "compliance discrimination anti harassment policy",
            "responsibility brand brand representative reflective company Initiates conversation",
            "customer",
            "UO brand customer service team player flexible hour meet store",
            "seamless omni channel shopping utilization tool service customer",
            "teamwork",
            "jump support team exhibit willingness",
            "floor",
            "inclusive environment employee",
            "Urban Outfitters' visual operational standard focus customer support shipment process",
            "technology",
            "advice product knowledge"
        ],
        "combined_lemmatized_tokens": "overview Sales Associate contribute drive sale provide genuine customer . responsibility brand brand representative reflective company Initiates conversation share advice product knowledge interact customer personalized utilize technology inform company priority promotion store online deliver seamless omni channel shopping utilization tool service customer i.e. MPOS POS Store Curbside pick teamwork + communication contribute store positive respectful helpful collaborate peer leadership share idea jump support team exhibit willingness learn adapt flexible change open thing visual + Business Operations maintain Urban Outfitters' visual operational standard focus customer support shipment process gain awareness product include floor contribute completion omni order fulfillment process Adheres store's safety standard inventory accuracy reduction product loss uphold company policy procedure support profitability store qualification passion UO brand customer service team player flexible hour meet store include night celebrate diversity commit create inclusive environment employee . provide equal employment EEO employee applicant employment regard race color sex include gender pregnancy sexual orientation gender identity expression religion creed age physical mental national origin ancestry ethnicity citizenship service uniformed service genetic information protect characteristic establish law . foster safe fair respectful environment . ensure compliance discrimination anti harassment policy offer anti harassment training manager employee ."
    }
}