{
    "id": "ab88d2ec4cabf7ea",
    "company": "Siemens Healthineers",
    "positionName": "Research Scientist/Engineer, 12 Month Contract",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-07T02:03:02.289Z",
    "url": "https://www.indeed.ca/rc/clk?jk=ab88d2ec4cabf7ea&from=jasx&tk=1hc6garcoih7o800&vjs=3",
    "externalApplyLink": "https://jobs.siemens.com/careers/job/563156116424254?domain=siemens.com&hl=en&jobPipeline=Indeed",
    "companyDescription": "",
    "description": "Do you want to join us in helping to fight the world’s most threatening diseases and enabling access to care for more people around the world? At Siemens Healthineers, we pioneer breakthroughs in healthcare. For everyone. Everywhere.\n  \n   At Siemens Healthineers, We offer you a flexible and dynamic environment with opportunities to go beyond your comfort zone in order to grow personally and professionally. Sound interesting? Then come and join our global team as a Research Scientist to be a member of the System Performance Team participating in designing, validating, transferring to production and ensuring technical support of electrochemical assays and associated production processes, analytical systems and QC fluids/systems\n  \n   Our global team: We are a team of more than 69,000 highly dedicated employees across more than 70 countries passionately pushing the boundaries of what’s possible in healthcare to help improve people’s lives around the world. As a leader in the industry, we aspire to create better outcomes and experiences for patients no matter where they live or what health issues they are facing. Our portfolio, spanning from in-vitro and in-vivo diagnostics to image-guided therapy and innovative cancer care, is crucial for clinical decision-making and treatment pathways.\n  \n   Our culture: We are part of an incredible community of scientists, clinicians, developers, researchers, professionals, and skilled specialists pushing the boundaries of what’s possible, to improve people’s lives around the world. We embrace a culture of inclusivity in which the power and potential of every individual can be unleashed. We spark ideas that lead to positive impact and continued success. Check our Careers Site at https://jobs.siemens-healthineers.com/careers\n  \n   This is a role well suited to an ambitious professional, looking for the next step in their career. As a Research Scientist you will be responsible to: \n  \n   Design, perform, analyze and summarize experiments leading to the design and characterization of electrochemical and/or optical assays. \n   Assist in the development of an optimized production process and associated QC fluids/systems for electrochemical and/or optical assays. \n   Assist in the design verification and validation studies of new and existing assays \n   Assist in the preparation of 510k application(s) and other regulatory activities \n   Participate in construction of the design history file and device master record. \n   Interface with the production team as well as other resources needed to ensure smooth transfer to production and technical support after product launch. \n   Participate in product support after launch assisting manufacturing, QA/RA, sales and marketing, technical support teams as needed \n  \n  \n   This position may suit you best if you are familiar with what is below, and would like to do develop your career with Healthineers  \n  \n   Integrate within in a highly multidisciplinary team in charge of developing various sensors, their specific production processes and measurement system(s). Manage assigned tasks in an extremely interfaced team on tight deadlines \n   A strong ability to work well in a team setting and commitment to effectively manage change \n   Must be able to shift priorities as opportunities or issues arise \n   Flexibility in working in a quality system environment \n   Ability to communicate, both orally and written, with peers and management \n   Integrity, professionalism and overall commitment to excellence are paramount \n   A sense of urgency and results orientation with a dedicated focus toward product launch \n   Strong understanding of statistical methods and analysis \n   Physical \n   \n    Extended period of sitting/computer use \n    Extended period of standing/card testing \n    Manual dexterity \n    Ability to distinguish colors/read/write charts \n   \n  \n  \n  Required skills to have for the success of this role\n  \n   \n   2+ years of relevant industrial experience \n   B.Sc. or M. Sc. In Chemical Engineering, Analytical Chemistry, Electrochemistry, Clinical Chemistry, Biomedical Engineering or related disciplines and/or an equivalent combination of education and technical experience acceptable to Epocal. \n  \n  \n   Analytical chemistry, clinical chemistry, optics and/or electro-chemical background \n   Experience in medical device industry/ISO and FDA regulated environments is a strong asset \n   Experience with JMP is an asset \n   Knowledge of Microsoft Office applications \n   Equivalent combination of education and technical experience acceptable to Epocal. \n  \n  \n   While we appreciate all applications we receive, we advise that only candidates under consideration will be contacted.\n  \n   In our continued commitment to prioritize colleague health, comply with customer/business partner requirements, and help preserve our business continuity, Siemens Healthineers requires employees, contractors, and business partners to be fully vaccinated with relevant dose(s) of a Health Canada approved vaccine for all new hires by their start date. \n  \n  “Fully vaccinated” means it has been 14 days after receiving the full series of a COVID-19 vaccine or combination of COVID-19 vaccines approved by Health Canada (i.e. two doses of a two-dose vaccine series, or one dose of a single-dose vaccine series), and which may include, at the Company’s discretion, any further doses in accordance with Health Canada guidelines.\n  \n   Exemptions will only be granted for medical reasons or on the basis of a protected ground under applicable human rights legislation.\n  \n   At Siemens Healthineers, we value those who dedicate their energy and passion to a greater cause. Our people make us unique as an employer in the med-tech industry. What unites and motivates our global team is the inspiration of our common purpose: To innovate for healthcare, building on our remarkable legacy of pioneering ideas that translate into even better healthcare products and services. We recognize that taking ownership of our work allows both us and the company to grow. We offer you a flexible and dynamic environment and the space to move beyond your comfort zone to grow both personally and professionally.\n  \n   If you want to join us in transforming the way healthcare is delivered, visit our career site at https://jobs.siemens-healthineers.com/careers\n  \n   If you wish to find out more about the specific division before applying, please visit: \n  https://www.siemens-healthineers.com/en-ca/about\n  \n   Beware of Job Scams\n   Please beware of potentially fraudulent job postings or suspicious recruiting activity by persons that are currently posing as Siemens Healthineers recruiters/employees. These scammers may attempt to collect your confidential personal or financial information. If you are concerned that an offer of employment with Siemens Healthineers might be a scam or that the recruiter is not legitimate, please verify by searching for the posting on the Career site: https://jobs.siemens-healthineers.com/careers\n \n  \n  \n  \n  \n Siemens is committed to creating a diverse environment and is proud to be an equal opportunity employer. Upon request, Siemens Canada will provide reasonable accommodation for disabilities to support participation of candidates in all aspects of the recruitment process. All qualified applicants will receive consideration for employment.  By submitting personal information to Siemens Canada Limited or its affiliates, service providers and agents, you consent to our collection, use and disclosure of such information for the purposes described in our Privacy Code available at www.siemens.ca.\n  Siemens s’engage à créer un environnement diversifié et est fière d’être un employeur souscrivant au principe de l’égalité d’accès à l’emploi. Sur demande, Siemens Canada prendra des mesures d’accommodement raisonnables pour les personnes handicapées, dans le but de soutenir la participation des candidats dans tous les aspects du processus de recrutement. Tous les candidats qualifiés seront pris en considération pour ce poste.  En transmettant des renseignements personnels à Siemens Canada limitée ou à ses sociétés affiliées, à ses fournisseurs de services ou à ses agents, vous nous autorisez à recueillir, à utiliser et à divulguer ces renseignements aux fins prévues dans notre Code de protection de la confidentialité, que vous pouvez consulter au www.siemens.ca."
}