{
    "id": "4eabbbda1842136d",
    "companyDescription": "",
    "description": "Want to help build a sustainable future, protect the environment, and make a real difference, every day? At Convertus Group, we offer career opportunities at the cutting-edge of organic waste treatment, to talented and enthusiastic people like you!\nWhat We Do\nWe partner with communities in North America to design, build, operate and service state-of-the-art organic waste treatment facilities. Our eco-friendly facilities divert residential and commercial organic (green) waste from landfills and convert it into valuable resources such as biogas and compost.\nWhy We Do It\nWe inspire and empower communities to close the loop for a sustainable future for all our children. Why not join us?\nWhat do you need to love about your work?\nAre you an individual who feels motivated by the Convertus values of Care, One Team, and Creativity?\nDoes discovering new solutions for current problems energize you?\nDo you love leading a team of driven individuals?\nDoes a constantly changing list of priorities and action items excite you?\nIf you answer yes to these questions, read on for the qualifications!\nWhat are we looking for on your CV?\n\n Knowledge of composting processes and process installation(s) preferably experienced in biological processing of organic waste streams\n Post-secondary degree or diploma in sciences or related field (biology, chemistry, environmental engineering, etc.).\n Clear understanding of the value of compost and its by-products.\n Two years’ experience with SCADA and different types of measuring and control technology.\n Intermediate computer skills (MS Office, SCADA, ERP).\n\nWhy us?\nWe strive to offer an environment that provides our associates with the right balance between work and family. We offer a comprehensive benefits package including:\n\n Profit-Sharing\n Medical and Dental\n Professional Development and Training\n Tuition Reimbursement Program\n Workplace Wellness Programs\n Paid Time Off – Sick, Vacation\n Employee Assistance Programs\n Employee Recognition Programs\n Dress for your day policy\n\nFeel that this position is calling your name? Apply now!\nConvertus Group is a Living Wage and Progressive Indigenous Relations committed employer. We believe in providing equal opportunity and creating an inclusive environment for all candidates and employees. We welcome applications regardless of ethnic origin, national origin, gender, gender identity, race, colour, religious beliefs, disability, sexual orientation, age, or marital status.\nWe thank you for your application; however, only successful applicants will be contacted.\nJob Type: Full-time\nSchedule:\n\n Monday to Friday\n\nAbility to commute/relocate:\n\n Gloucester, ON K1G 3Y3: reliably commute or plan to relocate before starting work (preferred)\n\nExperience:\n\n Leadership: 1 year (preferred)\n\nLicence/Certification:\n\n Drivers Licence (preferred)\n\nWork Location: In person",
    "preprocessed_description": "Want to help build a sustainable future, protect the environment, and make a real difference, every day? At Convertus Group, we offer career opportunities at the cutting-edge of organic waste treatment, to talented and enthusiastic people like you! What We Do We partner with communities in North America to design, build, operate and service state-of-the-art organic waste treatment facilities. Our eco-friendly facilities divert residential and commercial organic (green) waste from landfills and convert it into valuable resources such as biogas and compost. Why We Do It We inspire and empower communities to close the loop for a sustainable future for all our children. Why not join us? What do you need to love about your work? Are you an individual who feels motivated by the Convertus values of Care, One Team, and Creativity? Does discovering new solutions for current problems energize you? Do you love leading a team of driven individuals? Does a constantly changing list of priorities and action items excite you? If you answer yes to these questions, read on for the qualifications! What are we looking for on your Curriculum Vitae? Knowledge of composting processes and process installation(s) preferably experienced in biological processing of organic waste streams Post-secondary degree or diploma in sciences or related field (biology, chemistry, environmental engineering, etc.). Clear understanding of the value of compost and its by-products. Two years' experience with SCADA and different types of measuring and control technology. Intermediate computer skills (MS Office, SCADA, Enterprise Resource Planning). Why us? We strive to offer an environment that provides our associates with the right balance between work and family. We offer a comprehensive benefits package including: Profit-Sharing Medical and Dental Professional Development and Training Tuition Reimbursement Program Workplace Wellness Programs Paid Time Off – Sick, Vacation Employee Assistance Programs Employee Recognition Programs Dress for your day policy Feel that this position is calling your name? Apply now! Convertus Group is a Living Wage and Progressive Indigenous Relations committed employer. We believe in providing equal opportunity and creating an inclusive environment for all candidates and employees. We welcome applications regardless of ethnic origin, national origin, gender, gender identity, race, colour, religious beliefs, disability, sexual orientation, age, or marital status. We thank you for your application; however, only successful applicants will be contacted. Job Type: Full-time Schedule: Monday to Friday Ability to commute/relocate: Gloucester, ON K1G 3Y3: reliably commute or plan to relocate before starting work (preferred) Experience: Leadership: 1 year (preferred) Licence/Certification: Drivers Licence (preferred) Work Location: In person",
    "processed_description": "help build sustainable future protect environment real difference offer career cutting edge organic waste treatment talented enthusiastic people partner community design build operate service state art organic waste treatment facility . eco friendly facility divert residential commercial organic green waste landfill convert valuable resource biogas compost . inspire empower community close loop sustainable future child . join love individual feels motivate Convertus Team creativity discover solution current problem energize love lead team drive individual constantly change list priority action item excite answer question read qualification Curriculum Vitae knowledge compost process process installation preferably biological processing organic waste stream post secondary degree diploma science field biology chemistry environmental engineering . . clear understanding compost product . year' type measure control technology . intermediate computer skill . strive offer environment provide associate balance family . offer comprehensive benefit package include profit Sharing Medical Dental Professional Development Training Tuition Reimbursement Program Workplace Wellness Programs Paid – Sick Vacation Employee Assistance Programs Employee Recognition Programs dress policy feel position apply Living Wage Progressive Indigenous Relations commit employer . provide equal create inclusive environment employee . application ethnic origin national origin gender gender identity race colour religious belief sexual orientation age marital status . application successful applicant contact . type schedule commute relocate K1G 3Y3 reliably commute plan relocate start preferred leadership preferred Licence Certification Drivers Licence preferred location person",
    "results_group": {
        "extracted_noun_chunks": [
            "comprehensive benefit package",
            "sustainable future protect environment real difference",
            "position",
            "profit Sharing Medical Dental Professional Development Training Tuition Reimbursement Program Workplace Wellness Programs Paid",
            "preferred leadership",
            "application ethnic origin national origin gender gender identity race colour religious belief sexual orientation age marital status",
            "associate balance family",
            "answer question",
            "Sick Vacation Employee Assistance Programs Employee Recognition Programs dress policy",
            "list priority action item",
            "eco friendly facility",
            "career cutting edge organic waste treatment talented enthusiastic people partner community design build",
            "type schedule commute",
            "read qualification Curriculum Vitae knowledge compost process process installation preferably biological processing organic waste stream post secondary degree diploma science field biology chemistry environmental engineering",
            "environment",
            "year' type measure control technology",
            "successful applicant contact",
            "compost product",
            "love individual",
            "K1G 3Y3 reliably commute plan",
            "love lead team",
            "valuable resource biogas compost",
            "Convertus Team creativity",
            "individual",
            "employer",
            "application",
            "intermediate computer skill",
            "service state art organic waste treatment facility",
            "residential commercial organic green waste landfill",
            "community close loop sustainable future child",
            "inclusive environment employee",
            "Living Wage Progressive Indigenous Relations",
            "preferred Licence Certification Drivers Licence preferred location person"
        ],
        "combined_lemmatized_tokens": "help build sustainable future protect environment real difference offer career cutting edge organic waste treatment talented enthusiastic people partner community design build operate service state art organic waste treatment facility . eco friendly facility divert residential commercial organic green waste landfill convert valuable resource biogas compost . inspire empower community close loop sustainable future child . join love individual feels motivate Convertus Team creativity discover solution current problem energize love lead team drive individual constantly change list priority action item excite answer question read qualification Curriculum Vitae knowledge compost process process installation preferably biological processing organic waste stream post secondary degree diploma science field biology chemistry environmental engineering . . clear understanding compost product . year' type measure control technology . intermediate computer skill . strive offer environment provide associate balance family . offer comprehensive benefit package include profit Sharing Medical Dental Professional Development Training Tuition Reimbursement Program Workplace Wellness Programs Paid – Sick Vacation Employee Assistance Programs Employee Recognition Programs dress policy feel position apply Living Wage Progressive Indigenous Relations commit employer . provide equal create inclusive environment employee . application ethnic origin national origin gender gender identity race colour religious belief sexual orientation age marital status . application successful applicant contact . type schedule commute relocate K1G 3Y3 reliably commute plan relocate start preferred leadership preferred Licence Certification Drivers Licence preferred location person"
    }
}