{
    "id": "0ed263bc55a58b17",
    "company": "National Research Council Canada",
    "positionName": "Research Officer, Insulation and Roofing",
    "jobType": [],
    "location": "1200 Montreal Rd, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-01T20:08:57.418Z",
    "url": "https://www.indeed.ca/rc/clk?jk=0ed263bc55a58b17&from=jasx&tk=1he3lkogbirpe800&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=0ed263bc55a58b17&atk=&xpse=SoCl67I3IDjb9uRTop0LbzkdCdPP",
    "companyDescription": "",
    "description": "Help bring research to life and drive your career forward with the National Research Council of Canada (NRC), Canada's largest research and technology organization.  We are looking for a Research Officer, Insulation and Roofing to support our Construction Research Centre. The Research Officer, Insulation and Roofing would be someone who shares our core values of Integrity, Excellence, Respect and Creativity.  NRC Construction is implementing the “Platform to Decarbonize the Construction Sector at Scale” to accelerate and scale up new technologies to help transition the Canadian construction sector towards decarbonization and contribute to the emerging low-carbon economy. It will also establish new codes, standards, specifications, and guidelines to position the sector to achieve its 2050 greenhouse gas (GHG) carbon reduction targets. These investments will help spur the growth of Canada’s clean technology sector and help achieve Canada’s international commitments to reduce GHG emissions.  The primary responsibility of the Research Officer (RO) is to support the goals of NRC and the Research Centre through application of research of international calibre and through the development and application of advanced building envelope and insulation technologies. The RO works in a team environment with researchers and technical experts in world-class facilities. The RO will be responsible for developing, conducting, coordinating and reporting research projects related to roofing and insulation materials, specifically 1) conducting research on sustainability of rooftop technologies (green roofs, cool roofs and nature based solutions) and 2) life cycle analysis of roofs. The RO will be applying science and engineering theories and developing technical approaches to solve roofing research challenges complementing the overall direction and research priorities for the Building Envelope and Materials (BEM) resource group. Activities also include interaction and collaboration with the construction industry, Canadian Construction Material Centre (CCMC), and researchers from universities and national laboratories. The RO will present the research results in the form of conference papers, peer-reviewed journal papers, test standards and code changes. \n   \n  \n  \n   \n     Screening Criteria\n   \n   \n     Applicants must demonstrate within the content of their application that they meet the following screening criteria in order to be given further consideration as candidates: \n   \n  \n  \n   \n     Education\n   \n   \n     PhD in engineering or a relevant field of science, with an emphasis on sustainable building envelopes. \n    For information on certificates and diplomas issued abroad, please see Degree equivalency \n   \n  \n  \n   \n     Experience\n   \n   \n   \n     \n    \n     Experience in conducting research or technical activities dealing with the durability performance of building envelope materials and assemblies. \n     Experience in conducting research or technical activities related to sustainability of rooftop technologies such as green roofs, cool roofs and nature based solutions. \n     Experience in research activities related to LCA supporting Low/Net Zero Carbon/Energy Building design strategies, thermal modelling and building life-cycle assessments \n     Experience in client needs identification, marketing activities, and/or the development of partnerships and collaborations. \n     Experience interacting with standard bodies, on specifications or building codes or standards dealing with performance of building envelope materials and components (NBCC, NECB, ASHRAE, ASTM, CSA etc.) \n     Experience in participating in lab maintenance/upgrade/calibration process. \n     Experience in developing and writing research ideas and converting those ideas into business cases. \n    \n   \n  \n  \n   \n    Condition of Employment\n   \n   \n      Reliability Status \n   \n  \n  \n   \n     Language Requirements\n   \n   \n     English\n     \n     \n    Information on language requirements and self-assessment tests \n   \n  \n  \n   \n     Assessment Criteria\n   \n   \n     Candidates will be assessed on the basis of the following criteria: \n   \n  \n  \n   \n     Technical Competencies\n   \n   \n   \n     \n    \n     Solid understanding of built environment and building physics. \n     Solid understanding of life cycle environmental impacts of materials and systems and familiarity to use LCA software. \n     Ability to design and conduct laboratory and field experiments for short and long term performance assessment of building envelope materials and components. \n     Knowledge of building codes and standards related to performance requirements of the building envelope materials and components. \n     Ability to interact with clients and stakeholders to initiate projects supporting innovation in construction materials, including marketing of services and facilities. \n    \n   \n  \n  \n   \n    Behavioural Competencies \n   \n   \n    Research - Teamwork (Level 2) \n    Research - Self-knowing and self-development (Level 2) \n    Research - Results orientation (Level 2) \n    Research - Communication (Level 2) \n   \n  \n  \n   \n    Competency Profile(s)\n   \n   \n     For this position, the NRC will evaluate candidates using the following competency profile: Research\n     \n     \n   \n  \n  \n   \n     Relocation\n   \n   \n     Relocation assistance will be determined in accordance with the NRC's directives. \n   \n  \n  \n   \n     Compensation\n   \n   \n     The intent of this hiring action is to staff this position at the AsRO-AcRo level, which is an early to mid-career level position with a salary range of $74,230 to $123,393. \n    NOTE: Please note that the full RO/RCO salary scale has five levels. Salary determination will be based on a review of the candidate’s expertise, outcomes and impacts of their previous work experience relative to the requirements of the level. As such, the initial salary could be within another level of the RO/RCO salary scale (i.e. above or below the intended level for this position).\n     \n     \n    NRC employees enjoy a wide-range of competitive benefits including comprehensive health and dental plans, pension and insurance plans, vacation and other leave entitlements.\n     \n   \n  \n  \n   \n    Notes \n   \n   \n    \n     A pre-qualified list may be established for similar positions for a one year period. \n     Preference will be given to Canadian Citizens and Permanent Residents of Canada. Please include citizenship information in your application. \n     The incumbent must adhere to safe workplace practices at all times. \n     We thank all those who apply, however only those selected for further consideration will be contacted.\n    \n   \n  \n \n  \n  \n Please direct your questions, with the requisition number (18867) to: \n E-mail: NRC.NRCHiring-EmbaucheCNRC.CNRC@nrc-cnrc.gc.ca \n Telephone: 343-571-6509 \n Closing Date: 17 November 2023 - 23:59 Eastern Time"
}