{
    "id": "7d980dcd4d4ba633",
    "company": "R.W. Tomlinson Limited",
    "positionName": "Summer/Co-Op Students 2024",
    "jobType": [
        "Full-time",
        "Internship / Co-op"
    ],
    "location": "100 Citigate Drive, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-26T12:14:12.044Z",
    "url": "https://www.indeed.ca/rc/clk?jk=7d980dcd4d4ba633&from=jasx&tk=1hl5dcuan2fci002&bb=meFSaZ2jpWfCb2DCBnnuQB9mXobipEab--wxVKEiFa57w3uIZfLQ7_xWNa-yyQxhNAhX3kNf67fP74oUdoFIOWcTuuciG1-G0E9xzs69BjnBIFNEbLTatg%3D%3D&xkcb=SoCl67M3FlS8FtXIwZ0JbzkdCdPP&vjs=3",
    "externalApplyLink": "https://career8.successfactors.com/career?career_ns=job_listing&company=rwtomlinso&navBarLevel=JOB_SEARCH&rcm_site_locale=en_US&career_job_req_id=4381&jobPipeline=Indeed",
    "job_info_group": {
        "extracted_phone_numbers": [],
        "extracted_links": [
            "HTTP/HTTPS Links",
            "General Links",
            "WWW Links",
            "TLDs"
        ],
        "extracted_emails": [],
        "extracted_location_data": [],
        "extracted_dates": [
            "May to August 2024",
            "1952"
        ],
        "extracted_languages": [],
        "extracted_laws": [],
        "extracted_norps": [],
        "extracted_orgs": [
            "Twitter",
            "a Post-Secondary Program",
            "Facebook",
            "Ottawa & Kingston Below"
        ],
        "extracted_persons": [
            "R.W. Tomlinson",
            "Tomlinson"
        ],
        "extracted_products": [],
        "extracted_money": [
            {
                "amount": "500",
                "noun_phrases": []
            }
        ],
        "processed_text": "family operate business grow single axle dump truck Eastern Canada's leader environmental construction transportation infrastructure service . seek hire student team . position . location list position hire Accounts Receivable Student Administrators BBQ Coordinator Concrete Quality Control Technician Construction Coordinators estimation student support Technician Junior Network Administrator Laboratory Technician Labourers Landscapers Material Testing Student Operations Support Customer Service Kingston Project Controls Student Quarry Labourers Sales Administrator Survey Coordinator Requirements valid driver's license reliable transportation enrol attract develop retain good people . apply employee include student . play active role help define career plan develop skill . offer seasonal Bursary eligible student award upwards explore support community . family operate company understand help community . idea follow LinkedIn"
    },
    "companyDescription": "The Tomlinson Group of Companies is Eastern Canada’s leader in environmental, construction and transportation infrastructure services. The third-generation family-owned business is headquartered in Ottawa, Ontario. Through six decades of growth and innovation, Tomlinson has become a fully-integrated corporation providing a large array of turnkey services to its municipal, provincial, residential and industrial customers. Tomlinson boasts a staff of over 2000 skilled professionals and tradespeople. Tomlinson’s size and streamlined/consolidated structure allows the company to retain specialized technical expertise and centralized administrative resources to implement functional quality, safety, and environmental management systems. Our group of companies offers:\r\n\r\nRoad Building, Structures & Site Development\r\nSewer & Watermain\r\nPiling and Shoring\r\nDemolition & Remediation Services\r\nConcrete Supply\r\nSpecialty Sand Products, Aggregates and Asphalt Supply\r\nEnvironmental Services\r\nBiosolids and Organics Management\r\nDatashred Security\r\nSpecialized Parts Manufacturing and Machining\r\n\r\nTomlinson’s high standards have helped the company raise the bar for quality, professionalism, and customer satisfaction. Tomlinson developed a governing set of corporate Core Values that promote quality, safety, and service both internally and externally. By conducting its business in line with this set of Core Values, Tomlinson is able to consistently provide its customers with high quality materials and services that satisfy the most stringent municipal, provincial, and national standards.",
    "description": "Founded in 1952, Tomlinson is a family-owned and operated business that has grown from a single-axle dump truck to Eastern Canada’s leader in environmental, construction and transportation infrastructure services.\n  \n  \n R.W. Tomlinson is seeking to hire over 30 students for our various teams from May to August 2024. This would be a full-time position.\n  \n \n Locations: Ottawa & Kingston\n  \n  \n Below is a list of all positions we are hiring for: \n \n  Accounts Receivable Student \n  Administrators \n  BBQ Coordinator \n  Concrete Quality Control Technician \n  Construction Coordinators \n  Estimation Students \n  IT Support Technician \n  Junior Network Administrator \n  Laboratory Technician \n  Labourers \n  Landscapers \n  Material Testing Student \n  Operations Support/Customer Service (Kingston) \n  Project Controls Student \n  Quarry Labourers \n  Sales Administrator \n  Survey Coordinator\n \n  \n  \n Requirements: \n \n  Valid driver's license and reliable transportation \n  Enrolled in a Post-Secondary Program\n \n  \n  \n At Tomlinson, we believe in attracting, developing, and retaining the best people. This applies to all employees, including students. We play an active role in helping you define your career plan and develop the skills you need to get there.\n  \n  \n Tomlinson also offers a Seasonal Bursary for all eligible students; you can be awarded upwards of $500!\n  \n  \n Explore how Tomlinson supports communities with #TomlinsonCares. As a family-owned and operated company, we understand the importance of helping our communities.  Want to have a better idea about our day-to-day? Follow us on LinkedIn, Twitter, and Facebook!"
}