{
    "id": "5c608c4ae90f686a",
    "companyDescription": "Natural Resources Canada develops policies and programs that enhance the contribution of the natural resources sector to the economy, improve the quality of life for all Canadians and conduct innovative science in facilities across Canada to generate ideas and transfer technologies. We also represent Canada at the international level to meet the country's global commitments related to the sustainable development of natural resources.",
    "description": "Natural Resources Canada - Lands and Minerals Sector \n    Ottawa (Ontario) \n    EG-04 \n    $70,159 to $88,195 \n   For further information on the organization, please visit Natural Resources Canada \n   Closing date: 7 February 2024 - 23:59, Pacific Time \n   Who can apply: Persons residing in Canada, and Canadian citizens and Permanent residents abroad. \n   Apply online \n  \n \n Important messages \n We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process. If you need to be accommodated during any phase of the evaluation process, please use the Contact information below to request specialized accommodation. All information received in relation to accommodation will be kept confidential.\n  Assessment accommodation \n The Government of Canada is committed to building a skilled workforce that is representative of Canada's diversity, which includes the recruitment of Canadian Veterans and releasing Canadian Armed Forces personnel: https://www.canada.ca/en/public-servicecommission/jobs/services/publicservice-jobs/canadian-armed-forcesmembers-veterans.html  We encourage applicants to identify any abilities, competencies, and/or experiences acquired through employment with the Canadian Armed Forces where applicable. \n Work environment\n  At Natural Resources Canada, a Federal government job means developing leadership skills, fostering teamwork, and supporting creativity and innovation. We know it takes people from diverse pools of talent to make this happen. That is why we are looking for people like you. As an employee at Natural Resources Canada you can enjoy diverse employment opportunities, a range of career development programs, and a learning culture that supports you to learn on an ongoing basis. We support balancing your work and private life by offering the benefits of flexible work arrangements.  NRCan has transitioned to a hybrid work environment which offers employees the opportunity to telework and work from the designated work location, subject to operational requirements. This position will require an in-office presence for a minimum of two (2) days a week. \n Intent of the process \n The intent of this selection process is to staff a full-time indeterminate position. \n Positions to be filled: 1 \n Information you must provide \n Your résumé. \n In order to be considered, your application must clearly explain how you meet the following (essential qualifications)\n  Education: Successful completion of an acceptable post-secondary training program in mining or geological engineering technology ou earth resources technology or an acceptable combination of education, training and/or experience\n  Degree equivalency\n \n   Experience\n   \n  \n   Extensive experience of more than 3 years of laboratory or field work, relevant to the duties of the position\n   Experience working with database or spreadsheet software\n   Experience providing services for external clients\n  \n \n  If you possess any of the following, your application must also clearly explain how you meet it (other qualifications)\n \n   Asset Qualifications\n   \n  \n   Experience working in a geological or civil engineering testing laboratory\n   Experience working in a research and development environment \n   Experience working with machine shop equipment\n   Experience with industrial equipment\n  \n \n  The following will be applied / assessed at a later date (essential for the job)\n  English essential\n  Information on language requirements\n \n   Knowledge\n   \n  \n   Of mining methods and technologies used in the Canadian mining industry\n   Of laboratory testing practices related to geomechanics\n   Knowledge of data processing and analysis\n   Knowledge of techniques for validating data for accuracy\n   Knowledge of standard operating procedures in a laboratory environment\n   Knowledge of laboratory safety practices\n  \n \n \n   Abilities/Competencies\n   \n  \n   Ability to organize field or laboratory data \n   Ability to manage time effectively\n   Ability to communicate effectively orally\n   Ability to communicate effectively in writing\n  \n \n \n   Personal Suitability\n   \n  \n   Effective interpersonal relationships\n   Attention to detail\n   Initiative\n   Dependability\n   Working under minimal supervision\n  \n \n  The following may be applied / assessed at a later date (may be needed for the job)\n  Selection may be limited to members of the following Employment Equity groups: Aboriginal persons, persons with disabilities, visible minorities, women\n  Information on employment equity\n  Organizational Needs: Natural Resources Canada is committed to establishing and maintaining a representative workforce. This organizational need may be identified as part of the appointment decision. In such cases, qualified candidates who self-declare as members of a visible minority group, Indigenous peoples, persons with disabilities or women could be considered in priority.\n  Conditions of employment\n  Reliability Status security clearance \n Other information \n The Public Service of Canada is committed to building a skilled and diverse workforce that reflects the Canadians we serve. We promote employment equity and encourage you to indicate if you belong to one of the designated groups when you apply.\n  Information on employment equity \n The hiring organization will accept applications on-line only. All job applications must therefore be submitted through the Government of Canada jobs website. To submit an application on-line, please select the button “Apply Online” below. Persons with disabilities preventing them from applying on-line are asked to contact the person named below.  It is our intention to communicate with candidates via email for assessment purposes. This will include communication of invitations to written tests and interviews. To that end, candidates must include a valid email address in their application. It is the candidate’s responsibility to ensure that this address is functional and that it accepts messages from unknown users (some email systems block these types of email). It is also the candidate’s responsibility to ensure accurate information is provided and updated as required.  Candidates invited to an interview will be required to bring proof of their education credentials, in the form of a diploma or official transcript (original documents only). Candidates with foreign credentials must provide proof Canadian equivalency. Consult the Canadian Information Centre for International Credentials for further information at http://www.cicic.ca.  Reference checks may be sought.  An interview may be administered.  A test may be administered.  You must provide proof of your education credentials.  Persons are entitled to participate in the appointment process in the official language(s) of their choice. \n Preference \n Preference will be given to veterans first and then to Canadian citizens and permanent residents, with the exception of a job located in Nunavut, where Nunavut Inuit will be appointed first.\n  Information on the preference to veterans \n We thank all those who apply. Only those selected for further consideration will be contacted.",
    "preprocessed_description": "Natural Resources Canada - Lands and Minerals Sector Ottawa (Ontario) EG-04 $70,159 to $88,195 For further information on the organization, please visit Natural Resources Canada Closing date: 7 February 2024 - 23:59, Pacific Time Who can apply: Persons residing in Canada, and Canadian citizens and Permanent residents abroad. Apply online Important messages We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process. If you need to be accommodated during any phase of the evaluation process, please use the Contact information below to request specialized accommodation. All information received in relation to accommodation will be kept confidential. Assessment accommodation The Government of Canada is committed to building a skilled workforce that is representative of Canada's diversity, which includes the recruitment of Canadian Veterans and releasing Canadian Armed Forces personnel: https://www.canada.ca/en/public-servicecommission/jobs/services/publicservice-jobs/canadian-armed-forcesmembers-veterans.html We encourage applicants to identify any abilities, competencies, and/or experiences acquired through employment with the Canadian Armed Forces where applicable. Work environment At Natural Resources Canada, a Federal government job means developing leadership skills, fostering teamwork, and supporting creativity and innovation. We know it takes people from diverse pools of talent to make this happen. That is why we are looking for people like you. As an employee at Natural Resources Canada you can enjoy diverse employment opportunities, a range of career development programs, and a learning culture that supports you to learn on an ongoing basis. We support balancing your work and private life by offering the benefits of flexible work arrangements. NRCan has transitioned to a hybrid work environment which offers employees the opportunity to telework and work from the designated work location, subject to operational requirements. This position will require an in-office presence for a minimum of two (2) days a week. Intent of the process The intent of this selection process is to staff a full-time indeterminate position. Positions to be filled: 1 Information you must provide Your résumé. In order to be considered, your application must clearly explain how you meet the following (essential qualifications) Education: Successful completion of an acceptable post-secondary training program in mining or geological engineering technology ou earth resources technology or an acceptable combination of education, training and/or experience Degree equivalency Experience Extensive experience of more than 3 years of laboratory or field work, relevant to the duties of the position Experience working with database or spreadsheet software Experience providing services for external clients If you possess any of the following, your application must also clearly explain how you meet it (other qualifications) Asset Qualifications Experience working in a geological or civil engineering testing laboratory Experience working in a research and development environment Experience working with machine shop equipment Experience with industrial equipment The following will be applied / assessed at a later date (essential for the job) English essential Information on language requirements Knowledge Of mining methods and technologies used in the Canadian mining industry Of laboratory testing practices related to geomechanics Knowledge of data processing and analysis Knowledge of techniques for validating data for accuracy Knowledge of standard operating procedures in a laboratory environment Knowledge of laboratory safety practices Abilities/Competencies Ability to organize field or laboratory data Ability to manage time effectively Ability to communicate effectively orally Ability to communicate effectively in writing Personal Suitability Effective interpersonal relationships Attention to detail Initiative Dependability Working under minimal supervision The following may be applied / assessed at a later date (may be needed for the job) Selection may be limited to members of the following Employment Equity groups: Aboriginal persons, persons with disabilities, visible minorities, women Information on employment equity Organizational Needs: Natural Resources Canada is committed to establishing and maintaining a representative workforce. This organizational need may be identified as part of the appointment decision. In such cases, qualified candidates who self-declare as members of a visible minority group, Indigenous peoples, persons with disabilities or women could be considered in priority. Conditions of employment Reliability Status security clearance Other information The Public Service of Canada is committed to building a skilled and diverse workforce that reflects the Canadians we serve. We promote employment equity and encourage you to indicate if you belong to one of the designated groups when you apply. Information on employment equity The hiring organization will accept applications on-line only. All job applications must therefore be submitted through the Government of Canada jobs website. To submit an application on-line, please select the button \"Apply Online\" below. Persons with disabilities preventing them from applying on-line are asked to contact the person named below. It is our intention to communicate with candidates via email for assessment purposes. This will include communication of invitations to written tests and interviews. To that end, candidates must include a valid email address in their application. It is the candidate's responsibility to ensure that this address is functional and that it accepts messages from unknown users (some email systems block these types of email). It is also the candidate's responsibility to ensure accurate information is provided and updated as required. Candidates invited to an interview will be required to bring proof of their education credentials, in the form of a diploma or official transcript (original documents only). Candidates with foreign credentials must provide proof Canadian equivalency. Consult the Canadian Information Centre for International Credentials for further information at http://www.cicic.ca. Reference checks may be sought. An interview may be administered. A test may be administered. You must provide proof of your education credentials. Persons are entitled to participate in the appointment process in the official language(s) of their choice. Preference Preference will be given to veterans first and then to Canadian citizens and permanent residents, with the exception of a job located in Nunavut, where Nunavut Inuit will be appointed first. Information on the preference to veterans We thank all those who apply. Only those selected for further consideration will be contacted.",
    "processed_description": "information organization visit Natural Resources closing apply person reside canadian citizen permanent resident abroad . apply online message committed provide inclusive barrier free environment start hiring process . accommodate phase evaluation process contact information request specialized accommodation . information receive relation accommodation confidential . assessment accommodation commit build skilled workforce representative Canada's diversity include recruitment release Canadian Armed Forces personnel encourage applicant identify competency acquire employment applicable . environment federal government develop leadership skill foster teamwork support creativity innovation . people diverse pool talent happen . people . employee enjoy diverse employment range career development program learn culture support learn ongoing basis . support balance private life offer benefit flexible arrangement . transition hybrid environment offer employee telework designate location subject operational requirement . position require office presence minimum week . intent process intent selection process staff indeterminate position . position fill information provide resume . order consider application explain meet essential qualification education successful completion acceptable post secondary training program mining geological engineering technology earth resource technology acceptable combination education training Degree equivalency extensive laboratory field relevant duty position database spreadsheet software provide service external client possess follow application explain meet qualification Asset Qualifications geological civil engineering testing laboratory research development environment machine shop equipment industrial equipment apply assess essential English essential Information language requirement Knowledge mining method technology canadian mining industry laboratory testing practice relate geomechanic Knowledge datum processing analysis knowledge technique validate datum accuracy Knowledge standard operating procedure laboratory environment knowledge laboratory safety practice Competencies organize field laboratory datum manage effectively communicate effectively orally communicate effectively write Personal Suitability effective interpersonal relationship attention detail minimal supervision apply assess selection limit follow Employment Equity group aboriginal person person visible minority woman Information commit establish maintain representative workforce . organizational identify appointment decision . case qualified declare visible minority group indigenous people person woman consider priority . condition employment Reliability Status security clearance information commit build skilled diverse workforce reflect serve . promote employment equity encourage indicate belong designate group apply . information employment equity hire organization accept application . application submit Government website . submit application select button apply Online . person prevent apply contact person . intention communicate email assessment purpose . include communication invitation write test interview . include valid email address application . candidate's responsibility ensure address functional accept message unknown user email system block type email . candidate's responsibility ensure accurate information provide update require . invite interview require bring proof education credential form diploma official transcript original document . foreign credential provide proof canadian equivalency . consult information . reference check seek . interview administer . test administer . provide proof education credential . person entitle participate appointment process official language choice . veteran canadian citizen permanent resident exception locate appoint . information preference veteran apply . select consideration contact .",
    "results_group": {
        "extracted_noun_chunks": [
            "phase evaluation process contact information",
            "proof education credential form diploma official transcript original document",
            "proof education credential",
            "Competencies",
            "accurate information",
            "Online",
            "foreign credential",
            "transition hybrid environment",
            "visible minority group indigenous people person woman",
            "leadership skill foster teamwork support creativity innovation",
            "diverse employment range career development program",
            "canadian citizen permanent resident",
            "intention",
            "designate group",
            "select consideration contact",
            "person entitle",
            "organizational identify appointment decision",
            "follow application",
            "field laboratory datum",
            "skilled diverse workforce",
            "application select button",
            "unknown user email system block type email",
            "Natural Resources closing apply person",
            "support balance private life",
            "information preference veteran",
            "selection limit",
            "federal government",
            "culture support",
            "meet qualification Asset Qualifications geological civil engineering testing laboratory research development environment machine shop equipment industrial equipment",
            "address",
            "geomechanic Knowledge datum processing analysis knowledge technique",
            "resume",
            "inclusive barrier free environment",
            "environment",
            "proof canadian equivalency",
            "specialized accommodation",
            "skilled workforce representative",
            "test administer",
            "employment equity encourage",
            "essential qualification education successful completion acceptable post secondary training program mining geological engineering technology earth resource technology acceptable combination education training Degree equivalency extensive laboratory field relevant duty position database spreadsheet software",
            "veteran canadian citizen",
            "information organization",
            "recruitment release Canadian Armed Forces personnel",
            "intent process intent selection process staff indeterminate position",
            "Personal Suitability effective interpersonal relationship attention detail minimal supervision",
            "relation accommodation",
            "update require",
            "people",
            "email assessment purpose",
            "Information",
            "information",
            "application",
            "employee",
            "Canada's diversity",
            "flexible arrangement",
            "order",
            "case",
            "employee telework designate location subject operational requirement",
            "position",
            "visible minority woman",
            "person",
            "permanent resident exception",
            "candidate's responsibility",
            "Government website",
            "priority",
            "ongoing basis",
            "interview",
            "assessment accommodation",
            "information employment equity hire organization",
            "message",
            "representative workforce",
            "people diverse pool talent",
            "interview administer",
            "online message",
            "process",
            "contact person",
            "communication invitation write test interview",
            "valid email address application",
            "reference check",
            "datum accuracy Knowledge standard operating procedure laboratory environment knowledge laboratory safety practice",
            "service external client",
            "office presence minimum week",
            "technology"
        ],
        "combined_lemmatized_tokens": "information organization visit Natural Resources closing apply person reside canadian citizen permanent resident abroad . apply online message committed provide inclusive barrier free environment start hiring process . accommodate phase evaluation process contact information request specialized accommodation . information receive relation accommodation confidential . assessment accommodation commit build skilled workforce representative Canada's diversity include recruitment release Canadian Armed Forces personnel encourage applicant identify competency acquire employment applicable . environment federal government develop leadership skill foster teamwork support creativity innovation . people diverse pool talent happen . people . employee enjoy diverse employment range career development program learn culture support learn ongoing basis . support balance private life offer benefit flexible arrangement . transition hybrid environment offer employee telework designate location subject operational requirement . position require office presence minimum week . intent process intent selection process staff indeterminate position . position fill information provide resume . order consider application explain meet essential qualification education successful completion acceptable post secondary training program mining geological engineering technology earth resource technology acceptable combination education training Degree equivalency extensive laboratory field relevant duty position database spreadsheet software provide service external client possess follow application explain meet qualification Asset Qualifications geological civil engineering testing laboratory research development environment machine shop equipment industrial equipment apply assess essential English essential Information language requirement Knowledge mining method technology canadian mining industry laboratory testing practice relate geomechanic Knowledge datum processing analysis knowledge technique validate datum accuracy Knowledge standard operating procedure laboratory environment knowledge laboratory safety practice Competencies organize field laboratory datum manage effectively communicate effectively orally communicate effectively write Personal Suitability effective interpersonal relationship attention detail minimal supervision apply assess selection limit follow Employment Equity group aboriginal person person visible minority woman Information commit establish maintain representative workforce . organizational identify appointment decision . case qualified declare visible minority group indigenous people person woman consider priority . condition employment Reliability Status security clearance information commit build skilled diverse workforce reflect serve . promote employment equity encourage indicate belong designate group apply . information employment equity hire organization accept application . application submit Government website . submit application select button apply Online . person prevent apply contact person . intention communicate email assessment purpose . include communication invitation write test interview . include valid email address application . candidate's responsibility ensure address functional accept message unknown user email system block type email . candidate's responsibility ensure accurate information provide update require . invite interview require bring proof education credential form diploma official transcript original document . foreign credential provide proof canadian equivalency . consult information . reference check seek . interview administer . test administer . provide proof education credential . person entitle participate appointment process official language choice . veteran canadian citizen permanent resident exception locate appoint . information preference veteran apply . select consideration contact ."
    }
}