{
    "id": "6d02553587bc812b",
    "company": "Canadian Museum of History/Musée canadien de l'histoire",
    "positionName": "Program Officer, Digital Museums Canada (DMC)",
    "jobType": [],
    "location": "100 Rue Laurier, Gatineau, QC",
    "salary": null,
    "postingDateParsed": "2024-01-17T05:12:59.015Z",
    "url": "https://www.indeed.ca/rc/clk?jk=6d02553587bc812b&from=jasx&tk=1hkikiet3jkt6800&bb=sJvY2r8Bn5UisAXwGAcfDc-qHpp5XGNZ4eMo8J7L2jF7x0fS_6D8qRoahqBEyTFu33cJo2fjyvozPsJgVvpaRBsrZ3MiO3BGdCxYn1J3mipMNBuz5zM6ww%3D%3D&xkcb=SoB067M3FShGBP2YLR0GbzkdCdPP&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=6d02553587bc812b&bb=Xjc5z0kf4gvnhFa4at1vqa12JJA56WZUpyhbXT05qISe6FsMVNSoJkOHlx4fObDV&xkcb=SoBo67M3FShFVvAD7z0LbzkdCdPP&xpse=SoAM67I3FShFHSQ9QB0LbzkdCdPP",
    "companyDescription": "",
    "description": "We are looking for a Program Officer, Digital Museums Canada (DMC) \n    As a Program Officer, Digital Museums Canada (DMC), you will be responsible for the implementation of the DMC investment program and for the oversight of DMC funded projects. You will provide members of Canadian museums, heritage, cultural and indigenous organizations, with information, advice, and support on the DMC program, as well as supporting the promotion, administration, and continuous improvement of the program. \n    About Digital Museums Canada (DMC) \n    The mandate of Digital Museums Canada (DMC) is “to help build digital capacity in Canadian museums and heritage, cultural and Indigenous organizations, giving people living in Canada unique access to diverse stories and experiences.” \n    DMC provides investments between $25,000 and $250,000 for online projects in two streams, Digital Projects and Community Stories. DMC helps organizations build digital capacity by providing expert guidance in digital accessibility, user experience, and inclusive design. \n    DMC is the largest national investment program dedicated to supporting digital projects. Since 2014, DMC has invested in more than 240 projects with nearly $20 million in funding. DMC is managed by the Canadian Museum of History (CMH), with the financial support of the Government of Canada. \n    The Program Officer position is critical to supporting organizations in launching their online projects and building digital capacity. If you are passionate about achieving digital excellence or online accessibility in the heritage field, this opportunity is for you. \n    What we are looking for: \n    Ability to manage a large portfolio of approximately 20 digital projects simultaneously with stakeholders from external museums, heritage, cultural or Indigenous organizations), from selection to launch including post-mortem evaluation. \n    Ability to complete content and technical reviews of online products (such as websites, virtual exhibitions, online programming, games, web apps and more). \n    \n    Ability to participate in the Call for Proposals process including assessing proposals to ensure eligibility and feasibility. \n    Development and delivery of Application Assistance initiatives for the museum community. \n    Excellent project management skills and knowledge of best practices in museology. \n    Expertise in digital product development including knowledge of online accessibility, user centricity and inclusive design. \n    A strong sense of collaboration and diplomacy, and the ability to maintain strong working relationships with individuals at all levels in the museum field. \n    Excellent analytical, problem-solving skills, \n    Attention to detail and quality assurance skills. \n    Initiative, proactivity and a mindset towards continuous improvement. \n    \n   Minimum of three (3) years of relevant experience: \n    \n    Managing projects in a museum, heritage, cultural or Indigenous organization setting, including budget and timeline development and management. \n    Coordinating complex, multi-year projects within cross disciplinary team environments. \n    Analyzing, and assessing proposals, program documents and projects for completeness, accuracy, high-quality and compliance. \n    Developing and managing institutional and professional business relationships. \n    Preparing and delivering statistics, reports, and presentations. \n    Developing and maintaining comprehensive tracking systems and databases. \n    \n   Knowledge of: \n    \n    Museological principles and practices such as target audience, visitor/user experience, design and storytelling. \n    Museum and other heritage organizations’ related products, programs and services, especially digital products and related technologies. \n    The planning, development and evaluation lifecycle of exhibitions or programming, particularly in the digital space. \n    Methods and practices of financial and contract management; \n    Strategic communications and consultation techniques. \n    Museum Act,Financial Administration Act,Official Languages Act;Web Content Accessibility Guidelines (WCAG),Accessible Canada Act \n    \n   Considered an asset: \n    \n    Best practices in accessibility including the Web Content Accessibility Guidelines; \n    Best practices in quality assurance for websites and online products; \n    DMC mandate and program, and the mandate, priorities, programs, and services of the CMH. \n    \n   Education: University degree in museum studies, heritage, education, history, arts, social sciences, humanities, computer science, or an equivalent combination of education and experience. \n    A project management certification or accessibility accreditation is not required but would be considered an asset. \n    Compensation: E6 ($71,173 to $88,080) Status: Permanent Full-Time Position (# 10413-04) and to create an inventory of qualified candidates that may be considered to staff future vacancies for this position on a permanent or temporary basis. This inventory will be active for 6 months. Security Clearance: Enhanced Reliability  Location: 100, Laurier Street, Gatineau, Quebec (currently remote hybrid model) \n    Language: CBC We encourage all candidates to submit their application, regardless of whether they believe they meet the linguistic requirements of the position. Qualified candidates will be sent for linguistic validation. In the event a qualified bilingual candidate is not found, other qualified candidates may be considered. \n    Open to: Museum employees, external candidates and/or candidates from our inventory. Priority will be given to Canadian citizens and permanent residents. \n    Apply no later than January 30, 2024 at 11:59 p.m.\n    \n    \n  \n \n \n  \n   \n    \n     We thank all candidates for showing interest; however, only retained candidates will be contacted. \n      The masculine form is used in this document for the sole purpose of simplifying the text: it is not discriminatory in any way. \n      The Museum is committed to creating an organizational culture that fosters an inclusive, diverse, equitable and accessible environment for all. We encourage applications from all qualified individuals, including candidates from all cultures, racialized communities, all abilities, all sexual identities and genders, and anyone else who can contribute to the diversity of ideas. We are committed to an inclusive, barrier-free selection process and work environment. \n      The Canadian Museum of History subscribes to the Employment Equity Act. \n      If you require an accommodation (including alternate formats of materials) in order to participate in the hiring process, please contact us to make your needs known in advance. Information received relating to accommodation measures will be addressed confidentially. Contact: Abiba Diarrassouba or Monica Lun Pun at 819-776-8176 and 819-776-8532 or at competition@historymuseum.ca."
}