{
    "id": "5d2cc022053b823e",
    "companyDescription": "",
    "description": "Senior Fisheries Biologist - ( 230004IB ) \n Description \n Grounded in safety, quality, and ethics, our experts lead their fields and guide our work with rigor, a creative spirit, and vision for growth. We draw from more than 20 technical specialties around the globe and are committed to fostering an inclusive community of diverse talents, backgrounds, and expertise. We’re a place to apply your passion and collaborate with top environmental talents on work that’s critical to our clients and the communities they support. Join a team that has the environment down to a science. \n Your Opportunity \n We are currently seeking a talented and ambitious Senior Fisheries Biologist to join our freshwater ecology team in one of our Ontario offices. The successful candidate will lead aquatic components of projects in the transportation infrastructure, land development and/or oil and gas sector among others. As a senior practitioner you will help to shape our freshwater ecology practice and provide direction to field staff. Stantec has a flexible workplace strategy, which allows staff to flexibly work between home and office. \n Your Key Responsibilities \n \n  Plan (i.e., develop scope and budget), lead, and manage freshwater ecology and/or aquatic species at risk components of projects \n  Understand standard practices and techniques for sampling and analysis of fish and benthic invertebrate communities, aquatic habitat, and water and sediment quality data from streams, rivers and lakes \n  Coordinate and oversee freshwater ecology field programs and field staff \n  Provide input to proposals and other business development activities \n  Prepare high quality deliverables from stand-alone reports to chapters in larger reports, DFO correspondence and agency consultation \n  Manage tasks and projects according to approved scopes of work, and deliver quality reports and deliverables on schedule and within budget \n  Prepare Requests for Review under the Fisheries Act, and applications for authorization under the Fisheries Act and Species at Risk Act pertaining to aquatic species and habitat \n  Develop and maintain client and regulatory contacts \n  Understand project goals and provide sound environmental project advice to external clients and internal Stantec contacts \n  Work with other disciplines and business lines within Stantec’s Ontario offices to deliver projects \n  Contribute leadership to Stantec’s Ontario-based Environmental Services staff by providing technical direction and mentorship to facilitate long-term sustainability and succession within the freshwater ecology team \n  Contribute to the team’s operational success by tracking workload and project budgets \n  Embrace and promote Health, Safety, Security and Environment (HSSE) Policies, Procedures, Standards and Guidelines in the execution of all work \n \n Qualifications \n Your Capabilities and Credentials \n \n  Knowledge and experience with environmental assessments, environmental impact studies, and natural heritage policies in Ontario especially regarding working in and around watercourses, waterbodies and fish habitat \n  Knowledge of current provincial and federal government regulatory requirements, including applied experience with federal Fisheries Act Authorizations, and Species at Risk Act and Endangered Species Act permits related to aquatic species \n  Knowledge and experience applying the MTO/DFO/MNRF Fisheries Protocol for Protecting Fish and Fish Habitat on Provincial Undertakings \n  Experience in business development, working with and guiding clients, and proposal writing \n  Experience liaising with industry clients, government agencies, regulatory bodies and the public \n  Experience working on a range of project phases (from baseline data collection programs to EAs, and the various phases of planning and design) across a range of sectors \n  Experience in leading field crews in fish and fish habitat field programs, and guiding staff in data management, data analysis and report preparation \n  Strong senior technical review skills \n  Proven technical communication, writing and organization skills, including demonstrated experience preparing technical reports \n  Strong project management skills \n  Able to work both independently and in a collaborative team environment \n  Thrives in an environment with diverse and dynamic projects, and enjoys working on multi-disciplinary scopes of work \n  Valid driver’s licence \n \n Additional Assets: \n \n  MTO/DFO/MNRF Fisheries Protocol Training \n  Registered in MTO’s RAQS for Fisheries Assessment \n  Experience planning and implementing Headwater Drainage Feature Assessments \n  Class I Electrofishing or Class II Backpack Electrofishing Certification \n  Familiarity with the Ontario Stream Assessment Protocol (OSAP) \n  Familiar with the application of mobile digital data collection tools \n  Experience working with Indigenous communities \n \n Education and Experience \n \n  A Master’s or Bachelor’s degree or technological diploma in Biology, Zoology or Environmental Sciences is required \n  Ten to Fifteen years of industry experience, with at least part of the experience at a senior level in environmental consulting \n \n Typical office environment working with computers and remaining sedentary for long periods of time. Occasional field work may include exposure to the elements including inclement weather. Travel within Ontario requires a valid driver’s licence. \n This description is not a comprehensive listing of activities, duties or responsibilities that may be required of the employee and other duties, responsibilities and activities may be assigned or may be changed at any time with or without notice. \n Stantec is a place where the best and brightest come to build on each other’s talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best. \n Benefits Summary: Regular full-time and part-time employees will have access to health, dental, and vision plans, a well-being program, health care spending account, wellness spending accounts, group registered retirement savings plan, employee stock purchase program, group tax-free savings account, life and accidental death & dismemberment (AD&D) insurance, short-term/long-term disability plans, emergency travel benefits, tuition reimbursement, professional membership fee coverage, and paid time off. \n Temporary/casual employees will have access to group registered retirement savings plan, employee stock purchase program, and group tax-free savings account. \n The benefits information listed above may not apply to union positions because benefits for such positions are governed by applicable collective bargaining agreements. \n Primary Location : Canada-Ontario-Waterloo \n Other Locations : Canada-Ontario-London, Canada-Ontario-Stoney Creek, Canada-Ontario-Markham, Canada-Ontario-Ottawa, Canada-Ontario-Toronto \n Work Locations : \n Toronto ON \n Organization : BC-1609 EnvSvcs-CA Ontario West \n Employee Status : Regular \n Job Level : Individual Contributor \n Travel : Yes, 10 % of the Time \n Schedule : Full-time \n Job Posting : Nov 1, 2023, 8:43:43 AM \n Req ID: 230004IB \n Stantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans",
    "preprocessed_description": "Senior Fisheries Biologist - ( 230004IB ) Description Grounded in safety, quality, and ethics, our experts lead their fields and guide our work with rigor, a creative spirit, and vision for growth. We draw from more than 20 technical specialties around the globe and are committed to fostering an inclusive community of diverse talents, backgrounds, and expertise. We're a place to apply your passion and collaborate with top environmental talents on work that is critical to our clients and the communities they support. Join a team that has the environment down to a science. Your Opportunity We are currently seeking a talented and ambitious Senior Fisheries Biologist to join our freshwater ecology team in one of our Ontario offices. The successful candidate will lead aquatic components of projects in the transportation infrastructure, land development and/or oil and gas sector among others. As a senior practitioner you will help to shape our freshwater ecology practice and provide direction to field staff. Stantec has a flexible workplace strategy, which allows staff to flexibly work between home and office. Your Key Responsibilities Plan (i.e., develop scope and budget), lead, and manage freshwater ecology and/or aquatic species at risk components of projects Understand standard practices and techniques for sampling and analysis of fish and benthic invertebrate communities, aquatic habitat, and water and sediment quality data from streams, rivers and lakes Coordinate and oversee freshwater ecology field programs and field staff Provide input to proposals and other business development activities Prepare high quality deliverables from stand-alone reports to chapters in larger reports, Department of Fisheries and Oceans Canada correspondence and agency consultation Manage tasks and projects according to approved scopes of work, and deliver quality reports and deliverables on schedule and within budget Prepare Requests for Review under the Fisheries Act, and applications for authorization under the Fisheries Act and Species at Risk Act pertaining to aquatic species and habitat Develop and maintain client and regulatory contacts Understand project goals and provide sound environmental project advice to external clients and internal Stantec contacts Work with other disciplines and business lines within Stantec's Ontario offices to deliver projects Contribute leadership to Stantec's Ontario-based Environmental Services staff by providing technical direction and mentorship to facilitate long-term sustainability and succession within the freshwater ecology team Contribute to the team's operational success by tracking workload and project budgets Embrace and promote Health, Safety, Security and Environment (HSSE) Policies, Procedures, Standards and Guidelines in the execution of all work Qualifications Your Capabilities and Credentials Knowledge and experience with environmental assessments, environmental impact studies, and natural heritage policies in Ontario especially regarding working in and around watercourses, waterbodies and fish habitat Knowledge of current provincial and federal government regulatory requirements, including applied experience with federal Fisheries Act Authorizations, and Species at Risk Act and Endangered Species Act permits related to aquatic species Knowledge and experience applying the MTO/Department of Fisheries and Oceans Canada/MNRF Fisheries Protocol for Protecting Fish and Fish Habitat on Provincial Undertakings Experience in business development, working with and guiding clients, and proposal writing Experience liaising with industry clients, government agencies, regulatory bodies and the public Experience working on a range of project phases (from baseline data collection programs to EAs, and the various phases of planning and design) across a range of sectors Experience in leading field crews in fish and fish habitat field programs, and guiding staff in data management, data analysis and report preparation Strong senior technical review skills Proven technical communication, writing and organization skills, including demonstrated experience preparing technical reports Strong project management skills Able to work both independently and in a collaborative team environment Thrives in an environment with diverse and dynamic projects, and enjoys working on multi-disciplinary scopes of work Valid driver's licence Additional Assets: MTO/Department of Fisheries and Oceans Canada/MNRF Fisheries Protocol Training Registered in MTO's RAQS for Fisheries Assessment Experience planning and implementing Headwater Drainage Feature Assessments Class I Electrofishing or Class II Backpack Electrofishing Certification Familiarity with the Ontario Stream Assessment Protocol (OSAP) Familiar with the application of mobile digital data collection tools Experience working with Indigenous communities Education and Experience A Master's or Bachelor's degree or technological diploma in Biology, Zoology or Environmental Sciences is required Ten to Fifteen years of industry experience, with at least part of the experience at a senior level in environmental consulting Typical office environment working with computers and remaining sedentary for long periods of time. Occasional field work may include exposure to the elements including inclement weather. Travel within Ontario requires a valid driver's licence. This description is not a comprehensive listing of activities, duties or responsibilities that may be required of the employee and other duties, responsibilities and activities may be assigned or may be changed at any time with or without notice. Stantec is a place where the best and brightest come to build on each other's talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best. Benefits Summary: Regular full-time and part-time employees will have access to health, dental, and vision plans, a well-being program, health care spending account, wellness spending accounts, group registered retirement savings plan, employee stock purchase program, group tax-free savings account, life and accidental death & dismemberment (ADandD) insurance, short-term/long-term disability plans, emergency travel benefits, tuition reimbursement, professional membership fee coverage, and paid time off. Temporary/casual employees will have access to group registered retirement savings plan, employee stock purchase program, and group tax-free savings account. The benefits information listed above may not apply to union positions because benefits for such positions are governed by applicable collective bargaining agreements. Primary Location : Canada-Ontario-Waterloo Other Locations : Canada-Ontario-London, Canada-Ontario-Stoney Creek, Canada-Ontario-Markham, Canada-Ontario-Ottawa, Canada-Ontario-Toronto Work Locations : Toronto ON Organization : BC-1609 EnvSvcs-CA Ontario West Employee Status : Regular Job Level : Individual Contributor Travel : Yes, 10 % of the Time Schedule : Full-time Job Posting : Nov 1, 2023, 8:43:43 AM Req ID: 230004IB Stantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans",
    "processed_description": "Senior Fisheries Biologist 230004ib description ground safety quality ethic expert lead field guide rigor creative spirit vision growth . draw technical specialty globe committed foster inclusive community diverse talent background expertise . place apply passion collaborate environmental talent critical client community support . join team environment science . currently seek talented ambitious Senior Fisheries Biologist join freshwater ecology team office . successful lead aquatic component project transportation infrastructure land development oil gas sector . senior practitioner help shape freshwater ecology practice provide direction field staff . flexible workplace strategy allow staff flexibly office . Key Responsibilities Plan i.e. develop scope budget lead manage freshwater ecology aquatic specie risk component project understand standard practice technique sampling analysis fish benthic invertebrate community aquatic habitat water sediment quality datum stream river lake coordinate oversee freshwater ecology field program field staff provide input proposal business development activity prepare high quality deliverable stand report chapter large report Department Fisheries Oceans correspondence agency consultation Manage task project accord approve scope deliver quality report deliverable schedule budget application authorization pertain aquatic specie habitat maintain client regulatory contact understand project goal provide sound environmental project advice external client internal stantec contact discipline business Stantec's office deliver project contribute leadership Stantec's base Environmental Services staff provide technical direction mentorship facilitate long term sustainability succession freshwater ecology team contribute team's operational success track workload project budget promote HSSE policy procedure Standards Guidelines execution Qualifications Capabilities Credentials knowledge environmental assessment environmental impact study natural heritage policy regard watercourse waterbodie fish habitat knowledge current provincial federal government regulatory requirement include apply Species Risk Endangered Species permit relate aquatic species knowledge apply MNRF Fisheries Protocol protect fish Fish Habitat Provincial Undertakings business development guide client proposal write liaise industry client government agency regulatory body public range project phase baseline datum collection program eas phase planning design range sector lead field crew fish fish habitat field program guide staff datum management datum analysis report preparation strong senior technical review skill proven technical communication writing organization skill include demonstrate prepare technical report strong project management skill independently collaborative team environment thrive environment diverse dynamic project enjoy multi disciplinary scope valid driver's licence Additional asset Oceans MNRF Fisheries Protocol Training Registered MTofs raqs Fisheries Assessment plan implement Headwater drainage feature assessment class electrofishing Class II Backpack Electrofishing Certification Familiarity OSAP familiar application mobile digital datum collection tool indigenous community Education Master's Bachelor's degree technological diploma require industry senior level environmental consulting Typical office environment computer remain sedentary long period . occasional field include exposure element include inclement weather . travel require valid driver's licence . description comprehensive listing activity duty responsibility require employee duty responsibility activity assign change notice . place good bright build other's talent exciting impact . join redefine personal good . benefit summary regular employee access health dental vision plan program health care spending account wellness spending account group register retirement saving plan employee stock purchase program group tax free saving account life accidental death dismemberment adandd insurance short term long term plan emergency travel benefit tuition reimbursement professional membership fee coverage pay . temporary casual employee access group register retirement saving plan employee stock purchase program group tax free saving account . benefit information list apply union position benefit position govern applicable collective bargaining agreement . Primary Location Waterloo Locations London Markham Toronto Locations regular level Individual Contributor Travel schedule posting Req provide equal employment qualified employee applicant future current employment prohibit discrimination ground race color religion sex national origin age marital status genetic information protect veteran status sexual orientation gender identity gender expression . prohibit discrimination decision concern recruitment hiring referral promotion compensation fringe benefit training termination condition employment . compliance local state federal law regulation ensure equitable aspect employment . EEO include protect Veterans",
    "results_group": {
        "extracted_noun_chunks": [
            "aquatic specie habitat",
            "organization skill",
            "retirement saving plan employee stock purchase program group tax free saving account",
            "applicable collective bargaining agreement",
            "quality report",
            "independently collaborative team environment",
            "client regulatory contact",
            "project goal",
            "aquatic species knowledge",
            "deliverable schedule budget application authorization",
            "discrimination decision concern recruitment",
            "compliance local state federal law regulation",
            "employee duty responsibility activity",
            "veteran status sexual orientation",
            "scope budget lead",
            "exposure element",
            "technical direction",
            "personal good",
            "freshwater ecology field program field staff",
            "other's talent exciting impact",
            "freshwater ecology aquatic specie risk component project",
            "travel",
            "HSSE policy procedure Standards Guidelines execution Qualifications Capabilities Credentials knowledge environmental assessment environmental impact study natural heritage policy regard watercourse waterbodie fish habitat knowledge current provincial federal government regulatory requirement",
            "foster inclusive community diverse talent background expertise",
            "Key Responsibilities Plan",
            "multi disciplinary scope valid driver's licence Additional asset Oceans MNRF Fisheries Protocol Training Registered MTofs",
            "union position benefit position",
            "familiar application mobile digital datum collection tool indigenous community Education Master's Bachelor's degree technological diploma",
            "discrimination ground race color religion sex national origin age marital status genetic information",
            "flexible workplace strategy",
            "scope",
            "change notice",
            "internal stantec contact discipline business Stantec's office",
            "liaise industry client government agency regulatory body public range project phase baseline datum collection program eas phase planning design range sector lead field crew",
            "project contribute leadership Stantec's base Environmental Services staff",
            "long term sustainability succession freshwater ecology team",
            "Veterans",
            "freshwater ecology practice",
            "temporary casual employee access group",
            "senior practitioner help",
            "high quality deliverable stand report chapter large report Department Fisheries Oceans correspondence agency consultation Manage task project accord",
            "team's operational success track workload project budget",
            "inclement weather",
            "fish Fish Habitat Provincial Undertakings business development guide client proposal",
            "equal employment qualified employee applicant",
            "industry senior level environmental consulting Typical office environment computer",
            "benefit summary regular employee access health dental vision plan program health care spending account wellness spending account group",
            "occasional field",
            "referral promotion compensation",
            "Primary Location Waterloo Locations London Markham Toronto Locations regular level Individual Contributor Travel schedule",
            "successful lead aquatic component project transportation infrastructure land development oil gas sector",
            "gender identity gender expression",
            "Species Risk Endangered Species permit",
            "benthic invertebrate community aquatic habitat water sediment quality datum stream river lake coordinate",
            "creative spirit vision growth",
            "passion",
            "talented ambitious Senior Fisheries Biologist",
            "benefit information list",
            "direction field staff",
            "input proposal business development activity",
            "environmental talent critical client community support",
            "Headwater drainage feature assessment class electrofishing Class II Backpack Electrofishing Certification Familiarity OSAP",
            "equitable aspect employment",
            "MNRF Fisheries Protocol",
            "Senior Fisheries Biologist 230004ib description ground safety quality ethic expert lead field guide",
            "retirement saving plan employee stock purchase program group tax free saving account life accidental death dismemberment adandd insurance short term long term",
            "freshwater ecology team office",
            "future current employment",
            "team environment science",
            "technical report strong project management skill",
            "sound environmental project advice external client",
            "emergency travel benefit tuition reimbursement professional membership fee coverage pay",
            "EEO",
            "place",
            "description comprehensive listing activity duty responsibility",
            "raqs Fisheries Assessment plan",
            "technical communication",
            "Req",
            "valid driver's licence",
            "staff",
            "technical specialty globe",
            "fringe benefit training termination condition employment",
            "mentorship"
        ],
        "combined_lemmatized_tokens": "Senior Fisheries Biologist 230004ib description ground safety quality ethic expert lead field guide rigor creative spirit vision growth . draw technical specialty globe committed foster inclusive community diverse talent background expertise . place apply passion collaborate environmental talent critical client community support . join team environment science . currently seek talented ambitious Senior Fisheries Biologist join freshwater ecology team office . successful lead aquatic component project transportation infrastructure land development oil gas sector . senior practitioner help shape freshwater ecology practice provide direction field staff . flexible workplace strategy allow staff flexibly office . Key Responsibilities Plan i.e. develop scope budget lead manage freshwater ecology aquatic specie risk component project understand standard practice technique sampling analysis fish benthic invertebrate community aquatic habitat water sediment quality datum stream river lake coordinate oversee freshwater ecology field program field staff provide input proposal business development activity prepare high quality deliverable stand report chapter large report Department Fisheries Oceans correspondence agency consultation Manage task project accord approve scope deliver quality report deliverable schedule budget application authorization pertain aquatic specie habitat maintain client regulatory contact understand project goal provide sound environmental project advice external client internal stantec contact discipline business Stantec's office deliver project contribute leadership Stantec's base Environmental Services staff provide technical direction mentorship facilitate long term sustainability succession freshwater ecology team contribute team's operational success track workload project budget promote HSSE policy procedure Standards Guidelines execution Qualifications Capabilities Credentials knowledge environmental assessment environmental impact study natural heritage policy regard watercourse waterbodie fish habitat knowledge current provincial federal government regulatory requirement include apply Species Risk Endangered Species permit relate aquatic species knowledge apply MNRF Fisheries Protocol protect fish Fish Habitat Provincial Undertakings business development guide client proposal write liaise industry client government agency regulatory body public range project phase baseline datum collection program eas phase planning design range sector lead field crew fish fish habitat field program guide staff datum management datum analysis report preparation strong senior technical review skill proven technical communication writing organization skill include demonstrate prepare technical report strong project management skill independently collaborative team environment thrive environment diverse dynamic project enjoy multi disciplinary scope valid driver's licence Additional asset Oceans MNRF Fisheries Protocol Training Registered MTofs raqs Fisheries Assessment plan implement Headwater drainage feature assessment class electrofishing Class II Backpack Electrofishing Certification Familiarity OSAP familiar application mobile digital datum collection tool indigenous community Education Master's Bachelor's degree technological diploma require industry senior level environmental consulting Typical office environment computer remain sedentary long period . occasional field include exposure element include inclement weather . travel require valid driver's licence . description comprehensive listing activity duty responsibility require employee duty responsibility activity assign change notice . place good bright build other's talent exciting impact . join redefine personal good . benefit summary regular employee access health dental vision plan program health care spending account wellness spending account group register retirement saving plan employee stock purchase program group tax free saving account life accidental death dismemberment adandd insurance short term long term plan emergency travel benefit tuition reimbursement professional membership fee coverage pay . temporary casual employee access group register retirement saving plan employee stock purchase program group tax free saving account . benefit information list apply union position benefit position govern applicable collective bargaining agreement . Primary Location Waterloo Locations London Markham Toronto Locations regular level Individual Contributor Travel schedule posting Req provide equal employment qualified employee applicant future current employment prohibit discrimination ground race color religion sex national origin age marital status genetic information protect veteran status sexual orientation gender identity gender expression . prohibit discrimination decision concern recruitment hiring referral promotion compensation fringe benefit training termination condition employment . compliance local state federal law regulation ensure equitable aspect employment . EEO include protect Veterans"
    }
}