{
    "id": "3b90b6045605aff3",
    "companyDescription": "KPMG LLP is the Canadian member firm of KPMG International. We provide Audit, Tax, and Advisory services to many of the public and private business, not-for profit, and public sector organizations in Canada. Nationally, there are 40 offices and over 700 partners and 10,000 employees working together to help Canadian businesses achieve their goals.\r\n\r\nAt KPMG, you'll have the opportunity to collaborate and innovate with teams across Audit, Tax, Advisory, Enterprise, Digital and Business Enablement Services to make a difference for clients, communities and the people you work with. Every day, in ways big and small, you make a meaningful and positive difference for clients, people and the communities we serve. \r\n\r\nYour unique experiences and perspectives belong here. Both individually and as a team, you will understand and value the differences that lead to stronger insights and innovation.\r\n\r\nBuild relationships with colleagues who take care of each other. You will have the KPMG community at your side, providing the support you need to be at your best and create opportunities for yourself and others.\r\n\r\nYour aspirations and initiative make KPMG better. Wherever you work, be recognized for the impact you make, the leadership you show, and the success you create with others. Find opportunity everywhere with KPMG.\r\n",
    "description": "Overview: \n  At KPMG, you’ll join a team of diverse and dedicated problem solvers, connected by a common cause: turning insight into opportunity for clients and communities around the world.\n  The opportunity\n \n  KPMG is looking for an Account Coordinator to join our Centre of Excellence establish to support our Federal Government Account. The Account Coordinator will collaborate with the Senior Account Manager, COE team and client services teams to ensure optimization of the client experience.\n \n \n   This is a fulltime in person position in our Ottawa office with the requirement to work evenings to support marketing events.\n  What you will do: \n \n  Support the Senior Account Manager in successfully meeting client expectations and revenue targets\n   Support federal government account sponsorships/event planning through execution and management of logistics including attending evening events on a regular basis\n   Maintain contracts database \n  Communicate contract-related information to internal stakeholders\n   Manage contract-related correspondence and record keeping\n   Ensures contract compliance in areas such as Quarterly Reporting and Insurance Certifications \n  Support the review of RFP contract terms and conditions to ensure alignment with KPMG policies\n   Assist with requirements for Task Authorizations with a quick turn-around (resume review and quality assurance)\n   Assist the Senior Account Manager in the creation of reports and presentations\n   Assist in the review and maintenance of the Account Pipeline\n   Document and maintain information in shared record-keeping tools to be used as reference data, source information for reporting and analytics, and be utilized for compliance audits\n   Collaborate with other members of the team to ensure business needs are met\n   Actively participate in the efficient functioning of a high-performing team by adopting digital tools and strategies, driving innovation, and contributing to process improvements\n  What you bring to this role: \n \n  A minimum of two years progressive responsibility with quantifiable results in contract administration and risk management in a large professional services organization\n   Experience working with the federal government is an asset\n   Strong knowledge of federal government contracting vehicles \n  Demonstrated ability to act as a trusted advisor, and ability to deal with multiple stakeholders including senior firm members/ Partners, contractors, external service providers, and various subject-matter experts\n   Proven ability to work well in a fast paced, highly demanding, team environment, and manage a high volume of work with varying degrees of complexity\n   Organized, and able to manage competing priorities for multiple stakeholders\n   Keen eye for continuous improvement and efficiency, with a strong aptitude for conducting impact analysis assessments\n   Demonstrated success on operational, process driven initiatives\n   Proficient and comfortable with working in multiple technologies \n  Attention to detail and accuracy is paramount\n   Advanced knowledge of MS Office\n   Superior written and verbal communications skills in English and French is an asset\n   Experience managing simultaneous events/sponsorships in an asset\n \n  Keys to your success:\n  \n \n \n   High degree of personal and professional integrity\n   Ability to build a network and nurture excellent working relationships\n   Maintenance and development of Trusted Advisor relationships with current and future clients\n   A self-starter with proven ability to operate effectively in a collaborative environment\n   Proven ability to work effectively with high-performing teams in a collaborative team environment\n   Ability to propose creative, strategic and pragmatic solutions to resolve business issues\n   Ability to manage multiple projects with high-quality and timely work product in a fast-paced, deadline-driven environment\n   Team player with the ability to build trust and create effective working relationships across business lines, and with internal and external stakeholders\n   Excellent communication and interpersonal skills\n   Proactive commitment to operational excellence\n   Driven to continuously learn from experiences and seek out feedback and develop opportunities based on the feedback given\n \n \n \n   KPMG individuals \n  Deliver Impact | Seek Growth | Inspire Trust and understand that a diverse workforce enables us to deepen relationships and strengthen our business.\n \n \n \n   Providing you with the support you need to be at your best\n \n \n \n   For more information about KPMG in Canada’s Benefits and well-being, click here.\n  Our Values, The KPMG Way: \n \n   Integrity, we do what is right | \n  Excellence, we never stop learning and improving | \n  Courage, we think and act boldly | \n  Together, we respect each other and draw strength from our differences | \n  For Better, we do what matters\n \n \n \n   KPMG in Canada is a proud equal opportunities employer and we are committed to creating a respectful, inclusive and barrier-free workplace that allows all of our people to reach their full potential. A diverse workforce is key to our success and we believe in bringing your whole self to work. We welcome all qualified candidates to apply and hope you will choose KPMG in Canada as your employer of choice. For more information about Inclusion, Diversity & Equity in Recruitment, please click here.\n \n \n \n   If you have a question about accessible employment at KPMG, or to begin a confidential conversation about your individual accessibility or accommodation needs through the recruitment process, we encourage you to visit our accessibility page.",
    "preprocessed_description": "Overview: At KPMG, you will join a team of diverse and dedicated problem solvers, connected by a common cause: turning insight into opportunity for clients and communities around the world. The opportunity KPMG is looking for an Account Coordinator to join our Centre of Excellence establish to support our Federal Government Account. The Account Coordinator will collaborate with the Senior Account Manager, COE team and client services teams to ensure optimization of the client experience. This is a fulltime in person position in our Ottawa office with the requirement to work evenings to support marketing events. What you will do: Support the Senior Account Manager in successfully meeting client expectations and revenue targets Support federal government account sponsorships/event planning through execution and management of logistics including attending evening events on a regular basis Maintain contracts database Communicate contract-related information to internal stakeholders Manage contract-related correspondence and record keeping Ensures contract compliance in areas such as Quarterly Reporting and Insurance Certifications Support the review of Request for Proposal contract terms and conditions to ensure alignment with KPMG policies Assist with requirements for Task Authorizations with a quick turn-around (resume review and quality assurance) Assist the Senior Account Manager in the creation of reports and presentations Assist in the review and maintenance of the Account Pipeline Document and maintain information in shared record-keeping tools to be used as reference data, source information for reporting and analytics, and be utilized for compliance audits Collaborate with other members of the team to ensure business needs are met Actively participate in the efficient functioning of a high-performing team by adopting digital tools and strategies, driving innovation, and contributing to process improvements What you bring to this role: A minimum of two years progressive responsibility with quantifiable results in contract administration and risk management in a large professional services organization Experience working with the federal government is an asset Strong knowledge of federal government contracting vehicles Demonstrated ability to act as a trusted advisor, and ability to deal with multiple stakeholders including senior firm members/ Partners, contractors, external service providers, and various subject-matter experts Proven ability to work well in a fast paced, highly demanding, team environment, and manage a high volume of work with varying degrees of complexity Organized, and able to manage competing priorities for multiple stakeholders Keen eye for continuous improvement and efficiency, with a strong aptitude for conducting impact analysis assessments Demonstrated success on operational, process driven initiatives Proficient and comfortable with working in multiple technologies Attention to detail and accuracy is paramount Advanced knowledge of MS Office Superior written and verbal communications skills in English and French is an asset Experience managing simultaneous events/sponsorships in an asset Keys to your success: High degree of personal and professional integrity Ability to build a network and nurture excellent working relationships Maintenance and development of Trusted Advisor relationships with current and future clients A self-starter with proven ability to operate effectively in a collaborative environment Proven ability to work effectively with high-performing teams in a collaborative team environment Ability to propose creative, strategic and pragmatic solutions to resolve business issues Ability to manage multiple projects with high-quality and timely work product in a fast-paced, deadline-driven environment Team player with the ability to build trust and create effective working relationships across business lines, and with internal and external stakeholders Excellent communication and interpersonal skills Proactive commitment to operational excellence Driven to continuously learn from experiences and seek out feedback and develop opportunities based on the feedback given KPMG individuals Deliver Impact | Seek Growth | Inspire Trust and understand that a diverse workforce enables us to deepen relationships and strengthen our business. Providing you with the support you need to be at your best For more information about KPMG in Canada's Benefits and well-being, click here. Our Values, The KPMG Way: Integrity, we do what is right | Excellence, we never stop learning and improving | Courage, we think and act boldly | Together, we respect each other and draw strength from our differences | For Better, we do what matters KPMG in Canada is a proud equal opportunities employer and we are committed to creating a respectful, inclusive and barrier-free workplace that allows all of our people to reach their full potential. A diverse workforce is key to our success and we believe in bringing your whole self to work. We welcome all qualified candidates to apply and hope you will choose KPMG in Canada as your employer of choice. For more information about Inclusion, Diversity & Equity in Recruitment, please click here. If you have a question about accessible employment at KPMG, or to begin a confidential conversation about your individual accessibility or accommodation needs through the recruitment process, we encourage you to visit our accessibility page.",
    "processed_description": "overview join team diverse dedicated problem solver connect common turn insight client community . Account Coordinator join establish support . Account Coordinator collaborate Senior Account Manager COE team client service team ensure optimization client . fulltime person position office requirement evening support marketing event . support Senior Account Manager meet client expectation revenue target support federal government account sponsorship event plan execution management logistic include attend evening event regular basis maintain contract database Communicate contract relate information internal stakeholder Manage contract relate correspondence record keeping ensure contract compliance area review request proposal contract term condition ensure alignment KPMG policy assist requirement quick turn resume review quality assurance assist Senior Account Manager creation report presentation assist review maintenance maintain information share record tool reference datum source information reporting analytic utilize compliance audits team ensure business met actively participate efficient functioning high perform team adopt digital tool strategy drive innovation contribute process improvement bring role minimum progressive responsibility quantifiable result contract administration risk management large professional service organization federal government asset strong knowledge federal government contracting vehicle demonstrate trusted advisor deal multiple stakeholder include senior firm members partner contractor external service provider subject matter expert prove fast pace highly demanding team environment manage high volume vary degree complexity Organized manage compete priority multiple stakeholder eye continuous improvement efficiency strong aptitude conduct impact analysis assessment demonstrate success operational process drive initiative proficient comfortable multiple technology attention detail accuracy paramount advanced knowledge write verbal communication skill asset manage simultaneous event sponsorship asset Keys success high degree personal professional integrity build network nurture excellent relationship maintenance development Trusted Advisor relationship current future client starter proven operate effectively collaborative environment proven effectively high perform team collaborative team environment propose creative strategic pragmatic solution resolve business issue manage multiple project high quality timely product fast pace deadline drive environment Team player build trust create effective relationship business internal external stakeholder excellent communication interpersonal skill proactive commitment operational excellence drive continuously learn seek feedback develop base feedback KPMG individual Deliver impact | seek growth | Inspire Trust understand diverse workforce enable deepen relationship strengthen business . provide support good information Canada's benefit click . KPMG integrity | Excellence learn improve | courage boldly | respect draw strength difference | matter equal employer committed create respectful inclusive barrier free workplace allow people reach potential . diverse workforce key success bring . qualified apply choose employer choice . information click . question accessible employment confidential conversation individual accessibility accommodation recruitment process encourage visit accessibility .",
    "results_group": {
        "extracted_noun_chunks": [
            "respect",
            "matter equal employer",
            "client expectation revenue target",
            "success operational process",
            "diverse workforce",
            "deepen relationship",
            "potential",
            "business issue",
            "evening event",
            "initiative",
            "respectful inclusive barrier free workplace",
            "base feedback",
            "employer choice",
            "good information",
            "quantifiable result contract administration risk management large professional service organization federal government asset strong knowledge federal government contracting vehicle",
            "growth",
            "| Excellence",
            "Senior Account Manager COE team client service team",
            "KPMG individual Deliver impact",
            "Senior Account Manager",
            "requirement quick turn",
            "key success",
            "support",
            "effectively high perform team collaborative team environment",
            "overview",
            "trusted advisor deal multiple stakeholder",
            "correspondence record keeping",
            "contract compliance area review request proposal contract term condition",
            "creative strategic pragmatic solution",
            "Organized",
            "effectively collaborative environment",
            "fulltime person position office requirement evening support marketing event",
            "multiple project high quality timely product fast pace deadline drive environment Team player",
            "verbal communication skill asset",
            "degree complexity",
            "digital tool strategy drive innovation contribute process improvement",
            "Account Coordinator",
            "trust",
            "efficient functioning high perform team",
            "Communicate contract",
            "role minimum progressive responsibility",
            "excellent relationship maintenance development Trusted Advisor relationship",
            "individual accessibility accommodation recruitment process",
            "strength difference",
            "Canada's benefit",
            "common turn insight client community",
            "KPMG integrity",
            "Inspire Trust",
            "simultaneous event sponsorship asset Keys success high degree personal professional integrity",
            "network",
            "people",
            "contract database",
            "review quality assurance",
            "federal government account sponsorship event plan execution management logistic",
            "effective relationship business internal external stakeholder excellent communication interpersonal skill proactive commitment operational excellence drive",
            "information share record tool reference datum source information",
            "accessible employment confidential conversation",
            "analytic utilize compliance audits team",
            "information internal stakeholder Manage contract",
            "priority multiple stakeholder",
            "optimization client",
            "visit accessibility",
            "review maintenance",
            "information",
            "fast pace highly demanding team environment",
            "current future client starter",
            "business",
            "continuous improvement efficiency strong aptitude conduct impact analysis assessment",
            "feedback",
            "high volume",
            "senior firm members partner contractor external service provider subject matter expert",
            "Senior Account Manager creation report presentation",
            "| courage"
        ],
        "combined_lemmatized_tokens": "overview join team diverse dedicated problem solver connect common turn insight client community . Account Coordinator join establish support . Account Coordinator collaborate Senior Account Manager COE team client service team ensure optimization client . fulltime person position office requirement evening support marketing event . support Senior Account Manager meet client expectation revenue target support federal government account sponsorship event plan execution management logistic include attend evening event regular basis maintain contract database Communicate contract relate information internal stakeholder Manage contract relate correspondence record keeping ensure contract compliance area review request proposal contract term condition ensure alignment KPMG policy assist requirement quick turn resume review quality assurance assist Senior Account Manager creation report presentation assist review maintenance maintain information share record tool reference datum source information reporting analytic utilize compliance audits team ensure business met actively participate efficient functioning high perform team adopt digital tool strategy drive innovation contribute process improvement bring role minimum progressive responsibility quantifiable result contract administration risk management large professional service organization federal government asset strong knowledge federal government contracting vehicle demonstrate trusted advisor deal multiple stakeholder include senior firm members partner contractor external service provider subject matter expert prove fast pace highly demanding team environment manage high volume vary degree complexity Organized manage compete priority multiple stakeholder eye continuous improvement efficiency strong aptitude conduct impact analysis assessment demonstrate success operational process drive initiative proficient comfortable multiple technology attention detail accuracy paramount advanced knowledge write verbal communication skill asset manage simultaneous event sponsorship asset Keys success high degree personal professional integrity build network nurture excellent relationship maintenance development Trusted Advisor relationship current future client starter proven operate effectively collaborative environment proven effectively high perform team collaborative team environment propose creative strategic pragmatic solution resolve business issue manage multiple project high quality timely product fast pace deadline drive environment Team player build trust create effective relationship business internal external stakeholder excellent communication interpersonal skill proactive commitment operational excellence drive continuously learn seek feedback develop base feedback KPMG individual Deliver impact | seek growth | Inspire Trust understand diverse workforce enable deepen relationship strengthen business . provide support good information Canada's benefit click . KPMG integrity | Excellence learn improve | courage boldly | respect draw strength difference | matter equal employer committed create respectful inclusive barrier free workplace allow people reach potential . diverse workforce key success bring . qualified apply choose employer choice . information click . question accessible employment confidential conversation individual accessibility accommodation recruitment process encourage visit accessibility ."
    }
}