{
    "id": "e8b469e76a5dbc3d",
    "company": "PanTHERA CryoSolutions Inc.",
    "positionName": "Laboratory Assistant",
    "jobType": [],
    "location": "10 Marie Curie Pvt, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-05T20:08:47.117Z",
    "url": "https://www.indeed.ca/rc/clk?jk=e8b469e76a5dbc3d&from=jasx&tk=1hc6geptqk7pr800&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "Laboratory Assistant\nOttawa, Ontario / part-time (Mon morning, Tue, Wed, Thu and Fri afternoons)\nPanTHERA CryoSolutions is a company that specializes in developing novel cryoprotectants for the preservation of cell and tissue constructs for regenerative medicine and cellular therapy applications. Our patented ice recrystallization inhibitor (IRI) technology exceeds our competitors’ products by providing superior cryoprotection which increases cell recovery and product quality for our customers.\nWe are proud of our passionate, high-performance culture – one based on a set of values that are the cornerstone of who we are and how we hold ourselves accountable. Founded in 2018, we are headquartered in Edmonton, Alberta and operate our chemical synthesis and manufacturing facility in Ottawa, Ontario. We offer a collaborative and highly innovative work environment founded upon scientific excellence.\nJob Summary\nWe are seeking a dedicated and dynamic individual to join our team in Ottawa, Ontario. The successful candidate will possess some experience working in a wet lab, and be able to work with an interdisciplinary team in a dynamic and high-paced environment.\nResponsibilities\n· Routine maintenance of the laboratory including facility, labware, equipment and others.\n· Follow Standard Operating Procedures (SOPs) when conducting work.\n· Collaborate with Quality Assurance and provide input to corrective action procedures\n· Monitor the laboratory to improve efficiencies and reduce costs in a continuous and ongoing fashion\n· Keeps work area clean, neat and organized\n· Assist in the preparation of stock solutions for Manufacturing, Quality Control and the Research teams\n· Assist in the unpacking, inventorying and storing of new purchases\n· Monitor and restock laboratory consumables/chemicals\n· Assist in procurement processes.\n· Work under minimal supervision, receiving specific instructions only on unusual problems or on matters which depart significantly from established policies and procedures.\nQualifications\n· Completion of high school diploma or equivalent required\n· Previous laboratory safety training required.\n· Experience working with chemicals or in a laboratory setting (ex. school) is an asset, but not required.\n· Highly adaptable and responsive to new priorities.\n· Effective written and oral communication skills.\n· Focused team-oriented player, with a strong work ethic is required.\n· Enthusiasm to tackle difficult problems, learn new technologies, and work in an exciting, high paced environment is a must.\nEquity, Diversity and Inclusion Statement\nPanTHERA CryoSolutions is committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, or gender identity.\nJob Type: Part-time\nExpected hours: 15 – 25 per week\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n Monday to Friday\n\nExperience:\n\n laboratory: 1 year (required)\n\nWork Location: In person"
}