{
    "id": "31bb9e53a7e2b7b1",
    "company": "National Gallery of Canada",
    "positionName": "Departmental Coordinator RCL until 9 May 2025",
    "jobType": [],
    "location": "380 SUSSEX DR, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-06T02:05:37.353Z",
    "url": "https://www.indeed.ca/rc/clk?jk=31bb9e53a7e2b7b1&from=jasx&tk=1hc6gggdfk6os802&vjs=3",
    "externalApplyLink": "https://nationalgallery.njoyn.com/CL2/xweb/Xweb.asp?tbtoken=YVxYQB9cDVByZ3V4TSAhEU9KdxFeaVVZd1RMW1kEenktLDYeWzJtdWBxdEQYGhBTSnBkF3U%3D&chk=ZVpaShM%3D&CLID=51300&page=jobdetails&JobID=J0923-0344&brid=343715&LANG=1",
    "companyDescription": "",
    "description": "Careers \n Departmental Coordinator RCL until 9 May 2025 \n \n \n  \n   \n    \n     Position Title: Departmental Coordinator RCL until 9 May 2025 \n    \n    \n     Competition #: 23-CC-205 \n    \n    \n     Posting Date: October 5, 2023 \n    \n    \n     Closing Date: October 19, 2023 \n    \n    \n     Department: Restoration & Conservation Laboratory \n    \n    \n     Working Hours: Full time (37.5 hours per week, overtime as required) \n    \n    \n     Employment Tenure: Determinate \n    \n    \n     Classification: Band 4 \n    \n    \n     Salary $57,566 - $67,697/Year \n    \n    \n     Number of Positions: 1 \n    \n    \n     Language Requirements: English BBB/French BBB (reading, writing, oral) \n    \n    \n     Affiliation: P.S.A.C.\n      \n    \n   \n    \n    \n   \n   \n    Job Summary \n    \n     The Restoration and Conservation Laboratory (RCL) seeks applications for a full-time (37.5 hours per week) Departmental Coordinator. Reporting to the Senior Manager, the Departmental Coordinator provides direct support to the Senior Manager and fulfills administrative functions, coordination, assistance and work-flow support for the Conservation Department and its staff. Primary duties include but are not limited to:\n      \n     \n      Coordinating daily office operations including maintaining calendars, files and correspondence, and assisting with general and detailed enquiries;\n      Assisting the Senior Manager in the budgetary planning and monitoring process, and with the yearly compilation of the exhibition workplans;\n      Liaising with the Senior Manager in sourcing information and communicating relevant information to staff;\n      Assisting with collecting data and statistics for quarterly reports, audits and related tasks;\n      Maintaining the financial accounting and purchasing systems; keeping monthly variance reports updated; managing office petty cash; reconciling the department’s credit card accounts;\n      Keeping an ongoing log of Requests for Service for each area, and liaising with Collections Management;\n      Keeping a log of all Loan Requests, creating internal loan files including relevant written and photographic documents;\n      Keeping abreast with the Exhibitions schedule and the Conservation staff assigned to the various exhibitions, and providing assistance as necessary;\n      Assisting with acquisition related administrative and coordinating activities;\n      Assisting with the restocking of lab tools and materials, arranging for repair of equipment, assisting with researching and finding of niche, specialized equipment, replacement parts or components and processing the financial and purchasing aspect;\n      Coordinating visits to the conservation labs by scholars, outside specialists, artists, and film crews, etc., and for other special projects where the Conservation Team needs logistical help;\n      Maintaining inventories of office supplies and equipment;\n      Procuring goods and services; tracking purchases; processing invoices; processing reimbursements for staff and guests;\n      Assisting in the coordination of staff and guest travel by providing travel authority forms, making travel arrangements, booking appointments and creating travel itineraries, among other things;\n      Assisting with the coordination of human resources such as participating in the on-boarding of new staff and interns.\n     \n    \n     \n   \n    \n   \n   \n    Requirements \n    \n     Education :\n      Post-secondary (BA) in Art History, diploma in Museology, Museum Studies, or Heritage Studies with an Administrative or project management component, or BA in Administration, or an acceptable combination of education and experience;\n      \n      Experience:\n      \n     \n      Complex experience as an Administrative Assistant, Coordinator or Project Manager;\n      Solid experience in providing financial support and budget functions;\n      Experience in drafting routine correspondence;\n      Experience and strong skills working with Microsoft Office applications, including Word, Excel, Outlook and PowerPoint;\n     \n      Knowledge:\n      \n     \n      Knowledge of the basic principles of heritage conservation;\n      A grasp of the Gallery’s mandate and general functioning;\n      Comprehensive knowledge of computer software systems, office management and bookkeeping principles;\n     \n      Skills/Abilities:\n      \n      \n     \n      Ability to work effectively under pressure with the ability to establish priorities, multi-task and meet tight deadlines;\n      Ability to adapt to changing priorities;\n      Ability to work independently and as a team member;\n      Ability to communicate effectively both verbally and in writing in both official languages;\n      Ability to plan, organize, prioritize and coordinate workload and activities with a strong attention to detail;\n      Mathematical and analytical skills for the review of budgets and variance reports\n      Discretion, integrity and sound judgment\n      Excellent interpersonal skills, initiative, reliability and a team player with a positive attitude.\n     \n     \n    Notice to Applicants: The People, Culture and Belonging team of the National Gallery of Canada, invites selected applicants for interviews by way of written communication via email as per the NGC Staffing Process. Should applicants opt to unsubscribe from receiving emails regarding employment in this organization, please note that we will not be able to communicate with you to participate in the interview process. We encourage applicants to update their career profiles, ensure Email Communication Consent preferences are set to allow emails and check email junk/spam folders regularly. \n    We encourage applicants to update their career profiles, ensure Email Communication Consent preferences are set to allow emails and check email junk/spam folders regularly. \n   \n    \n   \n   \n    Condition of Employment \n    \n     Must meet the bilingual requirement to be invited to the interview process.\n     Reliability Status - this factor is not used at the pre-selection stage.\n    \n     \n   \n    \n   \n   \n    Additional Information \n    \n     Temporary assignment with the possibility of an extension or becoming indeterminate.\n    \n     \n    \n     A variety of assessment tools may be used to assess candidates.\n    \n     \n    \n     Candidates are encouraged to self-identify as a member of one or more employment equity designated groups through the questions in the online application process.\n    \n     The National Gallery values and celebrates everyone's life experiences, their voices, and their histories and are committed to the principles of Justice Equity, Diversity, Inclusion, and Accessibility JEDI&A in accordance with the tenets of the Canadian Human Rights Act and the Ontario Human Rights Code. We are committed to having a skilled, diversified workforce reflective of Canadian Society., and encourages applications from Indigenous, Black and racialized communities, women, persons with disabilities, and members of 2SLGBTQIA+ communities.\n     \n     \n    \n     The Gallery is committed to developing inclusive, barrier-free selection processes and work environment. Alternative selection tool methods and/or reasonable accommodation are available upon request.\n     Candidates are entitled to participate in the selection process in the official language of their choice.\n    \n     \n   \n    \n   \n   \n    View Disclaimer\n     \n   \n    \n    \n   \n   \n    \n     Apply for this job"
}