{
    "id": "292d4cc619127031",
    "company": "CleanPlanet Inc",
    "positionName": "Quality Control Technician and Assembly",
    "jobType": [
        "Permanent",
        "Full-time"
    ],
    "location": "CleanPlanet Inc in Ottawa, ON",
    "salary": "$26–$30 an hour",
    "postingDateParsed": "2024-01-26T12:12:41.163Z",
    "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0AELPRhecdlUvjzgpmXuW8g43IgUUnuXUNnAUbWmQWkAIM8GxAjBXFF8EoGJKYSwXeJ1uqY16j47WQ_iuC_xJ7A5Ykd_datC-2LjoEYAVQZ5iug5sodvQV98WEtQr9r3UgGwlNEtnoicDHMiV4hmlmKQ7DZXdgIsMsBDUFP_7xI8amzINCjLhqpM8Hl5yJ4tM_wJzViAcQLjGDdfzTN5opvaQkPtVdCZSBu-F2imZBeTfLP2eb6nccHdxgfuwoOITMB7gLkWl1KFVb1rbOFIXgIDin1FCIiwL4hWRRGsx9ss6G8mxpubC4S3alVZBjaipe0J2h2pY9kkyoG1NSId9Sh7vOdgH-RnK6kS8yUx22KHUDIt-HpOBCNhUneHZ7jMYyTSwO1yc5o1OHNfqq1rm1wwgtLlctH-ALEGLAblQdTDSNIzFSL5gAXmn5x_yPpQb66bjgn7cRnA6jSwtf3aPL64I5pEjrmY4kbbYiwac7fnmnzhhv8aGtJFclmW3LWY5QnW_7xJeblnIw9VrAkiSoR49Vn0tB55VQ9ji7sWBFtmUcynuc1tcqnRLOpJ9-8VRbtOMbVTW5shQPTBrXQKZ36-x_DXHXd3jzVvlEl_bbPgTf_30rndpCM2xwAmIpEEthvfMVgEVlG70OPuCwb-p1eSfAKK2iWiX39JecerE0GoGsXgUUuZ4IDosss85ZjgZUJJiIU8ybJ_5_6wJ-A2MyVGWbz3MbkXGCcAwxWefbqWQ%3D%3D&xkcb=SoDv6_M3FlSjXfRcgp0GbzkdCdPP&p=13&fvj=1&vjs=3&jsa=6643&tk=1hl5db43ij458800&from=jasx&wvign=1",
    "externalApplyLink": null,
    "job_info_group": {
        "extracted_phone_numbers": [],
        "extracted_links": [
            "HTTP/HTTPS Links",
            "General Links",
            "WWW Links",
            "TLDs"
        ],
        "extracted_emails": [],
        "extracted_location_data": [
            "Ottawa"
        ],
        "extracted_dates": [
            "Monday",
            "Friday",
            "3 years",
            "3 to 5 years"
        ],
        "extracted_languages": [],
        "extracted_laws": [],
        "extracted_norps": [],
        "extracted_orgs": [
            "Vision",
            "NCR",
            "Job description CleanPlanet Chemical Inc"
        ],
        "extracted_persons": [],
        "extracted_products": [],
        "extracted_money": [
            {
                "amount": "26.00-$30.00",
                "noun_phrases": []
            }
        ],
        "processed_text": "recognize leader deliver innovative cost effective solution site chemical recycling paint gun cleaning relate technology . deliver award win earth friendly technology improve performance reduce operating cost . Quality Control Technician join team . long term security chance stay long term organization . ESSENTIAL duty responsibility responsible conforming Report reject Material quality control root analysis problem solve activity stage operation constant monitoring fabrication assembly glazing operation find solve technical issue improvement lead hand problem solve initiative project product process quality issue apply quality core tool development implementation technical instruction flow process control plan gather analyze report meaningful datum problem solve project duty require . qualification Bachelor's Degree Mechanical Technology Industrial Engineering equivalent College Technical diploma asset minimum mechanical . Quality Control Quality Assurance manufacturing fabrication environment asset demonstrate utilize quality relate tool method . familiar ISO standard quality Audit concept asset read interpret procedure technical drawing accurately basic measuring device instrument ideal energetic assertive diligent detail orient direct drive problem solve initiative product Process improvement communicate effectively prioritize workload meet customer expectation . type permanent salary hour benefit dental care extended health care site parking care schedule hour shift supplemental pay type overtime pay mechanical assembly require location person"
    },
    "companyDescription": null,
    "description": "Job description\nCleanPlanet Chemical Inc is the recognized leader in delivering innovative & cost-effective solutions for on-site chemical recycling, paint-gun cleaning & related technologies.\nDelivering award-winning, earth-friendly technologies that improve performance and reduce operating cost. We’re looking for a Quality Control Technician to join our team in Ottawa.\nThis is a long-term opportunity for candidates looking for security, and the chance to stay long term with an organization.\nESSENTIAL DUTIES AND RESPONSIBILITIES:\n\n Responsible for all Non-Conforming Report (NCR), rejected Material, quality control, root cause analysis, and problem-solving activities at all stages of operation;\n\n\n Constant monitoring of the fabrication, assembly, glazing and other operations for finding opportunities for solving technical issues and improvement;\n\n\n Lead hands-on problem-solving initiative projects of product and processes quality issues with applying all quality core tools;\n\n\n Development and implementation of technical instructions, flow processes and controls Plans,\n\n\n Gather, analyze and report meaningful data for problem solving projects;\n\n\n Other duties as required.\n\nQUALIFICATIONS:\n\n A Bachelor's Degree in Mechanical, Technology or Industrial Engineering or equivalent College Technical diploma would be an asset;\n\n\n A minimum of 3 to 5 years of mechanical experience. Quality Control or Quality Assurance experience in a manufacturing & fabrication environment would be an asset;\n\n\n Demonstrated work experience utilizing quality-related tools and methods.\n\n\n Familiar with ISO 9000 standard and quality Audit concepts would be an asset;\n\n\n Ability to read and interpret procedures and technical drawings, and accurately use basic measuring devices and instruments;\n\n\n The ideal candidate must be energetic, assertive, diligent, detail-oriented, and self-directed at driving problem solving initiatives and product & Process improvement with the ability to communicate effectively and prioritize workload to meet customer expectations.\n\nJob Types: Full-time, Permanent\nSalary: $26.00-$30.00 per hour\nBenefits:\n\n Dental care\n Extended health care\n On-site parking\n Vision care\n\nSchedule:\n\n 8 hour shift\n Monday to Friday\n\nSupplemental pay types:\n\n Overtime pay\n\nExperience:\n\n Mechanical assembly: 3 years (required)\n\nWork Location: In person"
}