{
    "id": "9c11fb33c799da81",
    "company": "Proactive Pharmacy",
    "positionName": "Pharmacy Assistant",
    "jobType": [],
    "location": "1645 Bank Street, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-08T02:02:30.706Z",
    "url": "https://www.indeed.ca/rc/clk?jk=9c11fb33c799da81&from=jasx&tk=1hc6garcoih7o800&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "Responsibilities:- Assist pharmacists in dispensing medications to patients- Prepare and package medications for distribution- Maintain inventory of medications and supplies- Enter prescription information into computer systems- Answer phone calls and assist with customer inquiries- Process insurance claims and handle billing procedures- Provide excellent customer service to patients and healthcare professionals- Follow all safety protocols and maintain a clean and organized work area\nSkills:- Strong attention to detail and accuracy- Excellent organizational and multitasking abilities- Proficient computer skills, including knowledge of pharmacy software system (KROLL)- Exceptional communication skills, both verbal and written- Ability to work well in a fast-paced environment- Knowledge of medical terminology and pharmaceutical calculations is a plus\nAs a Pharmacy Assistant in a community setting, you will play a vital role in supporting the pharmacy team in providing quality healthcare services to patients. Your responsibilities will include assisting with medication dispensing, inventory management, customer service, and administrative tasks. Strong attention to detail, excellent organizational skills, and the ability to work efficiently in a fast-paced environment are essential for success in this role. If you have a passion for healthcare and enjoy working as part of a great team, we encourage you to apply for this position.\nJob Type: Part-time\nSalary: $18.00-$22.00 per hour\nExpected hours: 6 – 20 per week\nSchedule:\n\n Monday to Friday\n Weekends as needed\n\nAbility to commute/relocate:\n\n Ottawa, ON K1V 7Z1: reliably commute or plan to relocate before starting work (required)\n\nExperience:\n\n pharmacy: 1 year (required)\n\nWork Location: In person"
}