{
    "id": "9fe6102d6dd180ea",
    "companyDescription": "",
    "description": "Is this you? Are you an experienced Support Engineer with a passion for helping customers resolve cloud, server and back-up related issues? If yes, then this position is right for you!\n  Who are we? So glad you asked! HostedBizz is a top hybrid cloud solutions provider. We’re committed to delivering industry-leading solutions to our customers based on their unique business needs. For those looking to the public cloud, we’re an AWS Advanced Consulting Partner and Certified Solution Provider focused on migration, optimization, transformation, and cloud-first application consulting. We also specialize in managed cloud, backup, and disaster recovery.\n  We have a fun, casual culture that embraces fresh ideas and innovation. We’re customer-driven and we are looking for authentic and accountable team players to collaborate with us to reach our goals.\n  What would you do? As a Support Engineer for HostedBizz, you will work with the support teams to resolve day-to-day support-related issues for our clients. This hands-on role is responsible for resolving alerts/alarms from our monitoring systems and resolving customers' technical tickets while providing a high-touch customer experience to our clients. This role will report to the Support Team Lead and a Hosted Bizz Support Team member.\n  What are the details?\n  Primary Responsibilities:\n \n   Ensure that customer requests are attended to promptly while following appropriate procedures\n   Manage multiple tickets, prioritizing work against aggressive timelines\n   Work with managers to plan resource availability and distribution of work\n \n \n   Provide concise, consistent, and effective communication\n   Work with supervisor to recommend process enhancements to improve efficiencies and customer experience\n   Provide support for Veeam Backup-related issues as well as for Microsoft 365 customers\n   Assist in mentoring and training junior engineers\n   Participate in an after-hours On-Call support rotation\n \n \n   Respond to and resolve support tickets related to the on-going management of customer environments\n   Operating System Troubleshooting primarily Windows but may also work with Linux-based systems\n   Monitor and service client operations, including troubleshooting, patching, updating, and configuring various systems or applications\n   Monitor ticket queue, responding and updating, general BaaS and DRaaS inquiries as it relates to client technical support\n   Diagnose and resolve reported client incidents, tasks, questions, or problems\n \n \n   Develop automation to improve current and future processes\n   Provide documentation and technical specifications to other team members for maintaining and operating these environments for clients\n   Work with other teams VMware, Network, Storage, and Security subject matter experts to improve our service, response, and remediation times\n   Work onsite in our Ottawa location of a minimum of 2 days per week in the office\n \n  What do you know?\n  Basic Qualifications:\n \n   2 – 3 years of combined experience in cloud technologies or business continuity as a technician, administrator, engineer, or helpdesk team member e.g. VMware, Windows, Hyper-V, and Veeam other backup technologies\n   Deep knowledge of IT infrastructure components such as virtualization, networking, Data Center Services, Cloud platforms including VMware, AWS, Azure, Backups, and Disaster Recovery\n   Familiarity with technologies including Windows, Linux, Firewalls, Veeam, VMware, Zerto, and storage systems\n \n \n   Professional communication, problem-solving and organizational skills\n   Strong time management and prioritization skills\n   Highly comfortable engaging with external customers at the technical and executive levels\n   Experience working in Microsoft Office, Teams, Slack, Zendesk and Zoom\n \n  What do you know?\n  Preferred Qualifications:\n \n   Professional Certifications e.g., Veaam, MSFT, Networking, and CompTIA\n   Experience working with work management or ticketing systems e.g., Zendesk, ClickUp, and Zendesk\n   Experience with Monitoring tools such as Nagios, Icinga, Zabbix, etc.\n \n \n   Strong design-oriented thinking\n   Experience with VMware, Veeam, and Hyper-V\n   Previous hands-on experience in DRaaS, BaaS, and virtualization platforms\n   Ability to articulate complex concepts to cross-functional audiences\n   Demonstrated ability to adapt to new technologies and learn quickly\n \n \n   High degree of comfort presenting with executives, IT management, and developers\n \n  What do you get from us?\n \n   PTO\n   Medical & Dental Insurance\n \n \n   Retirement plan with company match\n   Casual atmosphere\n   Recognition Programs\n   Group Volunteer Opportunities\n   Option to be a hybrid (remote/in-office) position\n \n \n   A great place to spend most of your time!\n \n  HostedBizz an Opti9 Company is proud to be an equal opportunity employer. HostedBizz provides equal employment opportunities to all employees and applicants for employment without regard to race, color, ancestry, national origin, gender, sexual orientation, marital status, religion, age, disability, gender identity, results of genetic testing, service in the military, or any other legally protected characteristic.\n  \n TVxSRcuftp",
    "preprocessed_description": "Is this you? Are you an experienced Support Engineer with a passion for helping customers resolve cloud, server and back-up related issues? If yes, then this position is right for you! Who are we? So glad you asked! HostedBizz is a top hybrid cloud solutions provider. We're committed to delivering industry-leading solutions to our customers based on their unique business needs. For those looking to the public cloud, we are an Amazon Web Services Advanced Consulting Partner and Certified Solution Provider focused on migration, optimization, transformation, and cloud-first application consulting. We also specialize in managed cloud, backup, and disaster recovery. We have a fun, casual culture that embraces fresh ideas and innovation. We're customer-driven and we are looking for authentic and accountable team players to collaborate with us to reach our goals. What would you do? As a Support Engineer for HostedBizz, you will work with the support teams to resolve day-to-day support-related issues for our clients. This hands-on role is responsible for resolving alerts/alarms from our monitoring systems and resolving customers' technical tickets while providing a high-touch customer experience to our clients. This role will report to the Support Team Lead and a Hosted Bizz Support Team member. What are the details? Primary Responsibilities: Ensure that customer requests are attended to promptly while following appropriate procedures Manage multiple tickets, prioritizing work against aggressive timelines Work with managers to plan resource availability and distribution of work Provide concise, consistent, and effective communication Work with supervisor to recommend process enhancements to improve efficiencies and customer experience Provide support for Veeam Backup-related issues as well as for Microsoft 365 customers Assist in mentoring and training junior engineers Participate in an after-hours On-Call support rotation Respond to and resolve support tickets related to the on-going management of customer environments Operating System Troubleshooting primarily Windows but may also work with Linux-based systems Monitor and service client operations, including troubleshooting, patching, updating, and configuring various systems or applications Monitor ticket queue, responding and updating, general BaaS and DRaaS inquiries as it relates to client technical support Diagnose and resolve reported client incidents, tasks, questions, or problems Develop automation to improve current and future processes Provide documentation and technical specifications to other team members for maintaining and operating these environments for clients Work with other teams VMware, Network, Storage, and Security subject matter experts to improve our service, response, and remediation times Work onsite in our Ottawa location of a minimum of 2 days per week in the office What do you know? Basic Qualifications: 2 – 3 years of combined experience in cloud technologies or business continuity as a technician, administrator, engineer, or helpdesk team member e.g. VMware, Windows, Hyper-V, and Veeam other backup technologies Deep knowledge of IT infrastructure components such as virtualization, networking, Data Center Services, Cloud platforms including VMware, Amazon Web Services, Microsoft Azure, Backups, and Disaster Recovery Familiarity with technologies including Windows, Linux, Firewalls, Veeam, VMware, Zerto, and storage systems Professional communication, problem-solving and organizational skills Strong time management and prioritization skills Highly comfortable engaging with external customers at the technical and executive levels Experience working in Microsoft Office, Teams, Slack, Zendesk and Zoom What do you know? Preferred Qualifications: Professional Certifications e.g., Veaam, MSFT, Networking, and CompTIA Experience working with work management or ticketing systems e.g., Zendesk, ClickUp, and Zendesk Experience with Monitoring tools such as Nagios, Icinga, Zabbix, etc. Strong design-oriented thinking Experience with VMware, Veeam, and Hyper-V Previous hands-on experience in DRaaS, BaaS, and virtualization platforms Ability to articulate complex concepts to cross-functional audiences Demonstrated ability to adapt to new technologies and learn quickly High degree of comfort presenting with executives, IT management, and developers What do you get from us? Paid Time Off Medical & Dental Insurance Retirement plan with company match Casual atmosphere Recognition Programs Group Volunteer Opportunities Option to be a hybrid (remote/in-office) position A great place to spend most of your time! HostedBizz an Opti9 Company is proud to be an equal opportunity employer. HostedBizz provides equal employment opportunities to all employees and applicants for employment without regard to race, color, ancestry, national origin, gender, sexual orientation, marital status, religion, age, disability, gender identity, results of genetic testing, service in the military, or any other legally protected characteristic. TVxSRcuftp",
    "processed_description": "experienced Support Engineer passion help customer resolve cloud server issue position glad HostedBizz hybrid cloud solution provider . committed deliver industry lead solution customer base unique business . public cloud focus migration optimization transformation cloud application consulting . specialize manage cloud backup disaster recovery . fun casual culture embrace fresh idea innovation . customer drive authentic accountable team player collaborate reach goal . Support Engineer HostedBizz support team resolve support relate issue client . hand role responsible resolve alert alarm monitoring system resolve customer' technical ticket provide high touch customer client . role report Support Team Lead Hosted Bizz Support Team . detail primary responsibility ensure customer request attend follow appropriate procedure manage multiple ticket prioritize aggressive timeline manager plan resource availability distribution provide concise consistent effective communication supervisor recommend process enhancement improve efficiency customer provide support Veeam Backup relate issue customer assist mentor train junior engineer hour support rotation respond resolve support ticket relate going management customer environment Linux base system Monitor service client operation include troubleshoot patch update configure system application monitor ticket queue respond update general BaaS DRaaS inquiry relate resolve report client incident task question problem automation improve current future process provide documentation technical specification team maintain operate environment client team VMware security subject matter expert improve service response remediation times onsite location minimum office basic qualification – combine cloud technology business continuity technician administrator engineer helpdesk team Hyper veeam backup technology deep knowledge infrastructure component virtualization networking Cloud platform include backup Disaster Recovery Familiarity technology include Linux storage system professional communication problem solving organizational skill strong management prioritization skill highly comfortable engage external customer technical executive level Zoom preferred qualification Professional Certifications e.g. CompTIA management ticketing system Zendesk monitoring tool . strong design orient thinking VMware Hyper previous hand baas virtualization platform articulate complex concept cross functional audience demonstrate adapt technology learn high degree comfort executive management developer paid Medical Dental Insurance Retirement plan company match casual atmosphere Recognition Programs Group Volunteer Opportunities Option hybrid remote office position great place spend HostedBizz Opti9 Company equal employer . HostedBizz provide equal employment employee applicant employment regard race color ancestry national origin gender sexual orientation marital status religion age gender identity result genetic testing service military legally protect characteristic .",
    "results_group": {
        "extracted_noun_chunks": [
            "cloud technology business continuity technician administrator engineer helpdesk team Hyper veeam backup technology deep knowledge infrastructure component virtualization networking Cloud platform",
            "hand role responsible resolve alert alarm monitoring system",
            "Recognition Programs Group Volunteer Opportunities Option hybrid remote office position great place",
            "troubleshoot patch update",
            "HostedBizz",
            "concise consistent effective communication supervisor",
            "technology",
            "service response remediation times onsite location minimum office basic qualification",
            "external customer technical executive level Zoom preferred qualification",
            "aggressive timeline manager plan resource availability distribution",
            "backup Disaster Recovery Familiarity technology",
            "HostedBizz hybrid cloud solution provider",
            "high touch customer client",
            "support Veeam Backup",
            "management customer environment Linux base system Monitor service client operation",
            "operate environment client team VMware security subject matter expert",
            "previous hand",
            "high degree comfort executive management developer",
            "detail primary responsibility",
            "support",
            "fun casual culture",
            "HostedBizz Opti9 Company",
            "cloud server issue position",
            "genetic testing service military",
            "authentic accountable team player",
            "issue customer",
            "goal",
            "current future process",
            "industry lead solution customer base unique business",
            "customer request",
            "public cloud focus migration optimization transformation cloud application consulting",
            "follow appropriate procedure",
            "issue client",
            "cloud backup disaster recovery",
            "Professional Certifications e.g. CompTIA",
            "fresh idea innovation",
            "process enhancement",
            "management ticketing system",
            "Support Engineer passion",
            "efficiency customer",
            "casual atmosphere",
            "role report Support Team Lead Hosted Bizz Support Team",
            "Zendesk monitoring tool",
            "characteristic",
            "strong design orient thinking",
            "customer",
            "documentation technical specification team",
            "employer",
            "Linux storage system professional communication problem",
            "Support Engineer HostedBizz support team",
            "customer' technical ticket",
            "Medical Dental Insurance Retirement plan company",
            "resolve report client incident task question problem automation",
            "organizational skill strong management prioritization skill",
            "multiple ticket",
            "mentor train junior engineer hour support rotation",
            "configure system application monitor ticket queue",
            "BaaS DRaaS inquiry",
            "equal employment employee applicant employment regard race color ancestry national origin gender sexual orientation marital status religion age gender identity"
        ],
        "combined_lemmatized_tokens": "experienced Support Engineer passion help customer resolve cloud server issue position glad HostedBizz hybrid cloud solution provider . committed deliver industry lead solution customer base unique business . public cloud focus migration optimization transformation cloud application consulting . specialize manage cloud backup disaster recovery . fun casual culture embrace fresh idea innovation . customer drive authentic accountable team player collaborate reach goal . Support Engineer HostedBizz support team resolve support relate issue client . hand role responsible resolve alert alarm monitoring system resolve customer' technical ticket provide high touch customer client . role report Support Team Lead Hosted Bizz Support Team . detail primary responsibility ensure customer request attend follow appropriate procedure manage multiple ticket prioritize aggressive timeline manager plan resource availability distribution provide concise consistent effective communication supervisor recommend process enhancement improve efficiency customer provide support Veeam Backup relate issue customer assist mentor train junior engineer hour support rotation respond resolve support ticket relate going management customer environment Linux base system Monitor service client operation include troubleshoot patch update configure system application monitor ticket queue respond update general BaaS DRaaS inquiry relate resolve report client incident task question problem automation improve current future process provide documentation technical specification team maintain operate environment client team VMware security subject matter expert improve service response remediation times onsite location minimum office basic qualification – combine cloud technology business continuity technician administrator engineer helpdesk team Hyper veeam backup technology deep knowledge infrastructure component virtualization networking Cloud platform include backup Disaster Recovery Familiarity technology include Linux storage system professional communication problem solving organizational skill strong management prioritization skill highly comfortable engage external customer technical executive level Zoom preferred qualification Professional Certifications e.g. CompTIA management ticketing system Zendesk monitoring tool . strong design orient thinking VMware Hyper previous hand baas virtualization platform articulate complex concept cross functional audience demonstrate adapt technology learn high degree comfort executive management developer paid Medical Dental Insurance Retirement plan company match casual atmosphere Recognition Programs Group Volunteer Opportunities Option hybrid remote office position great place spend HostedBizz Opti9 Company equal employer . HostedBizz provide equal employment employee applicant employment regard race color ancestry national origin gender sexual orientation marital status religion age gender identity result genetic testing service military legally protect characteristic ."
    }
}