{
    "id": "a3d0d8856a5e3c6f",
    "company": "City of Ottawa",
    "positionName": "Customer Communications Officer",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-13T18:54:49.067Z",
    "url": "https://www.indeed.ca/rc/clk?jk=a3d0d8856a5e3c6f&from=jasx&tk=1hcvfqthu2mmn000&vjs=3",
    "externalApplyLink": "https://jobs-emplois.ottawa.ca/city-jobs/job/Ottawa%2C-ON-Customer-Communications-Officer-ON/728022047/",
    "companyDescription": "",
    "description": "Requisition ID: 10174 Department: Transit Services Department Service: Transit Strategic Communications & External Relations Service Branch: Transit Strategic Communications Branch Employment Type: 1 Full-time Temporary - Up to 18 months Work Hours: 35.00 hours per week Affiliation: ATU 1760 Salary Information: $62,167.56 - $88,182.64 annually (2023 rates of pay) Location: 1500 St.Laurent City: Ottawa, ON Job Category: Transportation Application Close: 26/10/2023 \n       \n        \n         \n           JOB SUMMARY\n         \n         \n           The mandate of the Transit Customer Systems and Planning Service is to provide customer service, service planning, and technology and control systems support for OC Transpo, geared to providing excellence in customer service delivery to 100 million transit customers per year by means of conventional bus, para transit and rail operations. Transit Customer Service is responsible for delivering a broad range of program areas and services related to Marketing/Branding, Sponsorship/Advertising, Customer Service, Information, Fare Sales and Operations, Community Relations, and Internal Communications. \n          You are responsible for writing and posting or sending information about transit service and transit service status through several channels, including OC Transpo live information channels and signage, and social media, and for researching and writing correspondence from or for Councillors and senior management. \n          You are also responsible for: preparing and relaying accurate and high-quality information about the public transit services offered by OC Transpo; ensuring that the information communicated to customers, staff, members of Council and the Transit Commission, and the general public is consistent, clear, effective, accurate and up to date; writing, editing and proofreading written communication to internal and external stakeholders; coordinating live information update activities for all transit modes, including social media monitoring; engaging with and supporting customers via social media; and developing and coordinating content for social media and public alerts. \n          In addition, you: coordinate the development and provision of responses to issues and inquiries; respond to requests received through formal channels (i.e. councillor inquiries or from Mayor’s office) and digital platforms, including the web, direct emails and social media; serve as a technical advisor and provide functional and administrative expertise relating to live updates; participate in the planning, coordination and implementation of Transit Services' live update strategy and tactics; prepare and provide regular status reports on live update and media activities; and assist with communication on special events, emergency and/or crisis communications, as required. \n         \n        \n        \n         \n           EDUCATION AND EXPERIENCE\n         \n         \n           Completion of 3 year university degree in communications, journalism or public relations, or related field \n          Minimum of 3 years of experience in the field of communications, public relations, journalism, marketing and/or media relations including at least one year working in a social media work environment. \n         \n        \n        \n         \n           KNOWLEDGE \n         \n         \n          \n           In-depth knowledge of social media dashboard programs (CMS Expressing Engine, TweetDeck, etc.), current social media channels, Microsoft Office Suite, Photoshop, and content management systems \n           Effective communication tactics and techniques using traditional and web-based channels \n           Trends in communications and transit industries and approaches \n           Local and current events \n           Effective media relations \n           City governance, initiatives, programs and services \n           Customer service requirements \n           Quality assurance procedures \n           Knowledge of applicable health and safety legislation, including the rights and duties of workers \n          \n         \n        \n        \n         \n          COMPETENCIES, SKILLS AND ABILITIES \n         \n         \n          \n           Proficiency in Social media dashboard programs (CMS Expressing Engine, TweetDeck, etc.), current social media channels, Microsoft Office Suite, Photoshop, and content management systems \n           Superior verbal communications, writing and editing skills \n           Exceptional eye for detail, editorial judgment, and grammatical skills \n           Ability to conceptualize, solicit, research and write stories for official blog \n           Ability to be creative and think logically \n           Effective organization, coordination and time management skills \n           Research and analytical skills \n           Ability to identify issues in the public domain \n           Ability to exercise effective judgment and independent decision making \n           Excellent interpersonal and relationship management skills \n           Ability to work independently and as part of a team \n           Ability to prepare detailed and concise reports \n           Ability to work in a fast-paced, deadline driven environment \n           Exercises effective judgment and independent decision making \n           Exercises tact, discretion and confidentiality \n           Ability to work directly with City staff, elected officials and senior management \n           Ability to prepare comprehensive communications strategies \n           Ability to influence and inform stakeholders regarding the application of communications tactics and techniques \n           Customer service sensitivity to meet diverse customer requirements \n           Demonstrate good judgment, tact, discretion, diplomacy, creativity and initiative \n           Positive attitude \n           Self-motivated \n           Organized and dependable \n           Works effectively in high pressure situations \n           Interest in current events and public affairs \n           Flexibility in accommodating morning/night/weekends shifts Must be willing to work evenings, weekends and/or holidays, should it be required \n          \n         \n        \n       \n       WHAT YOU NEED TO KNOW \n       \n        Language Requirement: Designated Bilingual – specific level of language proficiency: French: oral, reading, writing English: oral, reading, writing Candidates who do not meet language requirements will be required to participate in training. \n        Experience and formal training combined with demonstrated performance and ability may substitute for stipulated academic requirements. \n        Please save a copy of the job poster. Once the closing date has passed, it will no longer be available.\n       \n        \n        \n       We wish to thank all applicants for their interest and effort in applying for this position. Only candidates selected for interviews will be contacted.\n        \n        \n       The City of Ottawa promotes the principles of diversity and inclusion and adheres to the tenets of the Canadian Human Rights Act and the Ontario Human Rights Code. We encourage applications from members of Indigenous, Black and other racialized communities, persons with disabilities, women and non-binary persons, persons of all ethnic origins, religions, sexual orientations, classes, gender identities and expressions. Candidates are encouraged to self-identify as a member of one or more designated employment equity groups in the self-identification questionnaire.\n        \n        \n       The City of Ottawa provides accommodation during all parts of the hiring process, upon request, to applicants with disabilities. If contacted to proceed to the selection process, please advise us if you require any accommodation.\n        \n        \n       Accessible formats and communication supports are available upon request. Please contact the HR Service Centre at 613-580-2424, extension 47411."
}