{
    "id": "f700b1f6cacbfa0a",
    "companyDescription": "",
    "description": "Team lead, Application Development - ( 2400000E ) \n Description \n Grow with the best. Join a smart, creative, and inspired team that works to support operational excellence. The Stantec community unites more than 28,000 employees working in over 400 locations across 6 continents. Our Functional Services Teams (FSTs) include Corporate Development, Finance, HR, HSSE, IT, Legal, Marketing/Communications, Practice Services and Real Estate and Procurement. Bringing together individuals with diverse backgrounds, talents, and expertise, our FSTs are vital to making our Company stronger. \n Your Opportunity \n We are looking for a Team Lead, Application Development to join our Integrated Business Applications (IBA) team. In addition to providing supervision to a group of professionals, the Team lead will also be involved in developing solutions that extend our Oracle ERP systems (EBS and Cloud applications) and meet the requirements of our business users. The successful individual requires experience in both HR supervision and Oracle solutions development. \n Your Key Responsibilities \n \n  Provide management to direct reports and support the overall team, including recruiting new hires. \n  Work with your team to address personnel or project issues as they arise. \n  Provide guidance, coaching, feedback, and support to team members. \n  Establish and support career development plans with employees. \n  Keep peers and managers informed on the status of issues. \n  Communicate risks and recommend solutions to stakeholders and management. \n  Provide consultation on the capabilities of application technology to identify opportunities to solve business problems. \n  Perform quality reviews on the team members’ deliverables. \n  Prepare time and effort estimates for assigned projects and tasks. \n  Learn and adopt design and coding standards. \n  Assist in the analysis of software specifications provided by Business Systems Analyst. \n  Assist in the design and development of software solutions as per specifications. \n  Develop and execute unit test plans to ensure quality of software being released for integration and user testing. \n  Help develop a technical transition plan ensuring a smooth transition of solutions to production. \n  Plan, document, assign and implement production transition tasks to ensure a smooth deployment into our production environment. \n  Able to work Flexible hours if required. \n \n Qualifications \n Your Capabilities and Credentials \n \n  Experience leading a software development team of 4-5 people. \n  Experience working in a team-oriented, highly collaborative environment. \n  Strong interpersonal and communication skills, both written and verbal. \n  Strong soft skills and ability to empower team members as well as motivate them to achieve organizational goals. \n  Ability to coach, guide, and provide constructive feedback to team members. \n  Experience in all aspects of software development lifecycle following best practice methodologies like the Agile practices. \n  Understanding of ITIL practices. \n  Experience working with complex enterprise applications, preferably in an ERP environment such as Oracle e-Business Suite 11i/12, Oracle Cloud Applications, or Peoplesoft. \n  Strong organizational, time management, Analytical, and problem solving/troubleshooting skills. \n  Strong knowledge in Oracle Database and PL/SQL, java, JavaScript, Oracle Application Express, Oracle JDeveloper, Forms, Workflow, BI Publisher, OAF, Web Services, Oracle Integration Cloud services. \n  Experience reading and writing to web-based APIs using JSON or XML objects. \n  Experience in software versioning and revision control systems (GIT, STAT, BitBucket). \n \n Education and Experience \n \n  Post-secondary degree in Computer Science, Information Systems, or related field, or equivalent experience. \n  A minimum of 10 years of experience in a software development role. \n  A minimum of 5 years as senior developer, technical architect or technical lead providing direction and facilitating the Agile process. \n  Prior experience in a supervisory role managing task assignment, prioritization, and delivery. \n \n Stantec is a place where the best and brightest come to build on our collective talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best! \n Pay transparency laws require employers to provide the following information for positions that may be in the following jurisdiction(s): \n Salary Range(s): \n \n  $50.05 - $79.59 Min/Max Pay Range for postings located in BC \n \n The final agreed upon compensation is based on individual education, qualifications, experience, and work location. At Stantec certain roles are bonus eligible. \n Benefits Summary: Regular full-time and part-time employees will have access to health, dental, and vision plans, a well-being program, health care spending account, wellness spending accounts, group registered retirement savings plan, employee stock purchase program, group tax-free savings account, life and accidental death & dismemberment (AD&D) insurance, short-term/long-term disability plans, emergency travel benefits, tuition reimbursement, professional membership fee coverage, and paid time off. \n Temporary/casual employees will have access to group registered retirement savings plan, employee stock purchase program, and group tax-free savings account. \n The benefits information listed above may not apply to union positions because benefits for such positions are governed by applicable collective bargaining agreements. \n Primary Location : Canada-Alberta-Edmonton \n Other Locations : Canada-Alberta-Calgary, Canada-British Columbia-Vancouver, Canada-Manitoba-Winnipeg, Canada-New Brunswick, Canada-Ontario-Toronto, Canada-Ontario-Ottawa, Canada-Ontario-Waterloo, Canada-Newfoundland and Labrador, Canada-Quebec-Montréal, Canada-Nova Scotia \n Work Locations : \n Edmonton AB \n Organization : BC-1371 Integrated Business Applications-CA Canada \n Employee Status : Regular \n Job Level : Manager \n Travel : No \n Schedule : Full-time \n Job Posting : Jan 8, 2024, 9:05:13 AM \n Req ID: 2400000E \n Stantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans",
    "preprocessed_description": "Team lead, Application Development - ( 2400000E ) Description Grow with the best. Join a smart, creative, and inspired team that works to support operational excellence. The Stantec community unites more than 28,000 employees working in over 400 locations across 6 continents. Our Functional Services Teams (FSTs) include Corporate Development, Finance, Human Resources, HSSE, IT, Legal, Marketing/Communications, Practice Services and Real Estate and Procurement. Bringing together individuals with diverse backgrounds, talents, and expertise, our FSTs are vital to making our Company stronger. Your Opportunity We are looking for a Team Lead, Application Development to join our Integrated Business Applications (IBA) team. In addition to providing supervision to a group of professionals, the Team lead will also be involved in developing solutions that extend our Oracle Enterprise Resource Planning systems (EBS and Cloud applications) and meet the requirements of our business users. The successful individual requires experience in both Human Resources supervision and Oracle solutions development. Your Key Responsibilities Provide management to direct reports and support the overall team, including recruiting new hires. Work with your team to address personnel or project issues as they arise. Provide guidance, coaching, feedback, and support to team members. Establish and support career development plans with employees. Keep peers and managers informed on the status of issues. Communicate risks and recommend solutions to stakeholders and management. Provide consultation on the capabilities of application technology to identify opportunities to solve business problems. Perform quality reviews on the team members' deliverables. Prepare time and effort estimates for assigned projects and tasks. Learn and adopt design and coding standards. Assist in the analysis of software specifications provided by Business Systems Analyst. Assist in the design and development of software solutions as per specifications. Develop and execute unit test plans to ensure quality of software being released for integration and user testing. Help develop a technical transition plan ensuring a smooth transition of solutions to production. Plan, document, assign and implement production transition tasks to ensure a smooth deployment into our production environment. Able to work Flexible hours if required. Qualifications Your Capabilities and Credentials Experience leading a software development team of 4-5 people. Experience working in a team-oriented, highly collaborative environment. Strong interpersonal and communication skills, both written and verbal. Strong soft skills and ability to empower team members as well as motivate them to achieve organizational goals. Ability to coach, guide, and provide constructive feedback to team members. Experience in all aspects of software development lifecycle following best practice methodologies like the Agile practices. Understanding of ITIL practices. Experience working with complex enterprise applications, preferably in an Enterprise Resource Planning environment such as Oracle e-Business Suite 11i/12, Oracle Cloud Applications, or Peoplesoft. Strong organizational, time management, Analytical, and problem solving/troubleshooting skills. Strong knowledge in Oracle Database and PL/Structured Query Language, java, JavaScript, Oracle Application Express, Oracle JDeveloper, Forms, Workflow, Business Intelligence Publisher, OAF, Web Services, Oracle Integration Cloud services. Experience reading and writing to web-based APIs using JavaScript Object Notation or eXtensible Markup Language objects. Experience in software versioning and revision control systems (GIT, STAT, BitBucket). Education and Experience Post-secondary degree in Computer Science, Information Systems, or related field, or equivalent experience. A minimum of 10 years of experience in a software development role. A minimum of 5 years as senior developer, technical architect or technical lead providing direction and facilitating the Agile process. Prior experience in a supervisory role managing task assignment, prioritization, and delivery. Stantec is a place where the best and brightest come to build on our collective talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best! Pay transparency laws require employers to provide the following information for positions that may be in the following jurisdiction(s): Salary Range(s): $50.05 - $79.59 Min/Max Pay Range for postings located in BC The final agreed upon compensation is based on individual education, qualifications, experience, and work location. At Stantec certain roles are bonus eligible. Benefits Summary: Regular full-time and part-time employees will have access to health, dental, and vision plans, a well-being program, health care spending account, wellness spending accounts, group registered retirement savings plan, employee stock purchase program, group tax-free savings account, life and accidental death & dismemberment (ADandD) insurance, short-term/long-term disability plans, emergency travel benefits, tuition reimbursement, professional membership fee coverage, and paid time off. Temporary/casual employees will have access to group registered retirement savings plan, employee stock purchase program, and group tax-free savings account. The benefits information listed above may not apply to union positions because benefits for such positions are governed by applicable collective bargaining agreements. Primary Location : Canada-Alberta-Edmonton Other Locations : Canada-Alberta-Calgary, Canada-British Columbia-Vancouver, Canada-Manitoba-Winnipeg, Canada-New Brunswick, Canada-Ontario-Toronto, Canada-Ontario-Ottawa, Canada-Ontario-Waterloo, Canada-Newfoundland and Labrador, Canada-Quebec-Montréal, Canada-Nova Scotia Work Locations : Edmonton AB Organization : BC-1371 Integrated Business Applications-CA Canada Employee Status : Regular Job Level : Manager Travel : No Schedule : Full-time Job Posting : Jan 8, 2024, 9:05:13 AM Req ID: 2400000E Stantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans",
    "processed_description": "team lead description grow good . join smart creative inspire team support operational excellence . Stantec community unite employee location continent . fsts include Finance HSSE legal Real Estate Procurement . bring individual diverse background talent expertise fst vital company strong . Team Lead Application Development join Integrated Business Applications IBA team . addition provide supervision group professional Team lead involve develop solution extend Oracle Enterprise Resource Planning system EBS Cloud application meet requirement business user . successful individual require Human Resources supervision Oracle solution development . Key Responsibilities provide management direct report support team include recruit hire . team address personnel project issue . provide guidance coaching feedback support team . establish support career development plan employee . peer manager inform status issue . communicate risk recommend solution stakeholder management . provide consultation capability application technology identify solve business problem . perform quality review team member' deliverable . prepare effort estimate assign project task . learn adopt design code standard . assist analysis software specification provide Business Systems Analyst . assist design development software solution specification . develop execute unit test plan ensure quality software release integration user testing . help develop technical transition plan ensure smooth transition solution production . plan document assign implement production transition task ensure smooth deployment production environment . flexible hour require . qualification Capabilities Credentials lead software development team people . team orient highly collaborative environment . strong interpersonal communication skill write verbal . strong soft skill empower team motivate achieve organizational goal . coach guide provide constructive feedback team . aspect software development lifecycle follow good practice methodology agile practice . understand itil practice . complex enterprise application preferably Enterprise Resource Planning environment Business Suite 11i . strong organizational management problem solve troubleshooting skill . strong knowledge PL Structured Query Language java form Workflow Business Intelligence Publisher OAF Oracle Integration Cloud service . read write web base api JavaScript Object Notation eXtensible Markup Language object . software versioning revision control system STAT BitBucket . education Post secondary degree field equivalent . minimum software development role . minimum senior developer technical architect technical lead provide direction facilitate agile process . prior supervisory role manage task assignment prioritization delivery . place good bright build collective talent exciting impact . join redefine personal good pay transparency law require employer provide follow information position follow jurisdiction Salary Range Min Max Pay Range posting locate final agree compensation base individual education qualification location . role bonus eligible . benefit summary regular employee access health dental vision plan program health care spending account wellness spending account group register retirement saving plan employee stock purchase program group tax free saving account life accidental death dismemberment adandd insurance short term long term plan emergency travel benefit tuition reimbursement professional membership fee coverage pay . temporary casual employee access group register retirement saving plan employee stock purchase program group tax free saving account . benefit information list apply union position benefit position govern applicable collective bargaining agreement . Primary Location Alberta Edmonton Locations Alberta Calgary British Columbia Vancouver Manitoba Winnipeg Toronto Waterloo Newfoundland Montreal Nova Scotia Locations regular level manager travel schedule posting Req provide equal employment qualified employee applicant future current employment prohibit discrimination ground race color religion sex national origin age marital status genetic information protect veteran status sexual orientation gender identity gender expression . prohibit discrimination decision concern recruitment hiring referral promotion compensation fringe benefit training termination condition employment . compliance local state federal law regulation ensure equitable aspect employment . EEO include protect Veterans",
    "results_group": {
        "extracted_noun_chunks": [
            "Alberta Edmonton Locations",
            "analysis software specification",
            "retirement saving plan employee stock purchase program group tax free saving account",
            "Human Resources supervision Oracle solution development",
            "Integrated Business Applications IBA team",
            "team address personnel project issue",
            "applicable collective bargaining agreement",
            "discrimination decision concern recruitment",
            "smart creative inspire team",
            "flexible hour",
            "itil practice",
            "strong soft skill empower team",
            "compliance local state federal law regulation",
            "execute unit test plan",
            "veteran status sexual orientation",
            "Business Systems Analyst",
            "minimum software development role",
            "fsts",
            "write web base api JavaScript Object Notation eXtensible Markup Language object",
            "consultation capability application technology",
            "effort estimate",
            "agile process",
            "management direct report support team",
            "coach guide",
            "design development software solution specification",
            "troubleshooting skill",
            "design code standard",
            "description",
            "good bright build collective talent exciting impact",
            "union position benefit position",
            "peer manager",
            "discrimination ground race color religion sex national origin age marital status genetic information",
            "software versioning revision control system",
            "aspect software development lifecycle",
            "complex enterprise application preferably Enterprise Resource Planning environment Business Suite 11i",
            "technical transition plan",
            "quality review team member",
            "Alberta",
            "software development team people",
            "solution",
            "Stantec community",
            "Team Lead Application Development",
            "highly collaborative environment",
            "Veterans",
            "Key Responsibilities",
            "production transition task",
            "Workflow Business Intelligence Publisher OAF Oracle Integration Cloud service",
            "temporary casual employee access group",
            "education Post secondary degree field",
            "project task",
            "status issue",
            "employee location continent",
            "smooth deployment production environment",
            "risk",
            "Waterloo Newfoundland",
            "business problem",
            "Calgary British Columbia",
            "team",
            "role bonus",
            "quality software release integration user testing",
            "individual diverse background talent expertise fst vital company",
            "personal good pay transparency law",
            "equal employment qualified employee applicant",
            "task assignment prioritization delivery",
            "benefit summary regular employee access health dental vision plan program health care spending account wellness spending account group",
            "referral promotion compensation",
            "follow information position follow jurisdiction Salary Range Min Max Pay Range posting",
            "gender identity gender expression",
            "smooth transition solution production",
            "solution stakeholder management",
            "BitBucket",
            "benefit information list",
            "Vancouver Manitoba",
            "guidance coaching feedback support team",
            "minimum senior developer technical architect technical lead",
            "good practice methodology",
            "supervision group professional Team lead",
            "constructive feedback team",
            "Oracle Enterprise Resource Planning system",
            "equitable aspect employment",
            "recruit hire",
            "retirement saving plan employee stock purchase program group tax free saving account life accidental death dismemberment adandd insurance short term long term",
            "operational excellence",
            "agile practice",
            "support career development plan employee",
            "future current employment",
            "plan document",
            "final agree compensation base individual education qualification location",
            "Winnipeg Toronto",
            "java",
            "emergency travel benefit tuition reimbursement professional membership fee coverage pay",
            "Finance HSSE legal Real Estate Procurement",
            "EEO",
            "qualification Capabilities Credentials",
            "organizational goal",
            "direction",
            "addition",
            "Req",
            "strong interpersonal communication skill",
            "EBS Cloud application meet requirement business user",
            "strong organizational management problem",
            "employer",
            "fringe benefit training termination condition employment",
            "prior supervisory role",
            "successful individual"
        ],
        "combined_lemmatized_tokens": "team lead description grow good . join smart creative inspire team support operational excellence . Stantec community unite employee location continent . fsts include Finance HSSE legal Real Estate Procurement . bring individual diverse background talent expertise fst vital company strong . Team Lead Application Development join Integrated Business Applications IBA team . addition provide supervision group professional Team lead involve develop solution extend Oracle Enterprise Resource Planning system EBS Cloud application meet requirement business user . successful individual require Human Resources supervision Oracle solution development . Key Responsibilities provide management direct report support team include recruit hire . team address personnel project issue . provide guidance coaching feedback support team . establish support career development plan employee . peer manager inform status issue . communicate risk recommend solution stakeholder management . provide consultation capability application technology identify solve business problem . perform quality review team member' deliverable . prepare effort estimate assign project task . learn adopt design code standard . assist analysis software specification provide Business Systems Analyst . assist design development software solution specification . develop execute unit test plan ensure quality software release integration user testing . help develop technical transition plan ensure smooth transition solution production . plan document assign implement production transition task ensure smooth deployment production environment . flexible hour require . qualification Capabilities Credentials lead software development team people . team orient highly collaborative environment . strong interpersonal communication skill write verbal . strong soft skill empower team motivate achieve organizational goal . coach guide provide constructive feedback team . aspect software development lifecycle follow good practice methodology agile practice . understand itil practice . complex enterprise application preferably Enterprise Resource Planning environment Business Suite 11i . strong organizational management problem solve troubleshooting skill . strong knowledge PL Structured Query Language java form Workflow Business Intelligence Publisher OAF Oracle Integration Cloud service . read write web base api JavaScript Object Notation eXtensible Markup Language object . software versioning revision control system STAT BitBucket . education Post secondary degree field equivalent . minimum software development role . minimum senior developer technical architect technical lead provide direction facilitate agile process . prior supervisory role manage task assignment prioritization delivery . place good bright build collective talent exciting impact . join redefine personal good pay transparency law require employer provide follow information position follow jurisdiction Salary Range Min Max Pay Range posting locate final agree compensation base individual education qualification location . role bonus eligible . benefit summary regular employee access health dental vision plan program health care spending account wellness spending account group register retirement saving plan employee stock purchase program group tax free saving account life accidental death dismemberment adandd insurance short term long term plan emergency travel benefit tuition reimbursement professional membership fee coverage pay . temporary casual employee access group register retirement saving plan employee stock purchase program group tax free saving account . benefit information list apply union position benefit position govern applicable collective bargaining agreement . Primary Location Alberta Edmonton Locations Alberta Calgary British Columbia Vancouver Manitoba Winnipeg Toronto Waterloo Newfoundland Montreal Nova Scotia Locations regular level manager travel schedule posting Req provide equal employment qualified employee applicant future current employment prohibit discrimination ground race color religion sex national origin age marital status genetic information protect veteran status sexual orientation gender identity gender expression . prohibit discrimination decision concern recruitment hiring referral promotion compensation fringe benefit training termination condition employment . compliance local state federal law regulation ensure equitable aspect employment . EEO include protect Veterans"
    }
}