{
    "id": "f700b1f6cacbfa0a",
    "company": "Stantec",
    "positionName": "Team lead, Application Development",
    "jobType": [
        "Temporary",
        "Part-time",
        "Full-time"
    ],
    "location": "3001331 Clyde Avenue, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-09T03:11:09.823Z",
    "url": "https://www.indeed.ca/rc/clk?jk=f700b1f6cacbfa0a&from=jasx&tk=1hjm33n93k6rj800&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/applystart?jk=f700b1f6cacbfa0a&from=vj&pos=top&mvj=0&spon=0&sjdu=o7sfz71MPdMgyiV0LZq0d4DDplm6SwWjHcxyoDIphKm3A3k1e2F11IH87TVVEQT_PbCA0wN2XEmc4ldfiZvkb54FbbaVFntTy9sLlWA0AJjfjua1IaPdo245RWAMuto4YncM1qS4IhNPu6f3obr2N9ebqfni5nsIwraNDvi1iX3brEykfCWBdRnzHzEXO4gpw9_XINGINv7OnqX9-Wv1cg&vjfrom=serp&astse=6260231acc8aa100&assa=9140",
    "companyDescription": "",
    "description": "Team lead, Application Development - ( 2400000E ) \n Description \n Grow with the best. Join a smart, creative, and inspired team that works to support operational excellence. The Stantec community unites more than 28,000 employees working in over 400 locations across 6 continents. Our Functional Services Teams (FSTs) include Corporate Development, Finance, HR, HSSE, IT, Legal, Marketing/Communications, Practice Services and Real Estate and Procurement. Bringing together individuals with diverse backgrounds, talents, and expertise, our FSTs are vital to making our Company stronger. \n Your Opportunity \n We are looking for a Team Lead, Application Development to join our Integrated Business Applications (IBA) team. In addition to providing supervision to a group of professionals, the Team lead will also be involved in developing solutions that extend our Oracle ERP systems (EBS and Cloud applications) and meet the requirements of our business users. The successful individual requires experience in both HR supervision and Oracle solutions development. \n Your Key Responsibilities \n \n  Provide management to direct reports and support the overall team, including recruiting new hires. \n  Work with your team to address personnel or project issues as they arise. \n  Provide guidance, coaching, feedback, and support to team members. \n  Establish and support career development plans with employees. \n  Keep peers and managers informed on the status of issues. \n  Communicate risks and recommend solutions to stakeholders and management. \n  Provide consultation on the capabilities of application technology to identify opportunities to solve business problems. \n  Perform quality reviews on the team members’ deliverables. \n  Prepare time and effort estimates for assigned projects and tasks. \n  Learn and adopt design and coding standards. \n  Assist in the analysis of software specifications provided by Business Systems Analyst. \n  Assist in the design and development of software solutions as per specifications. \n  Develop and execute unit test plans to ensure quality of software being released for integration and user testing. \n  Help develop a technical transition plan ensuring a smooth transition of solutions to production. \n  Plan, document, assign and implement production transition tasks to ensure a smooth deployment into our production environment. \n  Able to work Flexible hours if required. \n \n Qualifications \n Your Capabilities and Credentials \n \n  Experience leading a software development team of 4-5 people. \n  Experience working in a team-oriented, highly collaborative environment. \n  Strong interpersonal and communication skills, both written and verbal. \n  Strong soft skills and ability to empower team members as well as motivate them to achieve organizational goals. \n  Ability to coach, guide, and provide constructive feedback to team members. \n  Experience in all aspects of software development lifecycle following best practice methodologies like the Agile practices. \n  Understanding of ITIL practices. \n  Experience working with complex enterprise applications, preferably in an ERP environment such as Oracle e-Business Suite 11i/12, Oracle Cloud Applications, or Peoplesoft. \n  Strong organizational, time management, Analytical, and problem solving/troubleshooting skills. \n  Strong knowledge in Oracle Database and PL/SQL, java, JavaScript, Oracle Application Express, Oracle JDeveloper, Forms, Workflow, BI Publisher, OAF, Web Services, Oracle Integration Cloud services. \n  Experience reading and writing to web-based APIs using JSON or XML objects. \n  Experience in software versioning and revision control systems (GIT, STAT, BitBucket). \n \n Education and Experience \n \n  Post-secondary degree in Computer Science, Information Systems, or related field, or equivalent experience. \n  A minimum of 10 years of experience in a software development role. \n  A minimum of 5 years as senior developer, technical architect or technical lead providing direction and facilitating the Agile process. \n  Prior experience in a supervisory role managing task assignment, prioritization, and delivery. \n \n Stantec is a place where the best and brightest come to build on our collective talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best! \n Pay transparency laws require employers to provide the following information for positions that may be in the following jurisdiction(s): \n Salary Range(s): \n \n  $50.05 - $79.59 Min/Max Pay Range for postings located in BC \n \n The final agreed upon compensation is based on individual education, qualifications, experience, and work location. At Stantec certain roles are bonus eligible. \n Benefits Summary: Regular full-time and part-time employees will have access to health, dental, and vision plans, a well-being program, health care spending account, wellness spending accounts, group registered retirement savings plan, employee stock purchase program, group tax-free savings account, life and accidental death & dismemberment (AD&D) insurance, short-term/long-term disability plans, emergency travel benefits, tuition reimbursement, professional membership fee coverage, and paid time off. \n Temporary/casual employees will have access to group registered retirement savings plan, employee stock purchase program, and group tax-free savings account. \n The benefits information listed above may not apply to union positions because benefits for such positions are governed by applicable collective bargaining agreements. \n Primary Location : Canada-Alberta-Edmonton \n Other Locations : Canada-Alberta-Calgary, Canada-British Columbia-Vancouver, Canada-Manitoba-Winnipeg, Canada-New Brunswick, Canada-Ontario-Toronto, Canada-Ontario-Ottawa, Canada-Ontario-Waterloo, Canada-Newfoundland and Labrador, Canada-Quebec-Montréal, Canada-Nova Scotia \n Work Locations : \n Edmonton AB \n Organization : BC-1371 Integrated Business Applications-CA Canada \n Employee Status : Regular \n Job Level : Manager \n Travel : No \n Schedule : Full-time \n Job Posting : Jan 8, 2024, 9:05:13 AM \n Req ID: 2400000E \n Stantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans"
}