{
    "id": "bab4dfa6c763c586",
    "companyDescription": "",
    "description": "Manager Lounge Services YOW\n  \n   2311673\n  \n \n \n   Primary LocationNorth America-CA-Ottawa-Ottawa International Airport (YOW)\n \n \n   ScheduleFull-time\n \n \n   Unposting DateNov 4, 2023, 10:59:00 PM\n   \n  \n \n \n   OrganizationCanada\n \n \n \n   Job Description: Duty Manager Lounge \n   If you have passion for hospitality, enjoy meeting new people and enjoy giving customers a great start to their travels in a bustling & exciting airport setting, then this is the role for you! \n   Swissport operates 50+ airport lounges across the world under the brand name of “Aspire Lounges”. \n   Our lounges are not quite cafés or restaurants but offer a haven for guests looking for a comfortable seat, complimentary food and drinks, great WiFi and above all a fantastic experience before their flight, no matter the reason for the journey. \n   Job Summary \n   Reporting to the Lounge Manager, the DM is responsible for overseeing the operation of the Executive Lounge. \n   Job Responsibilities \n  \n    Supervises the Lounge Agents Assign duties, direct staff\n   \n  \n    Ensure that the daily report is properly completed and sent to all the relevant parties\n   \n  \n    Ensure that all operations are run in line with budgets and financial KPIs and that the lounge complies with all audits and have perfect scores\n   \n  \n    Coach and train staff members, maintain performance management records while working in accordance with applicable collective bargaining agreement\n   \n  \n    Ensure compliance with Transport Canada, airline customers, and Company rules and regulations, Liaison with airline customers and airport authorities\n   \n  \n    Always ensure a prompt and high standard of guest service to the travelers and respond to customer issues with corrective and preventive action\n   \n  \n    Enforce and monitor Company's Health & Safety policies and procedures\n   \n  \n    Promote employees’ assiduity and maintains good work relations\n  \n   \n   \n   Qualifications and Competencies \n  \n    High School diploma or equivalent\n   \n  \n    Passionate about customer service with positive attitude and self-motivated\n   \n  \n    A proven leader with the ability for problem solving and people management skills\n   \n  \n    High sense of responsibility and attention to detail. Planning and organizing skills\n   \n  \n    Excellent communication skills (written and verbal) in country specific language\n   \n  \n    Additional languages desirable (French is an asset)\n   \n  \n    Commitment to continuous improvement\n   \n  \n    Computer literate (Office Word, Excel, Powerpoint)\n   \n  \n    Flexible to work on various shifts (days, evening, nights, weekends, and holidays)\n  \n   \n   \n   \n   What We Offer:\n   \n  \n    Extended health, dental and vision package for full-time employees.\n   \n  \n    4% of vacation pay is included in your monthly payroll.\n   \n  \n    Comprehensive paid training.\n   \n  \n    Free airport parking is provided for full-time employees.\n   \n  \n    Possibility of advancement – we encourage internal career development.\n  \n   \n   \n  \n    Equal Employment Opportunity Statement\n   \n  \n    Swissport as an equal opportunity employer bases its hiring decisions on the business need and the best qualified candidates available and does not discriminate in its employment decisions based on any protected category. Candidates who are offered employment may be subject to a criminal record and other background checks as permitted or required by company policy or applicable law.\n   \n   \n    About us\n   \n  \n    In 2021, Swissport International AG provided best-in-class airport ground services for some 97 million airline passengers (pre-COVID 2019: 265 million) and handled roughly 5.1 million tons of air freight (2019: 4.6 million) at over 120 air cargo centers worldwide. Several of its warehouses have been certified for pharmaceutical logistics by IATA’s CEIV Pharma and by the British MHRA. The world's leader in airport ground services and air cargo handling, with currently around 48,000 employees, was active at 287 airports in 45 countries on six continents as of 14 July 2022.\n  \n \n \n \n  \n    Résumé du poste : Assistant Gérant - service au salon\n   \n  \n    Si vous êtes passionné(e) par l'hospitalité, que vous aimez rencontrer de nouvelles personnes et que vous aimez donner aux clients un bon départ dans leur voyage dans un aéroport animé et passionnant, alors ce poste est fait pour vous !\n   \n  \n    Swissport gère plus de 50 salons d'aéroport à travers le monde sous la marque \"Aspire Lounges\".\n   \n  \n    Nos salons ne sont pas tout à fait des cafés ou des restaurants, mais ils offrent un havre de paix aux clients qui recherchent un siège confortable, de la nourriture et des boissons gratuites, une excellente connexion WiFi et surtout une expérience fantastique avant leur vol, quelle que soit la raison de leur voyage.\n   \n   \n   Résumé du poste\n   \n  \n    Sous la responsabilité du Lounge Manager, le DM est chargé de superviser le fonctionnement du salon exécutif.\n   \n   \n   Responsabilités du poste\n   \n  \n    Supervise les agents du salon. Assigne les tâches et dirige le personnel.\n   \n  \n    S'assurer que le rapport quotidien est correctement rempli et envoyé à toutes les parties concernées.\n   \n  \n    Veiller à ce que toutes les opérations soient menées conformément aux budgets et aux indicateurs clés de performance financière et que le salon soit conforme à tous les audits et obtienne des résultats parfaits.\n   \n  \n    Encadrer et former les membres du personnel, tenir des dossiers de gestion des performances tout en travaillant conformément à la convention collective applicable.\n   \n  \n    Assurer la conformité avec les règles et règlements de Transports Canada, des compagnies aériennes clientes et de l'entreprise, et assurer la liaison avec les compagnies aériennes clientes et les autorités aéroportuaires.\n   \n  \n    Assurer en permanence un service rapide et de qualité aux voyageurs et répondre aux problèmes des clients par des mesures correctives et préventives.\n   \n  \n    Appliquer et contrôler les politiques et procédures de santé et de sécurité de la compagnie.\n   \n  \n    Promouvoir l'assiduité des employés et maintenir de bonnes relations de travail.\n  \n   \n   \n  \n    Qualifications et compétences\n   \n  \n    Diplôme d'études secondaires ou équivalent\n   \n  \n    Passionné par le service à la clientèle, avec une attitude positive et motivé.\n   \n  \n    Leader reconnu, capable de résoudre des problèmes et de gérer des personnes.\n   \n  \n    Sens élevé des responsabilités et souci du détail. Compétences en matière de planification et d'organisation\n   \n  \n    Excellentes aptitudes à la communication (écrite et verbale) dans la langue du pays.\n   \n  \n    Autres langues souhaitables (le français est un atout).\n   \n  \n    Engagement envers l'amélioration continue\n   \n  \n    Connaissance de l'informatique (Office Word, Excel, Powerpoint)\n   \n  \n    Flexibilité pour travailler sur différents quarts de travail (jours, soirs, nuits, week-ends et jours fériés).\n   \n  \n    Ce que nous offrons :\n   \n  \n    Un régime d'assurance-maladie, de soins dentaires et de soins de la vue complémentaire pour les employés à temps plein.\n   \n  \n    4 % de la paie de vacances est incluse dans votre paie mensuelle.\n   \n  \n    Une formation complète et rémunérée.\n   \n  \n    Un stationnement gratuit à l'aéroport est offert aux employés à temps plein.\n   \n  \n    Possibilité d'avancement - nous encourageons le développement de carrière interne.\n  \n   \n   \n   Déclaration sur l'égalité en matière d'emploi \n   Swissport, en tant qu'employeur offrant l'égalité des chances, fonde ses décisions d'embauche sur les besoins de l'entreprise et sur les candidats les plus qualifiés disponibles et ne fait pas de discrimination dans ses décisions d'embauche sur la base de toute catégorie protégée. Les candidats qui se voient offrir un emploi peuvent faire l'objet d'une vérification du casier judiciaire et d'autres vérifications des antécédents, comme le permet ou l'exige la politique de la société. \n   A propos de nous \n   En 2021, Swissport International AG a fourni des services aéroportuaires au sol de premier ordre à quelque 97 millions de passagers aériens (préCOVID 2019 : 265 millions) et a traité environ 5,1 millions de tonnes de fret aérien (2019 : 4,6 millions) dans plus de 120 centres de fret aérien dans le monde. Plusieurs de ses entrepôts ont été certifiés pour la logistique pharmaceutique par le CEIV Pharma de l'IATA et par la MHRA britannique. Le leader mondial des services au sol dans les aéroports et de la manutention du fret aérien, qui compte actuellement environ 48 000 employés, était actif dans 287 aéroports de 45 pays sur six continents au 14 juillet 2022.",
    "preprocessed_description": "Manager Lounge Services YOW 2311673 Primary LocationNorth America-CA-Ottawa-Ottawa International Airport (YOW) ScheduleFull-time Unposting DateNov 4, 2023, 10:59:00 Project Manager OrganizationCanada Job Description: Duty Manager Lounge If you have passion for hospitality, enjoy meeting new people and enjoy giving customers a great start to their travels in a bustling & exciting airport setting, then this is the role for you! Swissport operates 50+ airport lounges across the world under the brand name of \"Aspire Lounges\". Our lounges are not quite cafés or restaurants but offer a haven for guests looking for a comfortable seat, complimentary food and drinks, great WiFi and above all a fantastic experience before their flight, no matter the reason for the journey. Job Summary Reporting to the Lounge Manager, the DM is responsible for overseeing the operation of the Executive Lounge. Job Responsibilities Supervises the Lounge Agents Assign duties, direct staff Ensure that the daily report is properly completed and sent to all the relevant parties Ensure that all operations are run in line with budgets and financial KPIs and that the lounge complies with all audits and have perfect scores Coach and train staff members, maintain performance management records while working in accordance with applicable collective bargaining agreement Ensure compliance with Transport Canada, airline customers, and Company rules and regulations, Liaison with airline customers and airport authorities Always ensure a prompt and high standard of guest service to the travelers and respond to customer issues with corrective and preventive action Enforce and monitor Company's Health & Safety policies and procedures Promote employees' assiduity and maintains good work relations Qualifications and Competencies High School diploma or equivalent Passionate about customer service with positive attitude and self-motivated A proven leader with the ability for problem solving and people management skills High sense of responsibility and attention to detail. Planning and organizing skills Excellent communication skills (written and verbal) in country specific language Additional languages desirable (French is an asset) Commitment to continuous improvement Computer literate (Office Word, Excel, Powerpoint) Flexible to work on various shifts (days, evening, nights, weekends, and holidays) What We Offer: Extended health, dental and vision package for full-time employees. 4% of vacation pay is included in your monthly payroll. Comprehensive paid training. Free airport parking is provided for full-time employees. Possibility of advancement – we encourage internal career development. Equal Employment Opportunity Statement Swissport as an equal opportunity employer bases its hiring decisions on the business need and the best qualified candidates available and does not discriminate in its employment decisions based on any protected category. Candidates who are offered employment may be subject to a criminal record and other background checks as permitted or required by company policy or applicable law. About us In 2021, Swissport International AG provided best-in-class airport ground services for some 97 million airline passengers (pre-COVID 2019: 265 million) and handled roughly 5.1 million tons of air freight (2019: 4.6 million) at over 120 air cargo centers worldwide. Several of its warehouses have been certified for pharmaceutical logistics by IATA's CEIV Pharma and by the British MHRA. The world's leader in airport ground services and air cargo handling, with currently around 48,000 employees, was active at 287 airports in 45 countries on six continents as of 14 July 2022. Résumé du poste : Assistant Gérant - service au salon Si vous êtes passionné(e) par l'hospitalité, que vous aimez rencontrer de nouvelles personnes et que vous aimez donner aux clients un bon départ dans leur voyage dans un aéroport animé et passionnant, alors ce poste est fait pour vous ! Swissport gère plus de 50 salons d'aéroport à travers le monde sous la marque \"Aspire Lounges\". Nos salons ne sont pas tout à fait des cafés ou des restaurants, mais ils offrent un havre de paix aux clients qui recherchent un siège confortable, de la nourriture et des boissons gratuites, une excellente connexion WiFi et surtout une expérience fantastique avant leur vol, quelle que soit la raison de leur voyage. Résumé du poste Sous la responsabilité du Lounge Manager, le DM est chargé de superviser le fonctionnement du salon exécutif. Responsabilités du poste Supervise les agents du salon. Assigne les tâches et dirige le personnel. S'assurer que le rapport quotidien est correctement rempli et envoyé à toutes les parties concernées. Veiller à ce que toutes les opérations soient menées conformément aux budgets et aux indicateurs clés de performance financière et que le salon soit conforme à tous les audits et obtienne des résultats parfaits. Encadrer et former les membres du personnel, tenir des dossiers de gestion des performances tout en travaillant conformément à la convention collective applicable. Assurer la conformité avec les règles et règlements de Transports Canada, des compagnies aériennes clientes et de l'entreprise, et assurer la liaison avec les compagnies aériennes clientes et les autorités aéroportuaires. Assurer en permanence un service rapide et de qualité aux voyageurs et répondre aux problèmes des clients par des mesures correctives et préventives. Appliquer et contrôler les politiques et procédures de santé et de sécurité de la compagnie. Promouvoir l'assiduité des employés et maintenir de bonnes relations de travail. Qualifications et compétences Diplôme d'études secondaires ou équivalent Passionné par le service à la clientèle, avec une attitude positive et motivé. Leader reconnu, capable de résoudre des problèmes et de gérer des personnes. Sens élevé des responsabilités et souci du détail. Compétences en matière de planification et d'organisation Excellentes aptitudes à la communication (écrite et verbale) dans la langue du pays. Autres langues souhaitables (le français est un atout). Engagement envers l'amélioration continue Connaissance de l'informatique (Office Word, Excel, Powerpoint) Flexibilité pour travailler sur différents quarts de travail (jours, soirs, nuits, week-ends et jours fériés). Ce que nous offrons : Un régime d'assurance-maladie, de soins dentaires et de soins de la vue complémentaire pour les employés à temps plein. 4 % de la paie de vacances est incluse dans votre paie mensuelle. Une formation complète et rémunérée. Un stationnement gratuit à l'aéroport est offert aux employés à temps plein. Possibilité d'avancement - nous encourageons le développement de carrière interne. Déclaration sur l'égalité en matière d'emploi Swissport, en tant qu'employeur offrant l'égalité des chances, fonde ses décisions d'embauche sur les besoins de l'entreprise et sur les candidats les plus qualifiés disponibles et ne fait pas de discrimination dans ses décisions d'embauche sur la base de toute catégorie protégée. Les candidats qui se voient offrir un emploi peuvent faire l'objet d'une vérification du casier judiciaire et d'autres vérifications des antécédents, comme le permet ou l'exige la politique de la société. A propos de nous En 2021, Swissport International AG a fourni des services aéroportuaires au sol de premier ordre à quelque 97 millions de passagers aériens (préCOVID 2019 : 265 millions) et a traité environ 5,1 millions de tonnes de fret aérien (2019 : 4,6 millions) dans plus de 120 centres de fret aérien dans le monde. Plusieurs de ses entrepôts ont été certifiés pour la logistique pharmaceutique par le CEIV Pharma de l'IATA et par la MHRA britannique. Le leader mondial des services au sol dans les aéroports et de la manutention du fret aérien, qui compte actuellement environ 48 000 employés, était actif dans 287 aéroports de 45 pays sur six continents au 14 juillet 2022.",
    "processed_description": "Manager YOW Manager OrganizationCanada Description passion hospitality enjoy meet people enjoy customer great start travel bustling exciting airport setting role swissport operate + airport lounge brand . lounge cafe restaurant offer haven guest comfortable seat complimentary food drink great wifi fantastic flight matter reason journey . summary report Lounge Manager responsible oversee operation . Responsibilities supervise Lounge Agents assign duty direct staff ensure daily report properly complete send relevant party ensure operation budget financial kpi lounge comply audits perfect score Coach train staff maintain performance management record applicable collective bargaining agreement ensure compliance airline customer company rule regulation airline customer airport authority ensure prompt high standard guest service traveler respond customer issue monitor Company's Health Safety policy procedure promote employee' assiduity maintain diploma equivalent Passionate customer service positive attitude motivate prove leader problem solving people management skill high sense responsibility attention detail . planning organizing skill excellent communication skill write verbal country specific language additional language desirable asset commitment continuous improvement Computer literate Office Word Powerpoint flexible shift night weekend holiday offer extended health dental vision package employee . vacation pay include monthly payroll . Comprehensive pay training . free airport parking provide employee . possibility advancement – encourage internal career development . Equal Employment Statement Swissport equal employer base hire decision business good qualified discriminate employment decision base protect category . offer employment subject criminal record background check permit require company policy applicable law . provide class airport ground service airline passenger handle roughly ton air freight air cargo center worldwide . warehouse certify pharmaceutical logistic . world's leader airport ground service air cargo handling currently employee active airport country continent . Assistant Gerant service au salon Si vous etes passionne par l'hospitalite vous aimez rencontrer nouvelles personnes vous aimez donner aux clients dans Swissport gere salon . salon ne sont pas tout fait des cafes des restaurant mais il offrent clients recherchent confortable nourriture des boissons gratuites excellente connexion WiFi surtout une fantastique avant leur soit raison leur voyage . Resume du poste Sous responsabilite du Lounge Manager DM est charge superviser fonctionnement du salon executif . Supervise les agent du salon . Assigne les tache dirige personnel . s'assurer rapport quotidien est correctement rempli envoye toute les party concernees . Veiller ce toutes les operation soient menees conformement aux budgets aux indicateurs cles performance financiere salon soit conforme tous les audits . tenir des dossiers gestion des performance tout travaillant conformement collective applicable . conformite reglements Transports des compagnie aeriennes clientes l'entreprise compagnie aeriennes clientes . permanence service rapide qualite aux voyageurs clients par des mesures corrective preventives . . maintenir bonnes relation travail . clientele attitude positive motive . leader reconnu capable resoudre des problemes gerer des personne . . competence matiere planification d'organisation Excellentes aptitude communication ecrite verbale langue du pay . Autres langues souhaitables francais est atout . engagement enver l'amelioration continue Office Word Powerpoint Flexibilite pour travailler sur quart travail jour soir nuit week jours ferie . Ce nous offron regime d'assurance maladie soins dentaires soins vue complementaire pour les employes temps plein . mensuelle . Une formation complete remuneree . stationnement gratuit l'aeroport est offert aux employes temps plein . Possibilite d'avancement nous encourageon developpement carriere interne . declaration sur l'egalite matiere dthemploi Swissport tant quthemployeur offrant l'egalite des chance fonde ses decision dthembauche sur les besoins l'entreprise sur les candidats les qualifies disponible ne fait pas discrimination dans toute categorie protegee . voient offrir emploi peuvent faire l'objet d'une verification du casier judiciaire d'autres verification . propos fourni des services aeroportuaires au sol premier ordre quelque passager aeriens preCOVID traite environ tonnes fret aerien dans centre fret aerien dans monde . MHRA britannique . leader mondial fret aerien actuellement environ employe dans aeroport pay sur continent au .",
    "results_group": {
        "extracted_noun_chunks": [
            "budgets aux indicateurs",
            "Ce nous offron regime d'assurance maladie soins dentaires soins vue complementaire",
            "du poste Sous responsabilite du Lounge Manager DM est charge superviser fonctionnement du salon executif",
            "positive motive",
            "customer issue monitor",
            "leader reconnu",
            "employment subject criminal record background check permit",
            "quelque passager",
            "ses decision",
            "dthemploi Swissport tant quthemployeur offrant l'egalite des chance",
            "clientele",
            "disponible ne fait pas discrimination",
            "leader mondial fret aerien actuellement environ employe",
            "great wifi fantastic flight matter reason journey",
            "tenir des dossiers gestion des performance",
            "internal career development",
            "aeroport pay sur continent au",
            "planning organizing skill excellent communication skill",
            "customer",
            "MHRA britannique",
            "management skill high sense responsibility attention detail",
            "perfect score Coach train staff",
            "Assigne les tache dirige personnel",
            "monde",
            "toute categorie protegee",
            "remuneree",
            "hire decision business good qualified discriminate employment decision base protect category",
            "Lounge Agents",
            "Possibilite d'avancement nous encourageon developpement carriere interne",
            "s'assurer rapport quotidien est correctement rempli envoye toute les party concernees",
            "performance management record applicable collective bargaining agreement",
            "fantastique avant leur soit raison leur voyage",
            "matiere planification d'organisation Excellentes",
            "Manager YOW Manager OrganizationCanada Description passion hospitality",
            "centre fret aerien",
            "duty direct staff",
            "health dental vision package employee",
            "brand",
            "capable resoudre des problemes gerer des personne",
            "class airport ground service airline passenger",
            "Autres langues souhaitables francais est atout",
            "prompt high standard guest service traveler",
            "world's leader airport ground service air cargo handling",
            "lounge cafe restaurant offer haven guest comfortable seat complimentary food",
            "les agent du salon",
            "conformite reglements Transports des compagnie aeriennes clientes l'entreprise compagnie",
            "Veiller ce toutes les operation soient menees",
            "Equal Employment Statement Swissport",
            "maintenir bonnes relation travail",
            "daily report",
            "salon Si vous",
            "monthly payroll",
            "compliance airline customer company",
            "summary report Lounge Manager",
            "sur l'egalite matiere",
            "Une formation",
            "diploma equivalent Passionate customer service positive attitude",
            "Company's Health Safety policy procedure",
            "roughly ton air freight air cargo center",
            "people",
            "stationnement gratuit l'aeroport est offert aux employes temps",
            "employee",
            "employer base",
            "operation",
            "possibility advancement",
            "declaration",
            "company policy applicable law",
            "aeriennes clientes",
            "les employes temps",
            "employee' assiduity",
            "Responsibilities",
            "par des mesures corrective preventives",
            "Assistant Gerant service",
            "Word Powerpoint Flexibilite",
            "relevant party",
            "operation budget financial kpi lounge comply audits",
            "passionne par l'hospitalite vous",
            "leader problem",
            "warehouse",
            "permanence service rapide qualite aux voyageurs clients",
            "Comprehensive pay training",
            "Swissport gere salon",
            "verification",
            "recherchent",
            "free airport parking",
            "vacation pay",
            "cles performance financiere salon soit",
            "great start travel bustling exciting airport setting role swissport",
            "pharmaceutical logistic",
            "dthembauche sur les besoins l'entreprise sur les candidats",
            "tous les audits",
            "aimez rencontrer nouvelles personnes vous aimez donner"
        ],
        "combined_lemmatized_tokens": "Manager YOW Manager OrganizationCanada Description passion hospitality enjoy meet people enjoy customer great start travel bustling exciting airport setting role swissport operate + airport lounge brand . lounge cafe restaurant offer haven guest comfortable seat complimentary food drink great wifi fantastic flight matter reason journey . summary report Lounge Manager responsible oversee operation . Responsibilities supervise Lounge Agents assign duty direct staff ensure daily report properly complete send relevant party ensure operation budget financial kpi lounge comply audits perfect score Coach train staff maintain performance management record applicable collective bargaining agreement ensure compliance airline customer company rule regulation airline customer airport authority ensure prompt high standard guest service traveler respond customer issue monitor Company's Health Safety policy procedure promote employee' assiduity maintain diploma equivalent Passionate customer service positive attitude motivate prove leader problem solving people management skill high sense responsibility attention detail . planning organizing skill excellent communication skill write verbal country specific language additional language desirable asset commitment continuous improvement Computer literate Office Word Powerpoint flexible shift night weekend holiday offer extended health dental vision package employee . vacation pay include monthly payroll . Comprehensive pay training . free airport parking provide employee . possibility advancement – encourage internal career development . Equal Employment Statement Swissport equal employer base hire decision business good qualified discriminate employment decision base protect category . offer employment subject criminal record background check permit require company policy applicable law . provide class airport ground service airline passenger handle roughly ton air freight air cargo center worldwide . warehouse certify pharmaceutical logistic . world's leader airport ground service air cargo handling currently employee active airport country continent . Assistant Gerant service au salon Si vous etes passionne par l'hospitalite vous aimez rencontrer nouvelles personnes vous aimez donner aux clients dans Swissport gere salon . salon ne sont pas tout fait des cafes des restaurant mais il offrent clients recherchent confortable nourriture des boissons gratuites excellente connexion WiFi surtout une fantastique avant leur soit raison leur voyage . Resume du poste Sous responsabilite du Lounge Manager DM est charge superviser fonctionnement du salon executif . Supervise les agent du salon . Assigne les tache dirige personnel . s'assurer rapport quotidien est correctement rempli envoye toute les party concernees . Veiller ce toutes les operation soient menees conformement aux budgets aux indicateurs cles performance financiere salon soit conforme tous les audits . tenir des dossiers gestion des performance tout travaillant conformement collective applicable . conformite reglements Transports des compagnie aeriennes clientes l'entreprise compagnie aeriennes clientes . permanence service rapide qualite aux voyageurs clients par des mesures corrective preventives . . maintenir bonnes relation travail . clientele attitude positive motive . leader reconnu capable resoudre des problemes gerer des personne . . competence matiere planification d'organisation Excellentes aptitude communication ecrite verbale langue du pay . Autres langues souhaitables francais est atout . engagement enver l'amelioration continue Office Word Powerpoint Flexibilite pour travailler sur quart travail jour soir nuit week jours ferie . Ce nous offron regime d'assurance maladie soins dentaires soins vue complementaire pour les employes temps plein . mensuelle . Une formation complete remuneree . stationnement gratuit l'aeroport est offert aux employes temps plein . Possibilite d'avancement nous encourageon developpement carriere interne . declaration sur l'egalite matiere dthemploi Swissport tant quthemployeur offrant l'egalite des chance fonde ses decision dthembauche sur les besoins l'entreprise sur les candidats les qualifies disponible ne fait pas discrimination dans toute categorie protegee . voient offrir emploi peuvent faire l'objet d'une verification du casier judiciaire d'autres verification . propos fourni des services aeroportuaires au sol premier ordre quelque passager aeriens preCOVID traite environ tonnes fret aerien dans centre fret aerien dans monde . MHRA britannique . leader mondial fret aerien actuellement environ employe dans aeroport pay sur continent au ."
    }
}