{
    "id": "9322b42abb5d41bf",
    "company": "Specsavers",
    "positionName": "Optician / Retail Partner Ownership Opportunity",
    "jobType": [
        "Permanent"
    ],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-25T12:17:57.281Z",
    "url": "https://www.indeed.ca/rc/clk?jk=9322b42abb5d41bf&from=jasx&tk=1hl5djsk1h7hv800&bb=xjPBkK6OIlrxY1Te1w3p5Zw7isczHoLcP2PuqNhrbdoa1lC5KSF9qKpLI0HbAx6F6N_0E3E_292KyjjDxo13g15NZuuR4V_qysje_1yPuh2mv6PChtwvXg%3D%3D&xkcb=SoCa67M3FlTATHzAAx0JbzkdCdPP&vjs=3",
    "externalApplyLink": "https://careers.specsavers.com/specsavers/job/Ottawa-Optician-Retail-Partner-Ownership-Opportunity-Ottawa-South%2C-ON-ON-K2B-8C1/1028727701/?feedId=356901&utm_source=Indeed&utm_campaign=SpecSavers_Indeed&sType=Indeed",
    "job_info_group": {
        "extracted_phone_numbers": [
            " (437) 214 1062",
            "(437) 214 1062"
        ],
        "extracted_links": [
            "HTTP/HTTPS Links",
            "General Links",
            "WWW Links",
            "TLDs"
        ],
        "extracted_emails": [
            "elizabeth.hill1@specsavers.com"
        ],
        "extracted_location_data": [
            "Canada",
            "Ottawa"
        ],
        "extracted_dates": [
            "over 35 years",
            "two years"
        ],
        "extracted_languages": [],
        "extracted_laws": [],
        "extracted_norps": [],
        "extracted_orgs": [
            "leading equipment Professional Development and Support",
            "Specsavers",
            "Clinical Excellence",
            "ON – Ottawa South Specsavers",
            "Product Excellence",
            "Connect"
        ],
        "extracted_persons": [
            "Elizabeth Hill"
        ],
        "extracted_products": [],
        "extracted_money": [],
        "processed_text": "location world's large privately optical retailer serve patient country . transform eye health career partner network . globally renowned partnership model centre empower independence optometrist optician adapt local prioritize patient care choose ownership . community eye health priority oct scan standard pre testing . integrate supply chain customer offer thorough testing wide selection quality frame lense . grow open store recognize license optician dedicated retail expert floor store – expertise . start optical store confidential chat contact true partnership ownership environment business support succeed late clinical technology rigorous testing extensive quality assurance process develop lense support customer patient range quality product offer provide leadership ensure patient good accessible quality eyecare coach motivate team stand embrace unique Specsavers Customer model prioritize drive long term customer relationship Opticians support empower practice scope qualification encourage career growth peer outstanding clinical professional development world's large network optometrist optician share idea clinical initiative discuss meaningful ownership topic benefit owner flexibility steer career independent clinic support resource ongoing commitment provide advanced technology training prepare team set benchmark patient care grow loyal customer base earn patient trust Specsavers customer journey exam selection frame lense tier portfolio impact community eyecare ladder collective impact global eye health agenda world's large network optometrist optician unique receive share profit optical store benefit guarantee salary company care community eye health professional field – vision elevate role optician opticianry core business model optometry people people . demonstrate history create exceptional customer previous retail management optic position – bonus license register optician contact lens practitioner . excited start business passionate advance eyecare develop team commit exceptional customer care . multiple location forward discuss retail partnership . help change live sight apply directly learn partnership process contact conversation start"
    },
    "companyDescription": "We’ve been a family-run business for over 35 years, working together with our partners to provide the best value optometry, audiology and other healthcare service for our customers both instore and supporting local communities at home. You’ll find us in the UK, Ireland, Netherlands, Norway, Sweden, Denmark, Finland, Spain, Canada, Australia and New Zealand employing over 35,000 people who work across our stores, support offices and supply chain function.\r\n\r\nOur purpose to change lives through better sight and hearing is ambitious to say the least. That’s why we are always on the lookout for new talent. We’ve always been passionate about eye health, but now we want to take this to the next level.\r\n\r\nWhat’s it like to work for us?\r\n\r\nOur people ambition this year is to be the place we are all proud to belong. We want to ensure all our colleagues are listened to and feel included, valued, and motivated and we’ve set ourselves some big targets to help us get there. To help start us on this journey networks and communities are being established by our colleagues across Specsavers. These voluntary groups bring together colleagues with shared characteristics and common interests, so far, we have PRISM which represents our LBGTQ+ community, MenoTalk to help support and drive our menopause in the workplace agenda and Empowered Together, our women's network that is in place to rally for women's equality in and out of work and help instil confidence in women.\r\n\r\nJoining our team means joining an ambitious yet down to earth group of people who thrive at a high pace. We work hard but it’s rewarded in many ways. We offer competitive salaries and an excellent bonus plan as well as private healthcare, dental care and life assurance to all our colleagues. With us, you can look forward to working in an exciting environment where you’ll be encouraged to unearth new skills, abilities, and opportunities, and push yourself like never before. It’s a career where you can truly make a difference.\r\n\r\nThe type of jobs we recruit for?\r\n\r\nWhatever stage you’re at in your career, we offer an attractive path. We’ve got opportunities going all the way to Canada and we’ll help you find a role, location and area of our business where you can truly excel.\r\n\r\nOur roles range from: clinical experts – optometrists to audiologists, becoming a partner and running your own business, being part of our store team as an optical assistant or retail role, working in our support office functions which could include marketing, finance, HR or technology and many more, working at one of our supply chain sites and we also offer a range of apprenticeship opportunities. \r\n\r\nWhatever you’re looking for, Specsavers will have you covered.\r\n\r\nSee a full range of our opportunities here: join.specsavers.com/uk",
    "description": "Location: Ottawa, ON – Ottawa South\n  \n  \n  Specsavers is the world’s largest, privately owned optical retailer serving 41 million patients in 11 countries. We have been transforming eye health and careers for over 35 years and are proud to have over 4,700 partners in our network. Our globally renowned partnership model centred on empowering the independence of optometrists and opticians, adapting to local needs, and prioritizing patient care is why so many have chosen ownership with us.\n  \n  \n  As community eye health is our top priority, we’ve made OCT scans a standard part of pre-testing. Not only that, but we have an integrated supply chain to put customers first by offering thorough testing on our wide selection of quality frames and lenses. And as we grow to open 200 stores across Canada in two years, we recognize the importance of having both licensed opticians and dedicated retail experts on the floor at each of our stores at all times – that’s why we need your expertise.\n  \n  \n  Start your own optical store \n  For a confidential chat about this opportunity, contact Elizabeth Hill on M: (437) 214 1062 or E: elizabeth.hill1@specsavers.com\n  \n  \n  A true partnership: \n  \n  Ownership: Experience an environment where you have the business support to succeed \n  Product Excellence: We use the latest clinical technology, rigorous testing, and extensive quality assurance processes to develop our lenses so that you can support your customers and patients with a full range of top-quality products that you’re proud to offer \n  Clinical Excellence: Provide leadership and ensure that all patients get the best accessible, quality eyecare with leading equipment \n  Professional Development and Support: Coach and motivate your team to stand out by embracing our unique Specsavers Customer Experience model, which means prioritizing driving long-term customer relationships \n  Opticians are supported and empowered to practice within the full scope of their qualification while being encouraged to further their career growth \n  Connect with Peers: Outstanding clinical and professional development opportunities with the world’s largest network of optometrists and opticians to share ideas, keep up to date on new clinical initiatives, and discuss meaningful ownership topics\n \n  \n  \n  What are the benefits of becoming an owner? \n  \n  Flexibility to steer your career and independent clinic with the support and resources of Specsavers \n  Ongoing commitment from Specsavers to provide the most advanced technology with training prepared for your team \n  An opportunity to set a benchmark for patient care and grow a loyal customer base by earning patient trust through the Specsavers customer journey, from their exam all the way through to their selection of frames and lenses from our top-tier portfolio \n  An ability to make your impact on community eyecare laddering up to collective impact on a global eye health agenda with the world’s largest network of optometrists and opticians \n  A unique opportunity to receive a 40% share of profits from your optical store while also benefiting from a guaranteed salary \n  Being part of a company that truly cares about community eye health and the professionals who work in the field – Our vision is to elevate the role of opticians by putting opticianry at the core of our business model, along with optometry\n \n  \n  \n  What we are looking for \n  \n  We’re people people, and you are too. \n  You have a demonstrated history of creating exceptional customer experiences in your previous retail management or optics position – a bonus if you’re a licensed/registered optician or contact lens practitioner. \n  You are excited to start your own business, passionate about advancing eyecare and developing a team, and committed to exceptional customer care. \n  We have multiple locations available and look forward to discussing a retail partnership with you.\n \n  \n  \n  Help us change lives through better sight! Apply directly or learn more about the opportunity and the partnership process by contacting Elizabeth Hill to get the conversation started! M: (437) 214 1062 or E: elizabeth.hill1@specsavers.com"
}