{
    "id": "3db6b2df810bd5f1",
    "company": "Walmart",
    "positionName": "Front End Assistant Manager (Temp 6 Months Contract)",
    "jobType": [],
    "location": "450 Terminal Ave, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-17T05:13:21.188Z",
    "url": "https://www.indeed.ca/rc/clk?jk=3db6b2df810bd5f1&from=jasx&tk=1hkikipjiii32800&bb=g3LG73kDIG2DKbipZ3VbGA0M-dJCS9b0uHLL0zN3cBPF6B2KwKa4akS51CwSJWcymPX0SJFkkAfo0Wq3vNDx5VYvsIvJh1xkV1KkReGuYT4uORIYr7E8Tg%3D%3D&xkcb=SoB567M3FShE7dQ2y50HbzkdCdPP&vjs=3",
    "externalApplyLink": "https://walmart.wd5.myworkdayjobs.com/fr-CA/WalmartExternal/job/Ottawa-ON/Front-End-Assistant-Manager--Temp-6-Months-Contract-_R-1764126?codes=1-INDEED",
    "companyDescription": "",
    "description": "Résumé des fonctions... Soutenir le gérant de succursale et gérer les activités de la succursale conformément aux directives de la Compagnie et diriger les associés afin d’assurer un service aimable, utile et de générer des ventes rentables pour la succursale \n \n Ce que vous ferez... \n 1. As a member of the Store Management Team drives profitable sales through achievement of sales and profit goals, budget management and sales forecasts. Proactively analyzes and utilizes sales/financial reports, economic trends and community needs to identify and respond to market changes while controlling expenditures. Communicates sales results associates and guides interpretation of results \n 2. Creates, with the balance of the Management Team, operational plans; prioritizes, delegates and provides clear direction to Managers and Associates. Ensures optimal store conditions through effective merchandise presentation, accurate and competitive pricing and store standards within Company policies and guidelines. Implements new store programs according to Company direction, while evaluating effectiveness to achieve successful results specifically related to the (Front End or Back End or Fresh or Operations - specific area that the incumbent will oversee). An Assistant Manager is cross-trained to work proficiently in all areas of the Store when needed. \n 3. Executes and monitors asset protection and safety controls; maintains quality assurance standards; oversees safety and operational reviews while ensuring compliance with Walmart policies and procedures and with established safety, security, sales, financial and record keeping procedures and practices. Anticipates and proactively responds to compliance issues, including Total Loss/general controls. \n 4. Serves Customers as an ambassador for their store by greeting customers, seeking their feedback and ensuring customer needs, complaints, and issues are resolved within Company guidelines to create a positive shopping experience. As a member of management, models, enforces, and provides direction to associates on friendly and helpful customer service approaches and techniques \n 5. Supports store initiatives to serve the community by participating in and supporting community events and developing relationships with key community groups. Participates in company-sponsored programs, events, and sustainability efforts for associates and customers to emphasize the store’s role as an integral part of the community. \n 6. Leads Associates by conducting regular store meetings and communicating operational direction and initiatives with a focus on the OMNI and the Total Store. Drives engagement, recognizes and rewards accomplishments and provides opportunities for professional growth. Develops all associates and identifies high-potential associates, providing training and development to increase capability. \n 7. Demonstrates Company values by holding Associates accountable through timely, honest, specific and respectful performance feedback and corrective and disciplinary action. Builds and manages relationships with supporting functions within the store and district (e.g. District HR Managers, etc.). \n 8. Complies to all Company standards and procedures when handling all merchandise, including but not limited to: alcohol, ammunition, narcotics, and high-ticket. Ensures appropriate cash controls, handling as much as $250,000 per day. ‎ \n \n Compétences minimales... \n Indiquez ci-dessous les compétences minimales requises pour ce poste. Si aucune n’est indiquée, il n’y a pas de compétences minimales. Age - 16 or older \n \n Compétences recherchées... \n Indiquez ci-dessous les compétences recherchées facultatives pour ce poste. Si aucune n’est indiquée, il n’y a pas de compétences recherchées. \n \n Comme requis par la loi, Walmart offrira des accommodements pour les besoins des associés avec des incapacités. \n \n Emplacement Principal... 450 TERMINAL AVE, OTTAWA, ON K1G 0Z3, Canada \n \n Êtes-vous actuellement un associé de Walmart ? \n Veuillez vous connecter à votre compte Workday et utiliser le rapport Trouver des emplois pour postuler à cet emploi. \n \n  Trouver des emplois"
}