{
    "id": "aca01d3fa0e3e9af",
    "companyDescription": null,
    "description": "Posting Date: Jan 23, 2024, 3:27:57 PM\n \n \n   Primary Location: Ontario-Ottawa\n \n \n   Job Type: Permanent\n \n \n   Schedule: Full-time\n \n \n \n   Export Development Canada (EDC) is a financial Crown corporation dedicated to helping Canadian businesses make an impact at home and abroad. EDC offers financial products and knowledge to help Canadian businesses confidently enter new markets, reduce financial risk, and grow their business. \n  When you join our team, you’ll be helping Canadian businesses learn the endless possibilities that open to them through export and help bring their vision, passion, and innovation to the world. Your knowledge and expertise will support more than 25,000 Canadian businesses and their customers in as many as 200 markets worldwide. You’ll work amongst the best and brightest in an inclusive, collaborative environment that fosters professional development and success. And you’ll know that you’re making an impact every day – for businesses, for Canada and for the people you work with. \n   Are you ready to make an impact? Join EDC, recognized as a Top 100 and Top Family-Friendly Employer, as we take on the risk so Canadian businesses can take on the world. #LI-Hybrid \n   Team & Job Overview \n   This new role of Vice President, Risk Quantification and Enterprise Risk is a prominent position with significant responsibility and a high degree of exposure to senior leaders across the organization up to the Board of Directors. Reporting to the Senior Vice President & Chief Risk and Sustainability Officer, the Vice President will lead the capital management, stress testing, climate scenario analysis, credit market liquidity and insurance risk model development, and enterprise risk management functions within the Global Risk & Sustainability Group. Responsibility will include evolving the risk maturity of these functions and being a delegate for the Chief Risk and Sustainability Officer. \n  The Vice President is responsible for setting the vision and strategic plan for the team, and delivering on the strategy, using exceptional leadership skills, a network of internal and external stakeholders, as well as strong technical and business experience. This role requires excellent communication and interpersonal skills to engage and consult with business areas and define risk practices and solutions adapted to EDC’s size, complexity and specific mandate. \n  Success will be linked to the ability to lead effectively, think critically, solve problems, and balance the management of risks with creating business opportunities in line with EDC’s strategy. \n   Most of the team members are located in Ottawa and therefore relocation to Ottawa is preferred but not essential. Being present with the team and peers in Ottawa periodically is essential. \n  Key Responsibilities \n   Strategy | Capital Management | Risk Models & Limits | Stress Testing | Climate Scenarios | Enterprise Risk Management | Governance \n   Strategy \n   \n   Participate in corporate business and strategy formulation, assess the underlying risks of the corporate strategy and conduct risk-based effective challenge of strategic objectives. \n   Develop and maintain the Risk Appetite framework including the development of Risk Appetite metrics, measurement, monitoring and reporting. \n   Stay abreast of emerging risks and trends within geographies and industries of business interest and ensure EDC’s strategy is well adapted. \n   \n  Capital Management \n   \n   Responsible for the management and operations of EDC’s economic capital framework (Internal Capital Adequacy Assessment Process) and dividend policy, and ownership of related policies, guidelines and standards. \n   Lead the internal capital target setting process and internal capital adequacy assessment process (ICAAP) as well as the development and management of capital management and dividend policies, standards/guidelines and standards. \n   Develop and oversee risk-based performance management and pricing methodologies. \n   Work closely with the lines of business to develop capital-based tools or allocations to enhance business decision making at the transaction and portfolio level. \n   \n  Models and Limits - Credit, Market, Liquidity & Insurance Risks \n   \n   Owner for credit, market, liquidity and insurance risk models. \n   Oversee market and liquidity risks, including monitoring and reporting on EDC’s exposures, and active participation at the Asset and Liability Committee (ALCO). \n   Lead the development, management and oversight of risk models for all products including: \n    \n     Economic capital models \n     Credit risk models including IFRS9 compliant models \n     Insurance risk models, including IFRS17 compliant models \n    \n   Advance the thinking on the quantification of operational and strategic risks, and other non-financial risks as required. \n   Work with Model Governance to ensure that a strong governance framework is in place to manage the end-to-end lifecycle for all risk models. \n   Ensure the integrity of EDC’s credit risk limits framework including quantifying risk exposure relative to limits, and updating the limits framework as required and in line with EDC’s strategy. \n   \n  Stress Testing, Climate Scenario Analysis \n  \n   Lead the annual enterprise-wide stress testing for financial and non-financial risks. \n   Lead the annual climate scenarios exercise in line with Task Force on Climate Disclosures (TCFD) and other regulatory guidance. \n   Lead the discussion on insights from the stress testing and climate scenario work to ensure that actions are pursued by the relevant accountable party (typically CRSO, CFO or COO). \n   Oversee a centralized portfolio analytics function to provide a view of portfolio risk under various scenarios to support business strategy. \n   \n  Enterprise Risk Management \n   \n   Oversee and mature the enterprise risk management function. \n   Develop and monitor enterprise risk framework, policies, standards and guidelines, reporting on and monitoring EDC’s strategic and operational risks. \n   Provide specialized advice and support actions to independently oversee, challenge and remediate risk findings from quality assurance activities. \n   Responsible for enterprise-wide risk reporting and monitoring function; \n   Actively monitor EDC’s risk profile across all risk types and business lines. \n   Continue maturing the emerging risks program. \n   \n  Governance \n   \n   Responsible for developing and monitoring risk policies, standards and guidelines related to EDC’s strategic, operational and financial risks within the risk governance framework. \n   Oversee the Risk Appetite framework, including metrics definition, measurement, monitoring and reporting and ongoing evolution to stay current with emerging risks. \n   Further develop second line functionality (oversight), ensuring clear roles and responsibilities between first and second lines, appropriate tools and reporting. \n   Support the CRSO in managing key risk committees, including the Management Risk Management Committee and the Board Risk Management Committee. \n   \n  Qualifications \n   Experience \n   \n   A minimum of 15 years of related work experience in the financial services industry including at least 10 years of leading quantitative and analytical teams \n   A deep expertise in either/all of financial, operational, and strategic risk practices from a financial services perspective and with an emphasis on quantitative analytics. \n   Proficient knowledge in the areas of controls, data, quantitative analysis and technology skills. \n   Proficient knowledge of current regulatory requirements in the financial services industry. \n   Advanced knowledge of policies, procedures, practices used in the financial services industry to ensure a well governed risk management function. \n   Experience in Enterprise Risk Management (including various models and organizational structures). \n   An understanding of ESG fundamentals and the connection with risk management. \n   Experience in interpreting trends in the financial services and regulatory environments to make practical changes to the risk function in support of the enterprise strategy. \n   \n  Leadership \n  \n   Excellent leadership skills demonstrated through providing sound guidance and coaching to other leaders, positively influencing organizational culture, and high integrity. \n   Exceptional relationship building skills, and the ability to hold others accountable without direct authority. \n   Strong oral and written communication skills and the ability to communicate complex subject matter clearly at all levels of the organization up to the Board. \n   Ability to present ideas in a clear, succinct and organized manner. \n   Ability to proactively identify creative solutions for taking on and managing risk that support the enterprise strategy and enable the business to develop differentiated value propositions \n   Technically strong with numeracy and financial awareness, yet able to see the bigger picture and not get stuck in the details. \n   A growth mindset, and the ability to build, sustain and improve enterprise risk practices. \n   \n  Education \n   \n   Undergraduate degree in actuarial science, finance, math, accounting, business or related field. \n   \n  Bilingual in both official languages. \n   Assets \n   \n   Transactional experience including assessing credit and non-credit risks. \n   Masters degree in actuarial science, finance, math, accounting, business or related field. \n   Relevant credentials: CFA, PRM, FRM, ASA/FSA, MBA. \n   \n  Salary Range: \n   \n   Salaries are based on qualifications and experience and typically range from $205,734 to $272,697 plus a STI and LTI performance-based incentive. \n   \n  \n   Location\n    \n    \n    Export Development Canada is a hybrid work environment. \n    This role may be performed from EDC’s headquarters in Ottawa or Toronto or Montreal. \n    Relocation assistance is available for eligible candidates. \n    \n   EDC's Commitment to Employment Equity \n   EDC is committed to employment equity and achieving a diverse workforce. EDC actively encourages applications from women, Aboriginal peoples, visible minorities, persons with disabilities and members of the 2SLGBTQI+ community. If selected for an interview, please advise us if you need any special accommodation. \n  \n \n \n   How to apply \n   \n   \n  Only candidates selected for an interview will be contacted.\n   \n  \n   Application deadline on www.edc.ca/careers : Feb 9, 2024, 10:59:00 PM\n   \n   If selected for an interview, please advise us if you require special accommodation.\n   \n  \n   Candidates must meet the requisite government security screening requirements.",
    "preprocessed_description": "Posting Date: Jan 23, 2024, 3:27:57 Project Manager Primary Location: Ontario-Ottawa Job Type: Permanent Schedule: Full-time Export Development Canada (EDC) is a financial Crown corporation dedicated to helping Canadian businesses make an impact at home and abroad. EDC offers financial products and knowledge to help Canadian businesses confidently enter new markets, reduce financial risk, and grow their business. When you join our team, you will be helping Canadian businesses learn the endless possibilities that open to them through export and help bring their vision, passion, and innovation to the world. Your knowledge and expertise will support more than 25,000 Canadian businesses and their customers in as many as 200 markets worldwide. You'll work amongst the best and brightest in an inclusive, collaborative environment that fosters professional development and success. And you will know that you are making an impact every day – for businesses, for Canada and for the people you work with. Are you ready to make an impact? Join EDC, recognized as a Top 100 and Top Family-Friendly Employer, as we take on the risk so Canadian businesses can take on the world. #LI-Hybrid Team & Job Overview This new role of Vice President, Risk Quantification and Enterprise Risk is a prominent position with significant responsibility and a high degree of exposure to senior leaders across the organization up to the Board of Directors. Reporting to the Senior Vice President & Chief Risk and Sustainability Officer, the Vice President will lead the capital management, stress testing, climate scenario analysis, credit market liquidity and insurance risk model development, and enterprise risk management functions within the Global Risk & Sustainability Group. Responsibility will include evolving the risk maturity of these functions and being a delegate for the Chief Risk and Sustainability Officer. The Vice President is responsible for setting the vision and strategic plan for the team, and delivering on the strategy, using exceptional leadership skills, a network of internal and external stakeholders, as well as strong technical and business experience. This role requires excellent communication and interpersonal skills to engage and consult with business areas and define risk practices and solutions adapted to EDC's size, complexity and specific mandate. Success will be linked to the ability to lead effectively, think critically, solve problems, and balance the management of risks with creating business opportunities in line with EDC's strategy. Most of the team members are located in Ottawa and therefore relocation to Ottawa is preferred but not essential. Being present with the team and peers in Ottawa periodically is essential. Key Responsibilities Strategy | Capital Management | Risk Models & Limits | Stress Testing | Climate Scenarios | Enterprise Risk Management | Governance Strategy Participate in corporate business and strategy formulation, assess the underlying risks of the corporate strategy and conduct risk-based effective challenge of strategic objectives. Develop and maintain the Risk Appetite framework including the development of Risk Appetite metrics, measurement, monitoring and reporting. Stay abreast of emerging risks and trends within geographies and industries of business interest and ensure EDC's strategy is well adapted. Capital Management Responsible for the management and operations of EDC's economic capital framework (Internal Capital Adequacy Assessment Process) and dividend policy, and ownership of related policies, guidelines and standards. Lead the internal capital target setting process and internal capital adequacy assessment process (ICAAP) as well as the development and management of capital management and dividend policies, standards/guidelines and standards. Develop and oversee risk-based performance management and pricing methodologies. Work closely with the lines of business to develop capital-based tools or allocations to enhance business decision making at the transaction and portfolio level. Models and Limits - Credit, Market, Liquidity & Insurance Risks Owner for credit, market, liquidity and insurance risk models. Oversee market and liquidity risks, including monitoring and reporting on EDC's exposures, and active participation at the Asset and Liability Committee (ALCO). Lead the development, management and oversight of risk models for all products including: Economic capital models Credit risk models including IFRS9 compliant models Insurance risk models, including IFRS17 compliant models Advance the thinking on the quantification of operational and strategic risks, and other non-financial risks as required. Work with Model Governance to ensure that a strong governance framework is in place to manage the end-to-end lifecycle for all risk models. Ensure the integrity of EDC's credit risk limits framework including quantifying risk exposure relative to limits, and updating the limits framework as required and in line with EDC's strategy. Stress Testing, Climate Scenario Analysis Lead the annual enterprise-wide stress testing for financial and non-financial risks. Lead the annual climate scenarios exercise in line with Task Force on Climate Disclosures (TCFD) and other regulatory guidance. Lead the discussion on insights from the stress testing and climate scenario work to ensure that actions are pursued by the relevant accountable party (typically CRSO, Chief Financial Officer or Chief Operating Officer). Oversee a centralized portfolio analytics function to provide a view of portfolio risk under various scenarios to support business strategy. Enterprise Risk Management Oversee and mature the enterprise risk management function. Develop and monitor enterprise risk framework, policies, standards and guidelines, reporting on and monitoring EDC's strategic and operational risks. Provide specialized advice and support actions to independently oversee, challenge and remediate risk findings from quality assurance activities. Responsible for enterprise-wide risk reporting and monitoring function; Actively monitor EDC's risk profile across all risk types and business lines. Continue maturing the emerging risks program. Governance Responsible for developing and monitoring risk policies, standards and guidelines related to EDC's strategic, operational and financial risks within the risk governance framework. Oversee the Risk Appetite framework, including metrics definition, measurement, monitoring and reporting and ongoing evolution to stay current with emerging risks. Further develop second line functionality (oversight), ensuring clear roles and responsibilities between first and second lines, appropriate tools and reporting. Support the CRSO in managing key risk committees, including the Management Risk Management Committee and the Board Risk Management Committee. Qualifications Experience A minimum of 15 years of related work experience in the financial services industry including at least 10 years of leading quantitative and analytical teams A deep expertise in either/all of financial, operational, and strategic risk practices from a financial services perspective and with an emphasis on quantitative analytics. Proficient knowledge in the areas of controls, data, quantitative analysis and technology skills. Proficient knowledge of current regulatory requirements in the financial services industry. Advanced knowledge of policies, procedures, practices used in the financial services industry to ensure a well governed risk management function. Experience in Enterprise Risk Management (including various models and organizational structures). An understanding of ESG fundamentals and the connection with risk management. Experience in interpreting trends in the financial services and regulatory environments to make practical changes to the risk function in support of the enterprise strategy. Leadership Excellent leadership skills demonstrated through providing sound guidance and coaching to other leaders, positively influencing organizational culture, and high integrity. Exceptional relationship building skills, and the ability to hold others accountable without direct authority. Strong oral and written communication skills and the ability to communicate complex subject matter clearly at all levels of the organization up to the Board. Ability to present ideas in a clear, succinct and organized manner. Ability to proactively identify creative solutions for taking on and managing risk that support the enterprise strategy and enable the business to develop differentiated value propositions Technically strong with numeracy and financial awareness, yet able to see the bigger picture and not get stuck in the details. A growth mindset, and the ability to build, sustain and improve enterprise risk practices. Education Undergraduate degree in actuarial science, finance, math, accounting, business or related field. Bilingual in both official languages. Assets Transactional experience including assessing credit and non-credit risks. Masters degree in actuarial science, finance, math, accounting, business or related field. Relevant credentials: CFA, PRM, FRM, ASA/FSA, MBA. Salary Range: Salaries are based on qualifications and experience and typically range from $205,734 to $272,697 plus a STI and LTI performance-based incentive. Location Export Development Canada is a hybrid work environment. This role may be performed from EDC's headquarters in Ottawa or Toronto or Montreal. Relocation assistance is available for eligible candidates. EDC's Commitment to Employment Equity EDC is committed to employment equity and achieving a diverse workforce. EDC actively encourages applications from women, Aboriginal peoples, visible minorities, persons with disabilities and members of the 2SLGBTQI+ community. If selected for an interview, please advise us if you need any special accommodation. How to apply Only candidates selected for an interview will be contacted. Application deadline on www.edc.ca/careers : Feb 9, 2024, 10:59:00 Project Manager If selected for an interview, please advise us if you require special accommodation. Candidates must meet the requisite government security screening requirements.",
    "processed_description": "posting Project Manager Primary Location Type permanent schedule financial Crown corporation dedicate help canadian business impact abroad . offer financial product knowledge help canadian business confidently enter market reduce financial risk grow business . join team help canadian business learn endless possibility open export help bring vision passion innovation . knowledge expertise support canadian business customer market worldwide . good bright inclusive collaborative environment foster professional development success . impact – business people . ready impact join recognize risk canadian business . role Vice President Risk Quantification Enterprise Risk prominent position responsibility high degree exposure senior leader organization . report Senior Vice President Chief Risk Sustainability Officer Vice President lead capital management stress testing climate scenario analysis credit market liquidity insurance risk model development enterprise risk management function . responsibility include evolve risk maturity function delegate Chief Risk Sustainability Officer . Vice President responsible set vision strategic plan team deliver strategy exceptional leadership skill network internal external stakeholder strong technical business . role require excellent communication interpersonal skill engage consult business area define risk practice solution adapt EDC's size complexity specific mandate . link lead effectively critically solve problem balance management risk create business EDC's strategy . team locate relocation prefer essential . team peer periodically essential . Key Responsibilities Strategy | Capital Management | Risk Models Limits | stress testing | climate scenario | enterprise risk Management | Governance Strategy participate corporate business strategy formulation assess underlie risk corporate strategy conduct risk base effective challenge strategic objective . develop maintain Risk appetite framework include development risk appetite metric measurement monitoring reporting . stay abreast emerge risk trend geography industry business interest ensure EDC's strategy adapt . management operation EDC's economic capital framework dividend policy ownership policy guideline standard . lead internal capital target set process internal capital adequacy assessment process ICAAP development management capital management dividend policy standard guideline standard . develop oversee risk base performance management pricing methodology . closely business develop capital base tool allocation enhance business decision making transaction portfolio level . model Limits Credit Market Liquidity Insurance Risks Owner credit market liquidity insurance risk model . oversee market liquidity risk include monitor reporting EDC's exposure active participation ALCO . lead development management oversight risk model product include economic capital model credit risk model include IFRS9 compliant model insurance risk model include IFRS17 compliant model advance thinking quantification operational strategic risk financial risk require . Model Governance ensure strong governance framework place manage lifecycle risk model . ensure integrity EDC's credit risk limit framework include quantify risk exposure relative limit update limit framework require EDC's strategy . stress Testing Climate scenario analysis lead annual enterprise wide stress testing financial financial risk . lead annual climate scenario exercise regulatory guidance . lead discussion insight stress testing climate scenario ensure action pursue relevant accountable party typically CRSO Chief Financial Officer Chief Operating Officer . oversee centralized portfolio analytic function provide view portfolio risk scenario support business strategy . mature enterprise risk management function . develop monitor enterprise risk framework policy standard guideline report monitor EDC's strategic operational risk . provide specialized advice support action independently oversee challenge remediate risk finding quality assurance activity . responsible enterprise wide risk reporting monitoring function actively monitor EDC's risk profile risk type business . continue mature emerge risk program . governance responsible develop monitor risk policy standard guideline relate EDC's strategic operational financial risk risk governance framework . oversee Risk Appetite framework include metric definition measurement monitoring reporting ongoing evolution stay current emerge risk . develop second functionality oversight ensure clear role responsibility second appropriate tool reporting . support crso manage key risk committee include . Qualifications minimum financial service industry include lead quantitative analytical team deep expertise financial operational strategic risk practice financial service perspective emphasis quantitative analytic . proficient knowledge area control datum quantitative analysis technology skill . proficient knowledge current regulatory requirement financial service industry . advanced knowledge policy procedure practice financial service industry ensure govern risk management function . Enterprise Risk Management include model organizational structure . understanding ESG fundamental connection risk management . interpret trend financial service regulatory environment practical change risk function support enterprise strategy . leadership excellent leadership skill demonstrate provide sound guidance coaching leader positively influence organizational culture high integrity . exceptional relationship building skill hold accountable direct authority . strong oral write communication skill communicate complex subject matter level organization . idea clear succinct organized manner . proactively identify creative solution manage risk support enterprise strategy enable business develop differentiated proposition technically strong numeracy financial awareness big picture stick detail . growth mindset build sustain improve enterprise risk practice . Education Undergraduate degree actuarial science finance math accounting business field . official language . asset transactional include assess credit credit risk . master degree actuarial science finance math accounting business field . relevant credential . Salary range salary base qualification typically range STI LTI performance base incentive . hybrid environment . role perform EDC's headquarters . relocation assistance eligible . committed employment equity achieve diverse workforce . actively encourage application woman aboriginal people visible minority person 2SLGBTQI+ community . select interview advise special accommodation . apply select interview contact . application deadline Project Manager select interview advise require special accommodation . meet requisite government security screening requirement .",
    "results_group": {
        "extracted_noun_chunks": [
            "current emerge risk",
            "complex subject matter level organization",
            "ongoing evolution",
            "enterprise risk practice",
            "canadian business",
            "2SLGBTQI+ community",
            "EDC's strategic operational risk",
            "ESG fundamental connection risk management",
            "help",
            "requisite government security screening requirement",
            "capital base tool allocation",
            "support",
            "Salary range salary base qualification",
            "development management oversight risk model product",
            "Vice President responsible set vision strategic plan team",
            "vision passion innovation",
            "transaction portfolio level",
            "integrity EDC's credit risk limit framework",
            "IFRS9 compliant model insurance risk model",
            "link lead",
            "professional development success",
            "monitor",
            "financial risk",
            "STI LTI performance base incentive",
            "model organizational structure",
            "action",
            "annual enterprise wide stress",
            "stress Testing Climate scenario analysis",
            "strong oral write communication skill",
            "role",
            "centralized portfolio analytic function",
            "business EDC's strategy",
            "Model Governance",
            "quantitative analytical team deep expertise financial operational strategic risk practice financial service perspective emphasis",
            "ready impact",
            "monitoring function",
            "Capital Management",
            "sound guidance coaching leader",
            "committed employment equity",
            "regulatory guidance",
            "risk maturity function delegate Chief Risk Sustainability Officer",
            "model Limits Credit Market Liquidity Insurance",
            "risk exposure relative limit update limit framework",
            "| enterprise risk Management | Governance Strategy",
            "Senior Vice President Chief Risk Sustainability Officer Vice President",
            "proficient knowledge area control datum quantitative analysis technology skill",
            "exceptional relationship building skill",
            "mature enterprise risk management function",
            "business strategy",
            "corporate business strategy formulation",
            "advanced knowledge policy procedure practice financial service industry",
            "climate scenario",
            "key risk committee",
            "canadian business customer market",
            "select interview",
            "risk management function",
            "responsibility",
            "governance",
            "differentiated proposition",
            "problem balance management risk",
            "trend financial service regulatory environment practical change risk function support enterprise strategy",
            "Risk appetite framework",
            "quantitative analytic",
            "lifecycle risk model",
            "credit credit risk",
            "quality assurance activity",
            "leadership excellent leadership skill",
            "EDC's strategy",
            "relocation",
            "development management capital management dividend policy standard guideline standard",
            "market",
            "monitor risk policy standard guideline",
            "EDC's exposure active participation ALCO",
            "business people",
            "discussion insight stress testing climate scenario",
            "risk",
            "development risk appetite metric measurement monitoring reporting",
            "diverse workforce",
            "good bright inclusive collaborative environment",
            "team",
            "master degree actuarial science finance math accounting business field",
            "market liquidity risk",
            "organizational culture high integrity",
            "risk practice solution",
            "excellent communication interpersonal skill",
            "application woman aboriginal people",
            "risk trend geography industry business interest",
            "second functionality oversight",
            "risk base effective challenge strategic objective",
            "official language",
            "select interview contact",
            "clear succinct organized manner",
            "accountable direct authority",
            "creative solution",
            "impact",
            "Risk Appetite framework",
            "risk program",
            "capital management stress testing climate scenario analysis credit market liquidity insurance risk model development enterprise risk management function",
            "strategy exceptional leadership skill network internal external stakeholder strong technical business",
            "strong governance framework place",
            "Enterprise Risk Management",
            "relocation assistance",
            "internal capital target set process internal capital adequacy assessment process",
            "relevant credential",
            "Project Manager Primary Location Type permanent schedule financial Crown corporation",
            "financial product knowledge",
            "special accommodation",
            "typically CRSO Chief Financial Officer Chief Operating Officer",
            "clear role responsibility second appropriate tool reporting",
            "growth mindset",
            "EDC's size complexity specific mandate",
            "metric definition measurement monitoring",
            "Qualifications minimum financial service industry",
            "consult business area",
            "role Vice President Risk Quantification Enterprise Risk prominent position responsibility high degree exposure senior leader organization",
            "endless possibility open export help",
            "EDC's headquarters",
            "Risk Models Limits",
            "support crso",
            "proficient knowledge current regulatory requirement financial service industry",
            "EDC's risk profile risk type business",
            "risk base performance management pricing methodology",
            "knowledge expertise",
            "economic capital model credit risk model",
            "annual climate scenario",
            "relevant accountable party",
            "specialized advice support action",
            "Key Responsibilities Strategy",
            "monitor enterprise risk framework policy standard guideline report",
            "hybrid environment",
            "management operation EDC's economic capital framework dividend policy ownership policy guideline standard",
            "canadian business impact",
            "quantification operational strategic risk financial risk",
            "Education Undergraduate degree actuarial science finance math accounting business field",
            "risk support enterprise strategy",
            "view portfolio risk scenario",
            "business decision",
            "visible minority person",
            "business",
            "responsible enterprise wide risk",
            "financial financial risk",
            "risk canadian business",
            "application deadline Project Manager select interview advise",
            "technically strong numeracy financial awareness big picture stick detail",
            "EDC's strategic operational financial risk risk governance framework"
        ],
        "combined_lemmatized_tokens": "posting Project Manager Primary Location Type permanent schedule financial Crown corporation dedicate help canadian business impact abroad . offer financial product knowledge help canadian business confidently enter market reduce financial risk grow business . join team help canadian business learn endless possibility open export help bring vision passion innovation . knowledge expertise support canadian business customer market worldwide . good bright inclusive collaborative environment foster professional development success . impact – business people . ready impact join recognize risk canadian business . role Vice President Risk Quantification Enterprise Risk prominent position responsibility high degree exposure senior leader organization . report Senior Vice President Chief Risk Sustainability Officer Vice President lead capital management stress testing climate scenario analysis credit market liquidity insurance risk model development enterprise risk management function . responsibility include evolve risk maturity function delegate Chief Risk Sustainability Officer . Vice President responsible set vision strategic plan team deliver strategy exceptional leadership skill network internal external stakeholder strong technical business . role require excellent communication interpersonal skill engage consult business area define risk practice solution adapt EDC's size complexity specific mandate . link lead effectively critically solve problem balance management risk create business EDC's strategy . team locate relocation prefer essential . team peer periodically essential . Key Responsibilities Strategy | Capital Management | Risk Models Limits | stress testing | climate scenario | enterprise risk Management | Governance Strategy participate corporate business strategy formulation assess underlie risk corporate strategy conduct risk base effective challenge strategic objective . develop maintain Risk appetite framework include development risk appetite metric measurement monitoring reporting . stay abreast emerge risk trend geography industry business interest ensure EDC's strategy adapt . management operation EDC's economic capital framework dividend policy ownership policy guideline standard . lead internal capital target set process internal capital adequacy assessment process ICAAP development management capital management dividend policy standard guideline standard . develop oversee risk base performance management pricing methodology . closely business develop capital base tool allocation enhance business decision making transaction portfolio level . model Limits Credit Market Liquidity Insurance Risks Owner credit market liquidity insurance risk model . oversee market liquidity risk include monitor reporting EDC's exposure active participation ALCO . lead development management oversight risk model product include economic capital model credit risk model include IFRS9 compliant model insurance risk model include IFRS17 compliant model advance thinking quantification operational strategic risk financial risk require . Model Governance ensure strong governance framework place manage lifecycle risk model . ensure integrity EDC's credit risk limit framework include quantify risk exposure relative limit update limit framework require EDC's strategy . stress Testing Climate scenario analysis lead annual enterprise wide stress testing financial financial risk . lead annual climate scenario exercise regulatory guidance . lead discussion insight stress testing climate scenario ensure action pursue relevant accountable party typically CRSO Chief Financial Officer Chief Operating Officer . oversee centralized portfolio analytic function provide view portfolio risk scenario support business strategy . mature enterprise risk management function . develop monitor enterprise risk framework policy standard guideline report monitor EDC's strategic operational risk . provide specialized advice support action independently oversee challenge remediate risk finding quality assurance activity . responsible enterprise wide risk reporting monitoring function actively monitor EDC's risk profile risk type business . continue mature emerge risk program . governance responsible develop monitor risk policy standard guideline relate EDC's strategic operational financial risk risk governance framework . oversee Risk Appetite framework include metric definition measurement monitoring reporting ongoing evolution stay current emerge risk . develop second functionality oversight ensure clear role responsibility second appropriate tool reporting . support crso manage key risk committee include . Qualifications minimum financial service industry include lead quantitative analytical team deep expertise financial operational strategic risk practice financial service perspective emphasis quantitative analytic . proficient knowledge area control datum quantitative analysis technology skill . proficient knowledge current regulatory requirement financial service industry . advanced knowledge policy procedure practice financial service industry ensure govern risk management function . Enterprise Risk Management include model organizational structure . understanding ESG fundamental connection risk management . interpret trend financial service regulatory environment practical change risk function support enterprise strategy . leadership excellent leadership skill demonstrate provide sound guidance coaching leader positively influence organizational culture high integrity . exceptional relationship building skill hold accountable direct authority . strong oral write communication skill communicate complex subject matter level organization . idea clear succinct organized manner . proactively identify creative solution manage risk support enterprise strategy enable business develop differentiated proposition technically strong numeracy financial awareness big picture stick detail . growth mindset build sustain improve enterprise risk practice . Education Undergraduate degree actuarial science finance math accounting business field . official language . asset transactional include assess credit credit risk . master degree actuarial science finance math accounting business field . relevant credential . Salary range salary base qualification typically range STI LTI performance base incentive . hybrid environment . role perform EDC's headquarters . relocation assistance eligible . committed employment equity achieve diverse workforce . actively encourage application woman aboriginal people visible minority person 2SLGBTQI+ community . select interview advise special accommodation . apply select interview contact . application deadline Project Manager select interview advise require special accommodation . meet requisite government security screening requirement ."
    }
}