{
    "id": "38f6bfbb6942636e",
    "companyDescription": "",
    "description": "Job Type:\n  Employee\n \n \n   Duration in Months (for fixed-term jobs):\n  N/A\n \n \n   Job Family:\n  Maintenance and Operations\n \n \n   # of Open Positions:\n  1\n \n \n   Faculty/Service - Department:\n  Grounds & Transportation\n \n \n   Campus:\n  Main Campus\n \n \n   Union Affiliation:\n  IUOE/772B - Employees of the trades, grounds and transportation\n \n \n   Date Posted:\n  octobre 16, 2023\n \n \n   Closing Date:\n  octobre 27, 2023\n \n   Note: Applications will be accepted until 11:59 PM on the day prior to the Posting End Date above\n \n \n \n   Hours per week:\n  40\n \n \n   Salary Grade:\n  Truck Driver - 772B\n \n \n   Salary Range:\n  $28,83 - $28,83\n  About Facilities\n  Facilities services are characterized by a dynamic and creative growing team where the winds of change are blowing, offering people like you opportunities to use your leadership and innovation skills to contribute to the achievement of their inspiring mission: to deliver best in class research infrastructure, reshape campus life and student experience, and provide a sustainable environment for students, researchers, teachers and community. \"\n \n \n   Position Purpose:\n \n \n   Reporting to the Supervisor, Campus Maintenance and Operations, the incumbent plays a key role in the safe, efficient campus-wide movement of furniture, boxes, laboratory equipment and various articles, along with assembly. Prepares and sets up tables, chairs, lecterns and other items for events, according to client needs and blueprints provided. Helps ensure smooth running of activities and meets University logistical requirements.\n \n \n \n   In this role, your responsibilities will include:\n \n \n   Loads, transports and unloads furniture, boxes and laboratory equipment safely and efficiently.\n   Follows handling procedures and protocols to prevent damage of transported goods.\n   Regularly checks the condition of trucks and indicates anything amiss to the team leader.\n   Coordinates delivery schedules with relevant departments to ensure high quality service.\n   Helps set up and take down equipment and installations needed for University events.\n   Works with event organizers to understand their exact needs and meet them effectively.\n   Ensures necessary resources are available, such as tables, chairs and audiovisual equipment.\n   Help teams in the field with related tasks, for example, installing temporary fencing for events, collecting broken branches and alerting service providers of damage or problems related to outdoor campus spaces.\n   Maintains clear, professional communication with transport team members, providers and relevant services and departments.\n   Works with the team leader to plan work assignment and priorities according to operational needs.\n   Responds to service requests proactively and efficiently, meeting established timelines.\n   Enters accurate, complete and relevant information in systems to indicate tasks completed with regard to work tickets\n \n \n \n   What you will bring:\n \n \n   High school diploma or equivalent\n   Proven experience in a similar role, for example, in moving, delivery or logistics\n   Valid class G drivers’ licence and exemplary driving record\n   Ability to handle heavy loads and perform demanding physical tasks\n   Good knowledge of security regulations for lifting and handling of various articles in transit\n   Ability to work independently\n   Excellent communication, interpersonal and customer service skills\n   Flexibility to work during off hours, as required\n   Basic knowledge of computers, IT systems and applications (like Outlook)\n   Bilingualism — French and English (spoken and written)\n \n \n \n   Key Competencies at uOttawa:\n   Here are the required competencies for all or our employees at uOttawa:\n   \n   Planning: Organize in time a series of actions or events in order to realize an objective or a project. Plan and organize own work and priorities in regular daily activities.\n   Initiative: Demonstrate creativity and initiative to suggest improvements and encourage positive results. Is proactive and self-starting. Show availability and willingness to go above and beyond whenever it is possible.\n   Client Service Orientation: Help or serve others to meet their needs. This implies anticipating and identifying the needs of internal and external clients and finding solutions on how to meet them.\n   Teamwork and Cooperation: Cooperate and work well with other members of the team to reach common goal(s). Accept and give constructive feedback. Able to adjust own behaviour to reach the goals of the team.\n   \n   The University of Ottawa embraces diversity and inclusion in the workplace. We are passionate about our people and committed to employment equity. We foster a culture of respect, teamwork and inclusion, where collaboration, innovation, and creativity fuel our quest for research and teaching excellence. While all qualified persons are invited to apply, we welcome applications from qualified Indigenous persons, racialized persons, persons with disabilities, women and LGBTQIA2S+ persons. The University is committed to creating and maintaining an accessible, barrier-free work environment. The University is also committed to working with applicants with disabilities requesting accommodation during the recruitment, assessment and selection processes. Applicants with disabilities may contact hrtalentmanagement@uottawa.ca to communicate the accommodation need. All qualified candidates are encouraged to apply; however, Canadians and permanent residents will be given priority.\n   \n   Note: if this is a union position: The hiring process will be governed by the current collective agreement related to the union affiliation noted above; you can click \n  \n   here\n   to find out more.\n   \n   \n  If this is a front-line position with responsibilities to interact with students, selected candidates must be rated at the Low Advanced proficiency level or higher for both oral comprehension and reading comprehension in their second official language. The rating is determined by a proficiency test designed by the Official Languages and Bilingualism Institute.\n \n \n \n   Prior to May 1, 2022, the University required all students, faculty, staff, and visitors (including contractors) to be fully vaccinated against Covid-19 as defined in Policy 129 – Covid-19 Vaccination. This policy was suspended effective May 1, 2022 but may be reinstated at any point in the future depending on public health guidelines and the recommendations of experts.",
    "preprocessed_description": "Job Type: Employee Duration in Months (for fixed-term jobs): N/A Job Family: Maintenance and Operations # of Open Positions: 1 Faculty/Service - Department: Grounds & Transportation Campus: Main Campus Union Affiliation: IUOE/772B - Employees of the trades, grounds and transportation Date Posted: octobre 16, 2023 Closing Date: octobre 27, 2023 Note: Applications will be accepted until 11:59 Project Manager on the day prior to the Posting End Date above Hours per week: 40 Salary Grade: Truck Driver - 772B Salary Range: $28,83 - $28,83 About Facilities Facilities services are characterized by a dynamic and creative growing team where the winds of change are blowing, offering people like you opportunities to use your leadership and innovation skills to contribute to the achievement of their inspiring mission: to deliver best in class research infrastructure, reshape campus life and student experience, and provide a sustainable environment for students, researchers, teachers and community. \" Position Purpose: Reporting to the Supervisor, Campus Maintenance and Operations, the incumbent plays a key role in the safe, efficient campus-wide movement of furniture, boxes, laboratory equipment and various articles, along with assembly. Prepares and sets up tables, chairs, lecterns and other items for events, according to client needs and blueprints provided. Helps ensure smooth running of activities and meets University logistical requirements. In this role, your responsibilities will include: Loads, transports and unloads furniture, boxes and laboratory equipment safely and efficiently. Follows handling procedures and protocols to prevent damage of transported goods. Regularly checks the condition of trucks and indicates anything amiss to the team leader. Coordinates delivery schedules with relevant departments to ensure high quality service. Helps set up and take down equipment and installations needed for University events. Works with event organizers to understand their exact needs and meet them effectively. Ensures necessary resources are available, such as tables, chairs and audiovisual equipment. Help teams in the field with related tasks, for example, installing temporary fencing for events, collecting broken branches and alerting service providers of damage or problems related to outdoor campus spaces. Maintains clear, professional communication with transport team members, providers and relevant services and departments. Works with the team leader to plan work assignment and priorities according to operational needs. Responds to service requests proactively and efficiently, meeting established timelines. Enters accurate, complete and relevant information in systems to indicate tasks completed with regard to work tickets What you will bring: High school diploma or equivalent Proven experience in a similar role, for example, in moving, delivery or logistics Valid class G drivers' licence and exemplary driving record Ability to handle heavy loads and perform demanding physical tasks Good knowledge of security regulations for lifting and handling of various articles in transit Ability to work independently Excellent communication, interpersonal and customer service skills Flexibility to work during off hours, as required Basic knowledge of computers, IT systems and applications (like Outlook) Bilingualism — French and English (spoken and written) Key Competencies at uOttawa: Here are the required competencies for all or our employees at uOttawa: Planning: Organize in time a series of actions or events in order to realize an objective or a project. Plan and organize own work and priorities in regular daily activities. Initiative: Demonstrate creativity and initiative to suggest improvements and encourage positive results. Is proactive and self-starting. Show availability and willingness to go above and beyond whenever it is possible. Client Service Orientation: Help or serve others to meet their needs. This implies anticipating and identifying the needs of internal and external clients and finding solutions on how to meet them. Teamwork and Cooperation: Cooperate and work well with other members of the team to reach common goal(s). Accept and give constructive feedback. Able to adjust own behaviour to reach the goals of the team. The University of Ottawa embraces diversity and inclusion in the workplace. We are passionate about our people and committed to employment equity. We foster a culture of respect, teamwork and inclusion, where collaboration, innovation, and creativity fuel our quest for research and teaching excellence. While all qualified persons are invited to apply, we welcome applications from qualified Indigenous persons, racialized persons, persons with disabilities, women and LGBTQIA2S+ persons. The University is committed to creating and maintaining an accessible, barrier-free work environment. The University is also committed to working with applicants with disabilities requesting accommodation during the recruitment, assessment and selection processes. Applicants with disabilities may contact hrtalentmanagement@uottawa.ca to communicate the accommodation need. All qualified candidates are encouraged to apply; however, Canadians and permanent residents will be given priority. Note: if this is a union position: The hiring process will be governed by the current collective agreement related to the union affiliation noted above; you can click here to find out more. If this is a front-line position with responsibilities to interact with students, selected candidates must be rated at the Low Advanced proficiency level or higher for both oral comprehension and reading comprehension in their second official language. The rating is determined by a proficiency test designed by the Official Languages and Bilingualism Institute. Prior to May 1, 2022, the University required all students, faculty, staff, and visitors (including contractors) to be fully vaccinated against Covid-19 as defined in Policy 129 – Covid-19 Vaccination. This policy was suspended effective May 1, 2022 but may be reinstated at any point in the future depending on public health guidelines and the recommendations of experts.",
    "processed_description": "type employee duration term Grounds Transportation Campus Main Campus Union Affiliation IUOE 772B employee trade ground transportation post closing note application accept Project Manager week Salary grade Truck Driver 772B Salary Range Facilities Facilities service characterize dynamic creative grow team wind change blow offer people leadership innovation skill contribute achievement inspiring mission deliver class research infrastructure reshape campus life student provide sustainable environment student researcher teacher community . incumbent play key role safe efficient campus wide movement furniture box laboratory equipment article assembly . prepare set table chair lectern item event accord client blueprint provide . help ensure smooth activity meet University logistical requirement . role responsibility include load transport unload furniture box laboratory equipment safely efficiently . follow handle procedure protocol prevent damage transport good . regularly check condition truck indicate amiss team leader . coordinate delivery schedule relevant department ensure high quality service . help set equipment installation University event . event organizer understand exact meet effectively . ensure resource table chair audiovisual equipment . help team field task example instal temporary fencing event collect broken branch alert service provider damage problem relate outdoor campus space . maintain clear professional communication transport team provider relevant service department . team leader plan assignment priority accord operational . respond service request proactively efficiently meeting establish timeline . enter accurate complete relevant information system indicate task complete regard ticket bring high school diploma equivalent proven role example moving delivery logistic valid class driver' licence exemplary driving record handle heavy load perform demand physical task good knowledge security regulation lift handling article transit independently excellent communication interpersonal customer service skill flexibility require basic knowledge computer system application Outlook Bilingualism — speak write require competency employee planning organize series action event order realize objective project . plan organize priority regular daily activity . initiative demonstrate creativity initiative improvement encourage positive result . proactive starting . availability willingness . Client Service Orientation help serve meet . imply anticipate identify internal external client find solution meet . teamwork Cooperation cooperate team reach common goal . accept constructive feedback . adjust behaviour reach goal team . embrace diversity inclusion workplace . passionate people commit employment equity . foster culture respect teamwork inclusion collaboration innovation creativity fuel quest research teaching excellence . qualified person invite apply application qualified indigenous person racialize person person woman lgbtqia2s+ person . commit create maintain accessible barrier free environment . committed applicant request accommodation recruitment assessment selection process . applicant contact communicate accommodation . qualified encourage apply permanent resident priority . note union position hiring process govern current collective agreement relate union affiliation note click find . position responsibility interact student select rate low advanced proficiency level high oral comprehension reading comprehension second official language . rating determine proficiency test design . prior require student faculty staff visitor include contractor fully vaccinate Covid define Policy – Covid Vaccination . policy suspend effective reinstate point future depend public health guideline recommendation expert .",
    "results_group": {
        "extracted_noun_chunks": [
            "condition truck",
            "damage transport",
            "accessible barrier free environment",
            "creativity initiative improvement",
            "passionate people",
            "team leader plan",
            "equipment installation University event",
            "task complete regard ticket",
            "contractor",
            "goal team",
            "foster culture respect teamwork inclusion collaboration innovation creativity fuel quest research teaching excellence",
            "Covid Vaccination",
            "union affiliation note click find",
            "internal external client",
            "accommodation",
            "priority regular daily activity",
            "current collective agreement",
            "proficiency test design",
            "smooth activity",
            "delivery schedule relevant department",
            "Covid",
            "instal temporary fencing event",
            "team field task example",
            "initiative",
            "effective reinstate point future",
            "competency employee planning",
            "solution",
            "type employee duration term Grounds Transportation Campus Main Campus Union Affiliation IUOE 772B employee trade ground transportation post closing note application",
            "policy",
            "incumbent",
            "diversity inclusion workplace",
            "key role",
            "event organizer",
            "union position hiring process",
            "availability willingness",
            "service request",
            "clear professional communication transport team provider relevant service department",
            "public health guideline recommendation expert",
            "teamwork Cooperation cooperate team",
            "independently excellent communication interpersonal customer service skill flexibility",
            "rating",
            "Client Service Orientation help",
            "organize series action event order",
            "high school diploma equivalent proven role example",
            "role responsibility",
            "permanent resident priority",
            "assignment priority accord",
            "common goal",
            "class research infrastructure",
            "outdoor campus space",
            "sustainable environment student researcher teacher community",
            "resource table chair audiovisual equipment",
            "campus life student",
            "handle procedure protocol",
            "timeline",
            "applicant contact",
            "positive result",
            "qualified encourage",
            "application qualified indigenous person racialize person person woman",
            "Policy",
            "amiss team leader",
            "objective project",
            "proactive starting",
            "accurate complete relevant information system",
            "student select rate low advanced proficiency level high oral comprehension reading comprehension second official language",
            "constructive feedback",
            "University logistical requirement",
            "applicant request accommodation recruitment assessment selection process",
            "behaviour",
            "student faculty staff visitor",
            "qualified person",
            "achievement inspiring mission",
            "broken branch alert service provider damage problem",
            "high quality service",
            "people leadership innovation skill",
            "employment equity",
            "position responsibility",
            "Salary grade Truck Driver 772B Salary Range Facilities Facilities service",
            "load transport unload furniture box laboratory equipment",
            "safe efficient campus wide movement furniture box laboratory equipment article assembly",
            "delivery logistic valid class driver' licence exemplary driving record handle heavy load",
            "basic knowledge computer system application Outlook Bilingualism"
        ],
        "combined_lemmatized_tokens": "type employee duration term Grounds Transportation Campus Main Campus Union Affiliation IUOE 772B employee trade ground transportation post closing note application accept Project Manager week Salary grade Truck Driver 772B Salary Range Facilities Facilities service characterize dynamic creative grow team wind change blow offer people leadership innovation skill contribute achievement inspiring mission deliver class research infrastructure reshape campus life student provide sustainable environment student researcher teacher community . incumbent play key role safe efficient campus wide movement furniture box laboratory equipment article assembly . prepare set table chair lectern item event accord client blueprint provide . help ensure smooth activity meet University logistical requirement . role responsibility include load transport unload furniture box laboratory equipment safely efficiently . follow handle procedure protocol prevent damage transport good . regularly check condition truck indicate amiss team leader . coordinate delivery schedule relevant department ensure high quality service . help set equipment installation University event . event organizer understand exact meet effectively . ensure resource table chair audiovisual equipment . help team field task example instal temporary fencing event collect broken branch alert service provider damage problem relate outdoor campus space . maintain clear professional communication transport team provider relevant service department . team leader plan assignment priority accord operational . respond service request proactively efficiently meeting establish timeline . enter accurate complete relevant information system indicate task complete regard ticket bring high school diploma equivalent proven role example moving delivery logistic valid class driver' licence exemplary driving record handle heavy load perform demand physical task good knowledge security regulation lift handling article transit independently excellent communication interpersonal customer service skill flexibility require basic knowledge computer system application Outlook Bilingualism — speak write require competency employee planning organize series action event order realize objective project . plan organize priority regular daily activity . initiative demonstrate creativity initiative improvement encourage positive result . proactive starting . availability willingness . Client Service Orientation help serve meet . imply anticipate identify internal external client find solution meet . teamwork Cooperation cooperate team reach common goal . accept constructive feedback . adjust behaviour reach goal team . embrace diversity inclusion workplace . passionate people commit employment equity . foster culture respect teamwork inclusion collaboration innovation creativity fuel quest research teaching excellence . qualified person invite apply application qualified indigenous person racialize person person woman lgbtqia2s+ person . commit create maintain accessible barrier free environment . committed applicant request accommodation recruitment assessment selection process . applicant contact communicate accommodation . qualified encourage apply permanent resident priority . note union position hiring process govern current collective agreement relate union affiliation note click find . position responsibility interact student select rate low advanced proficiency level high oral comprehension reading comprehension second official language . rating determine proficiency test design . prior require student faculty staff visitor include contractor fully vaccinate Covid define Policy – Covid Vaccination . policy suspend effective reinstate point future depend public health guideline recommendation expert ."
    }
}