{
    "id": "38f6bfbb6942636e",
    "company": "University of Ottawa",
    "positionName": "Transport Attendant",
    "jobType": [],
    "location": "40 Ruskin St, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-17T18:53:36.786Z",
    "url": "https://www.indeed.ca/rc/clk?jk=38f6bfbb6942636e&from=jasx&tk=1hcvfkunqk7dc802&vjs=3",
    "externalApplyLink": "https://uottawa.wd3.myworkdayjobs.com/en-US/uOttawa_External_Career_Site/job/Ottawa-ON/Prpose-ou-prpos-au-transport--Conductrice-ou-conducteur_JR6728",
    "companyDescription": "",
    "description": "Job Type:\n  Employee\n \n \n   Duration in Months (for fixed-term jobs):\n  N/A\n \n \n   Job Family:\n  Maintenance and Operations\n \n \n   # of Open Positions:\n  1\n \n \n   Faculty/Service - Department:\n  Grounds & Transportation\n \n \n   Campus:\n  Main Campus\n \n \n   Union Affiliation:\n  IUOE/772B - Employees of the trades, grounds and transportation\n \n \n   Date Posted:\n  octobre 16, 2023\n \n \n   Closing Date:\n  octobre 27, 2023\n \n   Note: Applications will be accepted until 11:59 PM on the day prior to the Posting End Date above\n \n \n \n   Hours per week:\n  40\n \n \n   Salary Grade:\n  Truck Driver - 772B\n \n \n   Salary Range:\n  $28,83 - $28,83\n  About Facilities\n  Facilities services are characterized by a dynamic and creative growing team where the winds of change are blowing, offering people like you opportunities to use your leadership and innovation skills to contribute to the achievement of their inspiring mission: to deliver best in class research infrastructure, reshape campus life and student experience, and provide a sustainable environment for students, researchers, teachers and community. \"\n \n \n   Position Purpose:\n \n \n   Reporting to the Supervisor, Campus Maintenance and Operations, the incumbent plays a key role in the safe, efficient campus-wide movement of furniture, boxes, laboratory equipment and various articles, along with assembly. Prepares and sets up tables, chairs, lecterns and other items for events, according to client needs and blueprints provided. Helps ensure smooth running of activities and meets University logistical requirements.\n \n \n \n   In this role, your responsibilities will include:\n \n \n   Loads, transports and unloads furniture, boxes and laboratory equipment safely and efficiently.\n   Follows handling procedures and protocols to prevent damage of transported goods.\n   Regularly checks the condition of trucks and indicates anything amiss to the team leader.\n   Coordinates delivery schedules with relevant departments to ensure high quality service.\n   Helps set up and take down equipment and installations needed for University events.\n   Works with event organizers to understand their exact needs and meet them effectively.\n   Ensures necessary resources are available, such as tables, chairs and audiovisual equipment.\n   Help teams in the field with related tasks, for example, installing temporary fencing for events, collecting broken branches and alerting service providers of damage or problems related to outdoor campus spaces.\n   Maintains clear, professional communication with transport team members, providers and relevant services and departments.\n   Works with the team leader to plan work assignment and priorities according to operational needs.\n   Responds to service requests proactively and efficiently, meeting established timelines.\n   Enters accurate, complete and relevant information in systems to indicate tasks completed with regard to work tickets\n \n \n \n   What you will bring:\n \n \n   High school diploma or equivalent\n   Proven experience in a similar role, for example, in moving, delivery or logistics\n   Valid class G drivers’ licence and exemplary driving record\n   Ability to handle heavy loads and perform demanding physical tasks\n   Good knowledge of security regulations for lifting and handling of various articles in transit\n   Ability to work independently\n   Excellent communication, interpersonal and customer service skills\n   Flexibility to work during off hours, as required\n   Basic knowledge of computers, IT systems and applications (like Outlook)\n   Bilingualism — French and English (spoken and written)\n \n \n \n   Key Competencies at uOttawa:\n   Here are the required competencies for all or our employees at uOttawa:\n   \n   Planning: Organize in time a series of actions or events in order to realize an objective or a project. Plan and organize own work and priorities in regular daily activities.\n   Initiative: Demonstrate creativity and initiative to suggest improvements and encourage positive results. Is proactive and self-starting. Show availability and willingness to go above and beyond whenever it is possible.\n   Client Service Orientation: Help or serve others to meet their needs. This implies anticipating and identifying the needs of internal and external clients and finding solutions on how to meet them.\n   Teamwork and Cooperation: Cooperate and work well with other members of the team to reach common goal(s). Accept and give constructive feedback. Able to adjust own behaviour to reach the goals of the team.\n   \n   The University of Ottawa embraces diversity and inclusion in the workplace. We are passionate about our people and committed to employment equity. We foster a culture of respect, teamwork and inclusion, where collaboration, innovation, and creativity fuel our quest for research and teaching excellence. While all qualified persons are invited to apply, we welcome applications from qualified Indigenous persons, racialized persons, persons with disabilities, women and LGBTQIA2S+ persons. The University is committed to creating and maintaining an accessible, barrier-free work environment. The University is also committed to working with applicants with disabilities requesting accommodation during the recruitment, assessment and selection processes. Applicants with disabilities may contact hrtalentmanagement@uottawa.ca to communicate the accommodation need. All qualified candidates are encouraged to apply; however, Canadians and permanent residents will be given priority.\n   \n   Note: if this is a union position: The hiring process will be governed by the current collective agreement related to the union affiliation noted above; you can click \n  \n   here\n   to find out more.\n   \n   \n  If this is a front-line position with responsibilities to interact with students, selected candidates must be rated at the Low Advanced proficiency level or higher for both oral comprehension and reading comprehension in their second official language. The rating is determined by a proficiency test designed by the Official Languages and Bilingualism Institute.\n \n \n \n   Prior to May 1, 2022, the University required all students, faculty, staff, and visitors (including contractors) to be fully vaccinated against Covid-19 as defined in Policy 129 – Covid-19 Vaccination. This policy was suspended effective May 1, 2022 but may be reinstated at any point in the future depending on public health guidelines and the recommendations of experts."
}