{
    "id": "af55ca8d3b900610",
    "companyDescription": "",
    "description": "Architecture49Inc. is currently seeking an Architect, Science & Technology. A49 has office location across Canada, and will allow the successful candidate to work from any A49 location in Canada, with preference for the Ottawa, ON area. This position will focus on Science & Technology projects and be responsible for the following: \n RESPONSIBILITIES \n \n  Serve as Laboratory Specialist for a variety of roles on Science & Technology projects; \n  Work with the National Science & Technology Leader to assist with our long-term strategic plan to develop and meet market and target client goals; \n  Assume leadership roles for our existing body of work with strong clients and a team of talented architects and engineers; \n  Validate that designs and deliverables conform to guidelines, code requirements and other regulations; \n  Advise team members on design and/or technical solutions specific to the project types; \n  Attend design team meetings; and \n  Attend project sites for construction observation. \n \n QUALIFICATIONS \n \n  A degree or diploma in Architecture from an accredited institution; \n  Must be a Registered Architect in Canada, or eligible to be registered in a Canadian province; \n  5+ years of experience in laboratory projects; \n  Experience with multiple delivery models including design-build, P3, and design-bid-build; \n  Strong listener, genuinely interested in people, and able to build followership among teammates and clients, alike; \n  Track record of developing new business and relationships with a variety of clients who may own, operate, develop, construct and lead laboratory projects; \n  Collaborative work style, always looking for a more effective way to do things; \n  Great communicator – verbally and in written form; \n  Good mentor – colleagues feel that you have their best interests at heart; \n  An extensive background in laboratory planning and design; \n  Resourceful and creative problem solver, motivated and energetic; \n  Interested in the drivers and ideas impacting the current and future Science & Technology industry; and \n  Has fun at work.",
    "preprocessed_description": "Architecture49Inc. is currently seeking an Architect, Science & Technology. A49 has office location across Canada, and will allow the successful candidate to work from any A49 location in Canada, with preference for the Ottawa, ON area. This position will focus on Science & Technology projects and be responsible for the following: RESPONSIBILITIES Serve as Laboratory Specialist for a variety of roles on Science & Technology projects; Work with the National Science & Technology Leader to assist with our long-term strategic plan to develop and meet market and target client goals; Assume leadership roles for our existing body of work with strong clients and a team of talented architects and engineers; Validate that designs and deliverables conform to guidelines, code requirements and other regulations; Advise team members on design and/or technical solutions specific to the project types; Attend design team meetings; and Attend project sites for construction observation. QUALIFICATIONS A degree or diploma in Architecture from an accredited institution; Must be a Registered Architect in Canada, or eligible to be registered in a Canadian province; 5+ years of experience in laboratory projects; Experience with multiple delivery models including design-build, P3, and design-bid-build; Strong listener, genuinely interested in people, and able to build followership among teammates and clients, alike; Track record of developing new business and relationships with a variety of clients who may own, operate, develop, construct and lead laboratory projects; Collaborative work style, always looking for a more effective way to do things; Great communicator – verbally and in written form; Good mentor – colleagues feel that you have their best interests at heart; An extensive background in laboratory planning and design; Resourceful and creative problem solver, motivated and energetic; Interested in the drivers and ideas impacting the current and future Science & Technology industry; and Has fun at work.",
    "processed_description": ". currently seek . A49 office location allow successful A49 location preference . position focus Science Technology project responsible follow responsibility serve Laboratory Specialist variety role Science Technology project National Science Technology Leader assist long term strategic plan develop meet market target client goal assume leadership role exist body strong client team talented architect engineer design deliverable conform guideline code requirement regulation advise team design technical solution specific project type attend design team meeting attend project site construction observation . qualification degree diploma accredited institution Registered Architect eligible register canadian province laboratory project multiple delivery model include design build design bid build strong listener genuinely interested people build followership teammate client alike Track record develop business relationship variety client operate develop construct lead laboratory project collaborative style effective thing great communicator – verbally write form good mentor – colleague feel good interest heart extensive background laboratory planning design resourceful creative problem solver motivated energetic driver idea impact current future Science Technology industry fun .",
    "results_group": {
        "extracted_noun_chunks": [
            "lead laboratory project collaborative style effective thing",
            "meet market target client goal",
            "body strong client team",
            "A49 office location",
            "team",
            "talented architect engineer design",
            "Science Technology project National Science Technology Leader",
            "good interest heart extensive background laboratory planning design resourceful creative problem",
            "qualification degree diploma accredited institution",
            "great communicator",
            "Laboratory Specialist variety role",
            "current future Science Technology industry fun",
            "business relationship variety client",
            "Registered Architect",
            "position focus Science Technology project responsible follow responsibility",
            "project site construction observation",
            "leadership role",
            "good mentor – colleague",
            "people",
            "design team meeting",
            "form",
            "successful A49 location preference",
            "deliverable conform guideline code requirement regulation",
            "design technical solution specific project type",
            "canadian province laboratory project multiple delivery model",
            "followership teammate client alike Track record",
            "design build design bid",
            "long term strategic plan"
        ],
        "combined_lemmatized_tokens": ". currently seek . A49 office location allow successful A49 location preference . position focus Science Technology project responsible follow responsibility serve Laboratory Specialist variety role Science Technology project National Science Technology Leader assist long term strategic plan develop meet market target client goal assume leadership role exist body strong client team talented architect engineer design deliverable conform guideline code requirement regulation advise team design technical solution specific project type attend design team meeting attend project site construction observation . qualification degree diploma accredited institution Registered Architect eligible register canadian province laboratory project multiple delivery model include design build design bid build strong listener genuinely interested people build followership teammate client alike Track record develop business relationship variety client operate develop construct lead laboratory project collaborative style effective thing great communicator – verbally write form good mentor – colleague feel good interest heart extensive background laboratory planning design resourceful creative problem solver motivated energetic driver idea impact current future Science Technology industry fun ."
    }
}