{
    "id": "4b2aef42c927a61a",
    "companyDescription": "",
    "description": "L3Harris is dedicated to recruiting and developing diverse, high-performing talent who are passionate about what they do. Our employees are unified in a shared dedication to our customers’ mission and quest for professional growth. L3Harris provides an inclusive, engaging environment designed to empower employees and promote work-life success. Fundamental to our culture is an unwavering focus on values, dedication to our communities, and commitment to excellence in everything we do.\n  L3Harris Technologies is the Trusted Disruptor for the global aerospace and defense industry. With customers’ mission-critical needs always in mind, our more than 50,000 employees deliver end-to-end technology solutions connecting the space, air, land, sea and cyber domains.\n  L3Harris MAS, a subsidiary of L3Harris Technologies, Inc., is an agile and innovative aerospace and defense technology company. Our 1000 employees provide complete military and commercial aviation modernization and upgrade solutions structural and avionics upgrades, aircraft component repair and overhaul, integrated logistics support, stripping and painting, field service support and technical publications, plus a full range of technical support services.\n \n  Our specialized aviation facilities include component repair, overhaul and machining, aircraft hangars and other upgrade facilities, structural design and analysis, full-scale fatigue testing and aircraft fatigue management, as well as other engineering services - from mechanical engineering and avionics to electronics and systems engineering.\n \n  Our customers perform on the world’s most challenging front lines. They trust us to keep them prepared for what’s next. We combine speed, innovation and flawless execution to ensure confidence and security in the world ahead.\n \n  About your next Challenge as a Aircraft Maintenance Engineer (AME) - Mechanical (M2):\n  Reporting to the Operations Supervisor the Aircraft Maintenance Engineer (AME M2) will perform work and be ready to sign a Maintenance Release for their work. The employee shall be the holder of a Transport Canada AME license, appropriately rated. The AME shall have demonstrated acceptable levels of knowledge of the AMO and its Quality Program and have been issued an ACA Authorization to sign a maintenance release in respect to work performed on aeronautical products. Their duties include but are not limited to:\n \n   Performance of work, up to and including certification with approved processes.\n   Reporting any un-airworthy conditions discovered (including Service Difficulties).\n   Utilizing certified/calibrated standard measuring and test equipment.\n   Familiarization with L3 MAS Policies and Processes.\n   Marshalling, fueling and towing of aircraft.\n   Maintaining a clean work area\n   Assuming responsibility for his work as indicated by his signature/stamp;\n   Performing duties such as repair, modification and maintenance of aircraft in accordance with approved maintenance procedures;\n   Reporting any un-airworthy conditions discovered;\n   Familiarisation of the MPM and related processes;\n   Participating in the Safety Management System Program Committee on Aircraft, if requested.\n \n \n  Qualifications:\n \n   You must hold an AME M license and have qualifications on heavy aircraft in the following areas:\n   \n     Engine/Airframe interface;\n     Environmental Control;\n     Electrical System;\n     Hydraulic System;\n     Fuel System;\n     Flight Control System.\n   \n \n \n  Eligibility Criteria:\n \n   Must be eligible for registration with the Controlled Goods Program;\n   Must be eligible to obtain and maintain a government of Canada “Reliability” status and Level 2 (Secret) security clearance.\n \n \n  Our culture:\n  L3Harris MAS cultivates an inclusive and stimulating work environment that empowers employees and promotes work-life balance. Our values (integrity, respect, excellence), community dedication and commitment to excel in everything we do are the foundation of our culture.\n \n  We are proud to be an Equal Opportunity Employer and are committed to treating all employees and applicants for employment with respect and dignity and maintaining a workplace that is free from unlawful discrimination. All applicants will be considered for employment without regard to race, color, religion, age, national origin, ancestry, ethnicity, gender (including pregnancy, childbirth, breastfeeding or other related medical conditions), gender identity, gender expression, sexual orientation, marital status, veteran status, disability, genetic information, citizenship status, characteristic or membership in any other group protected by federal, provincial or local laws. L3Harris maintains a drug-free workplace and performs pre-employment substance abuse testing and background checks, where permitted by law.\n \n  About L3Harris:\n  L3Harris Technologies is an agile global aerospace and defense technology innovator, delivering end-to-end solutions that meet customers’ mission-critical needs. The company provides advanced defense and commercial technologies across air, land, sea, space and cyber domains. L3Harris has approximately $18 billion in annual revenue, 48,000 employees and customers in more than 100 countries. L3Harris.com\n \n  Everything we do here has a direct impact on the protection and security of human lives.\n \n  We thank all applicants for their interest but only those selected for an interview will be contacted.\n  At L3Harris, we foster an inclusive, equitable and diverse workplace. L3Harris is committed to treating all employees and applicants for employment with respect and dignity and maintaining a workplace that is free from unlawful discrimination. For applicants with disabilities, we will provide you with accommodation so that you have what you need in order to be at your best.\n  L3Harris performs background checks prior to employment as all applicants must be eligible for registration with the Controlled Goods Program and obtain and maintain a positive security assessment. Some positions may require a government of Canada “Reliability” status and/or Level 2 (Secret) security clearance. In addition, L3Harris performs pre-employment substance abuse testing where required.",
    "preprocessed_description": "L3Harris is dedicated to recruiting and developing diverse, high-performing talent who are passionate about what they do. Our employees are unified in a shared dedication to our customers' mission and quest for professional growth. L3Harris provides an inclusive, engaging environment designed to empower employees and promote work-life success. Fundamental to our culture is an unwavering focus on values, dedication to our communities, and commitment to excellence in everything we do. L3Harris Technologies is the Trusted Disruptor for the global aerospace and defense industry. With customers' mission-critical needs always in mind, our more than 50,000 employees deliver end-to-end technology solutions connecting the space, air, land, sea and cyber domains. L3Harris MAS, a subsidiary of L3Harris Technologies, Inc., is an agile and innovative aerospace and defense technology company. Our 1000 employees provide complete military and commercial aviation modernization and upgrade solutions structural and avionics upgrades, aircraft component repair and overhaul, integrated logistics support, stripping and painting, field service support and technical publications, plus a full range of technical support services. Our specialized aviation facilities include component repair, overhaul and machining, aircraft hangars and other upgrade facilities, structural design and analysis, full-scale fatigue testing and aircraft fatigue management, as well as other engineering services - from mechanical engineering and avionics to electronics and systems engineering. Our customers perform on the world's most challenging front lines. They trust us to keep them prepared for what is next. We combine speed, innovation and flawless execution to ensure confidence and security in the world ahead. About your next Challenge as a Aircraft Maintenance Engineer (AME) - Mechanical (M2): Reporting to the Operations Supervisor the Aircraft Maintenance Engineer (AME M2) will perform work and be ready to sign a Maintenance Release for their work. The employee shall be the holder of a Transport Canada AME license, appropriately rated. The AME shall have demonstrated acceptable levels of knowledge of the AMO and its Quality Program and have been issued an ACA Authorization to sign a maintenance release in respect to work performed on aeronautical products. Their duties include but are not limited to: Performance of work, up to and including certification with approved processes. Reporting any un-airworthy conditions discovered (including Service Difficulties). Utilizing certified/calibrated standard measuring and test equipment. Familiarization with L3 MAS Policies and Processes. Marshalling, fueling and towing of aircraft. Maintaining a clean work area Assuming responsibility for his work as indicated by his signature/stamp; Performing duties such as repair, modification and maintenance of aircraft in accordance with approved maintenance procedures; Reporting any un-airworthy conditions discovered; Familiarisation of the MPM and related processes; Participating in the Safety Management System Program Committee on Aircraft, if requested. Qualifications: You must hold an AME M license and have qualifications on heavy aircraft in the following areas: Engine/Airframe interface; Environmental Control; Electrical System; Hydraulic System; Fuel System; Flight Control System. Eligibility Criteria: Must be eligible for registration with the Controlled Goods Program; Must be eligible to obtain and maintain a government of Canada \"Reliability\" status and Level 2 (Secret) security clearance. Our culture: L3Harris MAS cultivates an inclusive and stimulating work environment that empowers employees and promotes work-life balance. Our values (integrity, respect, excellence), community dedication and commitment to excel in everything we do are the foundation of our culture. We are proud to be an Equal Opportunity Employer and are committed to treating all employees and applicants for employment with respect and dignity and maintaining a workplace that is free from unlawful discrimination. All applicants will be considered for employment without regard to race, color, religion, age, national origin, ancestry, ethnicity, gender (including pregnancy, childbirth, breastfeeding or other related medical conditions), gender identity, gender expression, sexual orientation, marital status, veteran status, disability, genetic information, citizenship status, characteristic or membership in any other group protected by federal, provincial or local laws. L3Harris maintains a drug-free workplace and performs pre-employment substance abuse testing and background checks, where permitted by law. About L3Harris: L3Harris Technologies is an agile global aerospace and defense technology innovator, delivering end-to-end solutions that meet customers' mission-critical needs. The company provides advanced defense and commercial technologies across air, land, sea, space and cyber domains. L3Harris has approximately $18 billion in annual revenue, 48,000 employees and customers in more than 100 countries. L3Harris.com Everything we do here has a direct impact on the protection and security of human lives. We thank all applicants for their interest but only those selected for an interview will be contacted. At L3Harris, we foster an inclusive, equitable and diverse workplace. L3Harris is committed to treating all employees and applicants for employment with respect and dignity and maintaining a workplace that is free from unlawful discrimination. For applicants with disabilities, we will provide you with accommodation so that you have what you need in order to be at your best. L3Harris performs background checks prior to employment as all applicants must be eligible for registration with the Controlled Goods Program and obtain and maintain a positive security assessment. Some positions may require a government of Canada \"Reliability\" status and/or Level 2 (Secret) security clearance. In addition, L3Harris performs pre-employment substance abuse testing where required.",
    "processed_description": "L3Harris dedicate recruit develop diverse high perform talent passionate . employee unify share dedication customer' mission quest professional growth . l3harri provide inclusive engaging environment design empower employee promote life success . fundamental culture unwavering focus dedication community commitment excellence . Trusted Disruptor global aerospace defense industry . customer' mission critical mind employee deliver technology solution connect space air land sea cyber domain . L3Harris subsidiary agile innovative aerospace defense technology company . employee provide complete military commercial aviation modernization upgrade solution structural avionic upgrade aircraft component repair overhaul integrate logistic support stripping painting field service support technical publication range technical support service . specialized aviation facility include component repair overhaul machining aircraft hangar upgrade facility structural design analysis scale fatigue testing aircraft fatigue management engineering service mechanical engineering avionic electronic system engineering . customer perform world's challenging . trust prepared . combine speed innovation flawless execution ensure confidence security ahead . Challenge AME Mechanical M2 reporting Operations Supervisor AME M2 perform ready sign Maintenance Release . employee holder Transport AME license appropriately rate . AME demonstrate acceptable level knowledge issue ACA Authorization sign maintenance release respect perform aeronautical product . duty include limited performance include certification approve process . report airworthy condition discover include . utilize certify calibrate standard measuring test equipment . Familiarization . marshal fuel towing aircraft . maintain clean area assume responsibility indicate signature stamp perform duty repair modification maintenance aircraft approve maintenance procedure report airworthy condition discover process participate request . qualification hold AME license qualification heavy aircraft follow area Engine Airframe interface Hydraulic System Fuel System . Eligibility Criteria eligible registration eligible maintain government Reliability status Level secret security clearance . culture l3harris cultivate inclusive stimulate environment empower employee promote life balance . integrity respect excellence community dedication commitment excel foundation culture . Equal Employer committed treat employee applicant employment respect dignity maintain workplace free unlawful discrimination . applicant consider employment regard race color religion age national origin ancestry ethnicity gender include pregnancy childbirth breastfeeding relate medical condition gender identity gender expression sexual orientation marital status veteran status genetic information citizenship status characteristic membership group protect federal provincial local law . L3Harris maintain drug free workplace perform pre employment substance abuse testing background check permit law . l3harris technology agile global aerospace defense technology innovator deliver solution meet customer' mission critical . company provide advanced defense commercial technology air land sea space cyber domain . L3Harris annual revenue employee customer country . direct impact protection security human life . applicant interest select interview contact . L3Harris foster inclusive equitable diverse workplace . L3Harris committed treat employee applicant employment respect dignity maintain workplace free unlawful discrimination . applicant provide accommodation order good . L3Harris perform background check prior employment applicant eligible registration maintain positive security assessment . position require government Reliability status Level secret security clearance . addition L3Harris perform pre employment substance abuse testing require .",
    "results_group": {
        "extracted_noun_chunks": [
            "component repair overhaul machining aircraft hangar upgrade facility structural design analysis scale fatigue testing aircraft fatigue management engineering service mechanical engineering avionic electronic system engineering",
            "airworthy condition discover",
            "painting field service support technical publication range technical support service",
            "Trusted Disruptor global aerospace defense industry",
            "signature stamp",
            "logistic support",
            "background check prior employment applicant eligible registration",
            "L3Harris foster inclusive equitable diverse workplace",
            "duty",
            "treat employee applicant employment respect dignity",
            "life balance",
            "applicant",
            "eligible registration",
            "ready sign Maintenance Release",
            "customer' mission critical mind employee",
            "customer",
            "accommodation order",
            "qualification",
            "limited performance",
            "pre employment substance abuse testing background check permit law",
            "specialized aviation facility",
            "world's challenging",
            "pregnancy childbirth breastfeeding",
            "technology solution",
            "l3harris technology",
            "Eligibility Criteria",
            "culture",
            "structural avionic upgrade aircraft component repair overhaul",
            "drug free workplace",
            "solution",
            "responsibility",
            "maintenance procedure report airworthy condition discover process",
            "L3Harris",
            "recruit",
            "aeronautical product",
            "integrity respect excellence community dedication commitment excel foundation culture",
            "direct impact protection security",
            "fundamental culture unwavering focus dedication community commitment excellence",
            "request",
            "Operations Supervisor AME M2",
            "Equal Employer",
            "company",
            "positive security assessment",
            "inclusive engaging environment design empower employee",
            "acceptable level knowledge issue ACA Authorization sign maintenance release respect",
            "federal provincial local law",
            "confidence security",
            "employee holder Transport AME license",
            "marshal fuel towing aircraft",
            "AME",
            "trust",
            "applicant interest select interview contact",
            "L3Harris subsidiary",
            "space air land sea cyber domain",
            "workplace free unlawful discrimination",
            "government Reliability status Level secret security clearance",
            "employee",
            "life success",
            "inclusive stimulate environment",
            "customer' mission",
            "employment regard race color religion age national origin ancestry ethnicity gender",
            "position",
            "standard measuring test equipment",
            "certification approve process",
            "clean area",
            "agile innovative aerospace defense technology company",
            "human life",
            "advanced defense commercial technology air land sea space",
            "Familiarization",
            "speed innovation",
            "flawless execution",
            "l3harri",
            "genetic information",
            "complete military commercial aviation modernization upgrade solution",
            "agile global aerospace defense technology innovator",
            "addition",
            "AME license qualification heavy aircraft follow area Engine Airframe interface Hydraulic System Fuel System",
            "share dedication customer' mission quest professional growth",
            "cyber domain",
            "Challenge AME Mechanical M2"
        ],
        "combined_lemmatized_tokens": "L3Harris dedicate recruit develop diverse high perform talent passionate . employee unify share dedication customer' mission quest professional growth . l3harri provide inclusive engaging environment design empower employee promote life success . fundamental culture unwavering focus dedication community commitment excellence . Trusted Disruptor global aerospace defense industry . customer' mission critical mind employee deliver technology solution connect space air land sea cyber domain . L3Harris subsidiary agile innovative aerospace defense technology company . employee provide complete military commercial aviation modernization upgrade solution structural avionic upgrade aircraft component repair overhaul integrate logistic support stripping painting field service support technical publication range technical support service . specialized aviation facility include component repair overhaul machining aircraft hangar upgrade facility structural design analysis scale fatigue testing aircraft fatigue management engineering service mechanical engineering avionic electronic system engineering . customer perform world's challenging . trust prepared . combine speed innovation flawless execution ensure confidence security ahead . Challenge AME Mechanical M2 reporting Operations Supervisor AME M2 perform ready sign Maintenance Release . employee holder Transport AME license appropriately rate . AME demonstrate acceptable level knowledge issue ACA Authorization sign maintenance release respect perform aeronautical product . duty include limited performance include certification approve process . report airworthy condition discover include . utilize certify calibrate standard measuring test equipment . Familiarization . marshal fuel towing aircraft . maintain clean area assume responsibility indicate signature stamp perform duty repair modification maintenance aircraft approve maintenance procedure report airworthy condition discover process participate request . qualification hold AME license qualification heavy aircraft follow area Engine Airframe interface Hydraulic System Fuel System . Eligibility Criteria eligible registration eligible maintain government Reliability status Level secret security clearance . culture l3harris cultivate inclusive stimulate environment empower employee promote life balance . integrity respect excellence community dedication commitment excel foundation culture . Equal Employer committed treat employee applicant employment respect dignity maintain workplace free unlawful discrimination . applicant consider employment regard race color religion age national origin ancestry ethnicity gender include pregnancy childbirth breastfeeding relate medical condition gender identity gender expression sexual orientation marital status veteran status genetic information citizenship status characteristic membership group protect federal provincial local law . L3Harris maintain drug free workplace perform pre employment substance abuse testing background check permit law . l3harris technology agile global aerospace defense technology innovator deliver solution meet customer' mission critical . company provide advanced defense commercial technology air land sea space cyber domain . L3Harris annual revenue employee customer country . direct impact protection security human life . applicant interest select interview contact . L3Harris foster inclusive equitable diverse workplace . L3Harris committed treat employee applicant employment respect dignity maintain workplace free unlawful discrimination . applicant provide accommodation order good . L3Harris perform background check prior employment applicant eligible registration maintain positive security assessment . position require government Reliability status Level secret security clearance . addition L3Harris perform pre employment substance abuse testing require ."
    }
}