{
    "id": "6eba0d66fbafbaef",
    "company": "CHEO RESEARCH INSTITUTE",
    "positionName": "RI-24-003 Research Technician",
    "jobType": [],
    "location": "20 Marie-Curie Private, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-18T05:12:56.471Z",
    "url": "https://www.indeed.ca/rc/clk?jk=6eba0d66fbafbaef&from=jasx&tk=1hkikfdo3kecu801&bb=WxOhatT4U5HJji5qaEXltIhiYYiMtzDLUwRpFCNGEa8PhCmTIEHQ8UtpNCu9VoUE7eb9zYkCnp-I1L3RA3BdOribz-5FwSdf7uPk-Gke7LA4u40p0yJPYA%3D%3D&xkcb=SoC467M3FSgyYCQ9SB0JbzkdCdPP&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "JOB DESCRIPTION Posting # RI-24-003 \nPosting Period – January 17 to January 31, 2024 \nPOSITION: Research Technician\nTERM: Full-time (1.0 FTE) | 1 Year contract with possibility of extension\nSALARY: Will commensurate with skills and experience\nREPORTS TO: Dr. Jason Berman, Professor, Department of Pediatrics, CHEOResearch Institute\nChildren’s Hospital of Eastern Ontario Research Institute (“CHEO RI”) is the research arm of the Children’s Hospital of Eastern Ontario – Ottawa Children’s Treatment Centre (“CHEO”) and an affiliated institute of the University of Ottawa. CHEO is a beloved institution and workplace that is widely recognized for being an anchor in our community. CHEO RI works to create new knowledge and evidence to support CHEO in its provision of world-class care to our children. Our mission at CHEO RI is to connect exceptional talent and technology in pursuit of life-changing research for every child, youth, and family in our community and beyond.\nCHEO RI has an immediate requirement for a Research Technician. \nThe Berman lab is looking for a highly motivated individual with technical experience in general molecular biology techniques, including but not limited to DNA and RNA extraction, PCR and qPCR analysis, microscopy and zebrafish handling. The candidate should be able to demonstrate a record of a strong work ethic and enthusiasm to work independently while being part of a research team. The candidate will work in close collaboration with senior staff members and graduate students studying leukemia and leukemia predisposition syndromes.\nRESPONSIBILITIES \n\n Zebrafish handling, genotyping, breeding adults and microinjection of embryos\n Molecular cloning\n Gene-expression analysis by semi-quantitative RT-PCR and qPCR\n Whole-mount zebrafish embryo in situ hybridization and antibody labeling\n Flow cytometry and histology\n Fluorescent, brightfield and confocal microscopy\n Analyzing data and maintaining clear and accurate data records\n Independently identifying additional tasks which need to be performed\n Using appropriate safety procedures for handling, storage, and disposal of biological materials\n\nQUALIFICATIONS, SKILLS AND ABILITIES \n\n The candidate should have strong knowledge of and experience with molecular biology techniques\n Experience with zebrafish and gene editing is a plus, but all the training will be provided\n Minimum of a Bachelor’s degree in biological sciences and related experience\n Excellent interpersonal relations and communications skills, sound judgment and ability to foster a cooperative work environment\n Strong ability to organize and manage tasks\n High level of adaptability\n Attention to detail and excellent organizational skills\n Ability to learn and integrate new techniques & methodologies\n Proficiency in computer skills (Microsoft Office)\n\nWORKING CONDITIONS \nOn-site work in a research laboratory setting - Center for Advanced Research in Environmental Genomics (CAREG), 20 Marie-Curie Private, Ottawa, ON K1N 9B4\nOTHER REQUIREMENTS \n\n Eligible to work in Canada\n Compliance with CHEO RI’s universal COVID-19 vaccination policy\n Police record check\n\nTO APPLY \nInterested candidates please send your CV and cover letter as one PDF document with the subject line “Research Technician Application – Last name, First name” to Kristianne Galpin (kgalpin@cheo.on.ca).\nThe CHEO Research Institute values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants. Should an applicant require any accommodations during the application process, as per the Accessibility for Ontarians with Disabilities Act, please notify Human Resources at researchhr@cheo.on.ca.\nThe CHEO Research Institute seeks to increase equity, diversity and inclusion in all of its activities, including research, education and career development, patient, family and donor partnerships. We value diverse and non-traditional career paths and perspectives, and value skills such as resilience, collaboration, and relationship-building. We welcome applications from members of racialized minorities, Indigenous peoples, persons with disabilities, persons of minority sexual orientations and gender identities, and others with the skills and knowledge to productively engage with diverse communities.\nApplications will only be considered from those that are eligible to work in Canada. We thank all applicants for their interest, however, only those invited for an interview will be contacted.\nDESCRIPTION DE POSTE Numéro d’affichage RI-24-003 \nPériode d’affichage – Du 17 janvier 2024 au 31 janvier 2024 \nPOSTE : Technicien ou technicienne de recherche\nDURÉE : Poste à temps plein (1,0 ETP) d’un (1) an avec possibilité de prolongation\nSALAIRE : Proportionnel aux compétences et à l’expérience\nRELÈVE DE : Dr Jason Berman, professeur, département de pédiatrie, Institut de recherche de CHEO\nL’Institut de recherche du Centre hospitalier pour enfants de l’est de l’Ontario (« IR de CHEO ») est l’organisme de recherche du Centre de traitements pour enfants du Centre hospitalier pour enfants de l’est de l’Ontario situé à Ottawa (« CHEO ») et un institut affilié de l’Université d’Ottawa. CHEO est une institution et un milieu de travail que nous chérissons énormément et qui est largement reconnu pour être une source de soutien dans notre collectivité. L’IR de CHEO travaille pour créer de nouvelles connaissances et de nouvelles preuves pour soutenir CHEO dans sa prestation de soins de classe mondiale à nos enfants. Notre mission à l’IR de CHEO est de mettre en relation des talents et des technologies exceptionnels, dans le but de mener des recherches permettant de changer la vie de chaque enfant, adolescent et famille de notre communauté et au-delà.\nL’IR de CHEO a immédiatement besoin d’un(e) technicien(ne) de recherche.\nLe laboratoire Berman est à la recherche d’une personne très motivée ayant une expérience technique dans les techniques générales de biologie moléculaire, y compris, mais sans s’y limiter, l’extraction d’ADN et d’ARN, l’analyse PCR et qPCR, la microscopie et la manipulation du poisson zèbre. Le candidat ou la candidate doitêtre capable de démontrer une forte éthique de travail et un enthousiasme à travailler de manière indépendante tout en faisant partie d’une équipe de recherche. Le candidat ou la candidate travaillera en étroite collaboration avec des membres du personnel dirigeant et des étudiants diplômés étudiant la leucémie et les syndromes de prédisposition à la leucémie.\nRESPONSABILITÉS \n\n Manipulation du poisson zèbre, génotypage, reproduction des adultes et micro-injection des embryons\n Clonage moléculaire\n Analyse de l’expression génétique par RT-PCR semi-quantitative et qPCR\n Hybridation in situ d’embryons de poisson zèbre entiers et marquage d’anticorps\n Cytométrie en flux et histologie\n Microscopie fluorescente, à fond clair et confocale\n Analyser les données et tenir des registres de données clairs et précis\n Établir de manière indépendante les tâches supplémentaires à effectuer\n Utiliser les procédures de sécurité appropriées pour la manipulation, le stockage et l’élimination du matériel biologique\n\nQUALIFICATIONS, COMPÉTENCES ET CAPACITÉS \n\n Le candidat ou la candidate doit avoir de solides connaissances et une expérience des techniques de biologie moléculaire.\n Une expérience avec le poisson zèbre et l’édition de gènes est un plus, mais toute la formation sera fournie.\n Minimum d’un baccalauréat en sciences biologique et d’une expérience connexe.\n Excellentes relations interpersonnelles et compétences en communication, jugement sûr et capacité à favoriser un environnement de travail coopératif.\n Forte capacité d’organisation et de gestion des tâches.\n Haut niveau d’adaptabilité.\n Souci du détail et excellent sens de l’organisation.\n Capacité d’apprendre et d’intégrer de nouvelles techniques et méthodologies.\n Compétence en informatique (Microsoft Office).\n\nCONDITIONS DE TRAVAIL \nTravail sur place dans un laboratoire de recherche – Centre de recherche avancée en génomique environnementale (CRAGE), 20, Marie-Curie Private (Ottawa) ON K1N 9B4\nAUTRES EXIGENCES \n\n Admissible à travailler au Canada\n Respect de la politique de vaccination contre la COVID-19 du IR de CHEO;\n Vérification du casier judiciaire.\n\nPOUR POSTULER \nLes candidats et les candidates intéressés doivent envoyer leur CV et lettre de présentation en un seul document PDF en indiquant dans la ligne d’objet « Candidature technicien de recherche » – Nom, Prénom à Kristianne Galpin (kgalpin@cheo.on.ca).\nL’Institut de recherche de CHEO valorise la diversité et est un employeur qui souscrit au principe de l’égalité d’accès. Nous nous sommes engagés à fournir un environnement de travail inclusif et sans obstacle, en commençant par le processus d’embauche et nous sommes heureux de recevoir des demandes provenant de tous les candidats qualifiés. Si vous avez besoin de mesures d’adaptation pendant l’une des phases du processus de recrutement, conformément à la Loi sur l’accessibilité pour les personnes en situation de handicap de l’Ontario, veuillez communiquer avec les Ressources humaines à researchhr@cheo.on.ca.\nL’Institut de recherche CHEO cherche à accroître l’équité, la diversité et l’inclusion dans toutes ses activités, y compris la recherche, l’avancement professionnel, les partenariats avec les patients, la famille et les donateurs. Nous accordons de l’importance aux parcours de carrière et aux perspectives diversifiées et non traditionnelles et nous valorisons les compétences telles que la résilience, la collaboration et l’établissement de relations. Nous accueillons favorablement les demandes de membres de minorités raciales, d’Autochtones, de personnes en situation de handicap, de personnes ayant des orientations sexuelles minoritaires et des identités de genre, ainsi que d’autres personnes possédant les compétences et les connaissances nécessaires pour collaborer de façon productive avec diverses communautés.\nSeules les candidatures des personnes autorisées à travailler au Canada seront prises en considération. Nous remercions tous les candidats de leur intérêt, cependant, nous ne communiquerons qu’avec ceux qui seront convoqués à une entrevue.\nJob Type: Full-time\nSalary: $22.32-$32.32 per hour\nEducation:\n\n Bachelor's Degree (required)\n\nAbility to Commute:\n\n Ottawa, ON K1N 6N5 (required)\n\nWork Location: In person"
}