{
    "id": "5ac68376ca06abbb",
    "company": "Stantec",
    "positionName": "Construction Project Manager",
    "jobType": [
        "Temporary",
        "Part-time",
        "Full-time"
    ],
    "location": "3001331 Clyde Avenue, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-26T12:13:56.449Z",
    "url": "https://www.indeed.ca/rc/clk?jk=5ac68376ca06abbb&from=jasx&tk=1hl5dcuan2fci002&bb=meFSaZ2jpWfCb2DCBnnuQOo_HYI4tEiUaE79JNsL0mZ-K_UGPRfW8u-QhxigdS4IEoh6l_zPacjdTXWKCLnHSmrUI-cnH7QzeTQhylZHYDMDzkYJbPqn-w%3D%3D&xkcb=SoAC67M3FlS8FtXIwZ0MbzkdCdPP&vjs=3",
    "externalApplyLink": "https://stantec.jobs/ottawa-on/construction-project-manager/8EF967187B5849C2A28A0AA42CB12099/job/?vs=1554&utm_source=Indeed-DE&utm_medium=Job%20Aggregator&utm_campaign=Indeed",
    "companyDescription": "Communities are fundamental. Whether around the corner or across the globe, they provide a foundation, a sense of place and of belonging. That’s why at Stantec, we always design with community in mind. \r\n\r\nWe care about the communities we serve—because they’re our communities too. This allows us to assess what’s needed and connect our expertise, to appreciate nuances and envision what’s never been considered, to bring together diverse perspectives so we can collaborate toward a shared success.  \r\n\r\nWe’re designers, engineers, scientists, and project managers, innovating together at the intersection of community, creativity, and client relationships. Balancing these priorities results in projects that advance the quality of life in communities across the globe. \r\n\r\nStantec is a place where the best and brightest come to build on each other's talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best. Visit us at Stantec.com/careers ",
    "description": "Construction Project Manager - ( 240000D7 ) \n Description \n Stantec’s Ontario based Community Development group is a market leader in the real estate planning and development industry. Our experts lead their fields, collaborating on projects that are as technically challenging as they are impactful, creative, and fulfilling. We’re a place where you can apply your passion—and find endless opportunities to help make communities more equitable, resilient, and livable. \n Our multidisciplinary team covers planning and urban design, civil and stormwater engineering, landscape architecture, private site development, and construction management. We work with a diverse group of clients in land and site development, city-building and municipal projects, public realm and open space, and planning and development policy and strategy. Successful delivery of a diverse portfolio of projects and clients begins with insight and foresight into industry trends and engagement. \n Your opportunity \n This position is an intermediate to senior level position. As a Construction Project Manager, you will be working on Residential, Commercial, and Institutional infrastructure projects on our Field Services Team, as part of our Community Development Business Centre. We are looking to add new talent to what is already a strong and collaborative team of professionals of all ages, including some with up to 35 years of experience in land development and construction. We take pride in providing opportunity for professional growth and offer a unique constructive environment where you are able to see the efforts of your work take tangible shape in the roadways that we drive on, the parks that we play in, and the structures that we call home. \n Your Key Responsibilities \n The primary responsibilities for this role are varied; however generally involve the detailed management and coordination of construction for infrastructure projects in the Ottawa region and other Easter Ontario Municipalities. You will be working with Senior Construction Manager to assist our project management teams, to deliver infrastructure projects from a construction perspective including, development strategies, costing, construction coordination, compliance with designs and project specification and project closeout with turnover and acceptance by The City of Ottawa/other Municipalities. You must be very attentive to detail, well organized, have strong written and verbal communication skills and be able to prioritize multiple tasks as required. You must be committed to teamwork, as you may be working with multiple project teams on multiple infrastructure projects, in a very fast paced and dynamic work environment. Key Responsibilities include, but are not limited to: \n \n  Completing quantity take-offs from engineering drawings for use in construction contracts and for the preparation of opinions of probable cost. \n  Preparation of cost analysis and recommendations of costs for client consideration. \n  Overseeing contract administration, including contract preparation, execution, interpretation, cost and completion monitoring and control, review and preparation of progress payment certificates, change control reporting, and contract closeout. \n  Construction coordination, including liaison with contractors, City of Ottawa / other Municipalities staff, geotechnical consultants and construction surveyors, as well as other specialized consultants. \n  Review, coordination and implementation of erosion and sediment controls on active work sites. \n  Supervision, coaching and mentorship of junior observation staff. \n  Request documentation and review of compliance testing from sub consultants and The City of Ottawa, as well as ensure that all relevant data and reports are complete and confirm that contractors have completed all work as per engineering drawings and project specifications. \n  Ensure and participate as required that all final inspections with contractors, Municipalities and Stantec Staff are completed, in preparation for submission of completion certificates. \n  Meet, review and report to the project team, as well as clients on construction status, issues and concerns. \n  Actively participate and be engaged in the implementation of safety controls, attend safety meetings and actively promote safety and a safe work culture in the workplace. \n \n Qualifications \n Your Capabilities and Credentials \n \n  Ability to work with others on large complex projects that require teamwork and close collaboration, as you may be working on multiple teams on multiple infrastructure projects in a very fast paced and dynamic work environment. \n  Ability to solve problems using sound professional judgment, proactive creativity, and innovation. \n  Effective written and verbal communication skills. \n  Very well organized and highly attentive to details. \n  Able to work under and meet tight deadlines and prioritize multiple tasks as required. \n \n Education and Experience \n \n  An ideal candidate possesses the following attributes/qualifications: \n  At a minimum, a graduate of a post-secondary technical engineering or construction management program and/or a minimum of 8 years construction or resident consulting experience on residential land development or commercial infrastructure projects. \n  Design and drafting experience is an asset, however not a requirement. \n \n Position will primarily work in an office setting; may require some field work. \n This description is not a comprehensive listing of activities, duties or responsibilities that may be required of the employee and other duties, responsibilities and activities may be assigned or may be changed at any time with or without notice. \n Stantec is a place where the best and brightest come to build on each other’s talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best. \n Benefits Summary: Regular full-time and part-time employees will have access to health, dental, and vision plans, a well-being program, health care spending account, wellness spending accounts, group registered retirement savings plan, employee stock purchase program, group tax-free savings account, life and accidental death & dismemberment (AD&D) insurance, short-term/long-term disability plans, emergency travel benefits, tuition reimbursement, professional membership fee coverage, and paid time off. \n Temporary/casual employees will have access to group registered retirement savings plan, employee stock purchase program, and group tax-free savings account. \n The benefits information listed above may not apply to union positions because benefits for such positions are governed by applicable collective bargaining agreements. \n Primary Location : Canada-Ontario-Ottawa \n Organization : BC-1604 CommDev-CA Ottawa ON \n Employee Status : Regular \n Job Level : Individual Contributor \n Travel : No \n Schedule : Full-time \n Job Posting : Jan 25, 2024, 3:22:48 PM \n Req ID: 240000D7 \n Stantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans"
}