{
    "id": "55a37a3755f8be22",
    "companyDescription": "",
    "description": "Compensation Pay Range:\n \n  $21.83-$26.83\n \n \n   Job Description:\n \n \n  \n   \n     Please Note: If you are a current CHEO employee with access to Workday, please apply to this posting via the Workday application as an internal applicant.\n   \n   \n   \n     To successfully apply for this position, please submit your application by 11:59 pm the day before the advertised closing date in the posting to ensure your application is received.\n   \n   \n   \n     POSITION SUMMARY\n   \n   \n   \n     Provides clerical support services, ensures confidentiality and efficient conduct of business through the pharmacy department.\n   \n   \n   \n     RESPONSIBILITIES\n   \n   \n     Greet CHEO employees, visitors, patients and their families, identify the need and the urgency of the requests, provide information as required and notify the appropriate person to ensure the smooth functioning of the pharmacy reception area.\n     Receive and screen incoming calls to the pharmacy department, assess the urgency of the calls, provide information as required to the caller, take messages or refer the caller to the appropriate person.\n     Liaise with staff and coordinate retrieval of internal responses for matters requiring a reply.\n     Maintain continuous personal awareness of the Departments activities to interpret and direct for disposition, inquiries and directives from other services and the public by providing assistance and required information verbally and/or in writing.\n     Deliver medications within Pharmacy department, kidcare, and to the clinical ward in a timely and appropriate manner.\n     Provide support to the pharmacy staff on pharmacy non-regulated tasks.\n     Scan all paper files to patient chart.\n     Maintain files and order supplies as required within the areas of the department.\n     Photocopy, collate, fax and distribute documents. Proofread documents for grammar and spelling.\n     Type, transcribe dictated correspondence and format electronically based reports and correspondence; prepare spreadsheets; prepare documents for review.\n     Analyse and prioritize incoming mail and documents; distribute appropriately.\n     Establish, develop, and maintain various internal office support systems such as electronic databases, tracking systems, filing systems, monthly reports, BF systems, and confidential files.\n     Participate in staff and pharmacy technician meetings, departmental planning and communication activities, and special project assignments as required.\n     Participate in pharmacy quality assurance activities.\n     Keep work areas clean, organized, and functional.\n     Work cooperatively with all colleagues, promoting and maintaining harmonious inter and intra departmental relationships\n     Perform other duties as assigned.\n   \n   \n   \n     QUALIFICATIONS\n   \n   \n     Police Record Check (PRC) (Essential)\n     High School Diploma (Essential)\n     Minimum six (6) months of related experience (Essential)\n     Comprehensively use software including wordprocessing, spreadsheet, presentation, electronic mail.(Essential)\n     Use a voicemail system, photocopier, complex use of fax machine. (Essential)\n     Take steps to ensure timely completion of tasks by adjusting priorities as required. (Essential)\n     Adapt to changes to meet requirements. (Essential)\n     Communicate effectively and concisely, both orally and in writing. (Essential)\n     Work independently (Essential)\n     Research, collate, analyze and/or summarize information. (Essential)\n     Deal effectively with internal and external customers. (Essential)\n     Exercise sound judgement, discretion and a high degree of confidentiality. (Essential)\n     Bilingual (English/French) (Preferred)\n   \n   \n   \n    Please note you will be represented by the Ontario Federation Healthcare Workers – Laborers International Union of North America , (OFHCW-LiUNA).\n   \n   \n   \n     CHEO is committed to providing a safe environment for staff, patients, and visitors. Consistent with that commitment, all applicants must be fully vaccinated against COVID-19 to be considered for any staff or volunteer opportunities. Applicants are also strongly encouraged to receive their COVID-19 booster shots when eligible to protect against the spread of COVID-19. Upon hiring, presentation of government issued documentation confirming full vaccination must be provided, or presentation of supporting documentation of a valid medical contraindication or other reasonable consideration pursuant to the Ontario Human Rights Code.\n   \n   \n   \n     CHEO values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants.\n   \n   \n   \n     Should you require accommodation during any phase in the recruitment process, please contact Human Resources at \n    \n     jobs@cheo.on.ca\n    . All information received in relation to accommodation will be kept confidential and will be handled in compliance with the Accessibility for Ontarians with Disabilities Act.\n   \n   \n   \n     We thank all those who apply, however, only those to be interviewed will be contacted.\n   \n   \n   \n     Veuillez noter : Si vous êtes un employé actuel de CHEO et que vous avez accès à Workday, veuillez postuler à cette offre par l’entremise de l’application Workday à titre de candidat interne.\n   \n   \n   \n     Pour postuler avec succès à ce poste, veuillez soumettre votre candidature avant 23 h 59 le jour précédant la date de clôture annoncée dans l’annonce afin de vous assurer que votre candidature sera bien reçue.\n   \n   \n   \n     RÉSUMÉ DES FONCTIONS\n   \n   \n   \n     Le ou la titulaire fournit des services de soutien administratif et veille à la confidentialité et au fonctionnement efficace des affaires dans tout le service de pharmacie.\n   \n   \n   \n     RESPONSABILITÉS\n   \n   \n     Accueillir les employés de CHEO, les visiteurs, les patients et leurs familles, établir le besoin et l’urgence des demandes, fournir l’information au besoin et aviser la personne appropriée afin d’assurer le bon fonctionnement de l’aire de réception de la pharmacie.\n     Recevoir et filtrer les appels entrants au service de pharmacie, évaluer l’urgence des appels, fournir les informations nécessaires à l’appelant, prendre les messages ou renvoyer l’appelant à la personne appropriée.\n     Assurer la liaison avec le personnel et coordonner la récupération des réponses internes pour les questions nécessitant une réponse.\n     Se tenir constamment au courant des activités du service afin d’interpréter et de diriger les demandes d’élimination et de renseignements, ainsi que les directives émanant d’autres services et du public, en fournissant de l’aide et les renseignements requis, verbalement ou par écrit.\n     Livrer les médicaments au sein du service de pharmacie, de la pharmacie pédiatrique (KidCare) et du service clinique de manière opportune et appropriée.\n     Apporter son soutien au personnel de la pharmacie pour les tâches pharmaceutiques non réglementées.\n     Numériser tous les dossiers papier au dossier du patient.\n     Tenir à jour les dossiers et commander les fournitures nécessaires dans les secteurs du service.\n     Photocopier, assembler, télécopier et distribuer des documents. Corriger les erreurs de grammaire et d’orthographe qui se glissent dans les documents.\n     Dactylographier, transcrire la correspondance dictée et formater sous forme électronique des rapports et de la correspondance, préparer des feuilles de calcul, préparer des documents aux fins d’examen.\n     Analyser et classer par ordre de priorité le courrier et les documents entrants, et les distribuer de manière appropriée.\n     Établir, développer et maintenir divers systèmes internes de soutien de bureau, tels que des bases de données électroniques, des systèmes de suivi, des systèmes de classement, des rapports mensuels, des systèmes de rappel et des dossiers confidentiels.\n     Participer aux réunions du personnel et des techniciens en pharmacie, aux activités de planification et de communication du service et aux missions de projets spéciaux, au besoin.\n     Participer aux activités d’assurance qualité de la pharmacie.\n     Maintenir les aires de travail propres, organisées et fonctionnelles.\n     Travailler en collaboration avec tous les collègues en favorisant et en maintenant des relations harmonieuses entre les services et au sein des services.\n     Effectuer les autres tâches, telles qu’elles sont attribuées.\n   \n   \n   \n     QUALIFICATIONS\n   \n   \n     Vérification du casier judiciaire (Essentiel)\n     Diplôme de fin d’études secondaires (Essentiel)\n     Expérience pertinente d’au moins six (6) mois (Essentiel)\n     Connaissance pratique de logiciels de traitement de texte, de calcul, de présentation, de courrier électronique (Essentiel)\n     Utilisation d’un système de messagerie vocale, d’un photocopieur et d’un télécopieur complexe (Essentiel)\n     Adaptation de ses priorités afin de terminer ses tâches dans les délais requis (Essentiel)\n     Adaptation aux changements afin d’accomplir les tâches requises (Essentiel)\n     Capacité à communiquer avec efficacité et concision, verbalement et par écrit (Essentiel)\n     Capacité à travailler en autonomie (Essentiel)\n     Recherche, collecte, analyse et/ou résumé d’informations (Essentiel)\n     Capacité à traiter efficacement avec la clientèle interne et externe (Essentiel)\n     Faire preuve de discernement, de discrétion et d’un haut degré de confidentialité (Essentiel)\n     Bilinguisme (anglais et français) (Souhaitable)\n   \n   \n   \n    Veuillez noter que vous serez représenté(e) par le syndicat de la Fédération Ontarienne des travailleurs de la santé, LIUNA Local 1110.\n   \n   \n   \n     CHEO s’engage à offrir un environnement sécuritaire au personnel, aux patients et aux visiteurs. Conformément à cet engagement, tous les candidats doivent être entièrement vaccinés contre la COVID-19 pour être considérés comme des candidats pour tout emploi de personnel ou de bénévole. Les candidats sont également fortement encouragés à recevoir leurs doses de rappel contre la COVID-19 lorsqu’ils sont admissibles pour éviter la propagation de COVID-19. Lors de l’embauche, la présentation de documents gouvernementaux confirmant la vaccination complète doit être fournie, ou la présentation de documents justificatifs d’une contre-indication médicale valide ou d’une autre considération raisonnable en vertu du Code des droits de la personne de l’Ontario.\n   \n   \n   \n     CHEO valorise la diversité et est un employeur qui souscrit au principe de l’égalité d’accès. Nous nous sommes engagés à fournir un environnement de travail inclusif et sans obstacle, en commençant par le processus d’embauche et nous sommes heureux de recevoir des demandes provenant de tous les candidats qualifiés.\n   \n   \n   \n     Si vous avez besoin de mesures d’adaptation pendant une phase du processus de recrutement, veuillez communiquer avec les Ressources humaines à \n    \n     jobs@cheo.on.ca\n    . Tous les renseignements reçus concernant les mesures d’adaptation resteront confidentiels et seront traités conformément à la \n    Loi sur l’accessibilité pour les personnes handicapées de l’Ontario.\n   \n   \n   \n     Nous remercions toutes les personnes qui posent leur candidature; toutefois, nous ne communiquerons qu’avec celles qui seront convoquées à une entrevue.\n   \n  \n \n \n \n   Please note you will be represented by the Laborers International Union of North America , (LiUNA).\n \n \n \n   CHEO values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants.\n \n \n \n   Should you require accommodation during any phase in the recruitment process, please contact Human Resources at jobs@cheo.on.ca. All information received in relation to accommodation will be kept confidential and will be handled in compliance with the Accessibility for Ontarians with Disabilities Act.\n \n \n \n   We thank all those who apply, however, only those to be interviewed will be contacted.\n \n \n \n   Job Posting End Date (if applicable) :\n  January 12, 2024",
    "preprocessed_description": "Compensation Pay Range: $21.83-$26.83 Job Description: Please Note: If you are a current CHEO employee with access to Workday, please apply to this posting via the Workday application as an internal applicant. To successfully apply for this position, please submit your application by 11:59 pm the day before the advertised closing date in the posting to ensure your application is received. POSITION SUMMARY Provides clerical support services, ensures confidentiality and efficient conduct of business through the pharmacy department. RESPONSIBILITIES Greet CHEO employees, visitors, patients and their families, identify the need and the urgency of the requests, provide information as required and notify the appropriate person to ensure the smooth functioning of the pharmacy reception area. Receive and screen incoming calls to the pharmacy department, assess the urgency of the calls, provide information as required to the caller, take messages or refer the caller to the appropriate person. Liaise with staff and coordinate retrieval of internal responses for matters requiring a reply. Maintain continuous personal awareness of the Departments activities to interpret and direct for disposition, inquiries and directives from other services and the public by providing assistance and required information verbally and/or in writing. Deliver medications within Pharmacy department, kidcare, and to the clinical ward in a timely and appropriate manner. Provide support to the pharmacy staff on pharmacy non-regulated tasks. Scan all paper files to patient chart. Maintain files and order supplies as required within the areas of the department. Photocopy, collate, fax and distribute documents. Proofread documents for grammar and spelling. Type, transcribe dictated correspondence and format electronically based reports and correspondence; prepare spreadsheets; prepare documents for review. Analyse and prioritize incoming mail and documents; distribute appropriately. Establish, develop, and maintain various internal office support systems such as electronic databases, tracking systems, filing systems, monthly reports, BF systems, and confidential files. Participate in staff and pharmacy technician meetings, departmental planning and communication activities, and special project assignments as required. Participate in pharmacy quality assurance activities. Keep work areas clean, organized, and functional. Work cooperatively with all colleagues, promoting and maintaining harmonious inter and intra departmental relationships Perform other duties as assigned. QUALIFICATIONS Police Record Check (PRC) (Essential) High School Diploma (Essential) Minimum six (6) months of related experience (Essential) Comprehensively use software including wordprocessing, spreadsheet, presentation, electronic mail.(Essential) Use a voicemail system, photocopier, complex use of fax machine. (Essential) Take steps to ensure timely completion of tasks by adjusting priorities as required. (Essential) Adapt to changes to meet requirements. (Essential) Communicate effectively and concisely, both orally and in writing. (Essential) Work independently (Essential) Research, collate, analyze and/or summarize information. (Essential) Deal effectively with internal and external customers. (Essential) Exercise sound judgement, discretion and a high degree of confidentiality. (Essential) Bilingual (English/French) (Preferred) Please note you will be represented by the Ontario Federation Healthcare Workers – Laborers International Union of North America , (OFHCW-LiUNA). CHEO is committed to providing a safe environment for staff, patients, and visitors. Consistent with that commitment, all applicants must be fully vaccinated against COVID-19 to be considered for any staff or volunteer opportunities. Applicants are also strongly encouraged to receive their COVID-19 booster shots when eligible to protect against the spread of COVID-19. Upon hiring, presentation of government issued documentation confirming full vaccination must be provided, or presentation of supporting documentation of a valid medical contraindication or other reasonable consideration pursuant to the Ontario Human Rights Code. CHEO values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants. Should you require accommodation during any phase in the recruitment process, please contact Human Resources at jobs@cheo.on.ca . All information received in relation to accommodation will be kept confidential and will be handled in compliance with the Accessibility for Ontarians with Disabilities Act. We thank all those who apply, however, only those to be interviewed will be contacted. Veuillez noter : Si vous êtes un employé actuel de CHEO et que vous avez accès à Workday, veuillez postuler à cette offre par l'entremise de l'application Workday à titre de candidat interne. Pour postuler avec succès à ce poste, veuillez soumettre votre candidature avant 23 h 59 le jour précédant la date de clôture annoncée dans l'annonce afin de vous assurer que votre candidature sera bien reçue. RÉSUMÉ DES FONCTIONS Le ou la titulaire fournit des services de soutien administratif et veille à la confidentialité et au fonctionnement efficace des affaires dans tout le service de pharmacie. RESPONSABILITÉS Accueillir les employés de CHEO, les visiteurs, les patients et leurs familles, établir le besoin et l'urgence des demandes, fournir l'information au besoin et aviser la personne appropriée afin d'assurer le bon fonctionnement de l'aire de réception de la pharmacie. Recevoir et filtrer les appels entrants au service de pharmacie, évaluer l'urgence des appels, fournir les informations nécessaires à l'appelant, prendre les messages ou renvoyer l'appelant à la personne appropriée. Assurer la liaison avec le personnel et coordonner la récupération des réponses internes pour les questions nécessitant une réponse. Se tenir constamment au courant des activités du service afin d'interpréter et de diriger les demandes d'élimination et de renseignements, ainsi que les directives émanant d'autres services et du public, en fournissant de l'aide et les renseignements requis, verbalement ou par écrit. Livrer les médicaments au sein du service de pharmacie, de la pharmacie pédiatrique (KidCare) et du service clinique de manière opportune et appropriée. Apporter son soutien au personnel de la pharmacie pour les tâches pharmaceutiques non réglementées. Numériser tous les dossiers papier au dossier du patient. Tenir à jour les dossiers et commander les fournitures nécessaires dans les secteurs du service. Photocopier, assembler, télécopier et distribuer des documents. Corriger les erreurs de grammaire et d'orthographe qui se glissent dans les documents. Dactylographier, transcrire la correspondance dictée et formater sous forme électronique des rapports et de la correspondance, préparer des feuilles de calcul, préparer des documents aux fins d'examen. Analyser et classer par ordre de priorité le courrier et les documents entrants, et les distribuer de manière appropriée. Établir, développer et maintenir divers systèmes internes de soutien de bureau, tels que des bases de données électroniques, des systèmes de suivi, des systèmes de classement, des rapports mensuels, des systèmes de rappel et des dossiers confidentiels. Participer aux réunions du personnel et des techniciens en pharmacie, aux activités de planification et de communication du service et aux missions de projets spéciaux, au besoin. Participer aux activités d'assurance qualité de la pharmacie. Maintenir les aires de travail propres, organisées et fonctionnelles. Travailler en collaboration avec tous les collègues en favorisant et en maintenant des relations harmonieuses entre les services et au sein des services. Effectuer les autres tâches, telles qu'elles sont attribuées. QUALIFICATIONS Vérification du casier judiciaire (Essentiel) Diplôme de fin d'études secondaires (Essentiel) Expérience pertinente d'au moins six (6) mois (Essentiel) Connaissance pratique de logiciels de traitement de texte, de calcul, de présentation, de courrier électronique (Essentiel) Utilisation d'un système de messagerie vocale, d'un photocopieur et d'un télécopieur complexe (Essentiel) Adaptation de ses priorités afin de terminer ses tâches dans les délais requis (Essentiel) Adaptation aux changements afin d'accomplir les tâches requises (Essentiel) Capacité à communiquer avec efficacité et concision, verbalement et par écrit (Essentiel) Capacité à travailler en autonomie (Essentiel) Recherche, collecte, analyse et/ou résumé d'informations (Essentiel) Capacité à traiter efficacement avec la clientèle interne et externe (Essentiel) Faire preuve de discernement, de discrétion et d'un haut degré de confidentialité (Essentiel) Bilinguisme (anglais et français) (Souhaitable) Veuillez noter que vous serez représenté(e) par le syndicat de la Fédération Ontarienne des travailleurs de la santé, LIUNA Local 1110. CHEO s'engage à offrir un environnement sécuritaire au personnel, aux patients et aux visiteurs. Conformément à cet engagement, tous les candidats doivent être entièrement vaccinés contre la COVID-19 pour être considérés comme des candidats pour tout emploi de personnel ou de bénévole. Les candidats sont également fortement encouragés à recevoir leurs doses de rappel contre la COVID-19 lorsqu'ils sont admissibles pour éviter la propagation de COVID-19. Lors de l'embauche, la présentation de documents gouvernementaux confirmant la vaccination complète doit être fournie, ou la présentation de documents justificatifs d'une contre-indication médicale valide ou d'une autre considération raisonnable en vertu du Code des droits de la personne de l'Ontario. CHEO valorise la diversité et est un employeur qui souscrit au principe de l'égalité d'accès. Nous nous sommes engagés à fournir un environnement de travail inclusif et sans obstacle, en commençant par le processus d'embauche et nous sommes heureux de recevoir des demandes provenant de tous les candidats qualifiés. Si vous avez besoin de mesures d'adaptation pendant une phase du processus de recrutement, veuillez communiquer avec les Ressources humaines à jobs@cheo.on.ca . Tous les renseignements reçus concernant les mesures d'adaptation resteront confidentiels et seront traités conformément à la Loi sur l'accessibilité pour les personnes handicapées de l'Ontario. Nous remercions toutes les personnes qui posent leur candidature; toutefois, nous ne communiquerons qu'avec celles qui seront convoquées à une entrevue. Please note you will be represented by the Laborers International Union of North America , (LiUNA). CHEO values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants. Should you require accommodation during any phase in the recruitment process, please contact Human Resources at jobs@cheo.on.ca. All information received in relation to accommodation will be kept confidential and will be handled in compliance with the Accessibility for Ontarians with Disabilities Act. We thank all those who apply, however, only those to be interviewed will be contacted. Job Posting End Date (if applicable) : January 12, 2024",
    "processed_description": "compensation pay Range description note current CHEO employee access apply posting Workday application internal applicant . apply position submit application advertise closing posting ensure application receive . position summary provide clerical support service ensure confidentiality efficient conduct business pharmacy department . responsibility Greet CHEO employee visitor patient family identify urgency request provide information require notify appropriate person ensure smooth functioning pharmacy reception area . receive screen incoming pharmacy department assess urgency provide information require caller message refer caller appropriate person . liaise staff coordinate retrieval internal response matter require reply . maintain continuous personal awareness Departments activity interpret direct disposition inquiry directive service public provide assistance require information verbally writing . deliver medication Pharmacy department clinical ward timely appropriate manner . provide support pharmacy staff pharmacy regulated task . scan paper file patient chart . maintain file order supply require area department . photocopy collate fax distribute document . proofread document grammar spelling . type transcribe dictate correspondence format electronically base report correspondence prepare spreadsheet prepare document review . analyse prioritize incoming mail document distribute appropriately . establish develop maintain internal office support system electronic database tracking system file system monthly report confidential file . participate staff pharmacy technician meeting departmental planning communication activity special project assignment require . participate pharmacy quality assurance activity . area clean organize functional . cooperatively colleague promote maintain harmonious inter intra departmental relationship perform duty assign . qualification Police Record Check Essential High School Diploma Essential minimum Essential Comprehensively software include wordprocesse spreadsheet presentation electronic mail. essential voicemail system photocopier complex fax machine . essential step ensure timely completion task adjust priority require . essential adapt change meet requirement . essential Communicate effectively concisely orally writing . essential independently Essential Research collate analyze summarize information . essential deal effectively internal external customer . essential exercise sound judgement discretion high degree confidentiality . essential English French prefer note represent – LiUNA . CHEO commit provide safe environment staff patient visitor . consistent commitment applicant fully vaccinate covid consider staff volunteer . applicant encourage receive covid booster shot eligible protect spread covid . hiring presentation government issue documentation confirm vaccination provide presentation support documentation valid medical contraindication reasonable consideration pursuant . CHEO diversity equal employer . committed provide inclusive barrier free environment start hiring process interest qualified applicant . require accommodation phase recruitment process contact . information receive relation accommodation confidential handle compliance . apply interview contact . Veuillez noter employe actuel CHEO vous avez acces Workday cette offre par l'entremise l'application Workday titre candidat interne . pour postuler veuillez soumettre votre candidature avant . DES fonction titulaire administratif veille confidentialite au fonctionnement efficace des affaires dans . les visiteur les patient leurs familles fournir l'information au besoin aviser personne appropriee afin d'assurer bon fonctionnement l'aire reception pharmacie . Recevoir filtrer les appels entrants au service pharmacie evaluer l'urgence des appels fournir les information necessaires l'appelant prendre les message renvoyer l'appelant . Assurer liaison personnel coordonner recuperation des reponses internes pour les question necessitant une reponse . Se tenir constamment au courant des activites du service afin d'interpreter diriger les demandes d'elimination renseignements ainsi les directive emanant d'autres services du public fournissant l'aide les renseignement requis verbalement par ecrit . Livrer les medicaments au sein du service pharmacie pharmacie pediatrique du service clinique maniere opportune appropriee . personnel pour les tache pharmaceutique reglementees . . service . assembler telecopier distribuer des document . . formater sous forme electronique des rapports correspondance preparer des feuilles calcul preparer des document aux fins d'examen . Analyser classer par ordre priorite courrier les document entrant les distribuer maniere appropriee . des systemes suivi des systemes rappel des dossier confidentiel . Participer aux personnel des technicien pharmacie aux missions projets . Participer aux activites d'assurance qualite pharmacie . Maintenir les aires travail propres organisees fonctionnelle . travailler collaboration avec tous les collegues . Effectuer les autres tache telles qualification Essentiel Diplome fin d'etudes secondaire Essentiel mois Essentiel Connaissance pratique logiciels traitement texte calcul presentation Essentiel Utilisation d'un systeme messagerie vocale d'un photocopieur d'un telecopieur complexe Essentiel Adaptation ses priorites afin terminer ses tache dans les delais requis Essentiel adaptation aux changement afin d'accomplir les tache requise Essentiel Capacite communiquer avec efficacite concision verbalement par ecrit Essentiel collecte analyse resume d'information Essentiel capacite traiter efficacement clientele interne externe Essentiel Faire preuve discernement d'un haut degre confidentialite Essentiel Bilinguisme anglais francais Souhaitable noter vous serez represente par syndicat Federation Ontarienne des travailleurs sante LIUNA Local . personnel aux patient aux visiteur . Conformement cet engagement tous les candidats doivent etre entierement vaccines contre COVID pour etre consideres comme des candidats pour . candidats recevoir leurs doses rappel contre COVID admissible pour eviter propagation covid . confirmant vaccination complete raisonnable . employeur souscrit au principe l'egalite d'acces . nous nous sommes engages fournir environnement travail inclusif sans obstacle commencant par nous provenant tous les candidats qualifie . Si vous avez besoin mesures d'adaptation pendant une phase du processus recrutement humaine . Tous les renseignements recus concernant les mesures d'adaptation resteront seront traites conformement Loi sur l'accessibilite pour . nous remercion tout les personnes posent leur candidature toutefois nous ne communiquerons qu'avec celles seront convoquees une entrevue . note represent . CHEO diversity equal employer . committed provide inclusive barrier free environment start hiring process interest qualified applicant . require accommodation phase recruitment process contact . information receive relation accommodation confidential handle compliance . apply interview contact . posting applicable",
    "results_group": {
        "extracted_noun_chunks": [
            "essential English French",
            "candidats recevoir leurs doses rappel contre COVID",
            "reponse",
            "Assurer liaison personnel coordonner recuperation des reponses internes",
            "duty assign",
            "postuler veuillez soumettre votre candidature avant",
            "interview contact",
            "courrier",
            "qualified applicant",
            "Essentiel adaptation aux changement afin d'accomplir les tache requise",
            "reasonable consideration",
            "essential exercise sound judgement discretion high degree confidentiality",
            "des systemes suivi des systemes rappel des dossier confidentiel",
            "internal office support system electronic database tracking system file system monthly report confidential file",
            "question",
            "applicant",
            "screen incoming pharmacy department",
            "appropriate person",
            "clerical support service",
            "nous nous sommes",
            "Si vous avez besoin mesures d'adaptation pendant",
            "spreadsheet",
            "vaccination",
            "urgency",
            "support pharmacy staff pharmacy",
            "departmental planning communication activity special project assignment",
            "position submit application advertise closing posting",
            "d'acces",
            "necessitant",
            "incoming mail document",
            "file order supply",
            "direct disposition inquiry directive service public",
            "current CHEO employee access",
            "personnel",
            "correspondence format",
            "covid",
            "personnel des technicien pharmacie aux missions",
            "compliance",
            "area department",
            "Livrer les medicaments au sein du service pharmacie pharmacie pediatrique du service clinique maniere",
            "phase du processus recrutement",
            "photocopy",
            "smooth functioning pharmacy reception area",
            "safe environment staff patient visitor",
            "wordprocesse spreadsheet presentation electronic mail",
            "opportune appropriee",
            "inclusive barrier free environment",
            "des feuilles calcul",
            "confidentiality efficient conduct business pharmacy department",
            "responsibility",
            "position summary",
            "type transcribe",
            "tache pharmaceutique reglementees",
            "essential deal",
            "covid booster",
            "d'information",
            "assistance",
            "document review",
            "les delais",
            "fax distribute document",
            "document grammar spelling",
            "employeur souscrit au principe l'egalite",
            "continuous personal awareness Departments activity",
            "presentation government issue documentation",
            "essential Communicate",
            "essential voicemail system photocopier complex fax machine",
            "eviter propagation covid",
            "Essential High School Diploma Essential minimum Essential Comprehensively software",
            "DES fonction titulaire administratif veille confidentialite au fonctionnement efficace",
            "des document aux fins d'examen",
            "Tous les renseignements recus concernant les mesures d'adaptation resteront seront traites",
            "travailler collaboration",
            "CHEO diversity equal employer",
            "Workday application internal applicant",
            "eligible protect",
            "area",
            "timely completion task",
            "forme electronique des rapports correspondance",
            "COVID pour etre consideres comme des candidats",
            "Essentiel Capacite",
            "note",
            "staff pharmacy technician",
            "essential step",
            "fournir environnement travail inclusif sans obstacle commencant par nous provenant tous les candidats qualifie",
            "Greet CHEO employee visitor patient family",
            "change meet requirement",
            "urgency request",
            "harmonious inter intra departmental relationship",
            "Loi sur l'accessibilite pour",
            "reply",
            "les message renvoyer l'appelant",
            "liaise staff",
            "consistent commitment applicant",
            "task",
            "relation accommodation",
            "caller message",
            "CHEO",
            "Range description",
            "Effectuer les autres tache telles qualification Essentiel Diplome fin d'etudes secondaire Essentiel mois Essentiel Connaissance pratique logiciels traitement texte calcul presentation Essentiel Utilisation d'un systeme messagerie vocale d'un photocopieur d'un telecopieur complexe Essentiel Adaptation ses priorites afin terminer ses tache",
            "Participer aux activites",
            "medication Pharmacy department clinical ward timely appropriate manner",
            "application",
            "information",
            "Veuillez noter employe",
            "accommodation phase recruitment process contact",
            "electronically base report correspondence",
            "les",
            "Maintenir les aires travail propres organisees fonctionnelle",
            "Essential Research collate analyze",
            "assembler telecopier distribuer des document",
            "Police Record",
            "aux visiteur",
            "tous les collegues",
            "process interest",
            "demandes",
            "patient",
            "des affaires",
            "service",
            "priority require",
            "paper file patient chart",
            "retrieval internal response matter",
            "diversity equal employer",
            "les visiteur les patient leurs familles fournir l'information au besoin aviser personne appropriee afin d'assurer bon fonctionnement l'aire",
            "verbalement par ecrit",
            "CHEO vous avez",
            "communiquer",
            "caller appropriate person",
            "Se tenir constamment au",
            "pharmacy quality assurance activity",
            "Recevoir filtrer les appels entrants au service pharmacie evaluer l'urgence des appels fournir les information",
            "nous remercion tout les personnes posent leur candidature toutefois nous ne communiquerons qu'avec celles seront convoquees une entrevue",
            "Workday cette offre par l'entremise l'application Workday titre candidat interne"
        ],
        "combined_lemmatized_tokens": "compensation pay Range description note current CHEO employee access apply posting Workday application internal applicant . apply position submit application advertise closing posting ensure application receive . position summary provide clerical support service ensure confidentiality efficient conduct business pharmacy department . responsibility Greet CHEO employee visitor patient family identify urgency request provide information require notify appropriate person ensure smooth functioning pharmacy reception area . receive screen incoming pharmacy department assess urgency provide information require caller message refer caller appropriate person . liaise staff coordinate retrieval internal response matter require reply . maintain continuous personal awareness Departments activity interpret direct disposition inquiry directive service public provide assistance require information verbally writing . deliver medication Pharmacy department clinical ward timely appropriate manner . provide support pharmacy staff pharmacy regulated task . scan paper file patient chart . maintain file order supply require area department . photocopy collate fax distribute document . proofread document grammar spelling . type transcribe dictate correspondence format electronically base report correspondence prepare spreadsheet prepare document review . analyse prioritize incoming mail document distribute appropriately . establish develop maintain internal office support system electronic database tracking system file system monthly report confidential file . participate staff pharmacy technician meeting departmental planning communication activity special project assignment require . participate pharmacy quality assurance activity . area clean organize functional . cooperatively colleague promote maintain harmonious inter intra departmental relationship perform duty assign . qualification Police Record Check Essential High School Diploma Essential minimum Essential Comprehensively software include wordprocesse spreadsheet presentation electronic mail. essential voicemail system photocopier complex fax machine . essential step ensure timely completion task adjust priority require . essential adapt change meet requirement . essential Communicate effectively concisely orally writing . essential independently Essential Research collate analyze summarize information . essential deal effectively internal external customer . essential exercise sound judgement discretion high degree confidentiality . essential English French prefer note represent – LiUNA . CHEO commit provide safe environment staff patient visitor . consistent commitment applicant fully vaccinate covid consider staff volunteer . applicant encourage receive covid booster shot eligible protect spread covid . hiring presentation government issue documentation confirm vaccination provide presentation support documentation valid medical contraindication reasonable consideration pursuant . CHEO diversity equal employer . committed provide inclusive barrier free environment start hiring process interest qualified applicant . require accommodation phase recruitment process contact . information receive relation accommodation confidential handle compliance . apply interview contact . Veuillez noter employe actuel CHEO vous avez acces Workday cette offre par l'entremise l'application Workday titre candidat interne . pour postuler veuillez soumettre votre candidature avant . DES fonction titulaire administratif veille confidentialite au fonctionnement efficace des affaires dans . les visiteur les patient leurs familles fournir l'information au besoin aviser personne appropriee afin d'assurer bon fonctionnement l'aire reception pharmacie . Recevoir filtrer les appels entrants au service pharmacie evaluer l'urgence des appels fournir les information necessaires l'appelant prendre les message renvoyer l'appelant . Assurer liaison personnel coordonner recuperation des reponses internes pour les question necessitant une reponse . Se tenir constamment au courant des activites du service afin d'interpreter diriger les demandes d'elimination renseignements ainsi les directive emanant d'autres services du public fournissant l'aide les renseignement requis verbalement par ecrit . Livrer les medicaments au sein du service pharmacie pharmacie pediatrique du service clinique maniere opportune appropriee . personnel pour les tache pharmaceutique reglementees . . service . assembler telecopier distribuer des document . . formater sous forme electronique des rapports correspondance preparer des feuilles calcul preparer des document aux fins d'examen . Analyser classer par ordre priorite courrier les document entrant les distribuer maniere appropriee . des systemes suivi des systemes rappel des dossier confidentiel . Participer aux personnel des technicien pharmacie aux missions projets . Participer aux activites d'assurance qualite pharmacie . Maintenir les aires travail propres organisees fonctionnelle . travailler collaboration avec tous les collegues . Effectuer les autres tache telles qualification Essentiel Diplome fin d'etudes secondaire Essentiel mois Essentiel Connaissance pratique logiciels traitement texte calcul presentation Essentiel Utilisation d'un systeme messagerie vocale d'un photocopieur d'un telecopieur complexe Essentiel Adaptation ses priorites afin terminer ses tache dans les delais requis Essentiel adaptation aux changement afin d'accomplir les tache requise Essentiel Capacite communiquer avec efficacite concision verbalement par ecrit Essentiel collecte analyse resume d'information Essentiel capacite traiter efficacement clientele interne externe Essentiel Faire preuve discernement d'un haut degre confidentialite Essentiel Bilinguisme anglais francais Souhaitable noter vous serez represente par syndicat Federation Ontarienne des travailleurs sante LIUNA Local . personnel aux patient aux visiteur . Conformement cet engagement tous les candidats doivent etre entierement vaccines contre COVID pour etre consideres comme des candidats pour . candidats recevoir leurs doses rappel contre COVID admissible pour eviter propagation covid . confirmant vaccination complete raisonnable . employeur souscrit au principe l'egalite d'acces . nous nous sommes engages fournir environnement travail inclusif sans obstacle commencant par nous provenant tous les candidats qualifie . Si vous avez besoin mesures d'adaptation pendant une phase du processus recrutement humaine . Tous les renseignements recus concernant les mesures d'adaptation resteront seront traites conformement Loi sur l'accessibilite pour . nous remercion tout les personnes posent leur candidature toutefois nous ne communiquerons qu'avec celles seront convoquees une entrevue . note represent . CHEO diversity equal employer . committed provide inclusive barrier free environment start hiring process interest qualified applicant . require accommodation phase recruitment process contact . information receive relation accommodation confidential handle compliance . apply interview contact . posting applicable"
    }
}