{
    "id": "d1ed7ad78a866ebc",
    "companyDescription": "",
    "description": "Mallot Creek Group Inc. is truly a one-stop-shop where strategic business and engineering expertise accomplish all our client's needs. Our projects, reports, and recommendations are based on a genuine understanding of operational issues and are executable and results oriented. We are one of the leading firms in Canada, providing strategies and solutions to Clients throughout North America. \nWe provide a cohesive atmosphere and a dynamic, fast-paced environment. If you are looking for an opportunity that continually presents new challenges and rewards, we want to meet you!\nOur salaries are competitive within the industry, and we reward hard work! We offer shared-cost extended health and dental benefits, vision and wellness credits, continuing education reimbursement, access to mental and physical health supports, and an industry leading RRSP employer matching plan. Not to mention, our office is in one of the most beautiful villages in Ontario!\nSummary\nThe Mechanical Technologist will assist in the development and production of construction drawings utilizing REVIT and AutoCAD. The successful individual will have in-depth working knowledge and understanding of the construction industry, building systems, national, provincial, and local building codes, and by-laws. \nKey Responsibilities\n- Create engineering drawings for process and industrial building mechanical systems (plumbing, piping, HVAC, refrigeration) using computer-aided-design (CAD) and building-information-modeling (BIM) software.- Preparation and review of contract administration documentation.- Generate CAD and REVIT content to advance company standards.- Collaborate with clients, engineers, project managers, and trades to ensure client satisfaction and the achievement of project deliverables as required.- Perform site visits to assess existing conditions of mechanical systems.- Select appropriate mechanical equipment and plumbing fixtures as required for each project design including the sizing of piping and HVAC systems.- Provide written reports and logs as required.\nEssential Skills and Qualifications\n- Intermediate user of AutoCAD and REVIT (a portfolio of previous REVIT projects is required).- Solid understanding of applicable Ontario building codes and specifications.- Extensive knowledge and ability in the production of mechanical drawings and documents.- Must have own transportation and a willingness to travel.\nEducation and Experience\n- Completion of a College or University diploma or degree in Mechanical Engineering.- Minimum of two (2) years experience in a computer-aided drafting setting with a focus on mechanical engineering.- Drafting and related computer skills appropriate within industrial design is considered an asset.- Certified or working towards certification with a provincial professional association for engineering technicians and technologists, such as OACETT.- Previous hydronics experience is considered an asset.- Previous experience in the Agri-food, beverage, and/or pharmaceutical industries is considered an asset.\nSuccessful candidates will demonstrate:\n- Initiative and judgment in applying standard procedures and in problem solving.- Ability to deal with multiple tasks and conflicting deadlines in a fast-paced environment.- Strong customer service skills including presenting ideas and the ability to communicate effectively both verbally and in writing.- Understanding and ability of mechanical engineering principles and procedures.- Excellent organizational skills and strong attention to detail.- Proficiency in performing key responsibilities with minimal direction and oversight.- Willingness to learn and train those in need.- Ability to work in a high‐performance environment, deal with customers in a professional manner, and willingness to travel primarily within Ontario if required for projects.\nMallot Creek Group Inc. is an Equal Opportunity Employer and is committed to providing employment accommodation in accordance with the Accessibility for Ontarians with Disabilities Act, 2005 and the Ontario Human Rights Code. Mallot Creek Group Inc. will provide accommodation to applicants with disabilities throughout the recruitment, selection, and assessment process. If selected to participate in the recruitment, selection, and assessment process, please advise Human Resources of any accommodation(s) that you may require.\nJob Type: Full-time\nBenefits:\n\n Casual dress\n Company events\n Dental care\n Disability insurance\n Employee assistance program\n Extended health care\n Life insurance\n On-site gym\n On-site parking\n Paid time off\n RRSP match\n Tuition reimbursement\n Vision care\n Wellness program\n\nSchedule:\n\n Monday to Friday\n\nWork Location: On the road",
    "preprocessed_description": "Mallot Creek Group Inc. is truly a one-stop-shop where strategic business and engineering expertise accomplish all our client's needs. Our projects, reports, and recommendations are based on a genuine understanding of operational issues and are executable and results oriented. We are one of the leading firms in Canada, providing strategies and solutions to Clients throughout North America. We provide a cohesive atmosphere and a dynamic, fast-paced environment. If you are looking for an opportunity that continually presents new challenges and rewards, we want to meet you! Our salaries are competitive within the industry, and we reward hard work! We offer shared-cost extended health and dental benefits, vision and wellness credits, continuing education reimbursement, access to mental and physical health supports, and an industry leading RRSP employer matching plan. Not to mention, our office is in one of the most beautiful villages in Ontario! Summary The Mechanical Technologist will assist in the development and production of construction drawings utilizing REVIT and AutoCAD. The successful individual will have in-depth working knowledge and understanding of the construction industry, building systems, national, provincial, and local building codes, and by-laws. Key Responsibilities - Create engineering drawings for process and industrial building mechanical systems (plumbing, piping, HVAC, refrigeration) using computer-aided-design (Computer-Aided Design) and building-information-modeling (Building Information Modeling) software.- Preparation and review of contract administration documentation.- Generate Computer-Aided Design and REVIT content to advance company standards.- Collaborate with clients, engineers, project managers, and trades to ensure client satisfaction and the achievement of project deliverables as required.- Perform site visits to assess existing conditions of mechanical systems.- Select appropriate mechanical equipment and plumbing fixtures as required for each project design including the sizing of piping and HVAC systems.- Provide written reports and logs as required. Essential Skills and Qualifications - Intermediate user of AutoCAD and REVIT (a portfolio of previous REVIT projects is required).- Solid understanding of applicable Ontario building codes and specifications.- Extensive knowledge and ability in the production of mechanical drawings and documents.- Must have own transportation and a willingness to travel. Education and Experience - Completion of a College or University diploma or degree in Mechanical Engineering.- Minimum of two (2) years experience in a computer-aided drafting setting with a focus on mechanical engineering.- Drafting and related computer skills appropriate within industrial design is considered an asset.- Certified or working towards certification with a provincial professional association for engineering technicians and technologists, such as OACETT.- Previous hydronics experience is considered an asset.- Previous experience in the Agri-food, beverage, and/or pharmaceutical industries is considered an asset. Successful candidates will demonstrate: - Initiative and judgment in applying standard procedures and in problem solving.- Ability to deal with multiple tasks and conflicting deadlines in a fast-paced environment.- Strong customer service skills including presenting ideas and the ability to communicate effectively both verbally and in writing.- Understanding and ability of mechanical engineering principles and procedures.- Excellent organizational skills and strong attention to detail.- Proficiency in performing key responsibilities with minimal direction and oversight.- Willingness to learn and train those in need.- Ability to work in a high‐performance environment, deal with customers in a professional manner, and willingness to travel primarily within Ontario if required for projects. Mallot Creek Group Inc. is an Equal Opportunity Employer and is committed to providing employment accommodation in accordance with the Accessibility for Ontarians with Disabilities Act, 2005 and the Ontario Human Rights Code. Mallot Creek Group Inc. will provide accommodation to applicants with disabilities throughout the recruitment, selection, and assessment process. If selected to participate in the recruitment, selection, and assessment process, please advise Human Resources of any accommodation(s) that you may require. Job Type: Full-time Benefits: Casual dress Company events Dental care Disability insurance Employee assistance program Extended health care Life insurance On-site gym On-site parking Paid time off RRSP match Tuition reimbursement Vision care Wellness program Schedule: Monday to Friday Work Location: On the road",
    "processed_description": "shop strategic business engineering expertise accomplish client's . project report recommendation base genuine understanding operational issue executable result oriented . lead firm provide strategy solution client . provide cohesive atmosphere dynamic fast pace environment . continually challenge reward meet salary competitive industry reward hard offer share cost extended health dental benefit vision wellness credit continue education reimbursement access mental physical health support industry lead RRSP employer matching plan . mention office beautiful village Summary Mechanical Technologist assist development production construction drawing utilize . successful individual depth knowledge understanding construction industry building system national provincial local building code law . key Responsibilities create engineering drawing process industrial building mechanical system plumbing piping hvac refrigeration computer aid design computer Aided Design building information modeling review contract administration documentation. Generate Computer aid Design REVIT content advance company standards. collaborate client engineer project manager trade ensure client satisfaction achievement project deliverable site visit assess exist condition mechanical systems. select appropriate mechanical equipment plumbing fixture require project design include sizing piping hvac systems. provide write report log require . Essential Skills Qualifications Intermediate user AutoCAD REVIT portfolio previous REVIT project understanding applicable building code specifications. extensive knowledge production mechanical drawing documents. transportation willingness travel . education Completion College University diploma degree Mechanical Engineering. Minimum computer aid drafting setting focus mechanical engineering. Drafting relate computer skill appropriate industrial design consider certification provincial professional association engineering technician technologist OACETT. previous hydronic consider asset. previous Agri food beverage pharmaceutical industry consider asset . successful demonstrate initiative judgment apply standard procedure problem solving. deal multiple task conflict deadline fast pace environment. strong customer service skill include idea communicate effectively verbally mechanical engineering principle procedures. excellent organizational skill strong attention detail. proficiency perform key responsibility minimal direction oversight. Willingness learn train need. high‐performance environment deal customer professional manner willingness travel require project . commit provide employment accommodation . provide accommodation applicant recruitment selection assessment process . select participate recruitment selection assessment process advise accommodation require . type benefit casual dress company event dental care insurance Employee assistance program extended health care Life insurance site gym site parking Paid RRSP match Tuition reimbursement Vision care Wellness program Schedule Friday Location road",
    "results_group": {
        "extracted_noun_chunks": [
            "transportation willingness",
            "accommodation applicant recruitment selection assessment process",
            "successful individual depth knowledge",
            "standard procedure problem",
            "applicable building code specifications",
            "initiative judgment",
            "asset",
            "salary competitive industry reward",
            "Minimum computer aid",
            "shop strategic business engineering expertise",
            "high‐performance environment deal customer professional manner willingness travel",
            "plumbing piping hvac refrigeration computer aid design computer",
            "computer skill appropriate industrial design",
            "multiple task conflict deadline fast pace environment",
            "project report recommendation base",
            "Essential Skills Qualifications Intermediate user AutoCAD REVIT portfolio previous REVIT project",
            "Drafting",
            "client engineer project manager trade",
            "health care Life insurance site gym site parking Paid RRSP match Tuition reimbursement Vision care Wellness program Schedule Friday Location road",
            "Aided Design",
            "hard offer share cost extended health dental benefit vision wellness credit",
            "excellent organizational skill strong attention detail",
            "verbally mechanical engineering principle procedures",
            "key Responsibilities",
            "office beautiful village Summary Mechanical Technologist",
            "RRSP employer matching plan",
            "focus mechanical engineering",
            "reward",
            "development production construction drawing utilize",
            "piping hvac systems",
            "building information modeling review contract administration documentation",
            "engineering drawing process industrial building mechanical system",
            "type benefit casual dress company event dental care insurance Employee assistance program",
            "client satisfaction achievement project deliverable site visit",
            "cohesive atmosphere dynamic fast pace environment",
            "idea",
            "select appropriate mechanical equipment plumbing fixture",
            "condition mechanical systems",
            "proficiency",
            "operational issue",
            "Generate",
            "education Completion College University diploma degree Mechanical Engineering",
            "education reimbursement access",
            "accommodation",
            "certification provincial professional association engineering technician technologist OACETT",
            "previous Agri food beverage pharmaceutical industry",
            "strong customer service skill",
            "construction industry building system national provincial local building code law",
            "mental physical health support industry",
            "select participate recruitment selection assessment process",
            "employment accommodation",
            "Willingness",
            "lead firm",
            "strategy solution client",
            "project design",
            "previous hydronic consider asset",
            "key responsibility minimal direction oversight",
            "extensive knowledge production mechanical drawing documents",
            "Computer aid Design REVIT content advance company standards",
            "client",
            "project"
        ],
        "combined_lemmatized_tokens": "shop strategic business engineering expertise accomplish client's . project report recommendation base genuine understanding operational issue executable result oriented . lead firm provide strategy solution client . provide cohesive atmosphere dynamic fast pace environment . continually challenge reward meet salary competitive industry reward hard offer share cost extended health dental benefit vision wellness credit continue education reimbursement access mental physical health support industry lead RRSP employer matching plan . mention office beautiful village Summary Mechanical Technologist assist development production construction drawing utilize . successful individual depth knowledge understanding construction industry building system national provincial local building code law . key Responsibilities create engineering drawing process industrial building mechanical system plumbing piping hvac refrigeration computer aid design computer Aided Design building information modeling review contract administration documentation. Generate Computer aid Design REVIT content advance company standards. collaborate client engineer project manager trade ensure client satisfaction achievement project deliverable site visit assess exist condition mechanical systems. select appropriate mechanical equipment plumbing fixture require project design include sizing piping hvac systems. provide write report log require . Essential Skills Qualifications Intermediate user AutoCAD REVIT portfolio previous REVIT project understanding applicable building code specifications. extensive knowledge production mechanical drawing documents. transportation willingness travel . education Completion College University diploma degree Mechanical Engineering. Minimum computer aid drafting setting focus mechanical engineering. Drafting relate computer skill appropriate industrial design consider certification provincial professional association engineering technician technologist OACETT. previous hydronic consider asset. previous Agri food beverage pharmaceutical industry consider asset . successful demonstrate initiative judgment apply standard procedure problem solving. deal multiple task conflict deadline fast pace environment. strong customer service skill include idea communicate effectively verbally mechanical engineering principle procedures. excellent organizational skill strong attention detail. proficiency perform key responsibility minimal direction oversight. Willingness learn train need. high‐performance environment deal customer professional manner willingness travel require project . commit provide employment accommodation . provide accommodation applicant recruitment selection assessment process . select participate recruitment selection assessment process advise accommodation require . type benefit casual dress company event dental care insurance Employee assistance program extended health care Life insurance site gym site parking Paid RRSP match Tuition reimbursement Vision care Wellness program Schedule Friday Location road"
    }
}