{
    "id": "e6a37995c0d10582",
    "companyDescription": "We want to help you do what you do best. At CBI Health, our extensive national network is here to help you increase your local impact. By joining our care team, you’ll receive the independence and experienced support structure you need to provide life-changing care for your clients and their families. And while you do that, our team of over 13,000 healthcare professionals has your back!\r\n\r\nFor millions of Canadians, CBI Health is where better begins. We are Canada’s leading community healthcare provider, reliably delivering innovative Rehabilitation and Home Health care programs that help our clients achieve their health goals. With 250+ locations in more than 800 communities, people are at the heart of what we do. Every day, all across the country, our team members work together to make a meaningful difference in our clients’ lives and help shape healthcare for the better. \r\nLearn more about CBI Health.\r\n\r\nCompany Mission/Culture\r\nPeople are at the heart of what we do. Together, we serve local clients and communities by delivering nationally supported Rehabilitation and Home Health services. We also serve every member of our team by helping them achieve their health career goals through meaningful work and impactful outcomes.\r\n\r\nOur Purpose, Promise, and Values are what inform and guide this mission. These essential elements are at the heart of the decisions we make, the programs we implement, and the strategies we develop. Across the country, the CBI Health team is committed to delivering on Our Purpose, keeping Our Promise, and living Our Values in every community we serve.\r\n\r\nOur Purpose: The health and well-being of Canadians is at the heart of what we do. Every day, we make a meaningful difference in people’s lives by supporting them in achieving their goals. Together, we shape healthcare for the better. \r\n\r\nOur Promise: For our clients, we promise to always:  \r\nTreat you with dignity, respect and kindness \r\nUnderstand you, your goals and what matters most \r\nEngage, motivate, and inspire you on your health journey \r\nBring together our knowledge, expertise and experience to deliver the best care \r\nEarn and appreciate the trust you place in us \r\n\r\nOur Values:\r\nHeart – We are passionate about making a positive difference \r\nRespect – We accept and value everyone \r\nReliability – We do what we say we will do \r\nTeamwork – We work well together and support each other \r\nInnovation – We are committed to learning, improving and growing.\r\n \r\nLearn more about the CBI Health culture.\r\n\r\nDiversity Programs and Initiatives: CBI Health continually strives to be an inclusive organization and create a respectful work environment where everyone feels included and valued. Diversity in our workplace allows us to share and implement different perspectives, which we believe inevitably leads to better internal and external outcomes. Accepting and valuing everyone, part of Our Values, ensures that the CBI Health culture is strong, enhances the well-being of all team members, and allows us to effectively work together to fulfill Our Purpose: shaping healthcare for the better. \r\n\r\nOur employee-led Diversity, Equity and Inclusion (DEI) Committee is now in its third year running and continues to make great progress in developing meaningful initiatives to help team members feel safe and accepted as their authentic selves. Creating impactful new DEI initiatives and enhancing existing initiatives will remain a CBI Health priority moving forward.\r\n\r\nAwards: CBI Health is proud to be a national leader in the field of community healthcare. We are regularly recognized for our exemplary Rehabilitation and Home Health expertise, as well as our commitment to industry-recognized organizational best practices. ",
    "description": "Personal Support Worker, Ottawa \n  What we can offer you: \n  \n  Competitive wage between $21.85 - $23.99 in total compensation for direct care including travel pay \n  Full Time & Part Time Opportunities \n  Weekend and Evening Shift Premiums \n  Mileage Pay or Bus Pass reimbursement \n  Comprehensive benefits package \n  Paid orientation and ongoing training \n  Career Development and progression opportunities \n  Employee Assistance Program \n  Access to all necessary Personal Protective Equipment (PPE) \n  Flexible schedule and work arrangements \n  \n \n  Check with your recruiter on eligibility criteria to qualify for this bonus\n  \n  Do your life’s best work with us! \n  CBI Health is dedicated to improving the lives of both our clients and our healthcare team members. As you care for others, CBI Health will care for you by providing the Personal Protective Equipment, training and resources that you need to feel confident every day. \n  We’re committed to making a difference in people’s lives – and that starts with yours. You’ll enjoy a flexible schedule that allows you to achieve your goals at work and at home, with a balance of teamwork and independence. We have a team of Supervisors and motivated colleagues who are excited to meet and support you! \n  Your role with clients As a caring, responsible health care team member, you will support clients to be as safe and independent in their homes as possible, helping them to live their best lives. You will provide personal care to clients in their home, and may assist them to mobilize and perform light exercises. You will act at all times with the client and their family at the heart of all you do, observing, documenting, and reporting any changes in their condition to your Manager/Supervisor. You may be required to perform light housekeeping tasks as indicated in client care plans. \n  What you will need to be successful \n  \n  Your Personal Support Worker Certificate, or valid certification as a Home Support Worker, Home Support worker level II, Home Support worker level III, Health Care aid or personal attendant will be considered an asset \n  Students currently enrolled (post first year) in health care programs such as nursing, rehab, para medicine or have a valid certificate as a Developmental Support Worker or a valid certificate as an RN , RPN, or Practical Nurse, midwife or physician ( either domestic or internationally –trained ) or RN students with a minimum successful completion of year 1 \n  Current CPR and First Aid Certification \n  A clear Criminal Record Check with Vulnerable Sector Screening within the last 12 months \n  Proof of a negative TB test within the last 12 months and an up-to-date immunization record \n  Ability to travel from home to home within the Ottawa community \n  Commitment to work every other weekend \n  Strong verbal and written English communication skills required; the ability to communicate in French or other languages is considered an asset \n  Reliability and strong organization skills \n  Ability to safely lift up to 35 lbs. (16 kg) \n  \n About CBI Health \n  If you are passionate about offering a person-centered approach to care, this is your chance to do what you do best. Our interdisciplinary team enables you to collaborate with a variety of experts, explore your interests and achieve amazing results. We have more than 12,000 professionals working together to set the bar for best practices in the industry. For almost 50 years, we’ve flourished as an integrated network with a talented team of professionals just like you. Every day, we come together to help our clients and families live their best lives and achieve their personal goals and priorities – it all starts with you. \n  Join us at CBI Health - Because Your Care Matters \n  \n  CBI Health is committed to providing a diverse, equitable, and inclusive workplace where everyone feels safe and accepted as their authentic selves. We actively seek qualified candidates who share our commitment to equity and inclusion and contribute to the diversification of ideas and perspectives that help us innovate and provide the best possible care to our clients. \n  We are committed to fostering a positive experience for all Indigenous applicants whether you’re First Nations (status or non-status), Inuit or Metis and welcome applications from all individuals regardless of race, colour, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or any other characteristics that make each of us different. \n  In accordance with the Ontario Human Rights Code, Accessibility for Ontarians with Disabilities Act and CBI Policies on Accommodation, a request for accommodation will be accepted as part of our hiring process. Please inform your recruiter if you have any accommodation requests. \n   #HHEAST \n   #HHEAST",
    "preprocessed_description": "Personal Support Worker, Ottawa What we can offer you: Competitive wage between $21.85 - $23.99 in total compensation for direct care including travel pay Full Time & Part Time Opportunities Weekend and Evening Shift Premiums Mileage Pay or Bus Pass reimbursement Comprehensive benefits package Paid orientation and ongoing training Career Development and progression opportunities Employee Assistance Program Access to all necessary Personal Protective Equipment (PPE) Flexible schedule and work arrangements Check with your recruiter on eligibility criteria to qualify for this bonus Do your life's best work with us! CBI Health is dedicated to improving the lives of both our clients and our healthcare team members. As you care for others, CBI Health will care for you by providing the Personal Protective Equipment, training and resources that you need to feel confident every day. We're committed to making a difference in people's lives – and that starts with yours. You'll enjoy a flexible schedule that allows you to achieve your goals at work and at home, with a balance of teamwork and independence. We have a team of Supervisors and motivated colleagues who are excited to meet and support you! Your role with clients As a caring, responsible health care team member, you will support clients to be as safe and independent in their homes as possible, helping them to live their best lives. You will provide personal care to clients in their home, and may assist them to mobilize and perform light exercises. You will act at all times with the client and their family at the heart of all you do, observing, documenting, and reporting any changes in their condition to your Manager/Supervisor. You may be required to perform light housekeeping tasks as indicated in client care plans. What you will need to be successful Your Personal Support Worker Certificate, or valid certification as a Home Support Worker, Home Support worker level II, Home Support worker level III, Health Care aid or personal attendant will be considered an asset Students currently enrolled (post first year) in health care programs such as nursing, rehab, para medicine or have a valid certificate as a Developmental Support Worker or a valid certificate as an RN , RPN, or Practical Nurse, midwife or physician ( either domestic or internationally –trained ) or RN students with a minimum successful completion of year 1 Current CPR and First Aid Certification A clear Criminal Record Check with Vulnerable Sector Screening within the last 12 months Proof of a negative TB test within the last 12 months and an up-to-date immunization record Ability to travel from home to home within the Ottawa community Commitment to work every other weekend Strong verbal and written English communication skills required; the ability to communicate in French or other languages is considered an asset Reliability and strong organization skills Ability to safely lift up to 35 lbs. (16 kg) About CBI Health If you are passionate about offering a person-centered approach to care, this is your chance to do what you do best. Our interdisciplinary team enables you to collaborate with a variety of experts, explore your interests and achieve amazing results. We have more than 12,000 professionals working together to set the bar for best practices in the industry. For almost 50 years, we have flourished as an integrated network with a talented team of professionals just like you. Every day, we come together to help our clients and families live their best lives and achieve their personal goals and priorities – it all starts with you. Join us at CBI Health - Because Your Care Matters CBI Health is committed to providing a diverse, equitable, and inclusive workplace where everyone feels safe and accepted as their authentic selves. We actively seek qualified candidates who share our commitment to equity and inclusion and contribute to the diversification of ideas and perspectives that help us innovate and provide the best possible care to our clients. We are committed to fostering a positive experience for all Indigenous applicants whether you are First Nations (status or non-status), Inuit or Metis and welcome applications from all individuals regardless of race, colour, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or any other characteristics that make each of us different. In accordance with the Ontario Human Rights Code, Accessibility for Ontarians with Disabilities Act and CBI Policies on Accommodation, a request for accommodation will be accepted as part of our hiring process. Please inform your recruiter if you have any accommodation requests. #HHEAST #HHEAST",
    "processed_description": "Personal Support Worker offer competitive wage total compensation direct care include travel pay Opportunities Weekend Evening shift premium mileage pay Bus Pass reimbursement Comprehensive benefit package paid orientation ongoing training Career Development progression Employee Assistance Program Access PPE flexible schedule arrangement check recruiter eligibility criterion qualify bonus life's good dedicate improve life client healthcare team . care care provide training resource feel confident . committed difference people's life – start . enjoy flexible schedule allow achieve goal balance teamwork independence . team Supervisors motivated colleague excited meet support role client caring responsible health care team support client safe independent help live good life . provide personal care client assist mobilize perform light exercise . client family heart observe document report change condition Manager Supervisor . require perform light housekeeping task indicate client care plan . successful Personal Support Worker Certificate valid certification Support worker level III Health Care aid personal attendant consider currently enrol health care program nursing rehab valid certificate valid certificate RN midwife physician domestic internationally – train RN student minimum successful completion current cpr Aid Certification clear Criminal Record check vulnerable Sector Screening proof negative tb test immunization record travel community Commitment weekend Strong verbal write english communication skill require communicate french language consider asset reliability strong organization skill safely lift lb . CBI Health passionate offer person center approach care chance . interdisciplinary team enable collaborate variety expert explore interest achieve amazing result . professional set bar good practice industry . flourish integrate network talented team professional . help client family live good life achieve personal goal priority – start . join commit provide diverse equitable inclusive workplace feel safe accept authentic . actively seek qualified share commitment equity inclusion contribute diversification idea perspective help innovate provide good care client . committed foster positive indigenous applicant status status application individual race colour religion gender gender identity expression sexual orientation national origin genetic age veteran status characteristic . Accessibility Ontarians Disabilities request accommodation accept hiring process . inform recruiter accommodation request . HHEAST",
    "results_group": {
        "extracted_noun_chunks": [
            "bonus life's good dedicate",
            "travel pay Opportunities Weekend Evening shift premium mileage",
            "diverse equitable inclusive workplace",
            "diversification idea perspective help",
            "successful Personal Support Worker Certificate valid certification Support worker level III Health Care aid personal attendant",
            "meet support role client",
            "HHEAST",
            "document report change condition Manager Supervisor",
            "Accessibility Ontarians Disabilities",
            "good life",
            "asset reliability strong organization skill",
            "Strong verbal write english communication skill",
            "foster positive indigenous applicant status status application individual race colour religion gender gender identity expression",
            "amazing result",
            "client family",
            "care care",
            "orientation",
            "health care program nursing rehab valid certificate valid certificate RN midwife physician",
            "check vulnerable Sector Screening proof",
            "ongoing training Career Development progression Employee Assistance Program Access PPE flexible schedule arrangement check recruiter eligibility criterion",
            "goal balance teamwork independence",
            "network talented team",
            "Personal Support Worker",
            "good care client",
            "team Supervisors motivated colleague",
            "sexual orientation national origin",
            "light housekeeping task",
            "client care plan",
            "Bus Pass reimbursement Comprehensive benefit package",
            "committed difference people's life",
            "life client healthcare team",
            "safe independent help",
            "professional set bar good practice industry",
            "recruiter accommodation request",
            "collaborate variety expert",
            "personal goal priority",
            "interest",
            "commit",
            "competitive wage total compensation direct care",
            "authentic",
            "flexible schedule",
            "lb",
            "client family heart",
            "CBI Health passionate offer person center approach care chance",
            "qualified share commitment equity inclusion",
            "light exercise",
            "french language",
            "personal care client",
            "training resource",
            "start",
            "interdisciplinary team",
            "responsible health care team support client",
            "hiring process"
        ],
        "combined_lemmatized_tokens": "Personal Support Worker offer competitive wage total compensation direct care include travel pay Opportunities Weekend Evening shift premium mileage pay Bus Pass reimbursement Comprehensive benefit package paid orientation ongoing training Career Development progression Employee Assistance Program Access PPE flexible schedule arrangement check recruiter eligibility criterion qualify bonus life's good dedicate improve life client healthcare team . care care provide training resource feel confident . committed difference people's life – start . enjoy flexible schedule allow achieve goal balance teamwork independence . team Supervisors motivated colleague excited meet support role client caring responsible health care team support client safe independent help live good life . provide personal care client assist mobilize perform light exercise . client family heart observe document report change condition Manager Supervisor . require perform light housekeeping task indicate client care plan . successful Personal Support Worker Certificate valid certification Support worker level III Health Care aid personal attendant consider currently enrol health care program nursing rehab valid certificate valid certificate RN midwife physician domestic internationally – train RN student minimum successful completion current cpr Aid Certification clear Criminal Record check vulnerable Sector Screening proof negative tb test immunization record travel community Commitment weekend Strong verbal write english communication skill require communicate french language consider asset reliability strong organization skill safely lift lb . CBI Health passionate offer person center approach care chance . interdisciplinary team enable collaborate variety expert explore interest achieve amazing result . professional set bar good practice industry . flourish integrate network talented team professional . help client family live good life achieve personal goal priority – start . join commit provide diverse equitable inclusive workplace feel safe accept authentic . actively seek qualified share commitment equity inclusion contribute diversification idea perspective help innovate provide good care client . committed foster positive indigenous applicant status status application individual race colour religion gender gender identity expression sexual orientation national origin genetic age veteran status characteristic . Accessibility Ontarians Disabilities request accommodation accept hiring process . inform recruiter accommodation request . HHEAST"
    }
}