{
    "id": "d9de22542425b8dc",
    "company": "Ciena",
    "positionName": "Service Solution Architect IP",
    "jobType": [
        "Full-time"
    ],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-09T03:09:10.060Z",
    "url": "https://www.indeed.ca/rc/clk?jk=d9de22542425b8dc&from=jasx&tk=1hjm33n93k6rj800&vjs=3",
    "externalApplyLink": "https://careers.ciena.com/us/en/job/CIENUSR024294ENUS/Service-Solution-Architect-IP?utm_source=indeed&utm_medium=phenom-feeds",
    "companyDescription": "",
    "description": "Ciena is committed to our people-first philosophy. Our teams enjoy a culture focused on prioritizing a personalized and flexible work environment that empowers an individual’s passions, growth, wellbeing and belonging. We’re a technology company that leads with our humanity—driving our business priorities alongside meaningful social, community, and societal impact. \n \n .\n  How You Will Contribute:\n \n  Reporting to the Senior Director of Global Engineering and Learning Solutions, as a Service Solutions Architect, you will support the delivery of network transformation and modernization via a set of services that analyze the customer’s network, identify the network solutions (Ciena and/or third party), and plan the integration/conversion requirements to meet the customer’s needs. You will also play a key role supporting the Sales Account team, Product Line Manager, Engineering Account Owner on proposal activities designed to identify revenue (hardware and services) opportunities.\n \n \n   You will serve as a consultant to various Ciena teams to develop revenue (hardware and service opportunities) as well as support feature development and enhancement, test and validation procedures, and regularly guide product architects, security primes, and developers with their technology specialty.\n   You will track technology specific guidance and developments across the industry and create documentation and guidelines for product releases to be incorporated into security documentation packages.\n   You will work with both internal and external organizations to drive solutions for our customers. You’ll also perform technical oversight, including on-site customer engagements and support customer and internal architectural discussions and requirements.\n   You will provide advice on all aspect of the Telecommunication Network design from Layer 0 to Layer 3, including RESTFul API, creating multi-disciplinary technical innovations and solutions for the most complex or risky business situations.\n   You will support regional engineering teams on specific project deliverables, enabling the regions to be self-sufficient on all aspects of the engineering business, from tools to technology, enabling the creation and outcomes of audit and optimization service of telecommunication networks.\n \n \n   You will develop and present complex network modernization end to end solutions and perform network audits and architecture design to enable the introduction of complete end to end network modernization.\n   You will validate and test specific procedural steps in Ciena or Customer equipment laboratory.\n   You will provide leadership and technical consultation services to all Ciena field service teams, ensuring the proposed solutions are technically viable, meet customer requirements and provide maximum benefit to Ciena.\n   You will support pre-sales customer service estimates and act as a subject matter expert to close a solution lead proposal.\n \n \n  What Does Ciena Expect of You?\n \n \n   Curiosity – Exploration and research is driven by insatiable curiosity.\n   Initiative – You’re a self-starter who works with limited direction and is committed to delivering thoughtful, relevant and actionable insights.\n   Agility – you are readily able to make key decisions and manage competing and ever-changing account priorities.\n \n \n   Communication expertise – the ability to influence and tailor your message and ideas to the audience to ensure understanding and consensus.\n   An ability to go ‘up and down the ladder’ – capable of seeing the big picture, but also understanding the importance of details and analysis.\n   The flexibility to work independently and as part of a broader team – you thrive in a multi-disciplinary team environment, but are comfortable working independently as required.\n   Relationship builder – with an ability to influence, you’re able to quickly develop trusted connections and influence outcomes. Become a “trusted advisor” for the team, with our account executives and most importantly key external customers and researchers.\n   A commitment to innovation – you keep ahead of the market and competitive developments and are always keen to extrapolate current technologies into the future.\n \n \n  The Must Haves: \n \n \n  Excellent working knowledge of IP Networking protocols including OSPF, IS-IS, BGP, RSVP-TE, SR-MPLS, etc.\n   Understanding of Northbound integration language Netconf, YANG, SNMP, gNMI, etc.\n   Architecture experience with IP/MPLS networks across Tier 1 Service provider, Cloud Provider and Large Enterprise segments.\n   Previous experience in customer IP Network Architecture & Design, including managing successful customer engagements from initial requirements gathering, to HLD/LLD creation/validation, MOP execution and deployment.\n \n \n   Extensive IP Network Architecture/Design experience in planning and/or deploying IP/MPLS networks across a multitude of customer networks architectures (Access, Residential, Aggregation, Core, Peering, Data Center).\n   Ability to extract network design requirements through customer engagement and balance them with existing product capabilities to create a realizable/deployable design.\n   Minimum bachelor’s degree in computer science, Management Information Systems, Engineering or a related field coupled with extensive experience in a functional and/or technical project lead role in the telecommunications industry. \n  Executive communication and leadership experience and a proven ability to build partnerships and influence others.\n   Strong technical writing and presentation skills.\n   15+ years of proven experience within a Professional Services organization, with demonstrated people and thought leadership experience & consultancy skills.\n   Advanced knowledge of IP protocols and networking devices/technologies, SAOS software from Ciena and MCP (Manage, Control and Planning) NMS system from Ciena.\n   Experience in data analytics and working experience with BI platforms as well as with various software development methodologies and DevOps toolchains to drive faster innovations.\n   Working knowledge with Programing Languages such as Python or Java and Relational and NoSQL Databases.\n   A strong technical background with a working knowledge of Ciena's optical and packet technologies.\n \n \n  Assets:\n \n   CCNP and CCNE certification.\n   Experience specifically in the telecommunications equipment vendor industry.\n   Advanced degree in computer science or engineering\n   Project management experience\n \n \n  At Ciena, we are committed to building and fostering an environment in which our employees feel respected, valued, and heard. Ciena values the diversity of its workforce and respects its employees as individuals. We do not tolerate any form of discrimination.\n \n  Ciena is an Equal Opportunity Employer, including disability and protected veteran status.\n \n  If contacted in relation to a job opportunity, please advise Ciena of any accommodation measures you may require."
}