{
    "id": "58733fd95b8dc0dd",
    "companyDescription": "Together, with donors, recipients, employees, partners and volunteers, we are Canada’s lifeline. Our role is to provide lifesaving products and services in transfusion and transplantation for Canadian patients, and to safeguard Canada's systems of life essentials in blood, plasma, stem cells, and organs and tissues. \r\n\r\nThousands of Canadians depend on our programs every day. Our employees play a crucial role in ensuring products and services reach the right patients at the right time. \r\n\r\nIf you’re looking for a meaningful and inspiring career, where what you do matters, Canadian Blood Services is for you. ",
    "description": "Please note this role will work in a hybrid environment. The successful candidate will be working out of one of our locations with a mixture of on and off-site work based on the parameters for our operations to meet the needs of our donors, our staff and our communities. In addition to meet the needs of our operations, this role requires frequent travel to various locations across Canada. Currently, employees are expected to have an in-person presence for at least 40% of their work time. This requirement may vary depending upon circumstances.\n \n  Job category: Supervisory and management Job posting ID: 5079\n \n  Employment status: Regular full-time\n \n  Classification: PTS/MGT/IT B Salary/Rate of pay: $105,000 - $121,000\n \n  Application deadline: 2024-02-06 Please save a copy of the job posting, once the application deadline has passed, it will no longer be available.\n \n  Do you currently work for Canadian Blood Services? All employees must apply via the internal career page.\n \n  Together, we can make all the difference in the lives of others.\n \n  Be part of a dynamic, collaborative and caring organization committed to saving and improving lives. Thousands of patients depend on us every day for reliable access to safe blood, plasma, stem cells and organs and tissues.\n \n  If you are looking for a rewarding experience with a values and mission-driven team, join Canada’s Lifeline and make a meaningful difference.\n \n  We acknowledge that the work of Canadian Blood Services spans many Territories and Treaty areas across the country, and we are grateful for the Traditional Knowledge Keepers and Elders who have guided us in this important work. We recognize the land and waters that have inspired our work and offer gratitude to those Indigenous peoples on whose territory we work, live and play.\n \n  About the role Canadian Blood Services is looking for a Regular full time Senior Project Manager, to join our dynamic Organ and Tissue Donation and Transplantation (OTDT), Medical Affairs and Innovation team. The OTDT team works with the organ and tissue donation and transplantation (OTDT) community to improve national system performance. We do this through the development of leading practices, professional education, public awareness and data analysis and reporting. We also manage clinical programs that support the interprovincial sharing of organs.  As a member of the team, you may work in collaboration with medical advisors, regional organ donation organizations and transplant programs, professional societies, health care professionals, eye and tissue banks, HLA laboratories, advisory committees, Health Canada and the Organ Donation and Transplantation Collaborative, national and international research experts, as well as patient and public partners, including donors and their families, to advance and improve the performance and quality of the OTDT system in Canada.\n  As Senior Project Manager you will be responsible for the planning, management, development, implementation, and evaluation of complex multi-year projects that advance the performance of the organ and tissue donation and transplantation system in Canada. These projects may include clinical practice guidelines, policy frameworks, and evidence based leading practices. A key aspect of this work involves supporting translation of this knowledge to the bedside through public and professional education and training.\n  Formula for success\n \n   Leveraging your project management experience, you will lead or participate in the development of the project business case for complex, multi-year projects.\n   Utilizing your collaboration skills, you will work with the project team and steering committee to recruit project team members, while leveraging your leadership and engagement skills to oversee, support and direct project team members (including physicians) to stay engaged in the plan in order to effectively accomplish the goals and objectives of the project.\n   Drawing on your project leadership experience you will monitor and document the overall project plan and budget, ensuring the project meets timelines, targets and expectations based on the established parameters, and you will provide regular project status updates to all key stakeholders both internal and external on behalf of the project team.\n   Utilizing your communication, team-work skills and your project experience you will coordinate the activities of the project team, steering committee, internal and external stakeholders to develop the project plan, define deliverables, identify roles and responsibilities, establish timelines and communications, training strategies, implementation and evaluation strategies, risk management, costs, transition and close-out plans.\n   Drawing on your experience within organ donation, you will develop and deliver knowledge translation and implementation plans to support the adoption of guidelines into policy and clinical practice.\n   Perform other related duties as required.\n \n  Desired education and skills\n \n   Minimum of 5 years of experience in the field of organ and or tissue donation, transplantation or critical care, knowledge of the continuum of care in donation and transplantation\n   Completion of post-secondary education from a recognized academic institution, preferably a university or master’s degree in a related field.\n   Designation as a health professional is an asset (e.g. Registered Nurse; Registered Social Worker).\n   Evidence of ongoing professional development and leadership skills is required.\n   General management and leadership experience with the ability to create an engaged team environment that promotes high performance.\n   Experience managing multi-year projects including the development of project plans, briefing notes, and a demonstrated understanding of project management tools and techniques.\n   Experience in developing, implementing, and evaluating evidence-based leading practices and clinical practice guidelines.\n   Ability to analyze complex problems, interpret business needs and risks, synthesize research, translate analytics into meaningful information, and develop integrated solutions.\n   Certification in project management such as the Project Management Professional (PMP) designation is an asset..\n   Advanced verbal and written communications skills in English. French is also an asset.\n \n \n  What we offer you\n \n   4 weeks' vacation\n   Annual performance award up to 10%\n   Comprehensive group health, dental and vision benefits for you and your family\n   Defined benefit pension plan\n   Employee discounts, wellness program, professional resources\n \n \n  What you can expect\n \n   This role will work in a hybrid environment with requirements to be onsite at one of Canadian Blood Services office locations 40% of the time.\n   Travel requirements - travel will be required to attend meetings, projects, conferences, etc. with advanced notice provided.\n \n  Diversity and inclusion play a vital role in ensuring health equity for patients across Canada. We are committed to reflecting Canada’s population in our organization and fostering an environment where all employees can be their authentic selves, with equal opportunities to succeed and contribute.\n \n  Canadian Blood Services requires that all employees be fully vaccinated (COVID 19 vaccine doses as approved by Health Canada), subject to any medical or other human rights considerations. Persons who have been vaccinated outside of Canada must contact their local Public Health Unit in order to obtain a vaccine equivalency certificate.\n \n  If this role resonates with you, we encourage you to apply! This could be your first step towards a meaningful and inspiring career. Come to work each day knowing that you save lives.\n \n  We thank all applicants for their interest. However, only those considered for an interview or those invited to participate in an assessment will be contacted. Applicants who require accommodation should discuss their needs with us.",
    "preprocessed_description": "Please note this role will work in a hybrid environment. The successful candidate will be working out of one of our locations with a mixture of on and off-site work based on the parameters for our operations to meet the needs of our donors, our staff and our communities. In addition to meet the needs of our operations, this role requires frequent travel to various locations across Canada. Currently, employees are expected to have an in-person presence for at least 40% of their work time. This requirement may vary depending upon circumstances. Job category: Supervisory and management Job posting ID: 5079 Employment status: Regular full-time Classification: PTS/MGT/IT B Salary/Rate of pay: $105,000 - $121,000 Application deadline: 2024-02-06 Please save a copy of the job posting, once the application deadline has passed, it will no longer be available. Do you currently work for Canadian Blood Services? All employees must apply via the internal career page. Together, we can make all the difference in the lives of others. Be part of a dynamic, collaborative and caring organization committed to saving and improving lives. Thousands of patients depend on us every day for reliable access to safe blood, plasma, stem cells and organs and tissues. If you are looking for a rewarding experience with a values and mission-driven team, join Canada's Lifeline and make a meaningful difference. We acknowledge that the work of Canadian Blood Services spans many Territories and Treaty areas across the country, and we are grateful for the Traditional Knowledge Keepers and Elders who have guided us in this important work. We recognize the land and waters that have inspired our work and offer gratitude to those Indigenous peoples on whose territory we work, live and play. About the role Canadian Blood Services is looking for a Regular full time Senior Project Manager, to join our dynamic Organ and Tissue Donation and Transplantation (OTDT), Medical Affairs and Innovation team. The OTDT team works with the organ and tissue donation and transplantation (OTDT) community to improve national system performance. We do this through the development of leading practices, professional education, public awareness and data analysis and reporting. We also manage clinical programs that support the interprovincial sharing of organs. As a member of the team, you may work in collaboration with medical advisors, regional organ donation organizations and transplant programs, professional societies, health care professionals, eye and tissue banks, HLA laboratories, advisory committees, Health Canada and the Organ Donation and Transplantation Collaborative, national and international research experts, as well as patient and public partners, including donors and their families, to advance and improve the performance and quality of the OTDT system in Canada. As Senior Project Manager you will be responsible for the planning, management, development, implementation, and evaluation of complex multi-year projects that advance the performance of the organ and tissue donation and transplantation system in Canada. These projects may include clinical practice guidelines, policy frameworks, and evidence based leading practices. A key aspect of this work involves supporting translation of this knowledge to the bedside through public and professional education and training. Formula for success Leveraging your project management experience, you will lead or participate in the development of the project business case for complex, multi-year projects. Utilizing your collaboration skills, you will work with the project team and steering committee to recruit project team members, while leveraging your leadership and engagement skills to oversee, support and direct project team members (including physicians) to stay engaged in the plan in order to effectively accomplish the goals and objectives of the project. Drawing on your project leadership experience you will monitor and document the overall project plan and budget, ensuring the project meets timelines, targets and expectations based on the established parameters, and you will provide regular project status updates to all key stakeholders both internal and external on behalf of the project team. Utilizing your communication, team-work skills and your project experience you will coordinate the activities of the project team, steering committee, internal and external stakeholders to develop the project plan, define deliverables, identify roles and responsibilities, establish timelines and communications, training strategies, implementation and evaluation strategies, risk management, costs, transition and close-out plans. Drawing on your experience within organ donation, you will develop and deliver knowledge translation and implementation plans to support the adoption of guidelines into policy and clinical practice. Perform other related duties as required. Desired education and skills Minimum of 5 years of experience in the field of organ and or tissue donation, transplantation or critical care, knowledge of the continuum of care in donation and transplantation Completion of post-secondary education from a recognized academic institution, preferably a university or master's degree in a related field. Designation as a health professional is an asset (e.g. Registered Nurse; Registered Social Worker). Evidence of ongoing professional development and leadership skills is required. General management and leadership experience with the ability to create an engaged team environment that promotes high performance. Experience managing multi-year projects including the development of project plans, briefing notes, and a demonstrated understanding of project management tools and techniques. Experience in developing, implementing, and evaluating evidence-based leading practices and clinical practice guidelines. Ability to analyze complex problems, interpret business needs and risks, synthesize research, translate analytics into meaningful information, and develop integrated solutions. Certification in project management such as the Project Management Professional (PMP) designation is an asset.. Advanced verbal and written communications skills in English. French is also an asset. What we offer you 4 weeks' vacation Annual performance award up to 10% Comprehensive group health, dental and vision benefits for you and your family Defined benefit pension plan Employee discounts, wellness program, professional resources What you can expect This role will work in a hybrid environment with requirements to be onsite at one of Canadian Blood Services office locations 40% of the time. Travel requirements - travel will be required to attend meetings, projects, conferences, etc. with advanced notice provided. Diversity and inclusion play a vital role in ensuring health equity for patients across Canada. We are committed to reflecting Canada's population in our organization and fostering an environment where all employees can be their authentic selves, with equal opportunities to succeed and contribute. Canadian Blood Services requires that all employees be fully vaccinated (COVID 19 vaccine doses as approved by Health Canada), subject to any medical or other human rights considerations. Persons who have been vaccinated outside of Canada must contact their local Public Health Unit in order to obtain a vaccine equivalency certificate. If this role resonates with you, we encourage you to apply! This could be your first step towards a meaningful and inspiring career. Come to work each day knowing that you save lives. We thank all applicants for their interest. However, only those considered for an interview or those invited to participate in an assessment will be contacted. Applicants who require accommodation should discuss their needs with us.",
    "processed_description": "note role hybrid environment . successful location mixture site base parameter operation meet donor staff community . addition meet operation role require frequent travel location . currently employee expect person presence . requirement vary depend circumstance . category supervisory management post employment status PTS MGT salary rate pay application deadline save copy posting application deadline pass long . currently employee apply internal career . difference life . dynamic collaborative caring organization commit save improve life . patient depend reliable access safe blood plasma stem cell organ tissue . rewarding mission drive team join Canada's Lifeline meaningful difference . acknowledge span Territories Treaty area country grateful guide . recognize land water inspire offer gratitude indigenous people territory live play . role regular Senior Project Manager join dynamic Organ Tissue Donation Transplantation OTDT Medical Affairs Innovation team . OTDT teamwork organ tissue donation transplantation OTDT community improve national system performance . development lead practice professional education public awareness datum analysis reporting . manage clinical program support interprovincial sharing organ . team collaboration medical advisor regional organ donation organization transplant program professional society health care professional eye tissue bank HLA laboratory advisory committee national international research expert patient public partner include donor family advance improve performance quality OTDT system . Senior Project Manager responsible planning management development implementation evaluation complex multi project advance performance organ tissue donation transplantation system . project include clinical practice guideline policy framework evidence base lead practice . key aspect involve support translation knowledge bedside public professional education training . Formula success leverage project management lead participate development project business case complex multi project . utilize collaboration skill project team steering committee recruit project team leverage leadership engagement skill oversee support direct project team include physician stay engaged plan order effectively accomplish goal objective project . draw project leadership monitor document project plan budget ensure project meet timeline target expectation base establish parameter provide regular project status update key stakeholder internal external behalf project team . utilize communication team skill project coordinate activity project team steering committee internal external stakeholder develop project plan define deliverable identify role responsibility establish timeline communication training strategy implementation evaluation strategy risk management cost transition close plan . draw organ donation develop deliver knowledge translation implementation plan support adoption guideline policy clinical practice . perform relate duty require . desire education skill Minimum field organ tissue donation transplantation critical care knowledge continuum care donation transplantation Completion post secondary education recognize academic institution preferably university master's degree field . designation health professional asset Registered Social Worker . evidence ongoing professional development leadership skill require . general management leadership create engage team environment promote high performance . manage multi project include development project plan briefing note demonstrate understanding project management tool technique . develop implement evaluate evidence base leading practice clinical practice guideline . analyze complex problem interpret business risk synthesize research translate analytic meaningful information develop integrated solution . certification project management Project Management Professional PMP designation asset .. advance verbal write communication skill . asset . offer week' vacation annual performance award Comprehensive group health dental vision benefit family define benefit pension plan employee discount wellness program professional resource expect role hybrid environment requirement onsite Canadian Blood Services office location . travel requirement travel require attend meeting project conference . advanced notice provide . diversity inclusion play vital role ensure health equity patient . committed reflect Canada's population organization foster environment employee authentic equal succeed contribute . require employee fully vaccinate covid vaccine dose approve subject medical human consideration . person vaccinate contact order vaccine equivalency certificate . role resonate encourage apply step meaningful inspiring career . save life . applicant interest . consider interview invite participate assessment contact . applicant require accommodation discuss .",
    "results_group": {
        "extracted_noun_chunks": [
            "timeline target expectation base establish parameter",
            "reliable access safe blood plasma stem cell organ tissue",
            "development project business case complex multi project",
            "territory live play",
            "requirement",
            "dynamic Organ Tissue Donation Transplantation OTDT Medical Affairs Innovation team",
            "key stakeholder internal external behalf project team",
            "applicant",
            "development project plan briefing note",
            "certification project management Project Management Professional PMP designation asset",
            "copy posting application deadline",
            "accommodation",
            "dynamic collaborative caring organization",
            "participate assessment contact",
            "Canada's Lifeline meaningful difference",
            "role",
            "benefit pension plan employee discount wellness program professional resource",
            "complex problem",
            "attend meeting project conference",
            "integrated solution",
            "development lead practice",
            "project",
            "goal objective project",
            "asset",
            "life",
            "rewarding mission drive team",
            "category supervisory management post employment status",
            "apply step meaningful inspiring career",
            "team collaboration medical advisor regional organ donation organization transplant program professional society health care professional eye tissue bank HLA laboratory advisory committee national international research expert patient public partner",
            "PTS MGT salary rate pay application deadline",
            "applicant interest",
            "difference life",
            "engage team environment",
            "key aspect",
            "vital role",
            "evidence base leading practice clinical practice guideline",
            "gratitude indigenous people",
            "frequent travel location",
            "evidence",
            "travel requirement travel",
            "acknowledge span Territories Treaty area country grateful guide",
            "health equity patient",
            "successful location mixture site base parameter operation",
            "donor family advance",
            "circumstance",
            "role hybrid environment",
            "advanced notice provide",
            "education skill Minimum field organ tissue donation transplantation critical care knowledge continuum care donation transplantation Completion post secondary education",
            "engaged plan order",
            "project leadership monitor document project plan budget",
            "timeline communication training strategy implementation evaluation strategy risk management cost transition close plan",
            "internal career",
            "clinical program support interprovincial sharing organ",
            "donor staff community",
            "adoption guideline policy clinical practice",
            "Formula success leverage project management lead",
            "duty require",
            "land water inspire",
            "verbal write communication skill",
            "performance quality OTDT system",
            "support direct project team",
            "clinical practice guideline policy framework evidence base lead practice",
            "diversity inclusion",
            "employee",
            "regular Senior Project Manager",
            "designation health professional asset Registered Social Worker",
            "ongoing professional development leadership skill",
            "knowledge translation implementation plan support",
            "regular project status",
            "physician stay",
            "project plan",
            "analytic meaningful information",
            "patient",
            "collaboration skill project team steering committee recruit project team leverage leadership engagement skill",
            "academic institution",
            "person",
            "desire",
            "week' vacation annual performance award Comprehensive group health dental vision benefit family",
            "deliverable identify role responsibility",
            "general management leadership",
            "committee internal external stakeholder",
            "covid vaccine dose",
            "understanding project management tool technique",
            "OTDT teamwork organ tissue donation transplantation OTDT community",
            "subject medical human consideration",
            "interview",
            "Senior Project Manager responsible planning management development implementation evaluation complex multi project advance performance organ tissue donation transplantation system",
            "national system performance",
            "Canada's population organization foster environment employee",
            "support translation knowledge bedside public professional education training",
            "operation role",
            "addition",
            "organ donation",
            "person presence",
            "contact order vaccine equivalency certificate",
            "multi project",
            "role hybrid environment requirement",
            "high performance",
            "preferably university master's degree field",
            "business risk synthesize research"
        ],
        "combined_lemmatized_tokens": "note role hybrid environment . successful location mixture site base parameter operation meet donor staff community . addition meet operation role require frequent travel location . currently employee expect person presence . requirement vary depend circumstance . category supervisory management post employment status PTS MGT salary rate pay application deadline save copy posting application deadline pass long . currently employee apply internal career . difference life . dynamic collaborative caring organization commit save improve life . patient depend reliable access safe blood plasma stem cell organ tissue . rewarding mission drive team join Canada's Lifeline meaningful difference . acknowledge span Territories Treaty area country grateful guide . recognize land water inspire offer gratitude indigenous people territory live play . role regular Senior Project Manager join dynamic Organ Tissue Donation Transplantation OTDT Medical Affairs Innovation team . OTDT teamwork organ tissue donation transplantation OTDT community improve national system performance . development lead practice professional education public awareness datum analysis reporting . manage clinical program support interprovincial sharing organ . team collaboration medical advisor regional organ donation organization transplant program professional society health care professional eye tissue bank HLA laboratory advisory committee national international research expert patient public partner include donor family advance improve performance quality OTDT system . Senior Project Manager responsible planning management development implementation evaluation complex multi project advance performance organ tissue donation transplantation system . project include clinical practice guideline policy framework evidence base lead practice . key aspect involve support translation knowledge bedside public professional education training . Formula success leverage project management lead participate development project business case complex multi project . utilize collaboration skill project team steering committee recruit project team leverage leadership engagement skill oversee support direct project team include physician stay engaged plan order effectively accomplish goal objective project . draw project leadership monitor document project plan budget ensure project meet timeline target expectation base establish parameter provide regular project status update key stakeholder internal external behalf project team . utilize communication team skill project coordinate activity project team steering committee internal external stakeholder develop project plan define deliverable identify role responsibility establish timeline communication training strategy implementation evaluation strategy risk management cost transition close plan . draw organ donation develop deliver knowledge translation implementation plan support adoption guideline policy clinical practice . perform relate duty require . desire education skill Minimum field organ tissue donation transplantation critical care knowledge continuum care donation transplantation Completion post secondary education recognize academic institution preferably university master's degree field . designation health professional asset Registered Social Worker . evidence ongoing professional development leadership skill require . general management leadership create engage team environment promote high performance . manage multi project include development project plan briefing note demonstrate understanding project management tool technique . develop implement evaluate evidence base leading practice clinical practice guideline . analyze complex problem interpret business risk synthesize research translate analytic meaningful information develop integrated solution . certification project management Project Management Professional PMP designation asset .. advance verbal write communication skill . asset . offer week' vacation annual performance award Comprehensive group health dental vision benefit family define benefit pension plan employee discount wellness program professional resource expect role hybrid environment requirement onsite Canadian Blood Services office location . travel requirement travel require attend meeting project conference . advanced notice provide . diversity inclusion play vital role ensure health equity patient . committed reflect Canada's population organization foster environment employee authentic equal succeed contribute . require employee fully vaccinate covid vaccine dose approve subject medical human consideration . person vaccinate contact order vaccine equivalency certificate . role resonate encourage apply step meaningful inspiring career . save life . applicant interest . consider interview invite participate assessment contact . applicant require accommodation discuss ."
    }
}