{
    "id": "88e610f4664eaf2e",
    "companyDescription": "",
    "description": "Senior Landscape Architect - ( 2400009D ) \n Description \n Through design, we empower communities and help realize their potential. Our landscape architects create inspired spaces that reflect context and user needs along with our commitment to sustainability. We take a collaborative approach to design and believe that the best solutions are the product of diverse perspectives. \n Your Opportunity \n Stantec Planning and Landscape Architecture Group is seeking an experienced Landscape Architect to join our Ottawa team and assist on projects. Our location in the National Capital provides many unique opportunities to work on projects of local and national significance for private and government clients. \n We design urban parks and plazas, transportation corridors, waterfronts and mixed-use developments that enhance our communities. Our experienced inter-disciplinary team specializes in parks and open spaces, urban public spaces, multiuse pathways, roadway enhancements, commercial and residential developments, wetland creation, habitat enhancements, watercourse restoration, urban forestry, and low impact development. We connect the people, places, and resources that take a project from concept to reality. \n Your Key Responsibilities \n You will work with general supervision and direction on a variety of projects, ranging in size from urban in-fill projects to subdivision plans, as a team member of a larger project in collaboration with other professionals and experts. \n You will establish general landscape requirements; conduct preliminary site studies and assess potential to meet client specifications. You will carry out environmental impact studies. As part of our team, you will collaborate with skilled professionals on projects ranging from initial planning to decommission. \n Key responsibilities include but are not limited to: \n \n  Conceptualizes, designs, and documents landscape architectural designs. \n  Prepares design documents including reports, drawings, and construction specifications for assigned projects and has authority to sign and seal on design/plans. \n  Serves as technical design expert for projects and works with other team members to develop and execute design. \n  Communicates effectively with clients to resolve technical project issues. Present and explain reports and designs, and provide service to meet client’s goals. \n  Coordinates with other members of the design team to finalize the design of the development. \n  Effectively communicates with contractors to implement plan design. \n  Conducts site investigations and construction inspections including pre-design investigations. \n  Prepares proposals. \n  Collaborates with other disciplines and experts. \n \n Qualifications \n Your Capabilities and Credentials \n Through demonstrated progressively responsible experience in landscape architect project management, you have honed your planning and design development skills on urban space, commercial, residential, roadway or green space projects. \n Capabilities and credentials include but are not limited to: \n \n  Significant technical knowledge recognizing when problems are developing and initiating appropriate corrective actions using sound professional judgment, creativity, and innovation. \n  Familiarity with federal, provincial, and municipal approval process and standards. \n  Demonstrated experience in the preparation of designs and construction documents including specifications. \n  Proficient in relevant drafting/design software such as AutoCAD, SketchUp, Photoshop, InDesign, Illustrator and Adobe Acrobat with experience working with 3D rendering softwares an asset (Sketch-up, 3D Max). \n  Demonstrated industry practice knowledge and commitment to excellence in customer service. \n  Strong verbal and written communication and presentation skills. \n  Excellent organizational skills. \n  Positive team-oriented attitude. \n  Self-motivated and passionate about design and environmental stewardship. \n  Skills and ability to work closely with others as a team as well as independently. \n  Strong time management and critical thinking. \n  Strong problem-solving abilities along with a commitment to thrive in a proactive organization where client service is priority one. \n  Local and regional travel is expected, and the successful applicant shall supply his or her own vehicle. \n  Proficient in English or French. Bilingualism is an advantage. \n \n Education and Experience \n Applicants should have a full membership with the Ontario Association of Landscape Architects (OALA) or Association des architectes paysagistes du Québec (AAPQ). Applicants should demonstrate a minimum of 10 to 12 years of experience as a Landscape Architect and have a degree in Landscape Architecture or similar relevant certification. \n Please include the following additional required application materials: \n \n  A cover letter in PDF format indicating your background, interests, and goals in the field of landscape architecture, and any other relevant information you believe will support your application. \n  Two letters of recommendation in PDF format from individuals related to the field of landscape architecture and design. \n  Design Portfolio in PDF format. \n \n Application packages will be reviewed based upon creativity, critical thinking, and design communication skills. \n Typical office environment includes working with computers and remaining sedentary for long periods of time. Field work may include exposure to the elements including inclement weather. Current work requirements require working from home. Stantec will provide you a computer and you will have access remotely to project folders and files. \n This description is not a comprehensive listing of activities, duties or responsibilities that may be required of the employee and other duties, responsibilities and activities may be assigned or may be changed at any time with or without notice. \n Stantec is a place where the best and brightest come to build on each others’ talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best. \n Benefits Summary: Regular full-time and part-time employees will have access to health, dental, and vision plans, a well-being program, health care spending account, wellness spending accounts, group registered retirement savings plan, employee stock purchase program, group tax-free savings account, life and accidental death & dismemberment (AD&D) insurance, short-term/long-term disability plans, emergency travel benefits, tuition reimbursement, professional membership fee coverage, and paid time off. \n Temporary/casual employees will have access to group registered retirement savings plan, employee stock purchase program, and group tax-free savings account. \n The benefits information listed above may not apply to union positions because benefits for such positions are governed by applicable collective bargaining agreements. \n Primary Location : Canada-Ontario-Ottawa \n Organization : BC-1604 CommDev-CA Ottawa ON \n Employee Status : Regular \n Job Level : Individual Contributor \n Travel : Yes, 10 % of the Time \n Schedule : Full-time \n Job Posting : Jan 19, 2024, 8:32:51 AM \n Req ID: 2400009D \n Stantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans",
    "preprocessed_description": "Senior Landscape Architect - ( 2400009D ) Description Through design, we empower communities and help realize their potential. Our landscape architects create inspired spaces that reflect context and user needs along with our commitment to sustainability. We take a collaborative approach to design and believe that the best solutions are the product of diverse perspectives. Your Opportunity Stantec Planning and Landscape Architecture Group is seeking an experienced Landscape Architect to join our Ottawa team and assist on projects. Our location in the National Capital provides many unique opportunities to work on projects of local and national significance for private and government clients. We design urban parks and plazas, transportation corridors, waterfronts and mixed-use developments that enhance our communities. Our experienced inter-disciplinary team specializes in parks and open spaces, urban public spaces, multiuse pathways, roadway enhancements, commercial and residential developments, wetland creation, habitat enhancements, watercourse restoration, urban forestry, and low impact development. We connect the people, places, and resources that take a project from concept to reality. Your Key Responsibilities You will work with general supervision and direction on a variety of projects, ranging in size from urban in-fill projects to subdivision plans, as a team member of a larger project in collaboration with other professionals and experts. You will establish general landscape requirements; conduct preliminary site studies and assess potential to meet client specifications. You will carry out environmental impact studies. As part of our team, you will collaborate with skilled professionals on projects ranging from initial planning to decommission. Key responsibilities include but are not limited to: Conceptualizes, designs, and documents landscape architectural designs. Prepares design documents including reports, drawings, and construction specifications for assigned projects and has authority to sign and seal on design/plans. Serves as technical design expert for projects and works with other team members to develop and execute design. Communicates effectively with clients to resolve technical project issues. Present and explain reports and designs, and provide service to meet client's goals. Coordinates with other members of the design team to finalize the design of the development. Effectively communicates with contractors to implement plan design. Conducts site investigations and construction inspections including pre-design investigations. Prepares proposals. Collaborates with other disciplines and experts. Qualifications Your Capabilities and Credentials Through demonstrated progressively responsible experience in landscape architect project management, you have honed your planning and design development skills on urban space, commercial, residential, roadway or green space projects. Capabilities and credentials include but are not limited to: Significant technical knowledge recognizing when problems are developing and initiating appropriate corrective actions using sound professional judgment, creativity, and innovation. Familiarity with federal, provincial, and municipal approval process and standards. Demonstrated experience in the preparation of designs and construction documents including specifications. Proficient in relevant drafting/design software such as AutoCAD, SketchUp, Photoshop, InDesign, Illustrator and Adobe Acrobat with experience working with 3D rendering softwares an asset (Sketch-up, 3D Max). Demonstrated industry practice knowledge and commitment to excellence in customer service. Strong verbal and written communication and presentation skills. Excellent organizational skills. Positive team-oriented attitude. Self-motivated and passionate about design and environmental stewardship. Skills and ability to work closely with others as a team as well as independently. Strong time management and critical thinking. Strong problem-solving abilities along with a commitment to thrive in a proactive organization where client service is priority one. Local and regional travel is expected, and the successful applicant shall supply his or her own vehicle. Proficient in English or French. Bilingualism is an advantage. Education and Experience Applicants should have a full membership with the Ontario Association of Landscape Architects (OALA) or Association des architectes paysagistes du Québec (AAPQ). Applicants should demonstrate a minimum of 10 to 12 years of experience as a Landscape Architect and have a degree in Landscape Architecture or similar relevant certification. Please include the following additional required application materials: A cover letter in PDF format indicating your background, interests, and goals in the field of landscape architecture, and any other relevant information you believe will support your application. Two letters of recommendation in PDF format from individuals related to the field of landscape architecture and design. Design Portfolio in PDF format. Application packages will be reviewed based upon creativity, critical thinking, and design communication skills. Typical office environment includes working with computers and remaining sedentary for long periods of time. Field work may include exposure to the elements including inclement weather. Current work requirements require working from home. Stantec will provide you a computer and you will have access remotely to project folders and files. This description is not a comprehensive listing of activities, duties or responsibilities that may be required of the employee and other duties, responsibilities and activities may be assigned or may be changed at any time with or without notice. Stantec is a place where the best and brightest come to build on each others' talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best. Benefits Summary: Regular full-time and part-time employees will have access to health, dental, and vision plans, a well-being program, health care spending account, wellness spending accounts, group registered retirement savings plan, employee stock purchase program, group tax-free savings account, life and accidental death & dismemberment (ADandD) insurance, short-term/long-term disability plans, emergency travel benefits, tuition reimbursement, professional membership fee coverage, and paid time off. Temporary/casual employees will have access to group registered retirement savings plan, employee stock purchase program, and group tax-free savings account. The benefits information listed above may not apply to union positions because benefits for such positions are governed by applicable collective bargaining agreements. Primary Location : Canada-Ontario-Ottawa Organization : BC-1604 CommDev-CA Ottawa ON Employee Status : Regular Job Level : Individual Contributor Travel : Yes, 10 % of the Time Schedule : Full-time Job Posting : Jan 19, 2024, 8:32:51 AM Req ID: 2400009D Stantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans",
    "processed_description": "Senior Landscape Architect 2400009d description design empower community help realize potential . landscape architect create inspire space reflect context user commitment sustainability . collaborative approach design good solution product diverse perspective . seek join team assist project . location provide unique project local national significance private government client . design urban park plaza transportation corridor waterfront mixed development enhance community . experienced inter disciplinary team specialize park open space urban public space multiuse pathway roadway enhancement commercial residential development wetland creation habitat enhancement watercourse restoration urban forestry low impact development . connect people place resource project concept reality . Key Responsibilities general supervision direction variety project range size urban fill project subdivision plan team large project collaboration professional expert . establish general landscape requirement conduct preliminary site study assess potential meet client specification . carry environmental impact study . team collaborate skilled professional project range initial planning decommission . key responsibility include limit conceptualize design document landscape architectural design . prepare design document include report drawing construction specification assign project authority sign seal design plan . serve technical design expert project team develop execute design . communicate effectively client resolve technical project issue . explain report design provide service meet client's goal . coordinate design team finalize design development . effectively communicate contractor implement plan design . conduct site investigation construction inspection include pre design investigation . prepare proposal . collaborate discipline expert . qualification Capabilities Credentials demonstrate progressively responsible landscape architect project management hone planning design development skill urban space commercial residential roadway green space project . capability credential include limit technical knowledge recognize problem develop initiate appropriate corrective action sound professional judgment creativity innovation . familiarity federal provincial municipal approval process standard . demonstrate preparation design construction document include specification . proficient relevant drafting design software InDesign Adobe Acrobat 3d render software asset Sketch . demonstrate industry practice knowledge commitment excellence customer service . strong verbal write communication presentation skill . excellent organizational skill . positive team orient attitude . motivated passionate design environmental stewardship . skill closely team independently . strong management critical thinking . strong problem solve commitment thrive proactive organization client service priority . local regional travel expect successful applicant supply vehicle . proficient . Bilingualism advantage . education Applicants membership paysagiste . applicant demonstrate minimum Landscape Architect degree relevant certification . include additional require application material cover letter PDF format indicate background interest goal field landscape architecture relevant information support application . letter recommendation PDF format individual relate field landscape architecture design . Design Portfolio PDF format . application package review base creativity critical thinking design communication skill . typical office environment include computer remain sedentary long period . field include exposure element include inclement weather . current requirement require . provide computer access remotely project folder file . description comprehensive listing activity duty responsibility require employee duty responsibility activity assign change notice . place good bright build other' talent exciting impact . join redefine personal good . benefit summary regular employee access health dental vision plan program health care spending account wellness spending account group register retirement saving plan employee stock purchase program group tax free saving account life accidental death dismemberment adandd insurance short term long term plan emergency travel benefit tuition reimbursement professional membership fee coverage pay . temporary casual employee access group register retirement saving plan employee stock purchase program group tax free saving account . benefit information list apply union position benefit position govern applicable collective bargaining agreement . Primary Location Organization BC schedule posting Req 2400009d provide equal employment qualified employee applicant future current employment prohibit discrimination ground race color religion sex national origin age marital status genetic information protect veteran status sexual orientation gender identity gender expression . prohibit discrimination decision concern recruitment hiring referral promotion compensation fringe benefit training termination condition employment . compliance local state federal law regulation ensure equitable aspect employment . EEO include protect Veterans",
    "results_group": {
        "extracted_noun_chunks": [
            "strong verbal write communication presentation skill",
            "education Applicants membership paysagiste",
            "retirement saving plan employee stock purchase program group tax free saving account",
            "additional require application material cover letter PDF format",
            "applicable collective bargaining agreement",
            "relevant information support application",
            "computer access",
            "discrimination decision concern recruitment",
            "landscape architect",
            "key responsibility",
            "field landscape architecture design",
            "compliance local state federal law regulation",
            "letter recommendation PDF format individual",
            "diverse perspective",
            "applicant",
            "contractor implement plan design",
            "employee duty responsibility activity",
            "coordinate design team",
            "appropriate corrective action sound professional judgment creativity innovation",
            "people place resource project concept reality",
            "exposure element",
            "unique project local national significance private government client",
            "personal good",
            "Bilingualism advantage",
            "context user commitment sustainability",
            "service meet client's goal",
            "report",
            "environmental impact study",
            "pre design investigation",
            "design document",
            "urban park plaza transportation corridor waterfront mixed development",
            "report design",
            "union position benefit position",
            "location",
            "discrimination ground race color religion sex national origin age marital status genetic information",
            "sexual orientation",
            "discipline expert",
            "change notice",
            "conduct site investigation construction inspection",
            "relevant certification",
            "problem",
            "Veterans",
            "experienced inter disciplinary team",
            "collaborative approach design good solution product",
            "technical project issue",
            "computer",
            "potential meet client specification",
            "proactive organization client service priority",
            "design",
            "temporary casual employee access group",
            "positive team orient attitude",
            "capability credential",
            "inclement weather",
            "software asset Sketch",
            "team",
            "remotely project folder file",
            "strong problem",
            "Primary Location Organization BC schedule",
            "technical knowledge",
            "familiarity federal provincial municipal approval process standard",
            "equal employment qualified employee applicant",
            "join team",
            "Key Responsibilities general supervision direction variety project range size urban fill project subdivision plan team large project collaboration professional expert",
            "benefit summary regular employee access health dental vision plan program health care spending account wellness spending account group",
            "relevant drafting design software InDesign Adobe Acrobat 3d",
            "referral promotion compensation",
            "preparation design construction document",
            "general landscape requirement conduct preliminary site study",
            "proposal",
            "benefit information list",
            "industry practice knowledge commitment excellence customer service",
            "specification",
            "client",
            "Req 2400009d",
            "community",
            "strong management critical thinking",
            "typical office environment",
            "successful applicant supply vehicle",
            "park open space urban public space multiuse pathway roadway enhancement commercial residential development wetland creation habitat enhancement watercourse restoration urban forestry low impact development",
            "construction specification assign project authority sign seal design plan",
            "field",
            "equitable aspect employment",
            "progressively responsible landscape architect project management hone planning design development skill urban space commercial residential roadway green space project",
            "retirement saving plan employee stock purchase program group tax free saving account life accidental death dismemberment adandd insurance short term long term",
            "current requirement",
            "2400009d description design empower community help",
            "technical design expert project team",
            "future current employment",
            "inspire space",
            "skilled professional project range initial planning decommission",
            "design development",
            "skill closely team",
            "background interest goal field landscape architecture",
            "emergency travel benefit tuition reimbursement professional membership fee coverage pay",
            "commitment",
            "local regional travel",
            "design document landscape architectural design",
            "qualification Capabilities Credentials",
            "EEO",
            "excellent organizational skill",
            "description comprehensive listing activity duty responsibility",
            "motivated passionate design environmental stewardship",
            "minimum Landscape Architect",
            "other' talent exciting impact",
            "application package review base creativity critical thinking design communication skill",
            "Senior Landscape Architect",
            "fringe benefit training termination condition employment",
            "Design Portfolio PDF format",
            "project"
        ],
        "combined_lemmatized_tokens": "Senior Landscape Architect 2400009d description design empower community help realize potential . landscape architect create inspire space reflect context user commitment sustainability . collaborative approach design good solution product diverse perspective . seek join team assist project . location provide unique project local national significance private government client . design urban park plaza transportation corridor waterfront mixed development enhance community . experienced inter disciplinary team specialize park open space urban public space multiuse pathway roadway enhancement commercial residential development wetland creation habitat enhancement watercourse restoration urban forestry low impact development . connect people place resource project concept reality . Key Responsibilities general supervision direction variety project range size urban fill project subdivision plan team large project collaboration professional expert . establish general landscape requirement conduct preliminary site study assess potential meet client specification . carry environmental impact study . team collaborate skilled professional project range initial planning decommission . key responsibility include limit conceptualize design document landscape architectural design . prepare design document include report drawing construction specification assign project authority sign seal design plan . serve technical design expert project team develop execute design . communicate effectively client resolve technical project issue . explain report design provide service meet client's goal . coordinate design team finalize design development . effectively communicate contractor implement plan design . conduct site investigation construction inspection include pre design investigation . prepare proposal . collaborate discipline expert . qualification Capabilities Credentials demonstrate progressively responsible landscape architect project management hone planning design development skill urban space commercial residential roadway green space project . capability credential include limit technical knowledge recognize problem develop initiate appropriate corrective action sound professional judgment creativity innovation . familiarity federal provincial municipal approval process standard . demonstrate preparation design construction document include specification . proficient relevant drafting design software InDesign Adobe Acrobat 3d render software asset Sketch . demonstrate industry practice knowledge commitment excellence customer service . strong verbal write communication presentation skill . excellent organizational skill . positive team orient attitude . motivated passionate design environmental stewardship . skill closely team independently . strong management critical thinking . strong problem solve commitment thrive proactive organization client service priority . local regional travel expect successful applicant supply vehicle . proficient . Bilingualism advantage . education Applicants membership paysagiste . applicant demonstrate minimum Landscape Architect degree relevant certification . include additional require application material cover letter PDF format indicate background interest goal field landscape architecture relevant information support application . letter recommendation PDF format individual relate field landscape architecture design . Design Portfolio PDF format . application package review base creativity critical thinking design communication skill . typical office environment include computer remain sedentary long period . field include exposure element include inclement weather . current requirement require . provide computer access remotely project folder file . description comprehensive listing activity duty responsibility require employee duty responsibility activity assign change notice . place good bright build other' talent exciting impact . join redefine personal good . benefit summary regular employee access health dental vision plan program health care spending account wellness spending account group register retirement saving plan employee stock purchase program group tax free saving account life accidental death dismemberment adandd insurance short term long term plan emergency travel benefit tuition reimbursement professional membership fee coverage pay . temporary casual employee access group register retirement saving plan employee stock purchase program group tax free saving account . benefit information list apply union position benefit position govern applicable collective bargaining agreement . Primary Location Organization BC schedule posting Req 2400009d provide equal employment qualified employee applicant future current employment prohibit discrimination ground race color religion sex national origin age marital status genetic information protect veteran status sexual orientation gender identity gender expression . prohibit discrimination decision concern recruitment hiring referral promotion compensation fringe benefit training termination condition employment . compliance local state federal law regulation ensure equitable aspect employment . EEO include protect Veterans"
    }
}