{
    "id": "ceb334b69c71c71a",
    "company": "VBI Vaccines Inc",
    "positionName": "Accounting Associate - 6 month Temporary Full Time Contract",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-17T18:51:15.062Z",
    "url": "https://www.indeed.ca/rc/clk?jk=ceb334b69c71c71a&from=jasx&tk=1hcvfjcolkedt800&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/applystart?jk=ceb334b69c71c71a&from=vj&pos=top&mvj=0&spon=0&sjdu=o7sfz71MPdMgyiV0LZq0d4DDplm6SwWjHcxyoDIphKmf1I0WPh2adj9ayRRGjSoskN0wkll9wDHc3mnStM4Hmg&vjfrom=serp&astse=c16546f576b22d74&assa=4687",
    "job_info_group": {
        "extracted_phone_numbers": [],
        "extracted_links": [
            "HTTP/HTTPS Links",
            "General Links",
            "WWW Links",
            "TLDs"
        ],
        "extracted_emails": [],
        "extracted_location_data": [],
        "extracted_dates": [
            "6 months"
        ],
        "extracted_languages": [
            "English"
        ],
        "extracted_laws": [],
        "extracted_norps": [],
        "extracted_orgs": [
            "internal controls & processes",
            "particularly MS Excel",
            "VBI",
            "requested Experience & Qualifications Diploma in Accounting General"
        ],
        "extracted_persons": [],
        "extracted_products": [],
        "extracted_money": [],
        "processed_text": "temporary contract open Finance team Accounting Associate . role responsible account payable administration accurate timely assistance preparation monthly paper reconciliation purchasing procurement laboratory material equipment assign administrative relate activity . role temporary contract role possibility extension . key responsibility handle assign activity relate account payable purchasing cycle include matching invoice purchase order support document Analysis invoice coordination payment approval follow vendor address vendor request Finance team assist preparation journal entry maintain account reconciliation consistent corporate accounting policy ensure tight timeline meet perform purchasing procurement shipping receipt duty Othr general office administration understanding require proficiency MS Office application advanced level require advanced organizational skill independently manage multiple initiative adapt change priority produce high quality deliverable pressured commitment excellent command verbal writing . diversity strengthen team – innovation creativity progress dependent insight team background belief culture . equal workplace commit create inclusive environment ."
    },
    "companyDescription": "",
    "description": "A full time temporary contract opportunity has opened up on our Finance team for an Accounting Associate. This role will be primarily responsible for accounts payable administration, the accurate and timely assistance with the preparation of the monthly working papers and reconciliations, purchasing and procurement of laboratory materials and equipment and other assigned administrative related activities.\n \n  The role is a temporary contract role for 6 months with the possibility of extension.\n  \n  \n  Key Responsibilities:\n \n  Handle assigned activities related to the accounts payable and purchasing cycle including:\n  \n \n  \n   Matching invoices to purchase orders and supporting documents \n  Analysis of invoices and coordination of payment approval \n  Follow up with vendors & address vendor requests \n  As part of the Finance team, assist in the preparation of journals entries and maintain account reconciliations consistent with corporate accounting policies to ensure that tight timelines are met \n  Performing purchasing, procurement, shipping and receipt duties \n  Othr general office administration as requested\n \n  \n  \n  Experience & Qualifications\n  \n  \n  \n  Diploma in Accounting \n  General understanding of internal controls & processes required \n  Proficiency in MS Office applications, particularly MS Excel at an advanced level is required \n  Advanced organizational skills to independently manage multiple initiatives, adapt to changing priorities and produce high-quality deliverables against pressured time commitments \n  Excellent command of English, both verbal and in writing.\n \n  \n  \n  At VBI, we believe diversity strengthens our team – innovation, creativity, and progress are dependent on the insight and experience that comes from a team with different backgrounds, beliefs, and cultures. We are proud to be an equal opportunity workplace and committed to creating an inclusive environment."
}