{
    "id": "2c6aec23e01a7668",
    "companyDescription": "",
    "description": "Health Canada - Health Products and Food Branch - Food Directorate \n    Ottawa (Ontario), Laval (Québec) \n    ST-UDE-NT \n    The student must be willing to work approx 35-40 hours per week for a period of 36 to 60 months in Laval, QC and sometimes in Ottawa, ON. \n    $26.72 to $34.59 per hour \n   For further information on the organization, please visit Health Canada \n   Learn more about the Research affiliate program \n   Closing date: 10 December 2023 - 23:59, Pacific Time \n   Who can apply: Persons residing in Canada, and Canadian citizens and Permanent residents abroad.\n    To be considered for Research Affiliate Program (RAP) work opportunities, you must meet the following criteria:\n    Be a full-time student in a post-secondary institution\n    Be enrolled in an academic program that requires research as part of your curriculum\n    Meet the minimum age required in the province/territory of work. Must be willing to work in both Laval, QC and on occasion in Ottawa, ON.\n    This includes students with physical or emotional disabilities deemed to have full-time status by their academic institution. Adult students registered in education and retraining programs at the secondary level may also be eligible for student employment programs. \n   Apply online \n  \n \n Important messages \n We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process. If you need to be accommodated during any phase of the evaluation process, please use the Contact information below to request specialized accommodation. All information received in relation to accommodation will be kept confidential.\n  Assessment accommodation \n \n  To be considered for Research Affiliate Program (RAP) work opportunities, you must meet the following criteria:\n   \n   \n  \n   Be recognized as having full-time student status by the post-secondary academic institution at which you are currently enrolled (see Education requirements listed below), or pending approval of acceptance (proof will be required).\n  \n   \n  \n   Be the minimum age to work in the province or territory where the job is located.\n  \n   \n  \n   The student will be expected to work approximately 35-40 hours per week and be willing to commit to the research project for a period of about 36 to 60 months. The candidate's RAP research activities must be aligned with their PhD Program that is being conducted to fulfill degree requirements at a recognized post-secondary institution.\n  \n   Health Canada is committed to increasing representation of Black employees and other racialized groups, Indigenous People, women and persons with disabilities. Health Canada would like its workforce to be reflective of the population it serves. Therefore, we encourage candidates to indicate voluntarily on their application if they are a member of one of these groups.\n   \n   Give yourself the best chance to succeed! As the objective of this process is to assess qualifications needed for the position(s) to be staffed, let us know if you have a functional limitation/ disability, which may affect your performance. For example, contact us if you need assistance in completing and submitting your application. Should you then proceed to the next assessment stage, such as an exam or interview, we will send you an e-mail with additional information on the assessment format so that you can determine if you may require an accommodation (such as a different test format, an adaptive technology, or additional time). Assessment accommodations are designed to remove the obstacles without altering the criteria being assessed so candidates with functional limitations can fully demonstrate their abilities.\n   You may also review jobs open to the public through INFOTEL at 1-800-645-5605. The INFOTEL number for persons using a TTY/TDD is 1-800-532-9397.\n   \n   Health Canada welcomes applications from Veterans. We recognize your contribution to Canadians and would like to offer you the opportunity to continue your career in an environment where multi-talented employees with diverse skills are appreciated and supported.\n   \n   EVERYONE IS WELCOME\n   Health Canada and the Public Health Agency are dedicated to building an inclusive workforce that comprises individuals who have an array of identities, abilities, background, culture, skills, perspectives, and experiences that are representative of Canada’s current and evolving population. We are passionate about fostering a workplace where all people feel welcome, can reach their full potential, and contribute their unique perspectives and experience to the success of the team.\n   \n   BRING YOUR WHOLE SELF TO WORK\n   We encourage all qualified candidates to apply, regardless of race, colour, religion, sex (including gender identity and/or expression), national origin, sexual orientation, civil union or relationship status, disability, age, parental status, military service, or other status protected under federal law.\n   \n   PLEASE NOTE THAT YOUR RESPONSES TO THE SCREENING QUESTIONS, YOUR COVER LETTER, AND YOUR RESUME, WILL EVALUATE YOUR ABILITY TO COMMUNICATE EFFECTIVELY IN WRITING.\n  \n Work environment\n  The Regulatory Toxicology Research Division in the Bureau of Chemical Safety engages in research activities related to the assessment of potentially hazardous chemicals in the food supply to ensure that they are not present at levels that would pose an unacceptable risk to health. These chemicals include food contaminants, food packaging materials and incidental additives, allergens, and natural toxins.  The successful candidate will use genomics, bioinformatics, immunohistochemistry, and molecular biology techniques to investigate adverse reproductive effects using tissues from in vivo model studies. The project will leverage existing in vivo rodent studies completed at Health Canada, to identify microRNA (miRNA) and other molecular targets modulated by dietary exposure to these chemical contaminants. The project is funded by the Genomics Research and Development Initiative of the Government of Canada. \n Intent of the process \n The immediate need is to staff one Student position. English Essential  In support of achieving a diversified workforce, consideration may be given to candidates self-declaring as belonging to one of the following Employment Equity groups: Aboriginal peoples, Persons with disabilities, Members of visible minorities, and Women. \n Positions to be filled: 1 \n Information you must provide \n Your résumé. \n A covering letter \"Cover letter outlining your suitability for the position and your research interests. Please note that this will be used to evaluate your ability to communicate effectively in writing.\" \n A list of the courses you have taken as well as any courses that you are taking now, or that you will be taking this academic year \n In order to be considered, your application must clearly explain how you meet the following (essential qualifications)\n  Education: The student must be enrolled or in the process of enrolling in a full-time Ph.D. degree program at the Institut National de la Recherche Scientifique (INRS) with a specialization in Biology. In order to enroll in this programme, the student must hold a Master’s degree or equivalent in biology or related discipline and hold a cumulative average of 3.2 (out of 4.3) or equivalent.  By the start date, the student must be registered in the Department of Biology at INRS in their first year of a doctoral program with specialization in biology, for which supervised laboratory or field research is required for graduation.\n  Degree equivalency\n \n   Experience:\n   Experience working in a molecular or cellular biology laboratory*\n   \n   \n  \n   This does not include lab-based experience taken as part of course work in undergraduate studies.\n  \n \n  The following will be applied / assessed at a later date (essential for the job)\n  English essential\n  Information on language requirements\n  Knowledge: Knowledge of experimental methods in biology\n  Abilities: Ability to communicate effectively orally and in writing\n \n   Personal Suitabilities:\n   \n  \n   Respectful of Diversity\n   Effective interpersonal relationships\n   Initiative\n  \n \n  The following may be applied / assessed at a later date (may be needed for the job)\n \n   Organizational Needs:\n   \n  \n   Willing and able to work overtime when required and on short notice \n   Willing and able to work in Laval QC and sometimes in Ottawa ON\n   Willing and able to work with animals (rodents)\n  \n \n  Conditions of employment\n  Reliability Status security clearance\n  Medical clearance and periodic health evaluations \n Other information \n The Public Service of Canada is committed to building a skilled and diverse workforce that reflects the Canadians we serve. We promote employment equity and encourage you to indicate if you belong to one of the designated groups when you apply.\n  Information on employment equity \n You must meet all essential qualifications in order to be appointed to the position. Some essential qualifications will be assessed through your application. It is your responsibility to provide appropriate examples that illustrate how you meet each qualification. Failing to do so could result in your application being rejected.  Persons are entitled to participate in the appointment process in the official language of their choice. Applicants are asked to indicate their preferred official language in their application.   For this process, emails are the most efficient way to communicate with you. Candidates who apply to this selection process must include an email address that accepts email from unknown users (some email systems block these types of email). If you do not wish to receive results by email or if you change your email address during the process, it is your responsibility to inform us.   Please note that candidates are responsible for submitting their application by the closing date in order to be considered. ALL APPLICATIONS MUST BE SUBMITTED ONLINE THROUGH THE PSRS SYSTEM. No applications will be accepted once the deadline has passed. Candidates will not be solicited for incomplete or possibly missing information.  VERY IMPORTANT NOTE: The PSRS system will time out after 60 minutes of inactivity which may result in your inability to save your work or loss of data. It is recommended that you draft ALL RESPONSES in another document on your PC which may be saved (e.g. in MS Word or WordPerfect) and copy/paste into the PSRS system when completed. HEALTH CANADA IS NOT RESPONSIBLE FOR SYSTEM PROBLEMS WHICH MAY RESULT IN LOSS OF DATA AND/OR INCOMPLETE OR NON SUBMITTED APPLICATIONS.   Please note that volume management strategies, such as random selection, top-down approach, invoking any asset(s) and/or cut-off scores, MAY be used at any point in the staffing process for the purpose of managing volumes of applications/candidates.  You must provide your proof of education (degree) and a copy of your transcript.  References will be asked for at a later date. \n Preference Preference will be given to Canadian citizens and permanent residents, with the exception of a job located in Nunavut, where Nunavut Inuit will be appointed first. \n We thank all those who apply. Only those selected for further consideration will be contacted.",
    "preprocessed_description": "Health Canada - Health Products and Food Branch - Food Directorate Ottawa (Ontario), Laval (Québec) ST-UDE-NT The student must be willing to work approx 35-40 hours per week for a period of 36 to 60 months in Laval, Quality Control and sometimes in Ottawa, ON. $26.72 to $34.59 per hour For further information on the organization, please visit Health Canada Learn more about the Research affiliate program Closing date: 10 December 2023 - 23:59, Pacific Time Who can apply: Persons residing in Canada, and Canadian citizens and Permanent residents abroad. To be considered for Research Affiliate Program (RAP) work opportunities, you must meet the following criteria: Be a full-time student in a post-secondary institution Be enrolled in an academic program that requires research as part of your curriculum Meet the minimum age required in the province/territory of work. Must be willing to work in both Laval, Quality Control and on occasion in Ottawa, ON. This includes students with physical or emotional disabilities deemed to have full-time status by their academic institution. Adult students registered in education and retraining programs at the secondary level may also be eligible for student employment programs. Apply online Important messages We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process. If you need to be accommodated during any phase of the evaluation process, please use the Contact information below to request specialized accommodation. All information received in relation to accommodation will be kept confidential. Assessment accommodation To be considered for Research Affiliate Program (RAP) work opportunities, you must meet the following criteria: Be recognized as having full-time student status by the post-secondary academic institution at which you are currently enrolled (see Education requirements listed below), or pending approval of acceptance (proof will be required). Be the minimum age to work in the province or territory where the job is located. The student will be expected to work approximately 35-40 hours per week and be willing to commit to the research project for a period of about 36 to 60 months. The candidate's RAP research activities must be aligned with their PhD Program that is being conducted to fulfill degree requirements at a recognized post-secondary institution. Health Canada is committed to increasing representation of Black employees and other racialized groups, Indigenous People, women and persons with disabilities. Health Canada would like its workforce to be reflective of the population it serves. Therefore, we encourage candidates to indicate voluntarily on their application if they are a member of one of these groups. Give yourself the best chance to succeed! As the objective of this process is to assess qualifications needed for the position(s) to be staffed, let us know if you have a functional limitation/ disability, which may affect your performance. For example, contact us if you need assistance in completing and submitting your application. Should you then proceed to the next assessment stage, such as an exam or interview, we will send you an e-mail with additional information on the assessment format so that you can determine if you may require an accommodation (such as a different test format, an adaptive technology, or additional time). Assessment accommodations are designed to remove the obstacles without altering the criteria being assessed so candidates with functional limitations can fully demonstrate their abilities. You may also review jobs open to the public through INFOTEL at 1-800-645-5605. The INFOTEL number for persons using a TTY/Test-Driven Development is 1-800-532-9397. Health Canada welcomes applications from Veterans. We recognize your contribution to Canadians and would like to offer you the opportunity to continue your career in an environment where multi-talented employees with diverse skills are appreciated and supported. EVERYONE IS WELCOME Health Canada and the Public Health Agency are dedicated to building an inclusive workforce that comprises individuals who have an array of identities, abilities, background, culture, skills, perspectives, and experiences that are representative of Canada's current and evolving population. We are passionate about fostering a workplace where all people feel welcome, can reach their full potential, and contribute their unique perspectives and experience to the success of the team. BRING YOUR WHOLE SELF TO WORK We encourage all qualified candidates to apply, regardless of race, colour, religion, sex (including gender identity and/or expression), national origin, sexual orientation, civil union or relationship status, disability, age, parental status, military service, or other status protected under federal law. PLEASE NOTE THAT YOUR RESPONSES TO THE SCREENING QUESTIONS, YOUR COVER LETTER, AND YOUR RESUME, WILL EVALUATE YOUR ABILITY TO COMMUNICATE EFFECTIVELY IN WRITING. Work environment The Regulatory Toxicology Research Division in the Bureau of Chemical Safety engages in research activities related to the assessment of potentially hazardous chemicals in the food supply to ensure that they are not present at levels that would pose an unacceptable risk to health. These chemicals include food contaminants, food packaging materials and incidental additives, allergens, and natural toxins. The successful candidate will use genomics, bioinformatics, immunohistochemistry, and molecular biology techniques to investigate adverse reproductive effects using tissues from in vivo model studies. The project will leverage existing in vivo rodent studies completed at Health Canada, to identify microRNA (miRNA) and other molecular targets modulated by dietary exposure to these chemical contaminants. The project is funded by the Genomics Research and Development Initiative of the Government of Canada. Intent of the process The immediate need is to staff one Student position. English Essential In support of achieving a diversified workforce, consideration may be given to candidates self-declaring as belonging to one of the following Employment Equity groups: Aboriginal peoples, Persons with disabilities, Members of visible minorities, and Women. Positions to be filled: 1 Information you must provide Your résumé. A covering letter \"Cover letter outlining your suitability for the position and your research interests. Please note that this will be used to evaluate your ability to communicate effectively in writing.\" A list of the courses you have taken as well as any courses that you are taking now, or that you will be taking this academic year In order to be considered, your application must clearly explain how you meet the following (essential qualifications) Education: The student must be enrolled or in the process of enrolling in a full-time Ph.D. degree program at the Institut National de la Recherche Scientifique (INRS) with a specialization in Biology. In order to enroll in this programme, the student must hold a Master's degree or equivalent in biology or related discipline and hold a cumulative average of 3.2 (out of 4.3) or equivalent. By the start date, the student must be registered in the Department of Biology at INRS in their first year of a doctoral program with specialization in biology, for which supervised laboratory or field research is required for graduation. Degree equivalency Experience: Experience working in a molecular or cellular biology laboratory This does not include lab-based experience taken as part of course work in undergraduate studies. The following will be applied / assessed at a later date (essential for the job) English essential Information on language requirements Knowledge: Knowledge of experimental methods in biology Abilities: Ability to communicate effectively orally and in writing Personal Suitabilities: Respectful of Diversity Effective interpersonal relationships Initiative The following may be applied / assessed at a later date (may be needed for the job) Organizational Needs: Willing and able to work overtime when required and on short notice Willing and able to work in Laval Quality Control and sometimes in Ottawa ON Willing and able to work with animals (rodents) Conditions of employment Reliability Status security clearance Medical clearance and periodic health evaluations Other information The Public Service of Canada is committed to building a skilled and diverse workforce that reflects the Canadians we serve. We promote employment equity and encourage you to indicate if you belong to one of the designated groups when you apply. Information on employment equity You must meet all essential qualifications in order to be appointed to the position. Some essential qualifications will be assessed through your application. It is your responsibility to provide appropriate examples that illustrate how you meet each qualification. Failing to do so could result in your application being rejected. Persons are entitled to participate in the appointment process in the official language of their choice. Applicants are asked to indicate their preferred official language in their application. For this process, emails are the most efficient way to communicate with you. Candidates who apply to this selection process must include an email address that accepts email from unknown users (some email systems block these types of email). If you do not wish to receive results by email or if you change your email address during the process, it is your responsibility to inform us. Please note that candidates are responsible for submitting their application by the closing date in order to be considered. ALL APPLICATIONS MUST BE SUBMITTED ONLINE THROUGH THE PSRS SYSTEM. No applications will be accepted once the deadline has passed. Candidates will not be solicited for incomplete or possibly missing information. VERY IMPORTANT NOTE: The PSRS system will time out after 60 minutes of inactivity which may result in your inability to save your work or loss of data. It is recommended that you draft ALL RESPONSES in another document on your PC which may be saved (e.g. in MS Word or WordPerfect) and copy/paste into the PSRS system when completed. HEALTH CANADA IS NOT RESPONSIBLE FOR SYSTEM PROBLEMS WHICH MAY RESULT IN LOSS OF DATA AND/OR INCOMPLETE OR NON SUBMITTED APPLICATIONS. Please note that volume management strategies, such as random selection, top-down approach, invoking any asset(s) and/or cut-off scores, MAY be used at any point in the staffing process for the purpose of managing volumes of applications/candidates. You must provide your proof of education (degree) and a copy of your transcript. References will be asked for at a later date. Preference Preference will be given to Canadian citizens and permanent residents, with the exception of a job located in Nunavut, where Nunavut Inuit will be appointed first. We thank all those who apply. Only those selected for further consideration will be contacted.",
    "processed_description": "Laval ST UDE NT student approx week period . hour information organization visit Research affiliate program closing apply person reside canadian citizen permanent resident abroad . consider meet follow criterion student post secondary institution enrol academic program require research curriculum meet minimum age require province territory . occasion . include student physical emotional deem status academic institution . adult student register education retrain program secondary level eligible student employment program . apply online message committed provide inclusive barrier free environment start hiring process . accommodate phase evaluation process contact information request specialized accommodation . information receive relation accommodation confidential . assessment accommodation consider meet follow criterion recognize student status post secondary academic institution currently enrol education requirement list pende approval acceptance proof require . minimum age province territory locate . student expect week commit research project period . candidate's RAP research activity align conduct fulfill degree requirement recognize post secondary institution . committed increase representation black employee racialized group woman person . workforce reflective population serve . encourage indicate voluntarily application group . good chance succeed objective process assess qualification position staff functional limitation affect performance . example contact assistance complete submit application . proceed assessment stage exam interview send mail additional information assessment format determine require accommodation test format adaptive technology additional . assessment accommodation design remove obstacle alter criterion assess functional limitation fully demonstrate . review open public . INFOTEL number person TTY Test drive Development . application . recognize contribution offer continue career environment multi talented employee diverse skill appreciate support . Health dedicate build inclusive workforce comprise individual array identity background culture skill perspective representative Canada's current evolve population . passionate foster workplace people feel reach potential contribute unique perspective success team . bring encourage qualified apply race colour religion sex include gender identity expression national origin sexual orientation civil union relationship status age parental status military service status protect federal law . note response screening question COVER LETTER resume evaluate COMMUNICATE EFFECTIVELY writing . engage research activity relate assessment hazardous chemical food supply ensure level pose unacceptable risk health . chemical include food contaminant food packaging material incidental additive allergen natural toxin . successful genomic bioinformatic immunohistochemistry molecular biology technique investigate adverse reproductive tissue vivo model study . project leverage exist vivo rodent study complete identify microRNA mirna molecular target modulate dietary exposure chemical contaminant . project fund . intent process staff student position . English Essential support achieve diversified workforce consideration declare belong follow Employment Equity group aboriginal people person visible minority Women . position fill information provide resume . covering letter Cover letter outline suitability position research interest . note evaluate communicate effectively write . list course course order consider application explain meet essential qualification education student enrol process enrol ph.d. degree program specialization Biology . order enroll programme student hold Master's degree equivalent biology discipline hold cumulative average equivalent . start student register doctoral program specialization biology supervise laboratory field research require graduation . degree equivalency molecular cellular biology laboratory include lab base course undergraduate study . apply assess essential essential Information language requirement experimental method biology communicate effectively orally write Personal Suitabilities respectful Diversity effective interpersonal relationship Initiative apply assess organizational overtime require short notice animal rodent condition employment Reliability Status security clearance Medical clearance periodic health evaluation information commit build skilled diverse workforce reflect serve . promote employment equity encourage indicate belong designate group apply . information employment equity meet essential qualification order appoint position . essential qualification assess application . responsibility provide appropriate example illustrate meet qualification . fail result application reject . person entitle participate appointment process official language choice . applicant indicate prefer official language application . process email efficient communicate . apply selection process include email address accept email unknown user email system block type email . receive result email change email address process responsibility inform . note responsible submit application closing order consider . application submit online PSRS SYSTEM . application accept deadline pass . solicit incomplete information . note PSRS system inactivity result inability save loss datum . recommend draft document pc save e.g. copy paste PSRS system complete . health responsible system problems result loss DATA INCOMPLETE SUBMITTED application . note volume management strategy random selection approach invoke asset cut score point staffing process purpose manage volume application . provide proof education degree copy transcript . reference . canadian citizen permanent resident exception locate appoint . apply . select consideration contact .",
    "results_group": {
        "extracted_noun_chunks": [
            "essential essential Information language requirement experimental method biology",
            "potential contribute unique perspective success team",
            "phase evaluation process contact information",
            "volume application",
            "research activity",
            "responsible submit application closing order",
            "loss datum",
            "hour information organization",
            "career environment multi talented employee diverse skill",
            "Health",
            "support",
            "serve",
            "example",
            "PSRS system inactivity",
            "canadian citizen permanent resident",
            "unacceptable risk health",
            "essential qualification",
            "proof education degree copy transcript",
            "applicant",
            "essential qualification order",
            "education requirement list pende",
            "race colour religion sex",
            "designate group",
            "microRNA mirna molecular target",
            "project fund",
            "passionate foster workplace people",
            "select consideration contact",
            "person entitle",
            "post secondary institution",
            "open public",
            "assessment stage exam interview",
            "skilled diverse workforce",
            "copy paste PSRS system",
            "volume management strategy random selection approach",
            "Master's degree equivalent biology discipline",
            "chemical",
            "candidate's RAP research activity",
            "INCOMPLETE SUBMITTED",
            "selection process",
            "committed increase representation black employee",
            "suitability position research interest",
            "deadline pass",
            "student status",
            "assessment accommodation design remove obstacle",
            "food contaminant food packaging material incidental additive allergen natural toxin",
            "canadian citizen",
            "education retrain program secondary level eligible student employment program",
            "email unknown user email system block type email",
            "short notice animal rodent condition employment Reliability Status security clearance Medical clearance periodic health evaluation information",
            "successful genomic bioinformatic immunohistochemistry molecular biology technique",
            "diversified workforce consideration declare",
            "programme student",
            "resume",
            "Personal Suitabilities respectful Diversity effective interpersonal relationship Initiative",
            "inclusive barrier free environment",
            "list course course order",
            "Research affiliate program closing",
            "cumulative average equivalent",
            "responsibility",
            "COMMUNICATE EFFECTIVELY writing",
            "response screening question COVER LETTER resume",
            "specialized accommodation",
            "adverse reproductive tissue vivo model study",
            "employment equity encourage",
            "reflective population",
            "graduation",
            "research curriculum",
            "letter Cover letter",
            "province territory",
            "online PSRS SYSTEM",
            "process email",
            "lab base course undergraduate study",
            "objective process",
            "visible minority Women",
            "occasion",
            "essential qualification education student",
            "note",
            "accommodation test format adaptive technology",
            "information employment equity",
            "ph.d",
            "INFOTEL number person",
            "gender identity expression national origin sexual orientation civil union relationship status age parental status military service status",
            "relation accommodation",
            "additional information assessment format",
            "Laval ST UDE NT student approx week period",
            "federal law",
            "criterion",
            "result email change email address process responsibility inform",
            "student",
            "health responsible system problems",
            "functional limitation",
            "draft document pc",
            "good chance",
            "degree equivalency molecular cellular biology laboratory",
            "information",
            "application",
            "doctoral program specialization biology",
            "inability",
            "English Essential support",
            "order",
            "laboratory field research",
            "emotional deem status",
            "reference",
            "minimum age province territory",
            "asset cut score point staffing process purpose",
            "incomplete information",
            "position",
            "permanent resident exception",
            "research project period",
            "mail",
            "approval acceptance proof",
            "performance",
            "assessment accommodation",
            "email address",
            "official language application",
            "group woman person",
            "follow criterion",
            "assessment hazardous chemical food supply",
            "qualification position staff functional limitation",
            "build inclusive workforce",
            "contribution offer",
            "individual array identity background culture skill perspective representative Canada's current evolve population",
            "degree requirement",
            "level",
            "conduct",
            "organizational overtime",
            "online message",
            "process",
            "appropriate example illustrate meet qualification",
            "week",
            "follow criterion student post secondary institution",
            "intent process staff student position",
            "minimum age",
            "degree program specialization Biology",
            "voluntarily application group",
            "academic program",
            "dietary exposure chemical contaminant",
            "project leverage",
            "adult student"
        ],
        "combined_lemmatized_tokens": "Laval ST UDE NT student approx week period . hour information organization visit Research affiliate program closing apply person reside canadian citizen permanent resident abroad . consider meet follow criterion student post secondary institution enrol academic program require research curriculum meet minimum age require province territory . occasion . include student physical emotional deem status academic institution . adult student register education retrain program secondary level eligible student employment program . apply online message committed provide inclusive barrier free environment start hiring process . accommodate phase evaluation process contact information request specialized accommodation . information receive relation accommodation confidential . assessment accommodation consider meet follow criterion recognize student status post secondary academic institution currently enrol education requirement list pende approval acceptance proof require . minimum age province territory locate . student expect week commit research project period . candidate's RAP research activity align conduct fulfill degree requirement recognize post secondary institution . committed increase representation black employee racialized group woman person . workforce reflective population serve . encourage indicate voluntarily application group . good chance succeed objective process assess qualification position staff functional limitation affect performance . example contact assistance complete submit application . proceed assessment stage exam interview send mail additional information assessment format determine require accommodation test format adaptive technology additional . assessment accommodation design remove obstacle alter criterion assess functional limitation fully demonstrate . review open public . INFOTEL number person TTY Test drive Development . application . recognize contribution offer continue career environment multi talented employee diverse skill appreciate support . Health dedicate build inclusive workforce comprise individual array identity background culture skill perspective representative Canada's current evolve population . passionate foster workplace people feel reach potential contribute unique perspective success team . bring encourage qualified apply race colour religion sex include gender identity expression national origin sexual orientation civil union relationship status age parental status military service status protect federal law . note response screening question COVER LETTER resume evaluate COMMUNICATE EFFECTIVELY writing . engage research activity relate assessment hazardous chemical food supply ensure level pose unacceptable risk health . chemical include food contaminant food packaging material incidental additive allergen natural toxin . successful genomic bioinformatic immunohistochemistry molecular biology technique investigate adverse reproductive tissue vivo model study . project leverage exist vivo rodent study complete identify microRNA mirna molecular target modulate dietary exposure chemical contaminant . project fund . intent process staff student position . English Essential support achieve diversified workforce consideration declare belong follow Employment Equity group aboriginal people person visible minority Women . position fill information provide resume . covering letter Cover letter outline suitability position research interest . note evaluate communicate effectively write . list course course order consider application explain meet essential qualification education student enrol process enrol ph.d. degree program specialization Biology . order enroll programme student hold Master's degree equivalent biology discipline hold cumulative average equivalent . start student register doctoral program specialization biology supervise laboratory field research require graduation . degree equivalency molecular cellular biology laboratory include lab base course undergraduate study . apply assess essential essential Information language requirement experimental method biology communicate effectively orally write Personal Suitabilities respectful Diversity effective interpersonal relationship Initiative apply assess organizational overtime require short notice animal rodent condition employment Reliability Status security clearance Medical clearance periodic health evaluation information commit build skilled diverse workforce reflect serve . promote employment equity encourage indicate belong designate group apply . information employment equity meet essential qualification order appoint position . essential qualification assess application . responsibility provide appropriate example illustrate meet qualification . fail result application reject . person entitle participate appointment process official language choice . applicant indicate prefer official language application . process email efficient communicate . apply selection process include email address accept email unknown user email system block type email . receive result email change email address process responsibility inform . note responsible submit application closing order consider . application submit online PSRS SYSTEM . application accept deadline pass . solicit incomplete information . note PSRS system inactivity result inability save loss datum . recommend draft document pc save e.g. copy paste PSRS system complete . health responsible system problems result loss DATA INCOMPLETE SUBMITTED application . note volume management strategy random selection approach invoke asset cut score point staffing process purpose manage volume application . provide proof education degree copy transcript . reference . canadian citizen permanent resident exception locate appoint . apply . select consideration contact ."
    }
}