{
    "id": "139b838955fe2e03",
    "company": "The Ottawa Fertility Centre",
    "positionName": "Temporary Bilingual Registered Nurse - TFT - 18 months",
    "jobType": [],
    "location": "100-955 Green Valley Crescent, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-19T05:11:14.140Z",
    "url": "https://www.indeed.ca/rc/clk?jk=139b838955fe2e03&from=jasx&tk=1hkikf7r6kee4803&bb=k24Utp0bknnZiAXzK5jUgSGhr66jwHtQNXLMQvEvwV5M7h-Sjri7CaP2kxhvm_eqWXb6j8gcteBbzV_t5ddG4xuDdde8fBkkYDi5KDhMksihzGc3UG5L9g%3D%3D&xkcb=SoDr67M3FSgzJXQ9SB0ubzkdCdPP&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "The Ottawa Fertility Centre is recruiting for a Temporary Full-Time Billingual Registered Nurse, who is willing to work every other weekend, to contribute to the Centre’s vision of becoming nationally recognized as Canada’s premier centre for reproductive medical care. The Registered Nurse participates as an important member on a multidisciplinary team that includes physicians, clinical support workers, embryologists, andrologists, sonographers, pharmacists, medical laboratory technicians and administrative support staff. Using the nursing process, professional knowledge, critical thinking, technical skills and clinical judgment, the nurse collaborates with other professionals to deliver comprehensive, high quality patient focused nursing care to women and their partners undergoing treatment for general fertility including ovulation induction, therapeutic donor sperm insemination (TDI), intrauterine insemination (IUI), in vitro fertilization and embryo transfer (IVF-ET).\nThe nursing role involves working in the recovery room to prepare patients for procedures and care for patients post procedure; assisting physicians during procedures, preparing the room between procedures, and administering conscious sedation; meeting with patients to educate them on the treatment plans and preparing treatment schedules.\nThe Ottawa Fertility Centre is a state-of-the-art modern fertility treatment center that provides comprehensive diagnostic and treatment services to its patients. The Ottawa fertility Centre is accredited by Accreditation Canada and pursues standards of excellence in all areas of its operations. OFC is an equal opportunity employer and encourage staff growth and development.\nThe following are requirements or qualifications which are special to this position:\n\n Current Certificate of Registration, College of Nurses of Ontario (in Good Standing)\n Meets Standards of Nursing Practice for R.N.\n Current BCLS required\n Current ACLS required (or able to obtain before start of employment)\n Previous experience in reproductive medicine and/or gynaecology nice to have, but not required\n Counselling experience is an asset\n Minimum of 5 years’ experience as an R.N\n\nThe following knowledge is special to this position:\n\n Nursing practices according to standards of College of Nurses of Ontario\n Knowledge of other health care disciplines and their roles in patient care\n Knowledge of policies, procedures and standards of care for Assisted Human Reproduction\n Public Health of Ontario Infection Prevention and Control Standards\n\nThe following skills and abilities are special to this position:\n\n Proficient IV and venipuncture skills\n Excellent verbal, written and interpersonal communication skills\n Ability to appropriately prioritize competing demands\n Ability to organize, prioritize, make decisions and work independently\n Ability to manage conflicting demands (i.e. unexpected procedure time changes, equipment availability, space)\n Ability and desire to continually upgrade knowledge and review advancements\n Ability to work in a team environment\n Ability to maintain a good attendance record\n Ability to meet physical demands of the position (ie: frequent walking, standing, reaching, bending, lifting)\n Knowledge of computer software applications, such as MS Word, Excel and electronic medical records\n Willingness to train new staff\n\nPlease note that this position starts at Step 1 /Probation at an hourly rate of $37.23 for a three month period. With previous nursing experience an employee may move to Step 4 ($43.48) after the 3 month probationary period. Progression beyond Step 4 is only granted for those with direct fertility experience. Please send resume and cover letter explaining why you would be a good fit in the fast paced, rewarding and collaborative environment of the Ottawa Fertility Centre.\nJob Types: Full-time, TemporaryContract length: 18 months\nSalary: $37.23-$50.76 per hour\nExpected hours: 75 per week\nSchedule:\n\n 10 hour shift\n Monday to Friday\n Weekends as needed\n\nWork Location: In person\nApplication deadline: 2024-02-29Expected start date: 2024-02-05"
}