{
    "id": "6aba07b710105191",
    "company": "Local Staffing",
    "positionName": "1402 - Junior Chemical Technician",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-09-30T06:50:09.121Z",
    "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0D7_li43lGEkKH59S9xgAlP2Hbfd6IWSF-UAaFkJZmMxilmWsN8VpTNTXqABoUdZFuZ4YsZ-kwZx6m9ptS__l3MncVHL6j19WYOgjX2k0X1SXWwNFWWtHG3KgG3iIElDFtFNqQ1CDvY0J49U0713FuNS9TfY5Nxb4B90nzOi91ytAI4TZy2rGefNo8lybwwYebWzbJI7xtifPCpvNlDgyUZppsZFy0RPPz1wi8x9OkJQeKxjo7vYvJ8guC1zX_oQ8Ob9NG92i15trcnSYrIRyN-OaU6DYa9aEQHsVcALb5a5juooaOvk_O5-LxF2JxJtNeP5tm9ZfJScH0XJ_ryIJj9UC14oJoS3KVQDeeKe6s47ctLW3A9W_toUys3mzWxjsTq3Zu5-AiDbEeyU0j0Uqusw6FJavHb6oW49Mzj42tqZIQL9yBNCxmFtydicWI-0L6v7QZUMTiFj4F0GyCHvj_lNZbXsvsZ_IK2PStymIl4w44sOaoY2ovPlsd-BxCqvvD8K2IzojxXLYX5C46nDUu2VU0PxEyIzUCWJw55dGHoCViwf_95N_k-CgI8ajsaDkM-otD8kZJEDhM_WnjwiVVQwXpq6IG8VDY%3D&xkcb=SoDe-_M3K037dFxwl50LbzkdCdPP&p=0&fvj=1&vjs=3&jsa=399&tk=1hbkvt5cukf2u802&from=jasx&wvign=1",
    "externalApplyLink": null,
    "job_info_group": {
        "extracted_phone_numbers": [],
        "extracted_links": [
            "HTTP/HTTPS Links",
            "General Links",
            "WWW Links",
            "TLDs"
        ],
        "extracted_emails": [],
        "extracted_location_data": [],
        "extracted_dates": [
            "Monday"
        ],
        "extracted_languages": [],
        "extracted_laws": [],
        "extracted_norps": [],
        "extracted_orgs": [
            "the Accessibility for Ontarians with Disabilities Act",
            "the Ontario Human Rights Code",
            "a Chemical Technician",
            "all other PPE",
            "Bachelor of Chemical Engineering"
        ],
        "extracted_persons": [],
        "extracted_products": [],
        "extracted_money": [
            {
                "amount": "18.00-$20.00",
                "noun_phrases": []
            }
        ],
        "processed_text": "currently Junior Chemical Technician join waste management client's team . excellent graduate career . involve sampling waste stream laboratory testing analysis identify chemical composition waste analysis technique sort waste stream shipment disposal recycling require processing environmentally hazardous waste general warehousing duty manual labour direct Working fast pace industrial environment require academic background chemistry Chemical Technician Diploma strong understanding periodic table element positive attitude flexible adaptable high energy motivate lift repetitive basis provide CSA approve steel toe boot provide client Local Staffing base recruitment agency . manufacturing warehousing logistic industry . information visit website inclusive equal employer commit provide diversity accommodation applicant request stage recruitment process AODA . applicant requirement contact . type salary hour week schedule hour shift shift evening shift Friday Location person"
    },
    "companyDescription": "",
    "description": "We are currently looking for a Junior Chemical Technician to join our waste management client’s team. This is an excellent opportunity for a recent graduate looking to begin a career as a Chemical Technician.\nWhat the job involves:\n\n Sampling waste streams for laboratory testing and analysis\n Identifying the chemical composition of waste using various analysis techniques\n Sorting waste streams for shipment, disposal and recycling, as required\n Processing environmentally hazardous waste\n General warehousing duties and manual labour as directed\n Working in a fast-paced industrial environment\n\nWhat the job requires of you:\n\n An academic background in chemistry (ie: Chemical Technician Diploma or Bachelor of Chemical Engineering)\n Strong understanding of the periodic table of elements\n Positive attitude, flexible and adaptable, high energy, and self-motivated\n Ability to lift up to 50lbs on a repetitive basis\n Provide your own CSA-approved steel toe boots (all other PPE will be provided by the client)\n\nLocal Staffing is an Ottawa-based recruitment agency. We work primarily in the manufacturing, warehousing, and logistics industries. For more information, please visit our website at www.local-staffing.com\nWe are an inclusive and equal opportunity employer committed to providing diversity and accommodations for applicants upon request at any stage of the recruitment process in accordance with the Accessibility for Ontarians with Disabilities Act (AODA) and the Ontario Human Rights Code. All applicants must make their requirements known when contacted.\nJob Type: Full-time\nSalary: $18.00-$20.00 per hour\nExpected hours: 40 per week\nSchedule:\n\n 8 hour shift\n Day shift\n Evening shift\n Monday to Friday\n\nWork Location: In person"
}