{
    "id": "301fb8da27311da6",
    "companyDescription": "",
    "description": "Compensation Pay Range:\n \n  $23.23-$28.53\n \n \n   Job Description:\n \n \n  \n    Please Note: If you are a current CHEO employee with access to Workday, please apply to this posting via the Workday application as an internal applicant.\n  \n \n \n  \n    Please Note: To successfully apply for this position, please submit your application by 11:59 pm the day before the advertised closing date in the posting to ensure your application is received.\n  \n \n \n \n  \n    POSITION SUMMARY\n  \n \n \n  \n    The Medical Device Reprocessing Technician is responsible for a variety of activities relating to collection, decontamination, assembly, preparation, sterilization, sterile storage and distribution of supplies and equipment used in the hospital. This position rotates through shift and weekend hours and areas within the MDRD scope of responsibility.\n  \n \n \n \n  \n    The Medical Device Reprocessing Technician provides required equipment and instrumentation to the OR, wards and clinics in a timely manner, adhering to applicable Standards of Practice and accepted Quality Assurance practices.\n  \n \n \n \n  \n    The successful applicant will have a working knowledge of a variety of equipment including low temperature sterilization equipment, automatic endoscope reprocessing, washer/disinfectors, sonic processors, cart washer and steam sterilizers. Knowledge of the principles of disinfection and sterilization are essential.\n  \n \n \n \n  \n    JOB DESCRIPTION:\n  \n \n \n \n  \n    The Medical Device Reprocessing Technician is responsible for the following functions:\n  \n \n \n \n  \n   \n    \n     \n       Decontamination, assembly and preparation of medical and surgical supplies, instrumentation and equipment throughout the hospital\n     \n    \n     \n       Reprocessing of clinic and surgical flexible endoscopes\n     \n    \n     \n       Assembly of surgical procedure case carts\n     \n    \n     \n       Ordering, delivery and restocking of specific supplies\n     \n    \n     \n       Maintenance of the integrity of sterile supplies\n     \n    \n     \n       Operation of a variety of technical equipment specific to MDRD and the Operating Room Departments as written in hospital procedures and manufacturer’s guidelines.\n     \n    \n     \n       Quality Assurance activities related to equipment and processes in MDRD, OR and hospital departments\n     \n    \n     \n       Knowledge of departmental policies and procedures\n     \n    \n     \n       Participation in Quality Improvement initiatives within MDRD\n     \n    \n     \n       Participation in orientation of new personnel\n     \n    \n     \n       Performance and Understanding of Quality Assurance activities related to the position\n     \n    \n     \n       Other duties as assigned\n     \n   \n  \n  \n  \n   \n     QUALIFICATIONS\n   \n  \n  \n  \n   \n    \n     \n       Criminal Record Check (Essential)\n     \n    \n     \n       Certificate from a recognized college reprocessing course including MDRAO & CSA within the last 5 years (Essential)\n     \n    \n     \n       Secondary School Diploma (Essential)\n     \n    \n     \n       Computer skills (Preferred)\n     \n   \n  \n \n \n  \n   \n    \n     \n       2 years previous experience in a Medical Device Reprocessing Department (Preferred)\n     \n    \n     \n       Bilingualism (French/English) (Preferred)\n     \n   \n  \n  \n  \n   \n     Please note you will be represented by the Laborers International Union of North America , (LiUNA 3000).\n   \n  \n  \n  \n   \n     CHEO values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants.\n   \n  \n  \n  \n   \n     Should you require accommodation during any phase in the recruitment process, please contact Human Resources at \n    \n     jobs@cheo.on.ca\n    . All information received in relation to accommodation will be kept confidential and will be handled in compliance with the Accessibility for Ontarians with Disabilities Act.\n   \n  \n  \n  \n   \n     CHEO is committed to providing a safe environment for staff, patients, and visitors. Consistent with that commitment, all applicants must be fully vaccinated against COVID-19 to be considered for any staff or volunteer opportunities. Applicants are also strongly encouraged to receive their COVID-19 booster shots when eligible to protect against the spread of COVID-19. Upon hiring, presentation of government issued documentation confirming full vaccination must be provided, or presentation of supporting documentation of a valid medical contraindication or other reasonable consideration pursuant to the Ontario \n    Human Rights Code.\n   \n  \n  \n   \n     We thank all those who apply, however, only those to be interviewed will be contacted.\n   \n  \n  \n  \n   \n     Veuillez noter : si vous êtes actuellement un employé du CHEO ayant accès à Workday, veuillez postuler à cette offre via l'application Workday en tant que candidat interne.\n   \n  \n  \n   \n     Veuillez noter : pour postuler avec succès à ce poste, veuillez soumettre votre candidature avant 23 h 59 la veille de la date de clôture annoncée dans l'affichage pour vous assurer que votre candidature est reçue.\n   \n  \n  \n  \n   \n     RÉSUMÉ DES FONCTIONS\n   \n  \n \n \n \n  \n   \n     Le ou la titulaire doit effectuer plusieurs tâches, notamment la collection, la décontamination, l’assemblage, la préparation, la stérilisation, le stockage du matériel stérile et la distribution des fournitures et de l’équipement utilisés à l’hôpital. La personne qui occupe le poste travaille sur différents quarts de travail, elle travaille aussi la fin de semaine et elle assume des responsabilités qui relèvent du service de RDM.\n   \n  \n  \n  \n   \n     Le ou la titulaire prépare l’équipement et les instruments nécessaires pour la salle d’opération, les différents services et les cliniques en temps opportun, en respectant les normes de pratique applicables et en appliquant les pratiques en assurance de la qualité.\n   \n  \n  \n   \n     Le ou la titulaire devra posséder une connaissance pratique de plusieurs appareils, dont l’appareil de stérilisation à basse température, l’appareil de retraitement automatique des endoscopes, les appareils de lavage et de désinfection, les processeurs soniques, les appareils de lavage de chariots et les stérilisateurs à vapeur. Il ou elle doit aussi connaître les principes de stérilisation et de désinfection.\n   \n  \n  \n  \n   \n     DESCRIPTION DU POSTE\n   \n  \n  \n  \n   \n     Le ou la titulaire doit assumer les fonctions suivantes:\n   \n  \n  \n  \n   \n    \n     \n       La décontamination, l’assemblage et la préparation des fournitures médicales et chirurgicales, des instruments et de l’équipement dans tout l’hôpital\n     \n    \n     \n       Le retraitement des endoscopes flexibles cliniques et chirurgicaux\n     \n    \n     \n       L’assemblage des chariots d’intervention chirurgicale\n     \n    \n     \n       Le rangement, la livraison et la reconstitution des stocks de fournitures spécifiques\n     \n    \n     \n       Le maintien de l’intégrité du matériel stérile\n     \n    \n     \n       L’utilisation de différents équipements techniques liés au SRDM et d’équipements du service de chirurgie, en suivant les directives de l’hôpital et les instructions du fabricant\n     \n    \n     \n       L’assurance de la qualité de l’équipement et des procédés liés au RDM et des procédés employés dans les salles d’opération et dans les services de l’hôpital\n     \n    \n     \n       La connaissance des politiques et procédures des services de l’Hôpital\n     \n    \n     \n       La participation aux initiatives d’amélioration de la qualité en ce qui concerne le RDM\n     \n    \n     \n       La participation à l’orientation des nouveaux employés\n     \n   \n  \n \n \n  \n   \n    \n     \n       L’application et la compréhension de l’assurance de la qualité relative à son poste\n     \n    \n     \n       L’exécution d’autres tâches connexes à la demande du superviseur\n     \n   \n  \n  \n  \n   \n     QUALIFICATIONS\n   \n  \n  \n  \n   \n    \n     \n       Vérification du casier judiciaire (Essentiel)\n     \n    \n     \n       Certificat d’un cours pris dans un collège reconnu en retraitement y compris MDRAO et CSA au cours des 5 dernières années (Essentiel)\n     \n    \n     \n       Diplôme d’études secondaires (Essentiel)\n     \n    \n     \n       Compétences en informatique (Préférable)\n     \n    \n     \n       Expérience de 2 ans dans un service de retraitement de dispositifs médicaux (Préférable)\n     \n    \n     \n       Bilinguisme (français/anglais) (Préférable)\n     \n   \n  \n  \n  \n   \n     Veuillez noter vous serez représenté par le syndicat La Fédération Ontarienne Des Travailleurs De La Santé, LIUNA Local 3000.\n   \n  \n  \n  \n   \n     CHEO valorise la diversité et est un employeur qui souscrit au principe de l’égalité d’accès. Nous nous sommes engagés à fournir un environnement de travail inclusif et sans obstacle, en commençant par le processus d’embauche et nous sommes heureux de recevoir des demandes provenant de tous les candidats qualifiés.\n   \n  \n  \n  \n   \n     Si vous avez besoin de mesures d’adaptation pendant une phase du processus de recrutement, veuillez communiquer avec les Ressources humaines à \n    \n     jobs@cheo.on.ca\n    . Tous les renseignements reçus concernant les mesures d’adaptation resteront confidentiels et seront traités conformément à la Loi sur l’accessibilité pour les personnes handicapées de l’Ontario.\n   \n  \n  \n  \n   \n     CHEO s’engage à offrir un environnement sécuritaire au personnel, aux patients et aux visiteurs. Conformément à cet engagement, tous les candidats doivent être entièrement vaccinés contre la COVID-19 pour être considérés comme des candidats pour tout emploi de personnel ou de bénévole. Les candidats sont également fortement encouragés à recevoir leurs doses de rappel contre la COVID-19 lorsqu’ils sont admissibles pour éviter la propagation de COVID-19. Lors de l’embauche, la présentation de documents gouvernementaux confirmant la vaccination complète doit être fournie, ou la présentation de documents justificatifs d’une contre-indication médicale valide ou d’une autre considération raisonnable en vertu du Code des droits de la personne de l’Ontario.\n   \n  \n  \n   \n     Nous remercions toutes les personnes qui posent leur candidature; toutefois, nous ne communiquerons qu’avec celles qui seront convoquées à une entrevue.\n   \n  \n \n \n \n   Please note you will be represented by the Laborers International Union of North America , (LiUNA).\n \n \n \n   CHEO values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants.\n \n \n \n   Should you require accommodation during any phase in the recruitment process, please contact Human Resources at jobs@cheo.on.ca. All information received in relation to accommodation will be kept confidential and will be handled in compliance with the Accessibility for Ontarians with Disabilities Act.\n \n \n \n   We thank all those who apply, however, only those to be interviewed will be contacted.\n \n \n \n   Job Posting End Date (if applicable) :\n  January 12, 2024",
    "preprocessed_description": "Compensation Pay Range: $23.23-$28.53 Job Description: Please Note: If you are a current CHEO employee with access to Workday, please apply to this posting via the Workday application as an internal applicant. Please Note: To successfully apply for this position, please submit your application by 11:59 pm the day before the advertised closing date in the posting to ensure your application is received. POSITION SUMMARY The Medical Device Reprocessing Technician is responsible for a variety of activities relating to collection, decontamination, assembly, preparation, sterilization, sterile storage and distribution of supplies and equipment used in the hospital. This position rotates through shift and weekend hours and areas within the MDRD scope of responsibility. The Medical Device Reprocessing Technician provides required equipment and instrumentation to the OR, wards and clinics in a timely manner, adhering to applicable Standards of Practice and accepted Quality Assurance practices. The successful applicant will have a working knowledge of a variety of equipment including low temperature sterilization equipment, automatic endoscope reprocessing, washer/disinfectors, sonic processors, cart washer and steam sterilizers. Knowledge of the principles of disinfection and sterilization are essential. JOB DESCRIPTION: The Medical Device Reprocessing Technician is responsible for the following functions: Decontamination, assembly and preparation of medical and surgical supplies, instrumentation and equipment throughout the hospital Reprocessing of clinic and surgical flexible endoscopes Assembly of surgical procedure case carts Ordering, delivery and restocking of specific supplies Maintenance of the integrity of sterile supplies Operation of a variety of technical equipment specific to MDRD and the Operating Room Departments as written in hospital procedures and manufacturer's guidelines. Quality Assurance activities related to equipment and processes in MDRD, OR and hospital departments Knowledge of departmental policies and procedures Participation in Quality Improvement initiatives within MDRD Participation in orientation of new personnel Performance and Understanding of Quality Assurance activities related to the position Other duties as assigned QUALIFICATIONS Criminal Record Check (Essential) Certificate from a recognized college reprocessing course including MDRAO & CSA within the last 5 years (Essential) Secondary School Diploma (Essential) Computer skills (Preferred) 2 years previous experience in a Medical Device Reprocessing Department (Preferred) Bilingualism (French/English) (Preferred) Please note you will be represented by the Laborers International Union of North America , (LiUNA 3000). CHEO values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants. Should you require accommodation during any phase in the recruitment process, please contact Human Resources at jobs@cheo.on.ca . All information received in relation to accommodation will be kept confidential and will be handled in compliance with the Accessibility for Ontarians with Disabilities Act. CHEO is committed to providing a safe environment for staff, patients, and visitors. Consistent with that commitment, all applicants must be fully vaccinated against COVID-19 to be considered for any staff or volunteer opportunities. Applicants are also strongly encouraged to receive their COVID-19 booster shots when eligible to protect against the spread of COVID-19. Upon hiring, presentation of government issued documentation confirming full vaccination must be provided, or presentation of supporting documentation of a valid medical contraindication or other reasonable consideration pursuant to the Ontario Human Rights Code. We thank all those who apply, however, only those to be interviewed will be contacted. Veuillez noter : si vous êtes actuellement un employé du CHEO ayant accès à Workday, veuillez postuler à cette offre via l'application Workday en tant que candidat interne. Veuillez noter : pour postuler avec succès à ce poste, veuillez soumettre votre candidature avant 23 h 59 la veille de la date de clôture annoncée dans l'affichage pour vous assurer que votre candidature est reçue. RÉSUMÉ DES FONCTIONS Le ou la titulaire doit effectuer plusieurs tâches, notamment la collection, la décontamination, l'assemblage, la préparation, la stérilisation, le stockage du matériel stérile et la distribution des fournitures et de l'équipement utilisés à l'hôpital. La personne qui occupe le poste travaille sur différents quarts de travail, elle travaille aussi la fin de semaine et elle assume des responsabilités qui relèvent du service de RDM. Le ou la titulaire prépare l'équipement et les instruments nécessaires pour la salle d'opération, les différents services et les cliniques en temps opportun, en respectant les normes de pratique applicables et en appliquant les pratiques en assurance de la qualité. Le ou la titulaire devra posséder une connaissance pratique de plusieurs appareils, dont l'appareil de stérilisation à basse température, l'appareil de retraitement automatique des endoscopes, les appareils de lavage et de désinfection, les processeurs soniques, les appareils de lavage de chariots et les stérilisateurs à vapeur. Il ou elle doit aussi connaître les principes de stérilisation et de désinfection. DESCRIPTION DU POSTE Le ou la titulaire doit assumer les fonctions suivantes: La décontamination, l'assemblage et la préparation des fournitures médicales et chirurgicales, des instruments et de l'équipement dans tout l'hôpital Le retraitement des endoscopes flexibles cliniques et chirurgicaux L'assemblage des chariots d'intervention chirurgicale Le rangement, la livraison et la reconstitution des stocks de fournitures spécifiques Le maintien de l'intégrité du matériel stérile L'utilisation de différents équipements techniques liés au SRDM et d'équipements du service de chirurgie, en suivant les directives de l'hôpital et les instructions du fabricant L'assurance de la qualité de l'équipement et des procédés liés au RDM et des procédés employés dans les salles d'opération et dans les services de l'hôpital La connaissance des politiques et procédures des services de l'Hôpital La participation aux initiatives d'amélioration de la qualité en ce qui concerne le RDM La participation à l'orientation des nouveaux employés L'application et la compréhension de l'assurance de la qualité relative à son poste L'exécution d'autres tâches connexes à la demande du superviseur QUALIFICATIONS Vérification du casier judiciaire (Essentiel) Certificat d'un cours pris dans un collège reconnu en retraitement y compris MDRAO et CSA au cours des 5 dernières années (Essentiel) Diplôme d'études secondaires (Essentiel) Compétences en informatique (Préférable) Expérience de 2 ans dans un service de retraitement de dispositifs médicaux (Préférable) Bilinguisme (français/anglais) (Préférable) Veuillez noter vous serez représenté par le syndicat La Fédération Ontarienne Des Travailleurs De La Santé, LIUNA Local 3000. CHEO valorise la diversité et est un employeur qui souscrit au principe de l'égalité d'accès. Nous nous sommes engagés à fournir un environnement de travail inclusif et sans obstacle, en commençant par le processus d'embauche et nous sommes heureux de recevoir des demandes provenant de tous les candidats qualifiés. Si vous avez besoin de mesures d'adaptation pendant une phase du processus de recrutement, veuillez communiquer avec les Ressources humaines à jobs@cheo.on.ca . Tous les renseignements reçus concernant les mesures d'adaptation resteront confidentiels et seront traités conformément à la Loi sur l'accessibilité pour les personnes handicapées de l'Ontario. CHEO s'engage à offrir un environnement sécuritaire au personnel, aux patients et aux visiteurs. Conformément à cet engagement, tous les candidats doivent être entièrement vaccinés contre la COVID-19 pour être considérés comme des candidats pour tout emploi de personnel ou de bénévole. Les candidats sont également fortement encouragés à recevoir leurs doses de rappel contre la COVID-19 lorsqu'ils sont admissibles pour éviter la propagation de COVID-19. Lors de l'embauche, la présentation de documents gouvernementaux confirmant la vaccination complète doit être fournie, ou la présentation de documents justificatifs d'une contre-indication médicale valide ou d'une autre considération raisonnable en vertu du Code des droits de la personne de l'Ontario. Nous remercions toutes les personnes qui posent leur candidature; toutefois, nous ne communiquerons qu'avec celles qui seront convoquées à une entrevue. Please note you will be represented by the Laborers International Union of North America , (LiUNA). CHEO values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants. Should you require accommodation during any phase in the recruitment process, please contact Human Resources at jobs@cheo.on.ca. All information received in relation to accommodation will be kept confidential and will be handled in compliance with the Accessibility for Ontarians with Disabilities Act. We thank all those who apply, however, only those to be interviewed will be contacted. Job Posting End Date (if applicable) : January 12, 2024",
    "processed_description": "compensation pay Range description note current CHEO employee access apply posting Workday application internal applicant . note apply position submit application advertise closing posting ensure application receive . position summary responsible variety activity relate collection decontamination assembly preparation sterilization sterile storage distribution supply equipment hospital . position rotate shift area MDRD scope responsibility . provide required equipment instrumentation ward clinic timely manner adhere accept Quality Assurance practice . successful applicant knowledge variety equipment include low temperature sterilization equipment automatic endoscope reprocess washer disinfector sonic processor cart washer steam sterilizer . knowledge principle disinfection sterilization essential . description responsible follow function Decontamination assembly preparation medical surgical supply instrumentation equipment hospital reprocess clinic surgical procedure case cart order delivery restocking specific supply Maintenance integrity sterile supply Operation variety technical equipment specific write hospital procedure manufacturer's guideline . Quality Assurance activity relate equipment process hospital department Knowledge departmental policy procedure Participation Quality Improvement initiative orientation activity relate position duty assign qualifications Criminal Record Check Essential certificate recognize college reprocess course include essential Secondary School Diploma Essential Computer skill preferred previous Preferred Bilingualism prefer note represent LiUNA . CHEO diversity equal employer . committed provide inclusive barrier free environment start hiring process interest qualified applicant . require accommodation phase recruitment process contact . information receive relation accommodation confidential handle compliance . CHEO commit provide safe environment staff patient visitor . consistent commitment applicant fully vaccinate covid consider staff volunteer . applicant encourage receive covid booster shot eligible protect spread covid . hiring presentation government issue documentation confirm vaccination provide presentation support documentation valid medical contraindication reasonable consideration pursuant . apply interview contact . noter cette offre tant candidat interne . Veuillez noter pour veuillez soumettre votre candidature avant . DES fonction decontamination l'assemblage preparation stockage du materiel sterile distribution des fourniture l'equipement utilises . personne occupe poste travaille sur quart travail assume . les service les clinique temps opportun respectant les normes pratique applicables assurance qualite . titulaire devra posseder une connaissance pratique plusieurs appareil temperature retraitement automatique des endoscope les appareils lavage desinfection les les appareils lavage chariot les sterilisateur vapeur . Il elle doit aussi connaitre les principes sterilisation desinfection . description DU POSTE titulaire doit assumer les fonction suivantes des instrument l'equipement dans tout l'hopital retraitement des endoscopes flexible clinique chirurgicaux l'assemblage des chariot d'intervention chirurgicale rangement reconstitution des stock equipement technique suivant les directive l'hopital les instruction du fabricant L'assurance qualite l'equipement RDM des procedes employes dans procedures des services l'Hopital participation aux initiatives d'amelioration qualite ce concerne RDM participation l'orientation des nouveaux employes L'application comprehension l'assurance qualite relative son poste L'execution d'autres tache connexe demande du superviseur qualification Essentiel Certificat d'un dans compris MDRAO CSA au cours des dernieres annees Essentiel Diplome d'etudes secondaire Essentiel Competences informatique ans dans service retraitement dispositifs medicaux Preferable Bilinguisme francais anglais noter vous serez represente par syndicat Federation Ontarienne Des Travailleurs Sante LIUNA Local . CHEO valorise diversite est employeur souscrit au principe l'egalite d'acces . nous nous sommes engages fournir environnement travail inclusif sans obstacle commencant par nous provenant tous les candidats qualifie . Si vous avez besoin mesures d'adaptation pendant une phase du processus recrutement humaine . Tous les renseignements recus concernant les mesures d'adaptation resteront seront traites conformement Loi sur l'accessibilite pour les personnes . personnel aux patient aux visiteur . Conformement cet engagement tous les candidats doivent etre entierement vaccines contre COVID pour etre consideres comme des candidats pour . candidats recevoir leurs doses rappel contre COVID admissible pour eviter propagation covid . confirmant vaccination complete raisonnable . nous remercion tout les personnes posent leur candidature toutefois nous ne communiquerons qu'avec celles seront convoquees une entrevue . note represent . CHEO diversity equal employer . committed provide inclusive barrier free environment start hiring process interest qualified applicant . require accommodation phase recruitment process contact . information receive relation accommodation confidential handle compliance . apply interview contact . posting applicable",
    "results_group": {
        "extracted_noun_chunks": [
            "description responsible follow function Decontamination assembly preparation medical surgical supply instrumentation equipment hospital reprocess clinic surgical procedure case cart order delivery",
            "noter cette offre tant candidat interne",
            "candidats recevoir leurs doses rappel contre COVID",
            "interview contact",
            "position summary responsible variety activity",
            "qualified applicant",
            "reasonable consideration",
            "knowledge principle disinfection sterilization",
            "Veuillez noter",
            "essential Secondary School Diploma Essential Computer skill",
            "previous Preferred Bilingualism",
            "applicant",
            "Participation Quality Improvement initiative orientation activity",
            "nous nous sommes",
            "position rotate shift area MDRD scope responsibility",
            "Si vous avez besoin mesures d'adaptation pendant",
            "vaccination",
            "position submit application advertise closing posting",
            "d'acces",
            "Quality Assurance activity",
            "current CHEO employee access",
            "personnel",
            "DES fonction decontamination",
            "covid",
            "compliance",
            "equipment process hospital department Knowledge departmental policy procedure",
            "les service les clinique temps",
            "Sante LIUNA Local",
            "Loi sur l'accessibilite pour les personnes",
            "collection decontamination assembly preparation sterilization sterile storage distribution supply equipment hospital",
            "phase du processus recrutement",
            "valorise diversite est employeur souscrit au principe l'egalite",
            "safe environment staff patient visitor",
            "inclusive barrier free environment",
            "covid booster",
            "d'etudes",
            "presentation government issue documentation",
            "successful applicant knowledge variety equipment",
            "respectant les normes pratique applicables assurance qualite",
            "eviter propagation covid",
            "Tous les renseignements recus concernant les mesures d'adaptation resteront seront traites",
            "CHEO diversity equal employer",
            "Workday application internal applicant",
            "eligible protect",
            "COVID pour etre consideres comme des candidats",
            "MDRAO CSA au cours des dernieres annees Essentiel Diplome",
            "note",
            "procedures des services l'Hopital participation aux initiatives",
            "fournir environnement travail inclusif sans obstacle commencant par nous provenant tous les candidats qualifie",
            "Quality Assurance practice",
            "college reprocess course",
            "timely manner",
            "Il elle doit aussi connaitre les principes sterilisation desinfection",
            "consistent commitment applicant",
            "relation accommodation",
            "CHEO",
            "Range description",
            "personne occupe poste travaille sur quart travail",
            "application",
            "information",
            "accommodation phase recruitment process contact",
            "vous serez represente par syndicat Federation Ontarienne Des Travailleurs",
            "veuillez soumettre votre candidature avant",
            "position duty assign qualifications",
            "l'assemblage preparation stockage du materiel sterile distribution des fourniture l'equipement",
            "aux visiteur",
            "specific supply Maintenance integrity sterile supply Operation variety technical equipment specific write hospital procedure manufacturer's guideline",
            "process interest",
            "patient",
            "d'amelioration qualite ce concerne RDM participation l'orientation des nouveaux employes L'application comprehension l'assurance qualite relative son",
            "required equipment instrumentation ward clinic",
            "low temperature sterilization equipment automatic endoscope reprocess washer disinfector sonic processor cart washer steam sterilizer",
            "diversity equal employer",
            "LiUNA",
            "nous remercion tout les personnes posent leur candidature toutefois nous ne communiquerons qu'avec celles seront convoquees une entrevue",
            "service retraitement dispositifs medicaux Preferable Bilinguisme francais anglais",
            "Essential certificate"
        ],
        "combined_lemmatized_tokens": "compensation pay Range description note current CHEO employee access apply posting Workday application internal applicant . note apply position submit application advertise closing posting ensure application receive . position summary responsible variety activity relate collection decontamination assembly preparation sterilization sterile storage distribution supply equipment hospital . position rotate shift area MDRD scope responsibility . provide required equipment instrumentation ward clinic timely manner adhere accept Quality Assurance practice . successful applicant knowledge variety equipment include low temperature sterilization equipment automatic endoscope reprocess washer disinfector sonic processor cart washer steam sterilizer . knowledge principle disinfection sterilization essential . description responsible follow function Decontamination assembly preparation medical surgical supply instrumentation equipment hospital reprocess clinic surgical procedure case cart order delivery restocking specific supply Maintenance integrity sterile supply Operation variety technical equipment specific write hospital procedure manufacturer's guideline . Quality Assurance activity relate equipment process hospital department Knowledge departmental policy procedure Participation Quality Improvement initiative orientation activity relate position duty assign qualifications Criminal Record Check Essential certificate recognize college reprocess course include essential Secondary School Diploma Essential Computer skill preferred previous Preferred Bilingualism prefer note represent LiUNA . CHEO diversity equal employer . committed provide inclusive barrier free environment start hiring process interest qualified applicant . require accommodation phase recruitment process contact . information receive relation accommodation confidential handle compliance . CHEO commit provide safe environment staff patient visitor . consistent commitment applicant fully vaccinate covid consider staff volunteer . applicant encourage receive covid booster shot eligible protect spread covid . hiring presentation government issue documentation confirm vaccination provide presentation support documentation valid medical contraindication reasonable consideration pursuant . apply interview contact . noter cette offre tant candidat interne . Veuillez noter pour veuillez soumettre votre candidature avant . DES fonction decontamination l'assemblage preparation stockage du materiel sterile distribution des fourniture l'equipement utilises . personne occupe poste travaille sur quart travail assume . les service les clinique temps opportun respectant les normes pratique applicables assurance qualite . titulaire devra posseder une connaissance pratique plusieurs appareil temperature retraitement automatique des endoscope les appareils lavage desinfection les les appareils lavage chariot les sterilisateur vapeur . Il elle doit aussi connaitre les principes sterilisation desinfection . description DU POSTE titulaire doit assumer les fonction suivantes des instrument l'equipement dans tout l'hopital retraitement des endoscopes flexible clinique chirurgicaux l'assemblage des chariot d'intervention chirurgicale rangement reconstitution des stock equipement technique suivant les directive l'hopital les instruction du fabricant L'assurance qualite l'equipement RDM des procedes employes dans procedures des services l'Hopital participation aux initiatives d'amelioration qualite ce concerne RDM participation l'orientation des nouveaux employes L'application comprehension l'assurance qualite relative son poste L'execution d'autres tache connexe demande du superviseur qualification Essentiel Certificat d'un dans compris MDRAO CSA au cours des dernieres annees Essentiel Diplome d'etudes secondaire Essentiel Competences informatique ans dans service retraitement dispositifs medicaux Preferable Bilinguisme francais anglais noter vous serez represente par syndicat Federation Ontarienne Des Travailleurs Sante LIUNA Local . CHEO valorise diversite est employeur souscrit au principe l'egalite d'acces . nous nous sommes engages fournir environnement travail inclusif sans obstacle commencant par nous provenant tous les candidats qualifie . Si vous avez besoin mesures d'adaptation pendant une phase du processus recrutement humaine . Tous les renseignements recus concernant les mesures d'adaptation resteront seront traites conformement Loi sur l'accessibilite pour les personnes . personnel aux patient aux visiteur . Conformement cet engagement tous les candidats doivent etre entierement vaccines contre COVID pour etre consideres comme des candidats pour . candidats recevoir leurs doses rappel contre COVID admissible pour eviter propagation covid . confirmant vaccination complete raisonnable . nous remercion tout les personnes posent leur candidature toutefois nous ne communiquerons qu'avec celles seront convoquees une entrevue . note represent . CHEO diversity equal employer . committed provide inclusive barrier free environment start hiring process interest qualified applicant . require accommodation phase recruitment process contact . information receive relation accommodation confidential handle compliance . apply interview contact . posting applicable"
    }
}