{
    "id": "1528b43ad3cf0ae3",
    "companyDescription": "Docebo is a cloud-based, AI-powered Learning Suite designed to increase performance and learner engagement. Docebo’s platform is embraced for its ease of use and ability to blend coaching with social and formal learning, an approach that has been validated through extensive research, and is known as the 70/20/10 model. Its technology and processes help organizations get their people learning faster and building knowledge that leads to greater business success. \r\n\r\nSold in more than 80 countries and offered in over 32 languages, Docebo (Latin for “I will teach”) has more than 3000 clients worldwide and offers an enterprise solution for mid-size to large organizations who need to train employees, customers, partners and other stakeholders. \r\n\r\nThe Docebo family has grown from a handful of people with an idea to a team of 800+ innovators across the globe. We believe learning is for everyone, and that we all have something we can learn from each other. That’s why we have built a diverse and inclusive community that appreciates one another, learns, and grows together.",
    "description": "Hey you! \\uD83D\\uDC4B Want to work for one of the fastest growing SaaS companies in the world? \\uD83D\\uDCC8\n \n \n   We’re building the next generation of learning software that companies like AWS, Netflix, Opentable and L’Oreal rely on to deliver training \\uD83D\\uDCBB We believe learning is for everyone, and that we all have something we can learn from each other. We rely on one another to continuously innovate our products and processes to create an exceptional experience for our employees, customers and partners.\n \n \n \n   Still not sure? We are a culture where values are at the center of everything we do. We also embody what we call the \n  Docebo Heart. We trust our teammates, assume the best of one another, and also hold space for all the differences that make us better. \\uD83D\\uDC99\n \n \n \n   So what are you waiting for? Apply today! Join 800+ global Docebians and change the way people learn.\n \n \n \n   Are you ready to be a part of the learning revolution? \\uD83D\\uDE80\n \n \n \n   About This Opportunity:\n \n \n \n   As a Technical Support Analyst you’re a Docebo product expert and the first point of contact for customer issues and questions. As a Technical Support Analyst, you can be the game changer in a customer’s day. You will be helping with technical issues or answering questions that help clients utilize their system to the fullest potential. It is your job to ensure our customers have their questions answered, their system up and running, or their technical concerns alleviated.\n  \n Responsibilities: \n \n  Addressing customer issues by taking inbound chats, working live with customers through our chat functionality, ticketing systems, video/screen sharing, and other means of communication.\n   Troubleshooting issues by asking clarifying questions and gathering information that lead to the root cause of the issue.\n   Taking appropriate action that leads to quickly resolving issues and advocating for the customer when escalations are required.\n   Following up with customers in a timely manner.\n   Researching a technical issue using your troubleshooting skills and/or escalating to another technical team member.\n   Having meaningful conversations with customers to manage their expectations on response and resolution times.\n \n  Requirements: \n \n  Having the ability to learn and communicate software-related and technical concepts to customers.\n   You love talking to people and being as helpful as possible.\n   Having previous technical support experience working within SaaS or fast paced support organizations.\n   You have a “call the customer” mentality when resolving technical customer issues.\n   You enjoy the hustle and bustle of a fast-paced environment.\n   You are an “owner of your work” and continuously try to improve every day.\n   You are confident and love sharing successes with your team.\n   Experience with LMS is plus.\n   Essential Job Functions\n   Ability to conduct chat or email conversations within a highly technical environment up to 8 hours per day\n   Ability to read and comprehend complex technical material.\n   Ability to remain seated or relatively sedentary for long periods of time.\n   Reference various resource materials while simultaneously interacting with customers on the phone.\n   Consistent attendance and punctuality in line with the expectations of a contact center environment.\n   Comfortable closely following a set break & lunch schedule determined by the business based on customer need\n   Possess positive, professional interpersonal skills.\n   Ability to perform a broad variety of duties and responsibilities with accuracy and speed and successfully meet time-sensitive deadlines.\n   Ability to consistently achieve the established performance metrics for the role.\n   Candidates should be able to work a set shift that falls anytime between 7am - 11pm EST. Schedules are subject to change based on business need; We strive to provide ample notice prior to changing schedules, however you must remain flexible.\n   Periodic Weekend On Call Coverage including but not limited to monitoring for urgent client tickets and actioning in alignment with response time and escalation standards\n \n \n   Benefits & Perks \\uD83D\\uDE0D\n \n \n  Generous Vacation Policy, plus 2 extra floating holidays to use for religious or cultural events that matter to you\n  Employee Share Purchase Plan\n  Career progression/internal mobility opportunities\n  Four employee resource groups to get involved with (the Docebo Women's Alliance, PRIDE, BIDOC, and Green Ambassadors)\n  WeWork partnership and “Work from Anywhere” program\n \n \n \n   Hybrid Office Model \\uD83C\\uDFE2\n \n \n   We believe when people are together, they develop deeper relationships and accelerate innovation. Because of this, all Docebo employees worldwide are “hybrid.” We encourage in-person collaboration while supporting work-from-home when employees need dedicated focus time, allowing Docebians to do their best every day. Each team leader is able to decide how often their teams come into the office, considering the needs of the team and the employee’s needs. Our Talent Acquisition team will let you know about the role you are applying for and the hybrid details during the first interview.\n   \n \n \n  \n \n  About Docebo \\uD83D\\uDC99\n \n \n   Here at Docebo, we power learning experiences for over 3000 customers around the world with our easy-to-use, AI-powered Suite designed to close the enterprise learning loop. We have successfully achieved 2 IPOs (TSX: DCBO & NASDAQ: DCBO), been recognized as a Top SaaS e-learning Solution, and are growing exponentially in the process.\n \n \n   Docebo is a global company with offices in North America, EMEA, APAC and more. Our people believe in six core values, simply defined and manifested in everything we do - \n  Innovation, Simplicity, Accountability, Togetherness, Curiosity, and Impact. If this sounds like you, now is your time to join one of the fastest-growing learning technology companies on the market. Apply today!\n \n \n \n   Docebo is an Equal Employment Opportunity employer. We are committed to diversity and inclusion in our workforce. All qualified applicants and employees will receive consideration for employment regardless of their race, color, religion, sex (including pregnancy, gender identity, and sexual orientation), national origin, citizenship status, age, disability, genetic information, or any other category protected under applicable law.\n \n \n \n   Any individuals requiring a reasonable accommodation to assist with their job search or application for employment should send an e-mail to recruiting_accommodations (at) docebo.com. The e-mail should include a description of the requested accommodation and the position you’re applying for or interested in.",
    "preprocessed_description": "Hey you! \\uD83D\\uDC4B Want to work for one of the fastest growing SaaS companies in the world? \\uD83D\\uDCC8 We're building the next generation of learning software that companies like Amazon Web Services, Netflix, Opentable and L'Oreal rely on to deliver training \\uD83D\\uDCBB We believe learning is for everyone, and that we all have something we can learn from each other. We rely on one another to continuously innovate our products and processes to create an exceptional experience for our employees, customers and partners. Still not sure? We are a culture where values are at the center of everything we do. We also embody what we call the Docebo Heart. We trust our teammates, assume the best of one another, and also hold space for all the differences that make us better. \\uD83D\\uDC99 So what are you waiting for? Apply today! Join 800+ global Docebians and change the way people learn. Are you ready to be a part of the learning revolution? \\uD83D\\uDE80 About This Opportunity: As a Technical Support Analyst you are a Docebo product expert and the first point of contact for customer issues and questions. As a Technical Support Analyst, you can be the game changer in a customer's day. You will be helping with technical issues or answering questions that help clients utilize their system to the fullest potential. It is your job to ensure our customers have their questions answered, their system up and running, or their technical concerns alleviated. Responsibilities: Addressing customer issues by taking inbound chats, working live with customers through our chat functionality, ticketing systems, video/screen sharing, and other means of communication. Troubleshooting issues by asking clarifying questions and gathering information that lead to the root cause of the issue. Taking appropriate action that leads to quickly resolving issues and advocating for the customer when escalations are required. Following up with customers in a timely manner. Researching a technical issue using your troubleshooting skills and/or escalating to another technical team member. Having meaningful conversations with customers to manage their expectations on response and resolution times. Requirements: Having the ability to learn and communicate software-related and technical concepts to customers. You love talking to people and being as helpful as possible. Having previous technical support experience working within SaaS or fast paced support organizations. You have a \"call the customer\" mentality when resolving technical customer issues. You enjoy the hustle and bustle of a fast-paced environment. You are an \"owner of your work\" and continuously try to improve every day. You are confident and love sharing successes with your team. Experience with Learning Management System is plus. Essential Job Functions Ability to conduct chat or email conversations within a highly technical environment up to 8 hours per day Ability to read and comprehend complex technical material. Ability to remain seated or relatively sedentary for long periods of time. Reference various resource materials while simultaneously interacting with customers on the phone. Consistent attendance and punctuality in line with the expectations of a contact center environment. Comfortable closely following a set break & lunch schedule determined by the business based on customer need Possess positive, professional interpersonal skills. Ability to perform a broad variety of duties and responsibilities with accuracy and speed and successfully meet time-sensitive deadlines. Ability to consistently achieve the established performance metrics for the role. Candidates should be able to work a set shift that falls anytime between 7am - 11pm EST. Schedules are subject to change based on business need; We strive to provide ample notice prior to changing schedules, however you must remain flexible. Periodic Weekend On Call Coverage including but not limited to monitoring for urgent client tickets and actioning in alignment with response time and escalation standards Benefits & Perks \\uD83D\\uDE0D Generous Vacation Policy, plus 2 extra floating holidays to use for religious or cultural events that matter to you Employee Share Purchase Plan Career progression/internal mobility opportunities Four employee resource groups to get involved with (the Docebo Women's Alliance, PRIDE, BIDOC, and Green Ambassadors) WeWork partnership and \"Work from Anywhere\" program Hybrid Office Model \\uD83C\\uDFE2 We believe when people are together, they develop deeper relationships and accelerate innovation. Because of this, all Docebo employees worldwide are \"hybrid.\" We encourage in-person collaboration while supporting work-from-home when employees need dedicated focus time, allowing Docebians to do their best every day. Each team leader is able to decide how often their teams come into the office, considering the needs of the team and the employee's needs. Our Talent Acquisition team will let you know about the role you are applying for and the hybrid details during the first interview. About Docebo \\uD83D\\uDC99 Here at Docebo, we power learning experiences for over 3000 customers around the world with our easy-to-use, Artificial Intelligence-powered Suite designed to close the enterprise learning loop. We have successfully achieved 2 IPOs (TSX: DCBO & NASDAQ: DCBO), been recognized as a Top SaaS e-learning Solution, and are growing exponentially in the process. Docebo is a global company with offices in North America, EMEA, APAC and more. Our people believe in six core values, simply defined and manifested in everything we do - Innovation, Simplicity, Accountability, Togetherness, Curiosity, and Impact. If this sounds like you, now is your time to join one of the fastest-growing learning technology companies on the market. Apply today! Docebo is an Equal Employment Opportunity employer. We are committed to diversity and inclusion in our workforce. All qualified applicants and employees will receive consideration for employment regardless of their race, color, religion, sex (including pregnancy, gender identity, and sexual orientation), national origin, citizenship status, age, disability, genetic information, or any other category protected under applicable law. Any individuals requiring a reasonable accommodation to assist with their job search or application for employment should send an e-mail to recruiting_accommodations (at) docebo.com. The e-mail should include a description of the requested accommodation and the position you are applying for or interested in.",
    "processed_description": "hey \\ud83d\\udc4b fast grow saas company \\uD83D\\uDCC8 build generation learn software company rely deliver training \\uD83D\\uDCBB learn learn . rely continuously innovate product process create exceptional employee customer partner . culture center . embody . trust teammate assume good hold space difference . \\uD83D\\uDC99 wait apply join change people learn . ready learn revolution \\uD83D\\uDE80 Technical Support Analyst Docebo product expert point contact customer issue question . game changer customer's . help technical issue answer question help client utilize system potential . ensure customer question answer system technical concern alleviate . responsibility address customer issue inbound chat live customer chat functionality ticketing system video screen sharing communication . troubleshooting issue clarify question gather information lead root issue . appropriate action lead resolve issue advocate customer escalation require . follow customer timely manner . research technical issue troubleshooting skill escalate technical team . meaningful conversation customer manage expectation response resolution . requirement learn communicate software relate technical concept customer . love talk people helpful . previous technical support saas fast paced support organization . customer mentality resolve technical customer issue . enjoy hustle bustle fast pace environment . owner continuously improve . confident love share success team . . Essential Functions conduct chat email conversation highly technical environment read comprehend complex technical material . remain seated sedentary long period . reference resource material simultaneously interact customer phone . consistent attendance punctuality expectation contact center environment . comfortable closely follow set break lunch schedule determine business base customer possess positive professional interpersonal skill . perform broad variety duty responsibility accuracy speed meet sensitive deadline . consistently achieve establish performance metric role . set shift fall anytime . schedule subject change base business strive provide ample notice prior change schedule remain flexible . periodic weekend coverage include limit monitor urgent client ticket action alignment response escalation standard Benefits Perks \\ud83d\\ude0d Generous Vacation Policy extra float holiday religious cultural event matter Employee Share Purchase Plan career progression internal mobility employee resource group involve Docebo Women's Alliance PRIDE BIDOC Green Ambassadors WeWork partnership program Hybrid Office Model \\uD83C\\uDFE2 people develop deep relationship accelerate innovation . Docebo employee worldwide hybrid . encourage person collaboration support employee dedicated focus allow good . team leader decide team office consider team employee's . Talent Acquisition team role apply hybrid detail interview . Docebo \\ud83d\\udc99 power learn customer easy Artificial Intelligence power Suite design close enterprise learn loop . achieve IPOs DCBO recognize saas learning solution grow exponentially process . global company office . people core simply define manifest Innovation simplicity Accountability Impact . sound join fast grow learn technology company market . apply Equal Employment employer . committed diversity inclusion workforce . qualified applicant employee receive consideration employment race color religion sex include pregnancy gender identity sexual orientation national origin citizenship status age genetic information category protect applicable law . individual require reasonable accommodation assist search application employment send mail recruiting_accommodation . mail include description requested accommodation position apply interested .",
    "results_group": {
        "extracted_noun_chunks": [
            "consistent attendance punctuality expectation contact center environment",
            "good hold space difference",
            "Docebo Women's Alliance PRIDE",
            "reasonable accommodation",
            "requirement",
            "comfortable closely follow set break lunch schedule",
            "sensitive deadline",
            "responsibility address customer issue inbound chat live customer chat functionality ticketing system video screen",
            "technology company market",
            "hybrid detail interview",
            "question",
            "reference resource material",
            "customer easy Artificial Intelligence power Suite design close enterprise",
            "saas learning solution",
            "software company",
            "sound join",
            "owner",
            "person collaboration support employee dedicated focus",
            "qualified applicant employee",
            "customer mentality",
            "mail recruiting_accommodation",
            "exceptional employee customer partner",
            "hustle bustle fast pace environment",
            "schedule subject change base business",
            "team employee",
            "customer timely manner",
            "global company office",
            "extra float holiday religious cultural event",
            "Green Ambassadors WeWork partnership program Hybrid Office Model",
            "technical concept customer",
            "consideration employment race color religion sex",
            "Innovation simplicity Accountability Impact",
            "complex technical material",
            "culture center",
            "performance metric role",
            "team office",
            "game changer customer",
            "diversity inclusion workforce",
            "\\uD83D\\uDC99 wait",
            "root issue",
            "prior change schedule",
            "pregnancy gender identity sexual orientation national origin citizenship status age genetic information category",
            "customer question answer system technical concern",
            "limit monitor urgent client ticket action alignment response escalation standard Benefits Perks \\ud83d\\ude0d Generous Vacation Policy",
            "technical customer issue",
            "Talent Acquisition team role",
            "broad variety duty responsibility accuracy speed",
            "IPOs DCBO",
            "confident love share success team",
            "positive professional interpersonal skill",
            "saas company \\uD83D\\uDCC8 build generation",
            "saas fast paced support organization",
            "communication",
            "expectation response resolution",
            "Essential Functions",
            "team leader",
            "business base customer",
            "chat email conversation",
            "people",
            "periodic weekend coverage",
            "exponentially process",
            "information",
            "appropriate action lead",
            "Docebo employee",
            "meaningful conversation customer",
            "ample notice",
            "\\uD83C\\uDFE2 people",
            "research technical issue troubleshooting skill",
            "love",
            "search application employment",
            "Equal Employment employer",
            "mail",
            "revolution",
            "issue advocate customer escalation",
            "career progression",
            "loop",
            "customer phone",
            "product process",
            "Docebo \\ud83d\\udc99 power",
            "join change",
            "troubleshooting issue",
            "applicable law",
            "technical team",
            "software",
            "trust teammate",
            "description requested accommodation position",
            "system potential",
            "individual",
            "previous technical support",
            "innovation",
            "deep relationship",
            "people core",
            "client"
        ],
        "combined_lemmatized_tokens": "hey \\ud83d\\udc4b fast grow saas company \\uD83D\\uDCC8 build generation learn software company rely deliver training \\uD83D\\uDCBB learn learn . rely continuously innovate product process create exceptional employee customer partner . culture center . embody . trust teammate assume good hold space difference . \\uD83D\\uDC99 wait apply join change people learn . ready learn revolution \\uD83D\\uDE80 Technical Support Analyst Docebo product expert point contact customer issue question . game changer customer's . help technical issue answer question help client utilize system potential . ensure customer question answer system technical concern alleviate . responsibility address customer issue inbound chat live customer chat functionality ticketing system video screen sharing communication . troubleshooting issue clarify question gather information lead root issue . appropriate action lead resolve issue advocate customer escalation require . follow customer timely manner . research technical issue troubleshooting skill escalate technical team . meaningful conversation customer manage expectation response resolution . requirement learn communicate software relate technical concept customer . love talk people helpful . previous technical support saas fast paced support organization . customer mentality resolve technical customer issue . enjoy hustle bustle fast pace environment . owner continuously improve . confident love share success team . . Essential Functions conduct chat email conversation highly technical environment read comprehend complex technical material . remain seated sedentary long period . reference resource material simultaneously interact customer phone . consistent attendance punctuality expectation contact center environment . comfortable closely follow set break lunch schedule determine business base customer possess positive professional interpersonal skill . perform broad variety duty responsibility accuracy speed meet sensitive deadline . consistently achieve establish performance metric role . set shift fall anytime . schedule subject change base business strive provide ample notice prior change schedule remain flexible . periodic weekend coverage include limit monitor urgent client ticket action alignment response escalation standard Benefits Perks \\ud83d\\ude0d Generous Vacation Policy extra float holiday religious cultural event matter Employee Share Purchase Plan career progression internal mobility employee resource group involve Docebo Women's Alliance PRIDE BIDOC Green Ambassadors WeWork partnership program Hybrid Office Model \\uD83C\\uDFE2 people develop deep relationship accelerate innovation . Docebo employee worldwide hybrid . encourage person collaboration support employee dedicated focus allow good . team leader decide team office consider team employee's . Talent Acquisition team role apply hybrid detail interview . Docebo \\ud83d\\udc99 power learn customer easy Artificial Intelligence power Suite design close enterprise learn loop . achieve IPOs DCBO recognize saas learning solution grow exponentially process . global company office . people core simply define manifest Innovation simplicity Accountability Impact . sound join fast grow learn technology company market . apply Equal Employment employer . committed diversity inclusion workforce . qualified applicant employee receive consideration employment race color religion sex include pregnancy gender identity sexual orientation national origin citizenship status age genetic information category protect applicable law . individual require reasonable accommodation assist search application employment send mail recruiting_accommodation . mail include description requested accommodation position apply interested ."
    }
}