{
    "id": "b9a99c34f0ad52c2",
    "company": "Canna Cabana",
    "positionName": "Retail Sales Associate - St. Laurent",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-14T18:53:59.369Z",
    "url": "https://www.indeed.ca/rc/clk?jk=b9a99c34f0ad52c2&from=jasx&tk=1hcvfpdfukoko804&vjs=3",
    "externalApplyLink": "https://canna-cabana.hightide-ats.com/job/694347/retail-sales-associate-st-laurent?s=in",
    "companyDescription": "",
    "description": "Canna Cabana is actively seeking Part-Time Sales Associates who are knowledgeable, responsible, hardworking, dedicated, and mature individuals interested in joining our team. Join us and become an important part of a company where the sky is the limit. \n  Duties and Responsibilities: \n  \n  Always greet customers as they enter the store. \n  Manage login id on Point of Sale (POS) terminal as required by Canna Cabana. \n  Responsible for signing in and verifying floats of Cannabis at the beginning and end of shifts. \n  Create an educational and informative experience for all customers, regardless of their experience with cannabis. In-house training will be provided. \n  Recommend products including cannabis flower, oils, and cannabis/smoking accessories to customers. \n  Help Store/Assistant Managers open and close at the beginning or end of shifts, following Canna Cabana standard operating procedures. \n  Report any suspicious behaviours or abusive customers to Store/Assistant Managers. \n  General housekeeping of store spaces (vacuum/sweep sales floor area, wipe down counters & glass display cabinets, etc.). \n  Promptly ID all customers who look under the age of 25 years, as required by Cannabis Retail Store Handbook. \n  Abide by all company policies and procedures as directed by the Store/Assistant Managers. \n  Available to work any shift between 7 am to 12 am Monday to Sunday \n  \n Qualifications: \n  \n  Must provide a copy of completed Cannabis Retail Certification - CannSell License. \n  Must provide a copy of clean Criminal Background Check prior to start date. \n  Minimum 2-3 years of Retail Experience in sales and customer service required. \n  Must have knowledge of and passion for cannabis and accessories. \n  Must be available for shift work according to business needs, Monday to Sunday. \n  Excellent written and verbal communication skills. \n  Team player mentality. \n  Ability to compute basic mathematical problems. \n  Attention to detail. \n  Desire to educate customers and the community about the benefits associated with cannabis use without giving medical advice. \n  Ability to work nights, holidays and weekends and different locations. \n  \n Job Types: Part-time, Permanent \n  Why You Should Apply: \n \n  The opportunity to work for a growing company that is positioned to become a globally recognized brand in the cannabis industry. \n  Significant opportunity for growth, experience and learning \n  Unlimited bonus earning potential \n  \n Additional points: The job posting reflects the general details considered necessary to describe the principal functions and duties as required for proper evaluation of the job. There may be additional duties, responsibilities, and qualifications for this job. \n We thank all applicants in advance for their interest; however, only those selected for an interview will be contacted. \n  To get CannSell license please visit - \n https://purchase.cannsell.ca/product?catalog=CannSell-Standard-Certification"
}