{
    "id": "f40992a797cde352",
    "company": "MED-ENG - A Brand of The Safariland Group",
    "positionName": "Finance Admin - Finance Manager",
    "jobType": [
        "Full-time"
    ],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-05T03:13:34.110Z",
    "url": "https://www.indeed.ca/rc/clk?jk=f40992a797cde352&from=jasx&tk=1hjm3b3kbip98800&vjs=3",
    "externalApplyLink": "https://globalus232.dayforcehcm.com/CandidatePortal/en-US/safariland/Site/MEDENGPORTAL/Posting/View/3179?source=Indeed",
    "companyDescription": "",
    "description": "TOGETHER, WE SAVE LIVES \n\n \nSummary:\n Reporting to the VP of Finance, the Finance and Accounting Manager will be primarily responsible for the company’s finance and accounting processes encompassing A/P, A/R, G/L costing, financial analysis as well as the day-to-day management of the department. The role will also be responsible for ensuring accounting is complaint with US GAAP and implementing standard costing. \n\n \nResponsibilities:\n Finance and Accounting \n\n \n Partners with the senior business leadership to drive the business and support strategic initiatives. \n Prepares in-depth monthly, quarterly, and annual reporting requirement reviews of consolidated financial statements for use by Senior Leadership for internal and external reporting purposes. \n Oversees and ensures the maintenance and updating of the financial accounting and reporting systems to ensure compliance with US GAAP. \n Develops, maintains internal accounting controls to ensure assets are secure and financial reporting is accurate by conducting regular internal control audits and administers annual reviews; assist Department Managers in effectively managing department budgets. \n Supervises and motivates assigned staff; plans and establishes goals & objectives, evaluates training and development plans, conducts performance evaluations, and provides on-going feedback. \n Manage all aspects of the month end close process including ensuring all intercompany transactions are posted and balanced with other entities. \n Prepare and review month end reconciliations \n Managing Finance initiatives encompassing implementation of internal controls, capital expenditures process, contracts with suppliers/customers, SR&ED claims etc. \n Performs other projects or duties as assigned \n Reporting / Forecasting / Budgeting \n\n \n Provide daily reporting on shipments and orders \n Prepare weekly reporting required for payables forecast and bank funding \n Submit monthly forecasts for shipments / revenue, cash collections, P&L and working capital \n Lead the annual budgeting process \n Cost Accounting \n\n \n Performs month end cost accounting closing duties, including journal entry preparation and input \n Performs in-depth monthly analysis of manufacturing costs against standard including explanation of major variances \n Prepares monthly analysis of cost of goods sold and gross margin reports with proactive investigation of irregular results \n Develops and refines product / project costing systems as required \n Analyzes inventory valuations for accuracy and assists with year-end physical inventory counts in collaboration with Production / Operations personnel \n Analyzes inventory balances, turns and reviews obsolete inventory reserves with Material Management on a monthly / quarterly basis; investigates larger anomalies. \n Prepares Manufacturing Budgets, reviews material standards and prepares labour and overhead rates for costing system; participative in updating system costs / identifying problematic costs. \n \nEducation and Qualifications:\n \n \n University degree in Accounting, Business or a related field combined with a professional accounting designation is required; equivalent experience would be considered \n 5 - 7 years related experience (experience working in a manufacturing environment considered an asset) \n Strong analytical and technical skills, including proficiency with Microsoft Office applications and ERP systems a definite asset \n Experience with intercompany transactions and transacting with multi currencies \n Ability to work with minimal supervision and work effectively as part of a team \n Ability to exercise sound judgment, discretion, initiative and a high degree of confidentiality. \n Ability to analyze problems, proactive resolution, and proposal of solutions. \n Ability to maintain strict deadlines for closing processes, project timelines therefore requiring flexibility, organization, speed, accuracy, and attention to detail. \n The Safariland Group believes in the benefits of a diverse workforce and is committed to equal opportunity and affirmative actions. We pride ourselves on hiring and developing the best people, without regard to age, sex, sexual orientation, gender identity, genetic characteristics, race, color, creed, religion, ethnicity, national origin, alienage, citizenship, disability, marital status, military status, pregnancy, or any other legally-recognized protected basis prohibited by applicable law. \n\n For those applicants with disabilities, if you require reasonable accommodation in searching for a job opening or submitting an application, please contact us by calling 888-469-6455. \n\n All employment decisions are solely based on the applicant's qualifications as they relate to the requirements of the position."
}