{
    "id": "7245dd1ba495d791",
    "company": "Cencora",
    "positionName": "Field & Infusion Nurse (RN)",
    "jobType": [],
    "location": "Gatineau, QC",
    "salary": null,
    "postingDateParsed": "2023-10-07T02:04:22.810Z",
    "url": "https://www.indeed.ca/rc/clk?jk=7245dd1ba495d791&from=jasx&tk=1hc6ge9ifk7pr800&vjs=3",
    "externalApplyLink": "https://myhrabc.wd5.myworkdayjobs.com/en-US/Global/job/Gatineau-QC/Field---Infusion-Nurse--RN-_R2310658?source=%20Job_Board_Indeed",
    "companyDescription": "",
    "description": "Our team members are at the heart of everything we do. At Cencora, we are united in our responsibility to create healthier futures, and every person here is essential to us being able to deliver on that purpose. If you want to make a difference at the center of health, come join our innovative company and help us improve the lives of people and animals everywhere. Apply today!\n               \n              \n             \n            \n           \n          \n         \n        \n       \n      \n     \n    \n   \n  \n \n \n \n  \n   \n    \n     \n      \n       \n        \n         \n          \n           \n            \n             \n              \n               \n                \n                 \n                  \n                   \n                    \n                     \n                      \n                        What you will be doing\n                      \n                     \n                    \n                   \n                  \n                 \n                \n               \n              \n             \n            \n           \n          \n         \n        \n       \n      \n     \n    \n   \n  \n \n \n \n   PRIMARY DUTIES AND RESPONSIBILITIES:\n \n \n   Administer medications in the patient's home, specialty clinics and Physician Partnership clinic settings.\n   Assess monitor pre and post-injection/infusion treatments as directed by program protocols.\n   Completes necessary documentation based on policies and procedures, and as directed by the College of Nurses, and Innomar ISO accreditation standards of practice.\n   Provide patient / Caregivers education based on product monographs and program protocols, individually or in groups\n   Report adverse events, serious adverse events, product complaints in accordance with Innomar training and policies & procedures\n   Provides reliable availability based on the agreed upon employment agreement to meet the needs of the IBU and the Nursing and clinics Key Performance Indicators.\n   Communicates and works effectively amongst multi-disciplinary teams i.e. case managers, physicians, pharmacy, scheduling and other departments to meet established timelines for scheduling appointments and treatments.\n   Communicates effectively with Patients/Caregivers to set up appointments and drug delivery to home and clinic.\n   Participate regularly in team web-based meetings/training sessions with the Business Area Manager, RNE and Nurse Champion to maintain and enhance professional practice standards.\n   Participates in specialized client related trainings as required.\n   Adhere to professional nursing standards as prescribed by the professional associations and Innomar.\n   Work collaboratively within multidisciplinary health care team providing oversight and delegation of applicable tasks to RPN/LPN as authorized by provincial college of nurses\n   Required to travel within your designated IBU and surrounding IBUs to meet the operational needs.\n   Required to follow all nursing and clinic standard operating procedures and Work Instructions.\n   Required to follow all Health and Safety standards as per the provincial Health and safety Act.\n   Required to complete ongoing and annual education training as per the training matrix within the specified timeframes.\n   Perform other related duties and tasks as required by Innomar.\n   May be required to be on standby/on call to meet the service needs.\n \n \n \n  \n   \n    \n     \n      \n       \n        \n         \n          \n           \n            \n             \n              \n               \n                \n                 \n                  \n                   \n                    \n                     \n                      \n                        What your background should look like\n                      \n                     \n                    \n                   \n                  \n                 \n                \n               \n              \n             \n            \n           \n          \n         \n        \n       \n      \n     \n    \n   \n  \n \n \n \n  \n    EXPERIENCE AND EDUCATIONAL REQUIREMENTS:\n  \n  \n    Relevant experience as a Registered Nurse required\n    1 year experience IV initiation experience\n    Current registration with licensing body; CPR certificate\n    Experience in a critical care, emergency, acute care inpatient/outpatient or homecare setting\n    ACLS, PALs, MS and CVAA Certification, and central venous lines/port experience are considered assets\n    Proficient in MS Excel, Outlook (e-mail), and MS Word and other applicable computer programs.\n    Access to internet connection,\n    Knowledge of Cell phone for making and confirming appointments/assignments and fax machines.\n    Excellent customer service skills for managing daily interactions with: patients, family members, physicians and our clients. Strong written and verbal communication skills\n    Able to work autonomously with little supervision as part of a larger team\n    Able to travel to clinics and homecare appointments within a set geographical boundary\n  \n \n \n \n   MINIMUM SKILLS, KNOWLEDGE AND ABILITY REQUIREMENTS:\n \n \n   Advanced knowledge of pharmaceutical distribution industry is an asset.\n   Business and financial acumen is an asset.\n   Strong critical thinking skills and application\n   Ability to communicate effectively both orally and in writing\n   Effective interpersonal and leadership skills\n   Effective organizational skills; attention to detail\n   Effective time management and prioritization skills\n   Ability to consistently meet deadlines\n   Excellent problem-solving skills; ability to resolve issues effectively and efficiently\n   Excellent presentation skills\n   Self-directed with the ability to effectively work independently.\n   Ability to adapt to fast paced environment.\n   Hold and maintain a valid, non-expired, unrestricted driver's license and insurance coverage.\n \n \n \n   The successful candidate may have daily contacts with unilingual English-speaking customers, patients or peers from cross-functional teams.\n \n \n \n   What Cencora offers\n \n \n \n   We provide compensation, benefits, and resources that enable a highly inclusive culture and support our team members’ ability to live with purpose every day. In addition to traditional offerings like medical, dental, and vision care, we also provide a comprehensive suite of benefits that focus on the physical, emotional, financial, and social aspects of wellness. This encompasses support for working families, which may include backup dependent care, adoption assistance, infertility coverage, family building support, behavioral health solutions, paid parental leave, and paid caregiver leave.\n \n \n \n   To encourage your personal growth, we also offer a variety of training programs, professional development resources, and opportunities to participate in mentorship programs, employee resource groups, volunteer activities, and much more.\n \n \n \n   For details, visit https://www.virtualfairhub.com/amerisourcebergen\n \n \n   .\n \n \n \n   Schedule\n \n  Part time\n \n \n   Affiliated Companies:\n  Affiliated Companies: Innomar Strategies\n \n \n   Equal Employment Opportunity\n \n \n \n   Cencora is committed to providing equal employment opportunity without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, age, disability, veteran status or membership in any other class protected by federal, state or local law.\n \n \n \n   The company’s continued success depends on the full and effective utilization of qualified individuals. Therefore, harassment is prohibited and all matters related to recruiting, training, compensation, benefits, promotions and transfers comply with equal opportunity principles and are non-discriminatory.\n \n \n \n   AmerisourceBergen is committed to providing reasonable accommodations to individuals with disabilities during the employment process which are consistent with legal requirements. If you wish to request an accommodation while seeking employment, please call 888.692.2272 or email \n  \n   hrsc@amerisourcebergen.com\n  . We will make accommodation determinations on a request-by-request basis. Messages and emails regarding anything other than accommodations requests will not be returned\n \n \n \n   COVID-19 Vaccine Policy\n \n \n \n   As of October 18, 2021, Cencora requires all Canadian team members to be fully vaccinated and show proof of completed vaccine status at time of hire. If you cannot receive the COVID-19 vaccine due to a qualifying medical condition or sincerely held religious belief you will be required to follow AmerisourceBergen’s policy and process to apply for an \n  exemption/accommodation.\n \n \n \n   Accessibility Policy\n \n \n \n   AmerisourceBergen is committed to fair and accessible employment practices. When requested, AmerisourceBergen will accommodate people with disabilities during the recruitment, assessment and hiring processes and during employment."
}