{
    "id": "a63cd2606e3e74fc",
    "companyDescription": "",
    "description": "COMPANY OVERVIEW:\nSatcom Direct (SD) provides global connectivity solutions for business and general aviation, military, government, and land mobile services. Since 1997, SD has worked to solve the unsolvable and advance the technology of connectivity through our industry-leading hardware and flight operations software. Our company culture is based on innovation and creativity which allows our team members to thrive in a dynamic atmosphere. We are looking for people who are passionate about customer satisfaction and who excel in a constantly changing environment.\nSD Avionics is a division of Satcom Direct located in Kanata, the high-tech hub of Ottawa, Ontario. Our second largest site globally, this location manufactures avionics hardware, cabin routers, and the SD Plane Simple Antenna System.\nSatcom Direct offers a highly competitive benefits package, which includes comprehensive health, dental, vision, disability and life insurance. Employees have an on-site gym and robust vacation time to have an excellent work/life balance. Additional benefits include matching retirement plan, pet insurance, and critical-illness insurance.\nJOB SUMMARY:\nConsistently exemplifies the Satcom Direct (SD) mission, vision, and values focused around a philosophy directed toward customer service/satisfaction, job performance, and cooperative team interactions. Willingness to support organizational policies that foster \"continuous improvement\" activities, promote Satcom Direct's ongoing strategic growth plan, and maintain its position as the premier leader within the Aviation Satellite Communications industry. This position requires working with the Technical Support team to quickly and efficiently resolve customer complaints, troubleshoot IP and telephony networks, and maintain a proactive approach towards problem-solving.\nESSENTIAL DUTIES/RESPONSIBILITIES:\nTo perform the job successfully, an individual must be able to perform each essential duty satisfactorily and should demonstrate the following competencies to consistently execute the functions of this position. All employees are expected to adhere to and be knowledgeable of Satcom Direct (SD) operations standards, established safety/security rules, and requirements for company work guidelines.\nMain Responsibilities:\n\n Responsible for writing/reviewing and maintaining test cases and test plans.\n Responsible for executing and developing Test scripts/Test Reports\n Responsible for developing various Test Tools for automation.\n Support day-to-day Test efforts in the Lab and in the field.\n Raise Defects and help troubleshoot problems\n Ability to work autonomously as well as in a team environment\n Ability to identify deficiencies in product code and suggest improvements for testability.\n Demonstrate efficient work practices to meet delivery dates.\n Satellite communications experience (L-Band, Ka, Ku, etc.)\n Build/Maintain and troubleshooting system test racks that may include 1 or more of these component's (IP switches, routers, modems, wireless Access Points, SIP handsets, Antennas, protocol testers, signal generators, spectrum analyzers, power meters)\n Test case writing and execution on SATCOM terminals Routers, wireless access points, SIP handsets ETC, PBX\n Perform system tests, robustness, and performance tests.\n Perform customer defect testing and bug tracking.\n Understanding of tools used Jira ticketing system.\n Working with Support, Systems, Software, and Hardware teams to resolve requirements issues and defects.\n\nGENERAL QUALIFICATIONS, KNOWLEDGE, AND SKILLS:\nTo perform this job successfully, an individual must be able to meet the minimum qualifications established for education, knowledge, and skills in order to be effective. The requirements listed below are representative of the traits required for the position:\n\n At least 5 years of experience in Networking or Software testing\n Experience with Linux\n Business Aviation industry experience: aircraft OEM airframes and knowledge of current equipment utilized for aircraft communications (SATCOM, VHF, DATALINK)\n Coding in any of Python, C/C++, scripting\n Familiarity with the Atlassian tools (JIRA, Confluence) and Git source control\n Basic IP networking knowledge and experience( function of switches, routers etc.… )\n “Hands-on” IT ability, i.e. able to setup small ad-hoc IP networks and install operating system\n Experience in the use of test frameworks and unit tests in the testing of systems or software components (such as API’s or Libraries)\n\nEDUCATION, KNOWLEDGE, AND SKILLS:\n\n A minimum of a bachelor’s degree in computer science or related field.\n L-Band/Ku/Ka/Iridium network fundamentals and service.\n Fault isolation/and capable of reading debug/log files from Satcom terminals.\n Understanding of Protocols ISDN, CEPT-E1, FXO/FXS\n Understanding of Arinc protocols and specifications\n Network+, Linux+\n Proficient with general office software including but not limited to; Microsoft Office Suite; Word, Excel, and PowerPoint.\n Outlook, and CRM, with the ability to adapt to a variety of other software databases.\n Outstanding customer service, organizational, time management skills, and ability to multi-task.\n Excellent oral and written communication skills including the ability to interact successfully with internal and external contacts.\n Excellent interpersonal skills and demonstrated ability to work in a team as well as independently.\n Effective and confident decision-making and problem-solving skills, especially under time constraints.\n Ability to maintain confidentiality.\n Must be able to perform independently and in a team environment.\n Ability to travel.\n\nPHYSICAL DEMANDS:\nWhile performing general office duties for this position, the employee is regularly required to sit, stand and/or walk around (including the use of stairs). Other demands include the ability to openly communicate with others by talking, listening, and reading, able to lift light objects (<25lbs), and use standard office equipment such as computer, printer, phone and cell phone. In addition, there is an occasional need to bend, twist or stoop in order to open/close cabinets, reach for files or other standard office type objects.\nWORK ENVIRONMENT:\nThe office environment is generally quiet and, in a temperature, controlled setting with random adjustments in noise or temperature due to others talking or laughing loudly, unscheduled maintenance repairs to the building or its interior offices or unpredictable situations due to weather or other acts beyond company control. An employee must be willing to work their regularly assigned work schedule for their particular duties and/or job responsibilities and in times of need, be able to work an extended schedule depending on company/department needs, project requirements or customer demands. Work may require some physical effort in the handling of light materials, boxes or equipment. The temperature at client locations can vary from controlled to variations off hot/cold when working, standing or walking in or near the flight-line or maintenance repair center.\nIf you are interested in applying for employment and need special assistance or an accommodation to apply for a posted position, contact our Human Resources department at (321) 777-3000\nSD Avionics is committed to hiring the most qualified candidates for approved company positions, without preference to any individual on the basis of race, color, age, religion, gender, sexual orientation, disability, or national origin. Our policy is to engage in recruitment and selection practices that are in compliance with all applicable national or local employment laws. SD Avionics and its various international entities follow talent acquisition practices that identify qualified and diverse candidates, promote opportunities for employee development, and provide equal employment opportunity for all applicants and employees. SD Avionics promotes equity in employment: As an equal opportunity employer, we welcome applications from women, Indigenous peoples, persons with disabilities and members of visible minorities.\nJob Type: Full-time\nBenefits:\n\n Company events\n Dental care\n Disability insurance\n Employee assistance program\n Extended health care\n Life insurance\n On-site gym\n On-site parking\n Paid time off\n RRSP match\n Vision care\n\nSchedule:\n\n Monday to Friday\n\nAbility to commute/relocate:\n\n Kanata, ON K2K 0A1: reliably commute or plan to relocate before starting work (required)\n\nEducation:\n\n Bachelor's Degree (preferred)\n\nExperience:\n\n networking or software testing: 5 years (preferred)\n\nWillingness to travel:\n\n 25% (preferred)\n\nWork Location: In person",
    "preprocessed_description": "COMPANY OVERVIEW: Satcom Direct (SD) provides global connectivity solutions for business and general aviation, military, government, and land mobile services. Since 1997, SD has worked to solve the unsolvable and advance the technology of connectivity through our industry-leading hardware and flight operations software. Our company culture is based on innovation and creativity which allows our team members to thrive in a dynamic atmosphere. We are looking for people who are passionate about customer satisfaction and who excel in a constantly changing environment. SD Avionics is a division of Satcom Direct located in Kanata, the high-tech hub of Ottawa, Ontario. Our second largest site globally, this location manufactures avionics hardware, cabin routers, and the SD Plane Simple Antenna System. Satcom Direct offers a highly competitive benefits package, which includes comprehensive health, dental, vision, disability and life insurance. Employees have an on-site gym and robust vacation time to have an excellent work/life balance. Additional benefits include matching retirement plan, pet insurance, and critical-illness insurance. JOB SUMMARY: Consistently exemplifies the Satcom Direct (SD) mission, vision, and values focused around a philosophy directed toward customer service/satisfaction, job performance, and cooperative team interactions. Willingness to support organizational policies that foster \"continuous improvement\" activities, promote Satcom Direct's ongoing strategic growth plan, and maintain its position as the premier leader within the Aviation Satellite Communications industry. This position requires working with the Technical Support team to quickly and efficiently resolve customer complaints, troubleshoot IP and telephony networks, and maintain a proactive approach towards problem-solving. ESSENTIAL DUTIES/RESPONSIBILITIES: To perform the job successfully, an individual must be able to perform each essential duty satisfactorily and should demonstrate the following competencies to consistently execute the functions of this position. All employees are expected to adhere to and be knowledgeable of Satcom Direct (SD) operations standards, established safety/security rules, and requirements for company work guidelines. Main Responsibilities: Responsible for writing/reviewing and maintaining test cases and test plans. Responsible for executing and developing Test scripts/Test Reports Responsible for developing various Test Tools for automation. Support day-to-day Test efforts in the Lab and in the field. Raise Defects and help troubleshoot problems Ability to work autonomously as well as in a team environment Ability to identify deficiencies in product code and suggest improvements for testability. Demonstrate efficient work practices to meet delivery dates. Satellite communications experience (L-Band, Ka, Ku, etc.) Build/Maintain and troubleshooting system test racks that may include 1 or more of these component's (IP switches, routers, modems, wireless Access Points, SIP handsets, Antennas, protocol testers, signal generators, spectrum analyzers, power meters) Test case writing and execution on SATCOM terminals Routers, wireless access points, SIP handsets ETC, PBX Perform system tests, robustness, and performance tests. Perform customer defect testing and bug tracking. Understanding of tools used Jira ticketing system. Working with Support, Systems, Software, and Hardware teams to resolve requirements issues and defects. GENERAL QUALIFICATIONS, KNOWLEDGE, AND SKILLS: To perform this job successfully, an individual must be able to meet the minimum qualifications established for education, knowledge, and skills in order to be effective. The requirements listed below are representative of the traits required for the position: At least 5 years of experience in Networking or Software testing Experience with Linux Business Aviation industry experience: aircraft OEM airframes and knowledge of current equipment utilized for aircraft communications (SATCOM, VHF, DATALINK) Coding in any of Python, C/C++, scripting Familiarity with the Atlassian tools (JIRA, Confluence) and Git source control Basic IP networking knowledge and experience( function of switches, routers etc.… ) \"Hands-on\" IT ability, i.e. able to setup small ad-hoc IP networks and install operating system Experience in the use of test frameworks and unit tests in the testing of systems or software components (such as Application Programming Interface's or Libraries) EDUCATION, KNOWLEDGE, AND SKILLS: A minimum of a bachelor's degree in computer science or related field. L-Band/Ku/Ka/Iridium network fundamentals and service. Fault isolation/and capable of reading debug/log files from Satcom terminals. Understanding of Protocols ISDN, CEPT-E1, FXO/FXS Understanding of Arinc protocols and specifications Network+, Linux+ Proficient with general office software including but not limited to; Microsoft Office Suite; Word, Excel, and PowerPoint. Outlook, and Customer Relationship Management, with the ability to adapt to a variety of other software databases. Outstanding customer service, organizational, time management skills, and ability to multi-task. Excellent oral and written communication skills including the ability to interact successfully with internal and external contacts. Excellent interpersonal skills and demonstrated ability to work in a team as well as independently. Effective and confident decision-making and problem-solving skills, especially under time constraints. Ability to maintain confidentiality. Must be able to perform independently and in a team environment. Ability to travel. PHYSICAL DEMANDS: While performing general office duties for this position, the employee is regularly required to sit, stand and/or walk around (including the use of stairs). Other demands include the ability to openly communicate with others by talking, listening, and reading, able to lift light objects (<25lbs), and use standard office equipment such as computer, printer, phone and cell phone. In addition, there is an occasional need to bend, twist or stoop in order to open/close cabinets, reach for files or other standard office type objects. WORK ENVIRONMENT: The office environment is generally quiet and, in a temperature, controlled setting with random adjustments in noise or temperature due to others talking or laughing loudly, unscheduled maintenance repairs to the building or its interior offices or unpredictable situations due to weather or other acts beyond company control. An employee must be willing to work their regularly assigned work schedule for their particular duties and/or job responsibilities and in times of need, be able to work an extended schedule depending on company/department needs, project requirements or customer demands. Work may require some physical effort in the handling of light materials, boxes or equipment. The temperature at client locations can vary from controlled to variations off hot/cold when working, standing or walking in or near the flight-line or maintenance repair center. If you are interested in applying for employment and need special assistance or an accommodation to apply for a posted position, contact our Human Resources department at (321) 777-3000 SD Avionics is committed to hiring the most qualified candidates for approved company positions, without preference to any individual on the basis of race, color, age, religion, gender, sexual orientation, disability, or national origin. Our policy is to engage in recruitment and selection practices that are in compliance with all applicable national or local employment laws. SD Avionics and its various international entities follow talent acquisition practices that identify qualified and diverse candidates, promote opportunities for employee development, and provide equal employment opportunity for all applicants and employees. SD Avionics promotes equity in employment: As an equal opportunity employer, we welcome applications from women, Indigenous peoples, persons with disabilities and members of visible minorities. Job Type: Full-time Benefits: Company events Dental care Disability insurance Employee assistance program Extended health care Life insurance On-site gym On-site parking Paid time off RRSP match Vision care Schedule: Monday to Friday Ability to commute/relocate: Kanata, ON K2K 0A1: reliably commute or plan to relocate before starting work (required) Education: Bachelor's Degree (preferred) Experience: networking or software testing: 5 years (preferred) Willingness to travel: 25% (preferred) Work Location: In person",
    "processed_description": "company OVERVIEW SD provide global connectivity solution business general aviation military government land mobile service . solve unsolvable advance technology connectivity industry lead hardware flight operation software . company culture base innovation creativity allow team thrive dynamic atmosphere . people passionate customer satisfaction excel constantly change environment . division locate high tech hub . second large site globally location manufacture avionic hardware cabin router . offer highly competitive benefit package include comprehensive health dental vision life insurance . employee site gym robust vacation excellent life balance . additional benefit include match retirement plan pet insurance critical illness insurance . summary consistently exemplify Satcom Direct SD mission vision focus philosophy direct customer service satisfaction performance cooperative team interaction . willingness support organizational policy foster continuous improvement activity promote Satcom Direct's ongoing strategic growth plan maintain position premier leader Aviation Satellite Communications industry . position require Technical Support team efficiently resolve customer complaint troubleshoot ip telephony network maintain proactive approach problem solving . ESSENTIAL duty responsibility perform individual perform essential duty satisfactorily demonstrate follow competency consistently execute function position . employee expect adhere knowledgeable sd operation standard establish safety security rule requirement company guideline . Main responsibility responsible write review maintain test case test plan . responsible execute develop test script Test Reports responsible develop Test Tools automation . support test effort lab field . raise defect help troubleshoot problem autonomously team environment identify deficiency product code improvement testability . demonstrate efficient practice meet delivery . satellite communication Ka Ku . build maintain troubleshoot system test rack include component's ip switch router modem SIP handset Antennas protocol tester signal generator spectrum analyzer power meter test case writing execution wireless access point SIP handset PBX perform system test robustness performance test . perform customer defect testing bug tracking . understand tool Jira ticketing system . Hardware team resolve requirement issue defect . general qualification KNOWLEDGE skill perform individual meet minimum qualification establish education knowledge skill order effective . requirement list representative trait require position Networking Software testing Linux Business Aviation industry aircraft OEM airframe knowledge current equipment utilize aircraft communication VHF DATALINK code Python C++ script Familiarity atlassian tool JIRA Confluence Git source control Basic ip networking knowledge function switch router . ... hand i.e. setup small ad hoc ip network install operating system test framework unit test testing system software component Libraries EDUCATION KNOWLEDGE skill minimum bachelor's degree computer science field . Band Ku Ka Iridium network fundamental service . fault isolation capable read debug log file Satcom terminal . understand Protocols ISDN Arinc protocol specification Network+ Linux+ proficient general office software include limit Microsoft Office Suite Word . outlook adapt variety software database . outstanding customer service organizational management skill multi task . excellent oral write communication skill include interact internal external contact . excellent interpersonal skill demonstrate team independently . effective confident decision making problem solve skill constraint . maintain confidentiality . perform independently team environment . travel . PHYSICAL demand perform general office duty position employee regularly require sit stand walk include stair . demand include openly communicate talk listen reading lift light object < standard office equipment computer printer phone cell phone . addition occasional bend twist stoop order open close cabinet reach file standard office type object . environment office environment generally quiet temperature control setting random adjustment noise temperature talk laugh loudly unscheduled maintenance repair building interior office unpredictable situation weather company control . employee regularly assign schedule duty responsibility extended schedule depend company department project requirement customer demand . require physical effort handling light material box equipment . temperature client location vary control variation hot cold stand walk flight maintenance repair center . interested apply employment special assistance accommodation apply post position contact Human Resources department commit hire qualified approve company position preference individual basis race color age religion gender sexual orientation national origin . policy engage recruitment selection practice compliance applicable national local employment law . international entity follow talent acquisition practice identify qualified diverse promote employee development provide equal employment applicant employee . promote equity employment equal employer application woman indigenous people person visible minority . type benefit company event dental care insurance Employee assistance program extended health care Life insurance site gym site parking Paid RRSP match vision care Schedule commute relocate 0a1 reliably commute plan relocate start require education Bachelor's Degree preferred networking software testing prefer willingness travel preferred location person",
    "results_group": {
        "extracted_noun_chunks": [
            "system test robustness performance test",
            "outlook",
            "equity employment equal employer application woman indigenous people person",
            "company position preference",
            "troubleshoot problem",
            "customer defect testing bug tracking",
            "Network+ Linux+ proficient general office software",
            "support test effort lab field",
            "company culture base innovation creativity",
            "satellite communication Ka Ku",
            "education",
            "light material box equipment",
            "Satcom Direct's ongoing strategic growth plan",
            "team environment",
            "Basic ip networking knowledge function switch router",
            "standard office equipment computer printer phone cell phone",
            "business general aviation military government",
            "individual meet minimum qualification",
            "international entity",
            "source control",
            "Satcom Direct SD mission vision",
            "requirement issue defect",
            "confidentiality",
            "function position",
            "deficiency product code improvement testability",
            "essential duty",
            "start",
            "environment office environment",
            "excellent interpersonal skill",
            "loudly unscheduled maintenance repair building interior office unpredictable situation weather company control",
            "match retirement plan pet insurance critical illness insurance",
            "proactive approach problem",
            "ESSENTIAL duty responsibility",
            "safety security rule requirement company guideline",
            "efficient practice",
            "employee development",
            "hardware flight operation software",
            "position Networking Software",
            "defect help",
            "Band Ku Ka Iridium network fundamental service",
            "component's ip switch router modem",
            "OEM",
            "small ad hoc ip network install operating system test framework unit test testing system software component Libraries EDUCATION",
            "high tech hub",
            "philosophy direct customer service satisfaction performance cooperative team interaction",
            "general office duty position employee",
            "Python C++ script Familiarity atlassian tool JIRA Confluence Git",
            "environment",
            "health care Life insurance site gym site parking Paid RRSP match vision care Schedule commute",
            "policy",
            "VHF DATALINK code",
            "execution",
            "knowledgeable sd operation standard",
            "troubleshoot system test rack",
            "highly competitive benefit package",
            "demand",
            "type benefit company event dental care insurance Employee assistance program",
            "dynamic atmosphere",
            "light object",
            "education knowledge skill order",
            "schedule duty responsibility",
            "recruitment selection practice compliance applicable national local employment law",
            "internal external contact",
            "addition occasional bend twist stoop order",
            "outstanding customer service organizational management skill multi task",
            "excellent oral write communication skill",
            "team",
            "additional benefit",
            "avionic hardware cabin router",
            "close cabinet reach file standard office type object",
            "aircraft communication",
            "customer complaint troubleshoot ip telephony network",
            "sit stand walk",
            "company OVERVIEW SD",
            "0a1 reliably commute plan",
            "willingness",
            "requirement list representative trait",
            "tool Jira ticketing system",
            "organizational policy foster continuous improvement activity",
            "people",
            "second large site globally location",
            "visible minority",
            "temperature control",
            "Protocols ISDN Arinc protocol specification",
            "test case test plan",
            "temperature client location",
            "fault isolation",
            "delivery",
            "unsolvable advance technology connectivity industry",
            "effective confident decision making problem",
            "Antennas protocol tester signal generator spectrum analyzer power meter test case",
            "employee",
            "stair",
            "talent acquisition practice",
            "extended schedule",
            "comprehensive health dental vision life insurance",
            "general qualification KNOWLEDGE skill",
            "debug log file Satcom terminal",
            "position",
            "employment special assistance accommodation",
            "PHYSICAL demand",
            "Microsoft Office Suite Word",
            "employee site gym robust vacation excellent life balance",
            "SIP",
            "division",
            "Hardware team",
            "hand i.e. setup",
            "SIP handset PBX",
            "Technical Support team",
            "post position contact Human Resources department commit",
            "physical effort",
            "variety software database",
            "follow competency",
            "equal employment applicant employee",
            "summary",
            "responsible execute develop test script Test Reports",
            "position premier leader Aviation Satellite Communications industry",
            "company department project requirement customer demand",
            "Test Tools automation",
            "skill constraint",
            "random adjustment noise temperature talk",
            "talk listen",
            "Bachelor's Degree preferred networking software testing",
            "Main responsibility responsible write review"
        ],
        "combined_lemmatized_tokens": "company OVERVIEW SD provide global connectivity solution business general aviation military government land mobile service . solve unsolvable advance technology connectivity industry lead hardware flight operation software . company culture base innovation creativity allow team thrive dynamic atmosphere . people passionate customer satisfaction excel constantly change environment . division locate high tech hub . second large site globally location manufacture avionic hardware cabin router . offer highly competitive benefit package include comprehensive health dental vision life insurance . employee site gym robust vacation excellent life balance . additional benefit include match retirement plan pet insurance critical illness insurance . summary consistently exemplify Satcom Direct SD mission vision focus philosophy direct customer service satisfaction performance cooperative team interaction . willingness support organizational policy foster continuous improvement activity promote Satcom Direct's ongoing strategic growth plan maintain position premier leader Aviation Satellite Communications industry . position require Technical Support team efficiently resolve customer complaint troubleshoot ip telephony network maintain proactive approach problem solving . ESSENTIAL duty responsibility perform individual perform essential duty satisfactorily demonstrate follow competency consistently execute function position . employee expect adhere knowledgeable sd operation standard establish safety security rule requirement company guideline . Main responsibility responsible write review maintain test case test plan . responsible execute develop test script Test Reports responsible develop Test Tools automation . support test effort lab field . raise defect help troubleshoot problem autonomously team environment identify deficiency product code improvement testability . demonstrate efficient practice meet delivery . satellite communication Ka Ku . build maintain troubleshoot system test rack include component's ip switch router modem SIP handset Antennas protocol tester signal generator spectrum analyzer power meter test case writing execution wireless access point SIP handset PBX perform system test robustness performance test . perform customer defect testing bug tracking . understand tool Jira ticketing system . Hardware team resolve requirement issue defect . general qualification KNOWLEDGE skill perform individual meet minimum qualification establish education knowledge skill order effective . requirement list representative trait require position Networking Software testing Linux Business Aviation industry aircraft OEM airframe knowledge current equipment utilize aircraft communication VHF DATALINK code Python C++ script Familiarity atlassian tool JIRA Confluence Git source control Basic ip networking knowledge function switch router . ... hand i.e. setup small ad hoc ip network install operating system test framework unit test testing system software component Libraries EDUCATION KNOWLEDGE skill minimum bachelor's degree computer science field . Band Ku Ka Iridium network fundamental service . fault isolation capable read debug log file Satcom terminal . understand Protocols ISDN Arinc protocol specification Network+ Linux+ proficient general office software include limit Microsoft Office Suite Word . outlook adapt variety software database . outstanding customer service organizational management skill multi task . excellent oral write communication skill include interact internal external contact . excellent interpersonal skill demonstrate team independently . effective confident decision making problem solve skill constraint . maintain confidentiality . perform independently team environment . travel . PHYSICAL demand perform general office duty position employee regularly require sit stand walk include stair . demand include openly communicate talk listen reading lift light object < standard office equipment computer printer phone cell phone . addition occasional bend twist stoop order open close cabinet reach file standard office type object . environment office environment generally quiet temperature control setting random adjustment noise temperature talk laugh loudly unscheduled maintenance repair building interior office unpredictable situation weather company control . employee regularly assign schedule duty responsibility extended schedule depend company department project requirement customer demand . require physical effort handling light material box equipment . temperature client location vary control variation hot cold stand walk flight maintenance repair center . interested apply employment special assistance accommodation apply post position contact Human Resources department commit hire qualified approve company position preference individual basis race color age religion gender sexual orientation national origin . policy engage recruitment selection practice compliance applicable national local employment law . international entity follow talent acquisition practice identify qualified diverse promote employee development provide equal employment applicant employee . promote equity employment equal employer application woman indigenous people person visible minority . type benefit company event dental care insurance Employee assistance program extended health care Life insurance site gym site parking Paid RRSP match vision care Schedule commute relocate 0a1 reliably commute plan relocate start require education Bachelor's Degree preferred networking software testing prefer willingness travel preferred location person"
    }
}