{
    "id": "7e6805a5a99d52cd",
    "company": "MED-ENG & PSP - THE SAFARILAND GROUP",
    "positionName": "Business Development Manager",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-06T02:05:36.958Z",
    "url": "https://www.indeed.ca/rc/clk?jk=7e6805a5a99d52cd&from=jasx&tk=1hc6gghag2p31000&vjs=3",
    "externalApplyLink": "https://globalus231.dayforcehcm.com/CandidatePortal/en-US/safariland/Site/CANADACAREERSITE/Posting/View/2765?source=Indeed",
    "companyDescription": "",
    "description": "TOGETHER, WE SAVE LIVES \n\n OVERVIEW \n\n Responsible for manager (a) Program development, (b) Pricing, (c) Inside Sales Support department (d) Channel management, (e) Salesforce.com and (f) APEX portal. This department has the responsibility for lifecycle management of all opportunities, the off-structure pricing process and sales support for all Safariland channels and markets. Responsible for the evaluation of regional business/product/marketing strategies to develop a Channels approach to achieve business development objectives through strategic bidding dealers. Responsible for channel performance through financial analysis of distribution, acquire and delete distributors as needed. Responsible for an internal CRM platform and an external customer facing portal. Responsible for financial planning, budgeting reporting and analysis for the Sales and Business Development organization. \n\n RESPONSIBILITIES \n\n \n Develops and implements templates and SOP’s governing contract, pricing and sales support processes \n Automates and creates KPI’s for sales support activities through Salesforce.com \n Provides analytical support with regards to pricing, contracts and promotional opportunities \n Responsible for the development and implementation of bidding dealer channel programs with input from Sales and Marketing \n Lead the development, manage and analyze our ongoing Primary Marketing Areas (PMA’s) effort to identify macro opportunities (by region) \n Directs the operational activities of the department including staffing levels \n Relies on extensive experience and judgment to plan and accomplish goals \n Constructs cost/price analysis and strategic response strategies for RFP’s. \n Oversees all bids and RFP execution, to include compliant technical solutions, proper technical documentation, product collateral, and required legal documentation within an organized and timely proposal \n Responsible for managing, administering and continued rollouts of the APEX portal, Customer Master and Salesforce.com platforms \n Oversees coordination of proposal preparation, statements of work, specifications, negotiation and administration of contracts \n Oversees the management of request for bids, proposals, and competitor information. \n Analyzes business proposals to ensure profitability \n Assist in the development of sales goals for field force that align with company budget forecast \n Creates and maintain as repository of competitive information as to why/how a bid was lost/won to be used for future bids as well as provide a means to improve Safariland margins. \n Conducts ROI review for all direct and indirect tenders. \n Prepares a variety of reports for upper management to include status of projects, success rates and forecasting timing. \n Creates and maintains analysis tools to store and utilize win/loss analysis, competitive pricing information, contract renewal flags and price increase flags \n Works in cross-functional teams with Sales, Marketing, Manufacturing, Finance and Channels \n Ensure department is well-informed, at all times, of changes and events within the department and organization \n Champions change and effectively manages the implementation of enw ideas and improvement initiatives throughout the team. \n Eliminates waste to increase cost savings in department \n Performs other duties as needed \n May supervisor up one or more direct reports \n May have one or more indirect reports \n Analyze and approve pricing and off-structure pricing at a defined level of authority \n Exercises staff oversight to ensure new operations, plans, policies, procedures and transition/migration plans are consistent with overall company goals and objectives \n QUALIFICATIONS \n\n \n Ten (10) or more years of related experience and/or training; or equivalent combination of education and experience. \n Prior pricing, contracts and promotional experience preferred \n Bachelor’s degree in business management or relevant field or equivalent combination of education and experience. \n Analyze and update retail pricing based on market forces. \n Set pricing on new products based on market intelligence \n Gather competitive information and review pricing versus competition \n Ability to monitor, collect and interpret data and to redesign processing as needed using best methods to exceed business needs. \n Ability to convey information clearly and concisely to groups and individuals \n Ability to take action consistent with facts, constraints, and anticipated consequences. \n Identify issues and alternative solutions \n Prioritize brand review based on need \n Ability to work in cross-functional teams with other departments to move towards the completion of goals and to manage conflict as it arises. \n Familiarity with a variety of program/contract vehicles. \n Strong organizational skills and ability to manage multiple tasks \n Ability to multitask on a variety of projects \n Must have strong leadership skills and decision-making capabilities \n Maintain effectiveness when experiencing major changes in the work environment \n Ability to work with deadlines and deal with high stress situations. \n Provide guidance and feedback to assist groups of employees while building and maintaining work relationships. \n The Safariland Group believes in the benefits of a diverse workforce and is committed to equal opportunity and affirmative actions. We pride ourselves on hiring and developing the best people, without regard to age, sex, sexual orientation, gender identity, genetic characteristics, race, color, creed, religion, ethnicity, national origin, alienage, citizenship, disability, marital status, military status, pregnancy, or any other legally-recognized protected basis prohibited by applicable law. \n\n For those applicants with disabilities, if you require reasonable accommodation in searching for a job opening or submitting an application, please contact us by calling 888-469-6455. \n\n All employment decisions are solely based on the applicant's qualifications as they relate to the requirements of the position."
}