{
    "id": "7e6805a5a99d52cd",
    "companyDescription": "",
    "description": "TOGETHER, WE SAVE LIVES \n\n OVERVIEW \n\n Responsible for manager (a) Program development, (b) Pricing, (c) Inside Sales Support department (d) Channel management, (e) Salesforce.com and (f) APEX portal. This department has the responsibility for lifecycle management of all opportunities, the off-structure pricing process and sales support for all Safariland channels and markets. Responsible for the evaluation of regional business/product/marketing strategies to develop a Channels approach to achieve business development objectives through strategic bidding dealers. Responsible for channel performance through financial analysis of distribution, acquire and delete distributors as needed. Responsible for an internal CRM platform and an external customer facing portal. Responsible for financial planning, budgeting reporting and analysis for the Sales and Business Development organization. \n\n RESPONSIBILITIES \n\n \n Develops and implements templates and SOP’s governing contract, pricing and sales support processes \n Automates and creates KPI’s for sales support activities through Salesforce.com \n Provides analytical support with regards to pricing, contracts and promotional opportunities \n Responsible for the development and implementation of bidding dealer channel programs with input from Sales and Marketing \n Lead the development, manage and analyze our ongoing Primary Marketing Areas (PMA’s) effort to identify macro opportunities (by region) \n Directs the operational activities of the department including staffing levels \n Relies on extensive experience and judgment to plan and accomplish goals \n Constructs cost/price analysis and strategic response strategies for RFP’s. \n Oversees all bids and RFP execution, to include compliant technical solutions, proper technical documentation, product collateral, and required legal documentation within an organized and timely proposal \n Responsible for managing, administering and continued rollouts of the APEX portal, Customer Master and Salesforce.com platforms \n Oversees coordination of proposal preparation, statements of work, specifications, negotiation and administration of contracts \n Oversees the management of request for bids, proposals, and competitor information. \n Analyzes business proposals to ensure profitability \n Assist in the development of sales goals for field force that align with company budget forecast \n Creates and maintain as repository of competitive information as to why/how a bid was lost/won to be used for future bids as well as provide a means to improve Safariland margins. \n Conducts ROI review for all direct and indirect tenders. \n Prepares a variety of reports for upper management to include status of projects, success rates and forecasting timing. \n Creates and maintains analysis tools to store and utilize win/loss analysis, competitive pricing information, contract renewal flags and price increase flags \n Works in cross-functional teams with Sales, Marketing, Manufacturing, Finance and Channels \n Ensure department is well-informed, at all times, of changes and events within the department and organization \n Champions change and effectively manages the implementation of enw ideas and improvement initiatives throughout the team. \n Eliminates waste to increase cost savings in department \n Performs other duties as needed \n May supervisor up one or more direct reports \n May have one or more indirect reports \n Analyze and approve pricing and off-structure pricing at a defined level of authority \n Exercises staff oversight to ensure new operations, plans, policies, procedures and transition/migration plans are consistent with overall company goals and objectives \n QUALIFICATIONS \n\n \n Ten (10) or more years of related experience and/or training; or equivalent combination of education and experience. \n Prior pricing, contracts and promotional experience preferred \n Bachelor’s degree in business management or relevant field or equivalent combination of education and experience. \n Analyze and update retail pricing based on market forces. \n Set pricing on new products based on market intelligence \n Gather competitive information and review pricing versus competition \n Ability to monitor, collect and interpret data and to redesign processing as needed using best methods to exceed business needs. \n Ability to convey information clearly and concisely to groups and individuals \n Ability to take action consistent with facts, constraints, and anticipated consequences. \n Identify issues and alternative solutions \n Prioritize brand review based on need \n Ability to work in cross-functional teams with other departments to move towards the completion of goals and to manage conflict as it arises. \n Familiarity with a variety of program/contract vehicles. \n Strong organizational skills and ability to manage multiple tasks \n Ability to multitask on a variety of projects \n Must have strong leadership skills and decision-making capabilities \n Maintain effectiveness when experiencing major changes in the work environment \n Ability to work with deadlines and deal with high stress situations. \n Provide guidance and feedback to assist groups of employees while building and maintaining work relationships. \n The Safariland Group believes in the benefits of a diverse workforce and is committed to equal opportunity and affirmative actions. We pride ourselves on hiring and developing the best people, without regard to age, sex, sexual orientation, gender identity, genetic characteristics, race, color, creed, religion, ethnicity, national origin, alienage, citizenship, disability, marital status, military status, pregnancy, or any other legally-recognized protected basis prohibited by applicable law. \n\n For those applicants with disabilities, if you require reasonable accommodation in searching for a job opening or submitting an application, please contact us by calling 888-469-6455. \n\n All employment decisions are solely based on the applicant's qualifications as they relate to the requirements of the position.",
    "preprocessed_description": "TOGETHER, WE SAVE LIVES OVERVIEW Responsible for manager (a) Program development, (b) Pricing, (c) Inside Sales Support department (d) Channel management, (e) Salesforce.com and (f) APEX portal. This department has the responsibility for lifecycle management of all opportunities, the off-structure pricing process and sales support for all Safariland channels and markets. Responsible for the evaluation of regional business/product/marketing strategies to develop a Channels approach to achieve business development objectives through strategic bidding dealers. Responsible for channel performance through financial analysis of distribution, acquire and delete distributors as needed. Responsible for an internal Customer Relationship Management platform and an external customer facing portal. Responsible for financial planning, budgeting reporting and analysis for the Sales and Business Development organization. RESPONSIBILITIES Develops and implements templates and SOP's governing contract, pricing and sales support processes Automates and creates Key Performance Indicators's for sales support activities through Salesforce.com Provides analytical support with regards to pricing, contracts and promotional opportunities Responsible for the development and implementation of bidding dealer channel programs with input from Sales and Marketing Lead the development, manage and analyze our ongoing Primary Marketing Areas (PMA's) effort to identify macro opportunities (by region) Directs the operational activities of the department including staffing levels Relies on extensive experience and judgment to plan and accomplish goals Constructs cost/price analysis and strategic response strategies for Request for Proposal's. Oversees all bids and Request for Proposal execution, to include compliant technical solutions, proper technical documentation, product collateral, and required legal documentation within an organized and timely proposal Responsible for managing, administering and continued rollouts of the APEX portal, Customer Master and Salesforce.com platforms Oversees coordination of proposal preparation, statements of work, specifications, negotiation and administration of contracts Oversees the management of request for bids, proposals, and competitor information. Analyzes business proposals to ensure profitability Assist in the development of sales goals for field force that align with company budget forecast Creates and maintain as repository of competitive information as to why/how a bid was lost/won to be used for future bids as well as provide a means to improve Safariland margins. Conducts Return on Investment review for all direct and indirect tenders. Prepares a variety of reports for upper management to include status of projects, success rates and forecasting timing. Creates and maintains analysis tools to store and utilize win/loss analysis, competitive pricing information, contract renewal flags and price increase flags Works in cross-functional teams with Sales, Marketing, Manufacturing, Finance and Channels Ensure department is well-informed, at all times, of changes and events within the department and organization Champions change and effectively manages the implementation of enw ideas and improvement initiatives throughout the team. Eliminates waste to increase cost savings in department Performs other duties as needed May supervisor up one or more direct reports May have one or more indirect reports Analyze and approve pricing and off-structure pricing at a defined level of authority Exercises staff oversight to ensure new operations, plans, policies, procedures and transition/migration plans are consistent with overall company goals and objectives QUALIFICATIONS Ten (10) or more years of related experience and/or training; or equivalent combination of education and experience. Prior pricing, contracts and promotional experience preferred Bachelor's degree in business management or relevant field or equivalent combination of education and experience. Analyze and update retail pricing based on market forces. Set pricing on new products based on market intelligence Gather competitive information and review pricing versus competition Ability to monitor, collect and interpret data and to redesign processing as needed using best methods to exceed business needs. Ability to convey information clearly and concisely to groups and individuals Ability to take action consistent with facts, constraints, and anticipated consequences. Identify issues and alternative solutions Prioritize brand review based on need Ability to work in cross-functional teams with other departments to move towards the completion of goals and to manage conflict as it arises. Familiarity with a variety of program/contract vehicles. Strong organizational skills and ability to manage multiple tasks Ability to multitask on a variety of projects Must have strong leadership skills and decision-making capabilities Maintain effectiveness when experiencing major changes in the work environment Ability to work with deadlines and deal with high stress situations. Provide guidance and feedback to assist groups of employees while building and maintaining work relationships. The Safariland Group believes in the benefits of a diverse workforce and is committed to equal opportunity and affirmative actions. We pride ourselves on hiring and developing the best people, without regard to age, sex, sexual orientation, gender identity, genetic characteristics, race, color, creed, religion, ethnicity, national origin, alienage, citizenship, disability, marital status, military status, pregnancy, or any other legally-recognized protected basis prohibited by applicable law. For those applicants with disabilities, if you require reasonable accommodation in searching for a job opening or submitting an application, please contact us by calling 888-469-6455. All employment decisions are solely based on the applicant's qualifications as they relate to the requirements of the position.",
    "processed_description": "SAVE live overview responsible manager Program development Pricing inside Sales Support department Channel management portal . department responsibility lifecycle management structure pricing process sale support Safariland channel market . responsible evaluation regional business product marketing strategy develop Channels approach achieve business development objective strategic bidding dealer . responsible channel performance financial analysis distribution acquire delete distributor . responsible internal Customer Relationship Management platform external customer face portal . responsible financial planning budget reporting analysis Sales Business Development organization . responsibility develop implement template SOP's governing contract pricing sale support process Automates create key Performance Indicators sale support activity provide analytical support regard pricing contract promotional responsible development implementation bidding dealer channel program input Sales Marketing Lead development manage analyze PMA's effort identify macro region direct operational activity department include staffing level relie extensive judgment plan accomplish goal construct cost price analysis strategic response strategy request Proposal . Oversees bid request proposal execution include compliant technical solution proper technical documentation product collateral require legal documentation organized timely proposal responsible manage administer continued rollout APEX portal platform Oversees coordination proposal preparation statement specification negotiation administration contract Oversees management request bid proposal competitor information . analyzes business proposal ensure profitability assist development sale goal field force align company budget forecast create maintain repository competitive information bid lose win future bid provide improve Safariland margin . conduct return investment review direct indirect tender . prepare variety report upper management include status project success rate forecasting timing . create maintain analysis tool store utilize win loss analysis competitive pricing information contract renewal flag price increase flag cross functional team Sales Marketing Manufacturing Finance Channels ensure department informed change event department organization Champions change effectively manage implementation enw idea improvement initiative team . eliminate waste increase cost saving department perform duty supervisor direct report indirect report analyze approve pricing structure pricing define level authority exercise staff oversight ensure operation plan policy procedure transition migration plan consistent company goal objective qualification training equivalent combination education . prior pricing contract promotional prefer Bachelor's degree business management relevant field equivalent combination education . analyze update retail pricing base market force . set pricing product base market intelligence gather competitive information review pricing versus competition monitor collect interpret datum redesign processing good method exceed business . convey information concisely group individual action consistent fact constraint anticipated consequence . identify issue alternative solution prioritize brand review base cross functional team department completion goal manage conflict . familiarity variety program contract vehicle . strong organizational skill manage multiple task multitask variety project strong leadership skill decision capability maintain effectiveness major change environment deadline deal high stress situation . provide guidance feedback assist group employee build maintain relationship . benefit diverse workforce commit equal affirmative action . pride hire develop good people regard age sex sexual orientation gender identity genetic characteristic race color creed religion ethnicity national origin alienage citizenship marital status military status pregnancy legally recognize protect basis prohibit applicable law . applicant require reasonable accommodation search opening submit application contact . employment decision solely base applicant's qualification relate requirement position .",
    "results_group": {
        "extracted_noun_chunks": [
            "good method",
            "delete distributor",
            "assist",
            "win future bid provide",
            "portal",
            "Oversees bid request proposal execution",
            "analytical support regard pricing contract promotional responsible development implementation bidding dealer channel program input Sales Marketing Lead development manage",
            "information concisely group individual action",
            "consistent company goal objective qualification training equivalent combination education",
            "status project success rate forecasting timing",
            "applicant",
            "level authority exercise staff oversight",
            "responsible financial planning budget",
            "responsible channel performance financial analysis distribution",
            "responsible evaluation regional business product marketing strategy",
            "duty supervisor direct report indirect report",
            "pricing structure pricing",
            "religion ethnicity national origin",
            "group employee",
            "effectiveness major change environment deadline",
            "Safariland margin",
            "timely proposal responsible manage administer continued rollout APEX portal platform Oversees coordination proposal preparation statement specification negotiation administration contract Oversees management request bid proposal competitor information",
            "live overview responsible manager Program development Pricing",
            "competitive information review pricing",
            "analysis Sales Business Development organization",
            "Sales Support department Channel management portal",
            "implementation enw idea improvement initiative team",
            "equal affirmative action",
            "high stress situation",
            "prior pricing contract promotional",
            "pricing product base market intelligence",
            "responsibility",
            "familiarity variety program contract vehicle",
            "Bachelor's degree business management relevant field equivalent combination education",
            "key Performance Indicators sale support activity",
            "proper technical documentation product collateral",
            "business proposal",
            "PMA's effort",
            "age sex sexual orientation gender identity genetic characteristic race color",
            "business development objective strategic bidding dealer",
            "good people",
            "Automates",
            "employment decision",
            "diverse workforce",
            "retail pricing base market force",
            "legal documentation",
            "Channels approach",
            "conflict",
            "reasonable accommodation search opening submit application contact",
            "requirement position",
            "alienage citizenship marital status military status pregnancy",
            "relationship",
            "strong organizational skill",
            "brand review base cross functional team department completion goal",
            "create maintain analysis tool store",
            "macro region direct operational activity department",
            "applicant's qualification",
            "win loss analysis competitive pricing information contract renewal flag price increase flag cross functional team Sales Marketing Manufacturing Finance Channels",
            "guidance feedback",
            "implement template SOP's governing contract pricing sale support process",
            "responsible internal Customer Relationship Management platform external customer",
            "compliant technical solution",
            "multiple task multitask variety project strong leadership skill decision capability",
            "profitability",
            "department informed change event department organization Champions change",
            "company budget forecast",
            "variety report upper management",
            "department responsibility lifecycle management structure pricing process sale support Safariland channel market",
            "operation plan policy procedure transition migration plan",
            "issue alternative solution",
            "repository competitive information bid",
            "conduct",
            "applicable law",
            "staffing level relie extensive judgment plan",
            "anticipated consequence",
            "waste increase cost saving department",
            "cost price analysis",
            "business",
            "development sale goal field force"
        ],
        "combined_lemmatized_tokens": "SAVE live overview responsible manager Program development Pricing inside Sales Support department Channel management portal . department responsibility lifecycle management structure pricing process sale support Safariland channel market . responsible evaluation regional business product marketing strategy develop Channels approach achieve business development objective strategic bidding dealer . responsible channel performance financial analysis distribution acquire delete distributor . responsible internal Customer Relationship Management platform external customer face portal . responsible financial planning budget reporting analysis Sales Business Development organization . responsibility develop implement template SOP's governing contract pricing sale support process Automates create key Performance Indicators sale support activity provide analytical support regard pricing contract promotional responsible development implementation bidding dealer channel program input Sales Marketing Lead development manage analyze PMA's effort identify macro region direct operational activity department include staffing level relie extensive judgment plan accomplish goal construct cost price analysis strategic response strategy request Proposal . Oversees bid request proposal execution include compliant technical solution proper technical documentation product collateral require legal documentation organized timely proposal responsible manage administer continued rollout APEX portal platform Oversees coordination proposal preparation statement specification negotiation administration contract Oversees management request bid proposal competitor information . analyzes business proposal ensure profitability assist development sale goal field force align company budget forecast create maintain repository competitive information bid lose win future bid provide improve Safariland margin . conduct return investment review direct indirect tender . prepare variety report upper management include status project success rate forecasting timing . create maintain analysis tool store utilize win loss analysis competitive pricing information contract renewal flag price increase flag cross functional team Sales Marketing Manufacturing Finance Channels ensure department informed change event department organization Champions change effectively manage implementation enw idea improvement initiative team . eliminate waste increase cost saving department perform duty supervisor direct report indirect report analyze approve pricing structure pricing define level authority exercise staff oversight ensure operation plan policy procedure transition migration plan consistent company goal objective qualification training equivalent combination education . prior pricing contract promotional prefer Bachelor's degree business management relevant field equivalent combination education . analyze update retail pricing base market force . set pricing product base market intelligence gather competitive information review pricing versus competition monitor collect interpret datum redesign processing good method exceed business . convey information concisely group individual action consistent fact constraint anticipated consequence . identify issue alternative solution prioritize brand review base cross functional team department completion goal manage conflict . familiarity variety program contract vehicle . strong organizational skill manage multiple task multitask variety project strong leadership skill decision capability maintain effectiveness major change environment deadline deal high stress situation . provide guidance feedback assist group employee build maintain relationship . benefit diverse workforce commit equal affirmative action . pride hire develop good people regard age sex sexual orientation gender identity genetic characteristic race color creed religion ethnicity national origin alienage citizenship marital status military status pregnancy legally recognize protect basis prohibit applicable law . applicant require reasonable accommodation search opening submit application contact . employment decision solely base applicant's qualification relate requirement position ."
    }
}