{
    "id": "6a3f403dfbfa6371",
    "companyDescription": "",
    "description": "Our team members are at the heart of everything we do. At Cencora, we are united in our responsibility to create healthier futures, and every person here is essential to us being able to deliver on that purpose. If you want to make a difference at the center of health, come join our innovative company and help us improve the lives of people and animals everywhere. Apply today!\n               \n              \n             \n            \n           \n          \n         \n        \n       \n      \n     \n    \n   \n  \n \n \n \n  \n   \n    \n     \n      \n       \n        \n         \n          \n           \n            \n             \n              \n               \n                \n                 \n                  \n                   \n                    \n                     \n                      \n                        What you will be doing\n                      \n                     \n                    \n                   \n                  \n                 \n                \n               \n              \n             \n            \n           \n          \n         \n        \n       \n      \n     \n    \n   \n  \n \n \n \n   PRIMARY DUTIES AND RESPONSIBILITIES:\n \n \n   Provide medical support to patients and health care providers, including but not limited to education on specific diseases and therapies and disease management;\n   Telephone support (including maintenance calls and adherence support both inbound and outbound as needed);\n   Database management and ongoing auditing of files and information captured;\n   Administer and adhere to case-management protocols, including clinical monitoring, data collection, on-going patient follow-up, compliance, therapy disruption/discontinuation monitoring, adverse event reporting and liaison with primary healthcare providers;\n   Prepare for and attend extensive, specialized training sessions for specific therapies provided by the pharmaceutical team, as required;\n   Work directly with the reimbursement specialist and the physician to secure funding for their patient’s therapies; assist with alternative funding searches when needed;\n   Attend pharmaceutical sales meetings as required;\n   Attend patient meetings, conferences as needed to educate patients, providers regarding disease/product information and case management services;\n   Work with patient associations and advocacy groups, as required;\n   Establish and maintain partnerships with pharmaceutical team;\n   Liaise with health care providers, pharmacies and infusion clinics, and other agencies as required, to coordinate infusions, drug delivery and resolve issues as they arise;\n   Clear communication to the manager, team and the client regarding the management of patient cases;\n   With the managers, participate in the training process of new nurse case managers, including but not limited to shadowing & call monitoring.\n   Support and collaborate with other program staff in the development and implementation of disease management programs including clinical requirements, write texts, manuals or patient pamphlets, develop compliance program parameters, needs assessments and protocols;\n   Provide feedback regarding current protocols, databases, processes, inter-departmental relationships\n   Responsible for reporting all Adverse Events to the assigned units/departments.\n   The Nurse Case Manager will also be assigned other duties and tasks as required from time to time. May be required to be on standby/ on call as part of this role.\n \n \n \n  \n   \n    \n     \n      \n       \n        \n         \n          \n           \n            \n             \n              \n               \n                \n                 \n                  \n                   \n                    \n                     \n                      \n                        What your background should look like\n                      \n                     \n                    \n                   \n                  \n                 \n                \n               \n              \n             \n            \n           \n          \n         \n        \n       \n      \n     \n    \n   \n  \n \n \n \n   EXPERIENCE AND EDUCATIONAL REQUIREMENTS:\n \n \n   A Bachelor’s degree or registered nurse (RN) diploma, advanced degree or specific practice management experience preferred, with five (5) years of Nursing experience;\n   Registration with the College of Nurses in the province of employment is required\n   Requires a minimum of two (2) years in public or private third party reimbursement arena or pharmaceutical industry in sales (not required, but an asset), managed care, or clinical support, or related experience;\n   The preferred candidate is a nurse with healthcare and case management experience in medical or hospital practice or the insurance or bio-pharma industry;\n   Bilingualism (French and English) strongly preferred;\n \n \n \n   MINIMUM SKILLS, KNOWLEDGE AND ABILITY REQUIREMENTS:\n \n \n \n   Strong patient focus;\n   Strong ability to multi-task;\n   Ability to work under pressure;\n   Superior customer service skills;\n   Internet-research and computer savy; has strong verbal and written communication skills, problem solving skills and is a team player;\n   Strong phone etiquette;\n   Ability to communicate and comprehend medical information;\n   Demonstrate teamwork abilities;\n   Ability to work autonomously;\n   Ability to handle sensitive issues with opposing opinions and strong negotiation skills;\n   Strong business and financial acumen\n   Strong analytical and mathematical skills\n   Ability to communicate effectively both orally and in writing\n   Effective interpersonal and leadership skills\n   Effective organizational skills; attention to detail\n   Ability to consistently meet deadlines\n   Excellent problem-solving skills; ability to resolve issues effectively and efficiently\n   Excellent presentation skills\n   Proficiency in Microsoft Word, Excel, PowerPoint and other Office Programs\n   Available for travel at least 15% per year\n \n \n \n   The successful candidate may have daily contacts with unilingual English-speaking customers, patients or peers from cross-functional teams.\n \n \n \n   What Cencora offers\n \n \n \n   We provide compensation, benefits, and resources that enable a highly inclusive culture and support our team members’ ability to live with purpose every day. In addition to traditional offerings like medical, dental, and vision care, we also provide a comprehensive suite of benefits that focus on the physical, emotional, financial, and social aspects of wellness. This encompasses support for working families, which may include backup dependent care, adoption assistance, infertility coverage, family building support, behavioral health solutions, paid parental leave, and paid caregiver leave.\n \n \n \n   To encourage your personal growth, we also offer a variety of training programs, professional development resources, and opportunities to participate in mentorship programs, employee resource groups, volunteer activities, and much more.\n \n \n \n   For details, visit https://www.virtualfairhub.com/amerisourcebergen\n \n \n   .\n \n \n \n   Schedule\n \n  Full time\n \n \n   Affiliated Companies:\n  Affiliated Companies: Innomar Strategies\n \n \n   Equal Employment Opportunity\n \n \n \n   Cencora is committed to providing equal employment opportunity without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, age, disability, veteran status or membership in any other class protected by federal, state or local law.\n \n \n \n   The company’s continued success depends on the full and effective utilization of qualified individuals. Therefore, harassment is prohibited and all matters related to recruiting, training, compensation, benefits, promotions and transfers comply with equal opportunity principles and are non-discriminatory.\n \n \n \n   AmerisourceBergen is committed to providing reasonable accommodations to individuals with disabilities during the employment process which are consistent with legal requirements. If you wish to request an accommodation while seeking employment, please call 888.692.2272 or email \n  \n   hrsc@amerisourcebergen.com\n  . We will make accommodation determinations on a request-by-request basis. Messages and emails regarding anything other than accommodations requests will not be returned\n \n \n \n   COVID-19 Vaccine Policy\n \n \n \n   As of October 18, 2021, Cencora requires all Canadian team members to be fully vaccinated and show proof of completed vaccine status at time of hire. If you cannot receive the COVID-19 vaccine due to a qualifying medical condition or sincerely held religious belief you will be required to follow AmerisourceBergen’s policy and process to apply for an \n  exemption/accommodation.\n \n \n \n   Accessibility Policy\n \n \n \n   AmerisourceBergen is committed to fair and accessible employment practices. When requested, AmerisourceBergen will accommodate people with disabilities during the recruitment, assessment and hiring processes and during employment.",
    "preprocessed_description": "Our team members are at the heart of everything we do. At Cencora, we are united in our responsibility to create healthier futures, and every person here is essential to us being able to deliver on that purpose. If you want to make a difference at the center of health, come join our innovative company and help us improve the lives of people and animals everywhere. Apply today! What you will be doing PRIMARY DUTIES AND RESPONSIBILITIES: Provide medical support to patients and health care providers, including but not limited to education on specific diseases and therapies and disease management; Telephone support (including maintenance calls and adherence support both inbound and outbound as needed); Database management and ongoing auditing of files and information captured; Administer and adhere to case-management protocols, including clinical monitoring, data collection, on-going patient follow-up, compliance, therapy disruption/discontinuation monitoring, adverse event reporting and liaison with primary healthcare providers; Prepare for and attend extensive, specialized training sessions for specific therapies provided by the pharmaceutical team, as required; Work directly with the reimbursement specialist and the physician to secure funding for their patient's therapies; assist with alternative funding searches when needed; Attend pharmaceutical sales meetings as required; Attend patient meetings, conferences as needed to educate patients, providers regarding disease/product information and case management services; Work with patient associations and advocacy groups, as required; Establish and maintain partnerships with pharmaceutical team; Liaise with health care providers, pharmacies and infusion clinics, and other agencies as required, to coordinate infusions, drug delivery and resolve issues as they arise; Clear communication to the manager, team and the client regarding the management of patient cases; With the managers, participate in the training process of new nurse case managers, including but not limited to shadowing & call monitoring. Support and collaborate with other program staff in the development and implementation of disease management programs including clinical requirements, write texts, manuals or patient pamphlets, develop compliance program parameters, needs assessments and protocols; Provide feedback regarding current protocols, databases, processes, inter-departmental relationships Responsible for reporting all Adverse Events to the assigned units/departments. The Nurse Case Manager will also be assigned other duties and tasks as required from time to time. May be required to be on standby/ on call as part of this role. What your background should look like EXPERIENCE AND EDUCATIONAL REQUIREMENTS: A Bachelor's degree or registered nurse (RN) diploma, advanced degree or specific practice management experience preferred, with five (5) years of Nursing experience; Registration with the College of Nurses in the province of employment is required Requires a minimum of two (2) years in public or private third party reimbursement arena or pharmaceutical industry in sales (not required, but an asset), managed care, or clinical support, or related experience; The preferred candidate is a nurse with healthcare and case management experience in medical or hospital practice or the insurance or bio-pharma industry; Bilingualism (French and English) strongly preferred; MINIMUM SKILLS, KNOWLEDGE AND ABILITY REQUIREMENTS: Strong patient focus; Strong ability to multi-task; Ability to work under pressure; Superior customer service skills; Internet-research and computer savy; has strong verbal and written communication skills, problem solving skills and is a team player; Strong phone etiquette; Ability to communicate and comprehend medical information; Demonstrate teamwork abilities; Ability to work autonomously; Ability to handle sensitive issues with opposing opinions and strong negotiation skills; Strong business and financial acumen Strong analytical and mathematical skills Ability to communicate effectively both orally and in writing Effective interpersonal and leadership skills Effective organizational skills; attention to detail Ability to consistently meet deadlines Excellent problem-solving skills; ability to resolve issues effectively and efficiently Excellent presentation skills Proficiency in Microsoft Word, Excel, PowerPoint and other Office Programs Available for travel at least 15% per year The successful candidate may have daily contacts with unilingual English-speaking customers, patients or peers from cross-functional teams. What Cencora offers We provide compensation, benefits, and resources that enable a highly inclusive culture and support our team members' ability to live with purpose every day. In addition to traditional offerings like medical, dental, and vision care, we also provide a comprehensive suite of benefits that focus on the physical, emotional, financial, and social aspects of wellness. This encompasses support for working families, which may include backup dependent care, adoption assistance, infertility coverage, family building support, behavioral health solutions, paid parental leave, and paid caregiver leave. To encourage your personal growth, we also offer a variety of training programs, professional development resources, and opportunities to participate in mentorship programs, employee resource groups, volunteer activities, and much more. For details, visit https://www.virtualfairhub.com/amerisourcebergen . Schedule Full time Affiliated Companies: Affiliated Companies: Innomar Strategies Equal Employment Opportunity Cencora is committed to providing equal employment opportunity without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, age, disability, veteran status or membership in any other class protected by federal, state or local law. The company's continued success depends on the full and effective utilization of qualified individuals. Therefore, harassment is prohibited and all matters related to recruiting, training, compensation, benefits, promotions and transfers comply with equal opportunity principles and are non-discriminatory. AmerisourceBergen is committed to providing reasonable accommodations to individuals with disabilities during the employment process which are consistent with legal requirements. If you wish to request an accommodation while seeking employment, please call 888.692.2272 or email hrsc@amerisourcebergen.com . We will make accommodation determinations on a request-by-request basis. Messages and emails regarding anything other than accommodations requests will not be returned COVID-19 Vaccine Policy As of October 18, 2021, Cencora requires all Canadian team members to be fully vaccinated and show proof of completed vaccine status at time of hire. If you cannot receive the COVID-19 vaccine due to a qualifying medical condition or sincerely held religious belief you will be required to follow AmerisourceBergen's policy and process to apply for an exemption/accommodation. Accessibility Policy AmerisourceBergen is committed to fair and accessible employment practices. When requested, AmerisourceBergen will accommodate people with disabilities during the recruitment, assessment and hiring processes and during employment.",
    "processed_description": "team heart . unite responsibility create healthy future person essential deliver purpose . difference center health join innovative company help improve life people animal . apply primary duty responsibility provide medical support patient health care provider include limit education specific disease therapy disease management support include maintenance adherence support inbound outbound database management ongoing auditing file information capture Administer adhere case management protocol include clinical monitoring datum collection patient follow compliance therapy disruption discontinuation monitoring adverse event reporting liaison primary healthcare provider prepare attend extensive specialized training session specific therapy provide pharmaceutical team require directly reimbursement specialist physician secure funding patient's therapy assist alternative funding search attend pharmaceutical sale meeting require attend patient meeting conference educate patient provider regard disease product information case management service patient association advocacy group require maintain partnership pharmaceutical team liaise health care provider pharmacy infusion clinic agency require coordinate infusion drug delivery resolve issue clear communication manager team client regard management patient case manager participate training process nurse case manager include limit shadow monitoring . support collaborate program staff development implementation disease management program include clinical requirement write text manual patient pamphlet develop compliance program parameter assessment protocol provide feedback regard current protocol database process inter departmental relationship responsible report adverse event assign unit department . Nurse Case Manager assign duty task require . require standby role . background EDUCATIONAL requirement Bachelor's degree register nurse RN diploma advanced degree specific practice management prefer nursing registration province employment require require minimum public private party reimbursement arena pharmaceutical industry sale require asset manage care clinical support preferred nurse healthcare case management medical hospital practice insurance bio pharma industry Bilingualism preferred MINIMUM skill knowledge requirement strong patient focus strong multi task pressure superior customer service skill internet research computer savy strong verbal write communication skill problem solve skill team player strong phone etiquette communicate comprehend medical information teamwork autonomously handle sensitive issue oppose opinion strong negotiation skill strong business financial acumen strong analytical mathematical skill communicate effectively orally write effective interpersonal leadership skill effective organizational skill attention detail consistently meet deadline excellent problem solving skill resolve issue effectively efficiently excellent presentation skill proficiency travel successful daily contact unilingual English speak customer patient peer cross functional team . offer provide compensation benefit resource enable highly inclusive culture support team member' live purpose . addition traditional offering medical dental vision care provide comprehensive suite benefit focus physical emotional financial social aspect wellness . encompass support family include backup dependent care adoption assistance infertility coverage family building support behavioral health solution pay parental leave pay caregiver leave . encourage personal growth offer variety training program professional development resource participate mentorship program employee resource group volunteer activity . detail visit . schedule affiliated company affiliated company Innomar Strategies Equal Employment Cencora commit provide equal employment regard race color religion sex sexual orientation gender identity genetic information national origin age veteran status membership class protect federal state local law . company's continue success depend effective utilization qualified individual . harassment prohibit matter relate recruiting training compensation benefit promotion transfer comply equal principle discriminatory . commit provide reasonable accommodation individual employment process consistent legal requirement . request accommodation seek employment email . accommodation determination request request basis . message email regard accommodation request return covid Vaccine Policy require canadian team fully vaccinate proof complete vaccine status hire . receive covid vaccine qualify medical condition sincerely hold religious belief require follow AmerisourceBergen's policy process apply exemption accommodation . commit fair accessible employment practice . request accommodate people recruitment assessment hiring process employment .",
    "results_group": {
        "extracted_noun_chunks": [
            "medical support patient health care provider",
            "comprehensive suite benefit",
            "opinion strong negotiation skill strong business financial acumen strong analytical mathematical skill",
            "healthy future person",
            "issue",
            "support family",
            "funding patient's therapy",
            "nurse RN diploma advanced degree specific practice management",
            "reasonable accommodation individual employment process",
            "schedule affiliated company affiliated company",
            "duty task",
            "effective organizational skill attention detail",
            "alternative funding search",
            "partnership pharmaceutical team",
            "harassment prohibit matter",
            "care clinical support preferred nurse healthcare case management medical hospital practice insurance bio pharma industry",
            "company's continue success",
            "medical information teamwork",
            "personal growth",
            "training process nurse case manager",
            "peer cross functional team",
            "feedback",
            "support collaborate program staff development implementation disease management program",
            "mentorship program employee resource group volunteer activity",
            "exemption accommodation",
            "purpose",
            "covid vaccine",
            "asset",
            "difference center health",
            "request accommodation",
            "religious belief",
            "compliance program parameter assessment protocol",
            "unilingual English",
            "employment email",
            "people recruitment assessment hiring process employment",
            "ongoing auditing file information",
            "message email regard accommodation request return",
            "complete vaccine status",
            "compensation benefit resource",
            "medical dental vision care",
            "clinical monitoring datum collection patient",
            "effective interpersonal leadership skill",
            "responsibility",
            "variety training program professional development resource",
            "customer patient",
            "sensitive issue",
            "maintenance adherence support inbound outbound database management",
            "effective utilization qualified individual",
            "request",
            "Administer adhere case management protocol",
            "innovative company help",
            "regard current protocol database process inter departmental relationship responsible report adverse event assign unit department",
            "text manual patient pamphlet",
            "skill",
            "health care provider pharmacy infusion clinic agency",
            "education specific disease therapy disease management support",
            "covid Vaccine Policy",
            "Bilingualism",
            "deadline excellent problem",
            "equal principle discriminatory",
            "behavioral health solution",
            "extensive specialized training session specific therapy",
            "coordinate infusion drug delivery resolve issue clear communication manager team client regard management patient case manager",
            "minimum public private party reimbursement arena pharmaceutical industry sale",
            "parental leave pay caregiver leave",
            "strong verbal write communication skill problem",
            "pharmaceutical sale meeting",
            "fair accessible employment practice",
            "MINIMUM skill knowledge requirement",
            "background EDUCATIONAL",
            "accommodation determination request request basis",
            "AmerisourceBergen's policy process",
            "highly inclusive culture support team member' live purpose",
            "team heart",
            "Innomar Strategies Equal Employment Cencora",
            "effectively efficiently excellent presentation skill proficiency travel",
            "nursing registration province employment",
            "life people",
            "Bachelor's degree register",
            "physical emotional financial social aspect wellness",
            "strong phone etiquette",
            "limit shadow monitoring",
            "patient meeting conference",
            "recruiting training compensation benefit promotion transfer",
            "standby role",
            "proof",
            "Nurse Case Manager",
            "federal state local law",
            "clinical requirement",
            "detail visit",
            "superior customer service skill internet research computer",
            "skill team player",
            "canadian team",
            "strong patient",
            "equal employment regard race color religion sex sexual orientation gender identity genetic information national origin age veteran status membership class",
            "patient provider regard disease product information case management service patient association advocacy group",
            "consistent legal requirement",
            "medical condition",
            "primary duty responsibility",
            "pharmaceutical team"
        ],
        "combined_lemmatized_tokens": "team heart . unite responsibility create healthy future person essential deliver purpose . difference center health join innovative company help improve life people animal . apply primary duty responsibility provide medical support patient health care provider include limit education specific disease therapy disease management support include maintenance adherence support inbound outbound database management ongoing auditing file information capture Administer adhere case management protocol include clinical monitoring datum collection patient follow compliance therapy disruption discontinuation monitoring adverse event reporting liaison primary healthcare provider prepare attend extensive specialized training session specific therapy provide pharmaceutical team require directly reimbursement specialist physician secure funding patient's therapy assist alternative funding search attend pharmaceutical sale meeting require attend patient meeting conference educate patient provider regard disease product information case management service patient association advocacy group require maintain partnership pharmaceutical team liaise health care provider pharmacy infusion clinic agency require coordinate infusion drug delivery resolve issue clear communication manager team client regard management patient case manager participate training process nurse case manager include limit shadow monitoring . support collaborate program staff development implementation disease management program include clinical requirement write text manual patient pamphlet develop compliance program parameter assessment protocol provide feedback regard current protocol database process inter departmental relationship responsible report adverse event assign unit department . Nurse Case Manager assign duty task require . require standby role . background EDUCATIONAL requirement Bachelor's degree register nurse RN diploma advanced degree specific practice management prefer nursing registration province employment require require minimum public private party reimbursement arena pharmaceutical industry sale require asset manage care clinical support preferred nurse healthcare case management medical hospital practice insurance bio pharma industry Bilingualism preferred MINIMUM skill knowledge requirement strong patient focus strong multi task pressure superior customer service skill internet research computer savy strong verbal write communication skill problem solve skill team player strong phone etiquette communicate comprehend medical information teamwork autonomously handle sensitive issue oppose opinion strong negotiation skill strong business financial acumen strong analytical mathematical skill communicate effectively orally write effective interpersonal leadership skill effective organizational skill attention detail consistently meet deadline excellent problem solving skill resolve issue effectively efficiently excellent presentation skill proficiency travel successful daily contact unilingual English speak customer patient peer cross functional team . offer provide compensation benefit resource enable highly inclusive culture support team member' live purpose . addition traditional offering medical dental vision care provide comprehensive suite benefit focus physical emotional financial social aspect wellness . encompass support family include backup dependent care adoption assistance infertility coverage family building support behavioral health solution pay parental leave pay caregiver leave . encourage personal growth offer variety training program professional development resource participate mentorship program employee resource group volunteer activity . detail visit . schedule affiliated company affiliated company Innomar Strategies Equal Employment Cencora commit provide equal employment regard race color religion sex sexual orientation gender identity genetic information national origin age veteran status membership class protect federal state local law . company's continue success depend effective utilization qualified individual . harassment prohibit matter relate recruiting training compensation benefit promotion transfer comply equal principle discriminatory . commit provide reasonable accommodation individual employment process consistent legal requirement . request accommodation seek employment email . accommodation determination request request basis . message email regard accommodation request return covid Vaccine Policy require canadian team fully vaccinate proof complete vaccine status hire . receive covid vaccine qualify medical condition sincerely hold religious belief require follow AmerisourceBergen's policy process apply exemption accommodation . commit fair accessible employment practice . request accommodate people recruitment assessment hiring process employment ."
    }
}