{
    "id": "6a3f403dfbfa6371",
    "company": "Cencora",
    "positionName": "Nurse Case Manager - 12 months contract",
    "jobType": [],
    "location": "Ontario",
    "salary": null,
    "postingDateParsed": "2023-10-06T02:05:38.867Z",
    "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0Aw-0yW4ShgO3RgfkwBWHOvSxBbbijevudcRUz_ZHdAKruIoH-R7ob34Ba6D_yCf7Dc7btOpOu_smNbUbtO8YkxQIRA0BRlbwe1RH0c_esXyMyLxJBIMtb9on1V93yS1TIBGgRxeF-9M48g62GI4Gx60nHRBMnN1hLNKlfL4PsYAP_RrJz-wtOvnHbnhJKgGGweZ1w_QqEq3DNwIhaMrdcm3rGHnLcCPjdBzB39SVdbmXIBm8XI1dQNoE4nipNRefVeo3QFYRNpjqQG6dNrNd_ZxWEdKIW8CixaC_wJklPw_b5ZXO3NfIXCHshN8763IUBP-TObSJFnECwl7DmnLt9Jx8Oo910ySZ_nM2A7BH6kMmiRRcwDZ7yM7vD7_2z020V-suHee9HD9S8ny6P-7C_YbDGV--TBX56eHEPu6JVXLBkyP3hGh-cl1VrlEIqTYS-o9l7KaGqCSD4aK7Y_zRjk3MXDMJrgy2gBFEax4vfgLCrV6dNWFYrY7aEpszzSR7ESQS5THf-sFKYrrllB7QYr4nmeHblNc0hAuIaUghKlkk4RHXgMzPbyvHiyp44dEuKGWep5_ZnhfXrGYY_kDEaaMIxJqwsRTz8lkoURuUUZHLHVeI6rm3Smiox5E05GlldqXRZmWPVgkO3XQNsL02hwyOJ5RO8n6K7Dv7VcmcsMpLh2ikfWwiNFBR-vAU1HAGEaqa9jX6BD08Nzv1J0TnkAOiJkXTZ6FojRZnGHulXO1Xhncq2nSDSNMnt5jRk3WhIqa21N03FVfUutNLPkqxe_UzpYPVCql8cvD0nJKqlpDNjggaobv6ta627eqBBeIM7r1-My2r5uVpxyeUmJx96OfYkqkeOtVn6H1j2p5UOA6g%3D%3D&xkcb=SoAN-_M3JGpN_UgB9D0GbzkdCdPP&p=13&fvj=0&vjs=3&jsa=7493&tk=1hc6ggh24ih5j800&from=jasx&wvign=1",
    "externalApplyLink": "https://myhrabc.wd5.myworkdayjobs.com/en-US/Global/job/Remote-ON/Nurse-Case-Manager---12-months-contract_R2310971?source=%20Job_Board_Indeed",
    "companyDescription": "",
    "description": "Our team members are at the heart of everything we do. At Cencora, we are united in our responsibility to create healthier futures, and every person here is essential to us being able to deliver on that purpose. If you want to make a difference at the center of health, come join our innovative company and help us improve the lives of people and animals everywhere. Apply today!\n               \n              \n             \n            \n           \n          \n         \n        \n       \n      \n     \n    \n   \n  \n \n \n \n  \n   \n    \n     \n      \n       \n        \n         \n          \n           \n            \n             \n              \n               \n                \n                 \n                  \n                   \n                    \n                     \n                      \n                        What you will be doing\n                      \n                     \n                    \n                   \n                  \n                 \n                \n               \n              \n             \n            \n           \n          \n         \n        \n       \n      \n     \n    \n   \n  \n \n \n \n   PRIMARY DUTIES AND RESPONSIBILITIES:\n \n \n   Provide medical support to patients and health care providers, including but not limited to education on specific diseases and therapies and disease management;\n   Telephone support (including maintenance calls and adherence support both inbound and outbound as needed);\n   Database management and ongoing auditing of files and information captured;\n   Administer and adhere to case-management protocols, including clinical monitoring, data collection, on-going patient follow-up, compliance, therapy disruption/discontinuation monitoring, adverse event reporting and liaison with primary healthcare providers;\n   Prepare for and attend extensive, specialized training sessions for specific therapies provided by the pharmaceutical team, as required;\n   Work directly with the reimbursement specialist and the physician to secure funding for their patient’s therapies; assist with alternative funding searches when needed;\n   Attend pharmaceutical sales meetings as required;\n   Attend patient meetings, conferences as needed to educate patients, providers regarding disease/product information and case management services;\n   Work with patient associations and advocacy groups, as required;\n   Establish and maintain partnerships with pharmaceutical team;\n   Liaise with health care providers, pharmacies and infusion clinics, and other agencies as required, to coordinate infusions, drug delivery and resolve issues as they arise;\n   Clear communication to the manager, team and the client regarding the management of patient cases;\n   With the managers, participate in the training process of new nurse case managers, including but not limited to shadowing & call monitoring.\n   Support and collaborate with other program staff in the development and implementation of disease management programs including clinical requirements, write texts, manuals or patient pamphlets, develop compliance program parameters, needs assessments and protocols;\n   Provide feedback regarding current protocols, databases, processes, inter-departmental relationships\n   Responsible for reporting all Adverse Events to the assigned units/departments.\n   The Nurse Case Manager will also be assigned other duties and tasks as required from time to time. May be required to be on standby/ on call as part of this role.\n \n \n \n  \n   \n    \n     \n      \n       \n        \n         \n          \n           \n            \n             \n              \n               \n                \n                 \n                  \n                   \n                    \n                     \n                      \n                        What your background should look like\n                      \n                     \n                    \n                   \n                  \n                 \n                \n               \n              \n             \n            \n           \n          \n         \n        \n       \n      \n     \n    \n   \n  \n \n \n \n   EXPERIENCE AND EDUCATIONAL REQUIREMENTS:\n \n \n   A Bachelor’s degree or registered nurse (RN) diploma, advanced degree or specific practice management experience preferred, with five (5) years of Nursing experience;\n   Registration with the College of Nurses in the province of employment is required\n   Requires a minimum of two (2) years in public or private third party reimbursement arena or pharmaceutical industry in sales (not required, but an asset), managed care, or clinical support, or related experience;\n   The preferred candidate is a nurse with healthcare and case management experience in medical or hospital practice or the insurance or bio-pharma industry;\n   Bilingualism (French and English) strongly preferred;\n \n \n \n   MINIMUM SKILLS, KNOWLEDGE AND ABILITY REQUIREMENTS:\n \n \n \n   Strong patient focus;\n   Strong ability to multi-task;\n   Ability to work under pressure;\n   Superior customer service skills;\n   Internet-research and computer savy; has strong verbal and written communication skills, problem solving skills and is a team player;\n   Strong phone etiquette;\n   Ability to communicate and comprehend medical information;\n   Demonstrate teamwork abilities;\n   Ability to work autonomously;\n   Ability to handle sensitive issues with opposing opinions and strong negotiation skills;\n   Strong business and financial acumen\n   Strong analytical and mathematical skills\n   Ability to communicate effectively both orally and in writing\n   Effective interpersonal and leadership skills\n   Effective organizational skills; attention to detail\n   Ability to consistently meet deadlines\n   Excellent problem-solving skills; ability to resolve issues effectively and efficiently\n   Excellent presentation skills\n   Proficiency in Microsoft Word, Excel, PowerPoint and other Office Programs\n   Available for travel at least 15% per year\n \n \n \n   The successful candidate may have daily contacts with unilingual English-speaking customers, patients or peers from cross-functional teams.\n \n \n \n   What Cencora offers\n \n \n \n   We provide compensation, benefits, and resources that enable a highly inclusive culture and support our team members’ ability to live with purpose every day. In addition to traditional offerings like medical, dental, and vision care, we also provide a comprehensive suite of benefits that focus on the physical, emotional, financial, and social aspects of wellness. This encompasses support for working families, which may include backup dependent care, adoption assistance, infertility coverage, family building support, behavioral health solutions, paid parental leave, and paid caregiver leave.\n \n \n \n   To encourage your personal growth, we also offer a variety of training programs, professional development resources, and opportunities to participate in mentorship programs, employee resource groups, volunteer activities, and much more.\n \n \n \n   For details, visit https://www.virtualfairhub.com/amerisourcebergen\n \n \n   .\n \n \n \n   Schedule\n \n  Full time\n \n \n   Affiliated Companies:\n  Affiliated Companies: Innomar Strategies\n \n \n   Equal Employment Opportunity\n \n \n \n   Cencora is committed to providing equal employment opportunity without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, age, disability, veteran status or membership in any other class protected by federal, state or local law.\n \n \n \n   The company’s continued success depends on the full and effective utilization of qualified individuals. Therefore, harassment is prohibited and all matters related to recruiting, training, compensation, benefits, promotions and transfers comply with equal opportunity principles and are non-discriminatory.\n \n \n \n   AmerisourceBergen is committed to providing reasonable accommodations to individuals with disabilities during the employment process which are consistent with legal requirements. If you wish to request an accommodation while seeking employment, please call 888.692.2272 or email \n  \n   hrsc@amerisourcebergen.com\n  . We will make accommodation determinations on a request-by-request basis. Messages and emails regarding anything other than accommodations requests will not be returned\n \n \n \n   COVID-19 Vaccine Policy\n \n \n \n   As of October 18, 2021, Cencora requires all Canadian team members to be fully vaccinated and show proof of completed vaccine status at time of hire. If you cannot receive the COVID-19 vaccine due to a qualifying medical condition or sincerely held religious belief you will be required to follow AmerisourceBergen’s policy and process to apply for an \n  exemption/accommodation.\n \n \n \n   Accessibility Policy\n \n \n \n   AmerisourceBergen is committed to fair and accessible employment practices. When requested, AmerisourceBergen will accommodate people with disabilities during the recruitment, assessment and hiring processes and during employment."
}