{
    "id": "cad9349b443210b1",
    "companyDescription": "",
    "description": "At Ontario Health, we are committed to developing a strong organizational culture that connects and inspires all team members across the province. Our vision is that together, we will be a leader in health and wellness for all. Our mission is to connect the health system to drive improved and equitable health outcomes, experiences and value. How we work together is reflected through our five values: integrity, inspiration, tenacity, humility and care.\n \n \n \n   Want to make a difference in your career? Consider this opportunity!\n \n \n \n  \n    Reporting to: Manager, Provincial Resource Centre - Tissue\n  \n  \n    Classification: Tissue Coordinator\n  \n  \n    Worksite: Toronto (currently hybrid; subject to change)\n  \n  \n    Schedule: Combination of weekday and weekend 12 hour shifts\n  \n  \n  \n    Trillium Gift of Life Network (TGLN), part of Ontario Health, is responsible for the coordination of organ and tissue donation and transplantation in Ontario. Our mandate includes increasing public awareness of the importance of organ and tissue donation, education of health care professionals, and ensuring a safe and effective donation and transplant system in Ontario. Working collaboratively with our stakeholders and fostering organizational and individual growth, we value honesty, trust, respect and compassion.\n  \n  \n  \n    We are currently seeking a highly motivated full-time Tissue Coordinator (TC) for a 12 month contract. The incumbent shall provide professional services related to tissue donation in a manner consistent with the mission and values of TGLN. The Tissue Coordinator completes processes for donor screening, approaches families for consent to donate, secures acceptance of tissues by various tissue banks, coordinates recovery activities, and conducts family follow up post-donation for consented non-recovered tissues.\n  \n  \n  \n    Here is what you will be doing:\n  \n  \n   \n    \n      Responds to calls from referring hospitals received in the Provincial Resource Centre, conducts a preliminary assessment of the patient’s history and identifies all relevant donation options\n    \n   \n    \n      Provides consultation services as an expert in matters relating to tissue donation\n    \n   \n    \n      Assesses expert consultation regarding tissue suitability or other medical issues as appropriate\n    \n   \n    \n      Provides complete information to the tissue bank(s) concerning donor and tissue suitability for placement of tissues. The information is provided in a manner that complies with existing privacy legislation and TGLN confidentiality policies\n    \n   \n    \n      Timely completion of the medical-social questionnaire, usually at time of donation, occasionally at a pre-arranged date and time to minimize missed opportunities\n    \n   \n    \n      Liaises continuously with on-site personnel (i.e. Organ and Tissue Donation Specialist, health-care professionals and recovery staff) at referring hospital to complete risk assessment, screening, testing and evaluation of individual tissue suitability after consent\n    \n   \n    \n      Works with the coroner’s office to facilitate tissue donation and escalates cases to Regional Supervising Coroner on a case by case basis\n    \n   \n    \n      Obtains temporary surgical privileges for tissue recovery personnel, when necessary, in accordance with the policies of the referring hospital, ensuring compliance with the credentialing process is in place at the time\n    \n   \n    \n      Coordinates timing and confirmation of recovery facility (OR) availability and arrival of tissue recovery teams\n    \n   \n    \n      Conveys all relevant information regarding the donor to the appropriate tissue recovery personnel and relevant Tissue Bank\n    \n   \n    \n      Ensures relevant hospital department(s) are contacted following tissue recovery for timely transport of body to funeral home\n    \n   \n    \n      Maintains a professional and courteous demeanour with stakeholders at all times\n    \n   \n    \n      Performs other duties as required\n    \n  \n  \n  \n    Here is what you will need to be successful:\n  \n  \n  \n    Education and Experience\n  \n  \n   \n    \n      University degree or college diploma in health sciences, biological sciences or a recognized equivalent major is required\n    \n   \n    \n      Certification in eye or tissue banking (Certified Eye Bank Technician (CEBT)/Certified Tissue Banking Specialist (CTBS), blood banking, as a Registered Practical Nurse (RPN) or a paramedic is an asset\n    \n   \n    \n      Minimum of three (3) years working experience in organ and tissue donation, health sciences or health care environment, tissue recovery and processing is preferred\n    \n   \n    \n      Experience in a healthcare setting or working with patients and their families at times of crisis is preferred\n    \n  \n  \n  \n    Knowledge and Skills\n  \n  \n   \n    \n      Motivated self-starter with the ability to work independently and collaboratively as part of a team\n    \n   \n    \n      Demonstrated superior written and oral communication skills\n    \n   \n    \n      In-depth knowledge of biological and health sciences as well as quality assurance standards is an asset\n    \n   \n    \n      Ability to maintain and protect patient confidentiality at all times, demonstrating use of discretion and sound judgment\n    \n   \n    \n      Accuracy and close attention to detail\n    \n   \n    \n      Strong computer skills\n    \n   \n    \n      Demonstrated time management skills with the ability and flexibility to prioritize multiple tasks and projects in a fast paced, results oriented environment\n    \n  \n  \n  \n    Rate of Pay: $31.86 to $39.82 per hour\n  \n  \n  \n    Employment Type: Temporary Full-Time (12 month contract)\n  \n  \n  \n    Employment Location: Toronto (currently hybrid; subject to change). All applicants must be a resident of Ontario to be considered for roles at Ontario Health.\n  \n  \n  \n    Internal Application Deadline Date: October 12, 2023\n  \n  \n  \n   \n     Ontario Health actively encourages applications from candidates who are First Nations, Métis, Inuit, and urban Indigenous; Francophone; Black and racialized; members of 2SLGBTQIA+ communities; trans and nonbinary; and disabled.\n   \n  \n  \n  \n   \n     We encourage applicants with accessibility needs to notify us if they have any accommodation needs in the application and/or interview process.\n   \n  \n  \n  \n   \n     Note: As part of the initial recruitment screening process, Applicants must confirm that they are Fully Vaccinated against COVID-19. If Applicants are not Fully Vaccinated, they will be asked to identify any accommodation needs pursuant to a protected ground under the Code. If no such accommodation is identified, the Applicant will not be eligible to proceed through the recruitment process.",
    "preprocessed_description": "At Ontario Health, we are committed to developing a strong organizational culture that connects and inspires all team members across the province. Our vision is that together, we will be a leader in health and wellness for all. Our mission is to connect the health system to drive improved and equitable health outcomes, experiences and value. How we work together is reflected through our five values: integrity, inspiration, tenacity, humility and care. Want to make a difference in your career? Consider this opportunity! Reporting to: Manager, Provincial Resource Centre - Tissue Classification: Tissue Coordinator Worksite: Toronto (currently hybrid; subject to change) Schedule: Combination of weekday and weekend 12 hour shifts Trillium Gift of Life Network (TGLN), part of Ontario Health, is responsible for the coordination of organ and tissue donation and transplantation in Ontario. Our mandate includes increasing public awareness of the importance of organ and tissue donation, education of health care professionals, and ensuring a safe and effective donation and transplant system in Ontario. Working collaboratively with our stakeholders and fostering organizational and individual growth, we value honesty, trust, respect and compassion. We are currently seeking a highly motivated full-time Tissue Coordinator (TC) for a 12 month contract. The incumbent shall provide professional services related to tissue donation in a manner consistent with the mission and values of TGLN. The Tissue Coordinator completes processes for donor screening, approaches families for consent to donate, secures acceptance of tissues by various tissue banks, coordinates recovery activities, and conducts family follow up post-donation for consented non-recovered tissues. Here is what you will be doing: Responds to calls from referring hospitals received in the Provincial Resource Centre, conducts a preliminary assessment of the patient's history and identifies all relevant donation options Provides consultation services as an expert in matters relating to tissue donation Assesses expert consultation regarding tissue suitability or other medical issues as appropriate Provides complete information to the tissue bank(s) concerning donor and tissue suitability for placement of tissues. The information is provided in a manner that complies with existing privacy legislation and TGLN confidentiality policies Timely completion of the medical-social questionnaire, usually at time of donation, occasionally at a pre-arranged date and time to minimize missed opportunities Liaises continuously with on-site personnel (i.e. Organ and Tissue Donation Specialist, health-care professionals and recovery staff) at referring hospital to complete risk assessment, screening, testing and evaluation of individual tissue suitability after consent Works with the coroner's office to facilitate tissue donation and escalates cases to Regional Supervising Coroner on a case by case basis Obtains temporary surgical privileges for tissue recovery personnel, when necessary, in accordance with the policies of the referring hospital, ensuring compliance with the credentialing process is in place at the time Coordinates timing and confirmation of recovery facility (OR) availability and arrival of tissue recovery teams Conveys all relevant information regarding the donor to the appropriate tissue recovery personnel and relevant Tissue Bank Ensures relevant hospital department(s) are contacted following tissue recovery for timely transport of body to funeral home Maintains a professional and courteous demeanour with stakeholders at all times Performs other duties as required Here is what you will need to be successful: Education and Experience University degree or college diploma in health sciences, biological sciences or a recognized equivalent major is required Certification in eye or tissue banking (Certified Eye Bank Technician (CEBT)/Certified Tissue Banking Specialist (CTBS), blood banking, as a Registered Practical Nurse (RPN) or a paramedic is an asset Minimum of three (3) years working experience in organ and tissue donation, health sciences or health care environment, tissue recovery and processing is preferred Experience in a healthcare setting or working with patients and their families at times of crisis is preferred Knowledge and Skills Motivated self-starter with the ability to work independently and collaboratively as part of a team Demonstrated superior written and oral communication skills In-depth knowledge of biological and health sciences as well as quality assurance standards is an asset Ability to maintain and protect patient confidentiality at all times, demonstrating use of discretion and sound judgment Accuracy and close attention to detail Strong computer skills Demonstrated time management skills with the ability and flexibility to prioritize multiple tasks and projects in a fast paced, results oriented environment Rate of Pay: $31.86 to $39.82 per hour Employment Type: Temporary Full-Time (12 month contract) Employment Location: Toronto (currently hybrid; subject to change). All applicants must be a resident of Ontario to be considered for roles at Ontario Health. Internal Application Deadline Date: October 12, 2023 Ontario Health actively encourages applications from candidates who are First Nations, Métis, Inuit, and urban Indigenous; Francophone; Black and racialized; members of 2SLGBTQIA+ communities; trans and nonbinary; and disabled. We encourage applicants with accessibility needs to notify us if they have any accommodation needs in the application and/or interview process. Note: As part of the initial recruitment screening process, Applicants must confirm that they are Fully Vaccinated against COVID-19. If Applicants are not Fully Vaccinated, they will be asked to identify any accommodation needs pursuant to a protected ground under the Code. If no such accommodation is identified, the Applicant will not be eligible to proceed through the recruitment process.",
    "processed_description": "committed develop strong organizational culture connect inspire team province . vision leader health wellness . mission connect health system drive improved equitable health outcome . reflect integrity inspiration tenacity humility care . difference career consider reporting Manager Tissue Coordinator Worksite currently hybrid subject change schedule combination weekday weekend shift responsible coordination organ tissue donation transplantation . mandate include increase public awareness organ tissue donation education health care professional ensure safe effective donation transplant system . collaboratively stakeholder foster organizational individual growth honesty trust respect compassion . currently seek highly motivated Tissue Coordinator TC month contract . incumbent provide professional service relate tissue donation manner consistent mission . tissue Coordinator complete process donor screening approach family consent donate secure acceptance tissue tissue bank coordinate recovery activity conduct family follow post donation consented recovered tissue . respond refer hospital receive conduct preliminary assessment patient's history identify relevant donation option provide consultation service expert matter relate tissue donation assesse expert consultation regard tissue suitability medical issue appropriate provide complete information tissue bank concern donor tissue suitability placement tissue . information provide manner comply exist privacy legislation TGLN confidentiality policy timely completion medical social questionnaire donation occasionally pre arranged minimize liaise continuously site personnel i.e. Organ Tissue Donation Specialist health care professional recovery staff refer hospital complete risk assessment screening testing evaluation individual tissue suitability consent coroner's office facilitate tissue donation escalate case Regional Supervising Coroner case case basis temporary surgical privilege tissue recovery personnel policy refer hospital ensure compliance credentialing process place Coordinates timing confirmation recovery facility availability arrival tissue recovery team relevant information regard donor appropriate tissue recovery personnel relevant contact follow tissue recovery timely transport body funeral maintain professional courteous demeanour stakeholder perform duty require successful Education University degree college diploma health science biological science recognize equivalent major require Certification eye tissue banking CTBS blood banking Registered Practical Nurse paramedic asset minimum organ tissue donation health care environment tissue recovery processing prefer healthcare setting patient family crisis prefer Knowledge Skills motivate starter independently collaboratively team demonstrate superior write oral communication skill depth knowledge biological health science quality assurance standard asset maintain protect patient confidentiality demonstrate discretion sound judgment accuracy close attention detail strong computer skill demonstrate management skill flexibility prioritize multiple task project fast paced result orient environment rate pay hour Employment Type temporary month contract Employment Location Toronto currently hybrid subject change . applicant resident consider role . Internal Application Deadline actively encourage application urban Indigenous Black racialize 2slgbtqia+ community trans nonbinary disabled . encourage applicant accessibility notify accommodation application interview process . note initial recruitment screening process applicant confirm fully vaccinated covid . applicant fully vaccinated identify accommodation pursuant protect ground Code . accommodation identify eligible proceed recruitment process .",
    "results_group": {
        "extracted_noun_chunks": [
            "difference career",
            "Certification eye tissue banking CTBS blood banking Registered Practical Nurse paramedic asset minimum organ tissue donation health care environment tissue recovery processing",
            "healthcare",
            "recruitment process",
            "complete information tissue bank concern donor tissue suitability placement tissue",
            "successful Education University degree college diploma health science biological science",
            "currently hybrid subject change schedule combination",
            "accommodation application interview process",
            "relevant contact",
            "management skill flexibility",
            "multiple task project fast paced result orient environment rate pay hour Employment Type temporary month contract Employment Location Toronto currently hybrid subject change",
            "applicant resident",
            "applicant accessibility",
            "safe effective donation transplant system",
            "strong organizational culture",
            "timely transport body funeral",
            "patient confidentiality",
            "recovered tissue",
            "starter independently collaboratively team",
            "Internal Application Deadline",
            "duty",
            "office",
            "patient family crisis",
            "organizational individual growth honesty trust respect compassion",
            "professional courteous demeanour stakeholder",
            "responsible coordination organ tissue donation transplantation",
            "vision leader health wellness",
            "compliance credentialing process place",
            "pursuant protect ground Code",
            "recovery activity conduct",
            "temporary surgical privilege tissue recovery personnel policy",
            "professional service",
            "confirmation recovery facility availability arrival tissue recovery team relevant information regard donor appropriate tissue recovery personnel",
            "highly motivated Tissue Coordinator TC month contract",
            "mission",
            "equitable health outcome",
            "identify accommodation",
            "applicant",
            "fully vaccinated covid",
            "hospital receive conduct preliminary assessment patient's history",
            "integrity inspiration tenacity humility care",
            "tissue donation manner",
            "Regional Supervising Coroner case case",
            "hospital",
            "superior write oral communication skill depth knowledge biological health science quality assurance standard asset",
            "Manager Tissue Coordinator Worksite",
            "relevant donation option",
            "accommodation",
            "initial recruitment screening process applicant",
            "consistent mission",
            "incumbent",
            "public awareness organ tissue donation education health care professional",
            "secure acceptance tissue tissue bank",
            "Knowledge Skills",
            "discretion sound judgment accuracy close attention detail strong computer skill",
            "inspire team province",
            "privacy legislation TGLN confidentiality policy timely completion medical social questionnaire donation",
            "information",
            "tissue Coordinator complete process donor screening approach family consent",
            "application",
            "mandate",
            "liaise",
            "role",
            "health system drive",
            "consultation service expert matter",
            "family",
            "tissue recovery"
        ],
        "combined_lemmatized_tokens": "committed develop strong organizational culture connect inspire team province . vision leader health wellness . mission connect health system drive improved equitable health outcome . reflect integrity inspiration tenacity humility care . difference career consider reporting Manager Tissue Coordinator Worksite currently hybrid subject change schedule combination weekday weekend shift responsible coordination organ tissue donation transplantation . mandate include increase public awareness organ tissue donation education health care professional ensure safe effective donation transplant system . collaboratively stakeholder foster organizational individual growth honesty trust respect compassion . currently seek highly motivated Tissue Coordinator TC month contract . incumbent provide professional service relate tissue donation manner consistent mission . tissue Coordinator complete process donor screening approach family consent donate secure acceptance tissue tissue bank coordinate recovery activity conduct family follow post donation consented recovered tissue . respond refer hospital receive conduct preliminary assessment patient's history identify relevant donation option provide consultation service expert matter relate tissue donation assesse expert consultation regard tissue suitability medical issue appropriate provide complete information tissue bank concern donor tissue suitability placement tissue . information provide manner comply exist privacy legislation TGLN confidentiality policy timely completion medical social questionnaire donation occasionally pre arranged minimize liaise continuously site personnel i.e. Organ Tissue Donation Specialist health care professional recovery staff refer hospital complete risk assessment screening testing evaluation individual tissue suitability consent coroner's office facilitate tissue donation escalate case Regional Supervising Coroner case case basis temporary surgical privilege tissue recovery personnel policy refer hospital ensure compliance credentialing process place Coordinates timing confirmation recovery facility availability arrival tissue recovery team relevant information regard donor appropriate tissue recovery personnel relevant contact follow tissue recovery timely transport body funeral maintain professional courteous demeanour stakeholder perform duty require successful Education University degree college diploma health science biological science recognize equivalent major require Certification eye tissue banking CTBS blood banking Registered Practical Nurse paramedic asset minimum organ tissue donation health care environment tissue recovery processing prefer healthcare setting patient family crisis prefer Knowledge Skills motivate starter independently collaboratively team demonstrate superior write oral communication skill depth knowledge biological health science quality assurance standard asset maintain protect patient confidentiality demonstrate discretion sound judgment accuracy close attention detail strong computer skill demonstrate management skill flexibility prioritize multiple task project fast paced result orient environment rate pay hour Employment Type temporary month contract Employment Location Toronto currently hybrid subject change . applicant resident consider role . Internal Application Deadline actively encourage application urban Indigenous Black racialize 2slgbtqia+ community trans nonbinary disabled . encourage applicant accessibility notify accommodation application interview process . note initial recruitment screening process applicant confirm fully vaccinated covid . applicant fully vaccinated identify accommodation pursuant protect ground Code . accommodation identify eligible proceed recruitment process ."
    }
}