{
    "id": "d740fce3d304ef3b",
    "companyDescription": "",
    "description": "Job Description: \n \n   AECL acknowledges with gratitude that we operate on territories that have, since time immemorial, been the traditional lands of Indigenous peoples in Canada.\n \n \n  Is AECL right for you?\n \n   As a federal Crown corporation, Atomic Energy of Canada Limited (AECL) has a mandate to enable nuclear science and technology and manage the Government of Canada’s radioactive waste liabilities. Since 2015, AECL has been delivering its mandate through a Government-owned, Contractor-operated (GoCo) business model, whereby a private-sector organization, Canadian Nuclear Laboratories (CNL), is responsible for managing and operating AECL’s sites on its behalf, pursuant to long term agreements. AECL’s objectives under the GoCo model include accelerating Environmental Remediation Management, managing the Federal Nuclear Science and Technology Work Plan in support of government priorities and needs, and building a world-class nuclear laboratory that fulfils government priorities and grows commercial revenues, while reducing or containing costs and risks to Canada.\n \n  What you will do:\n \n   Reporting to a vice president, the Executive Assistant is responsible for ensuring organization efficiency, customer service, relationships management and delivery on key administrative activities for up to four executives. In this role, you act with professionalism and tact while managing an extensive range of executive-level administrative tasks that are sensitive and confidential in nature. You are organized and thrive in resolving administrative difficulties that are inherent in supporting a diversified team within a fast-paced environment.\n \n \n  What you bring:\n \n   Diploma in Business Administration.\n   Bilingualism in English and French is considered an asset.\n   5 years of previous experience supporting executives.\n   Solid understanding of corporate document standards and strict attention to detail and accuracy in the maintenance of records, agenda, minutes, electronic files, etc.\n   Solid planning skills and a highly organized approach to work.\n   Must be team oriented and an effective communicator to promote a positive work environment.\n   Demonstrated ability to approach work tactfully, with diplomacy and high a level of trust and discretion in handling of sensitive and confidential information.\n   Ability and willingness to work with minimal supervision in a team environment that requires initiative.\n   Ability to be self-motivated and work efficiently with all levels of employees both in person and on the telephone; ability to effectively interface with other groups, particularly those at other AECL sites, and other groups external to AECL.\n   Motivated to find efficiencies and continuously improve processes and procedures.\n   Ability to problem solve and be an effective critical thinker\n   Advanced proficiency with Microsoft Office Products (Word, Outlook, PowerPoint, and Excel) as well as an aptitude for learning new software, technologies, and systems.\n   Creativity, innovation, flexibility, and adaptability to handle the multiple priorities and schedules of AECL.\n \n  What you can expect:\n \n   While this ad will remain posted, we will begin reviewing applications on October 23, 2023.\n   This posting is for two, full-time temporary positions that will be one year in duration. One position will be based out of AECL’s Chalk River, Ontario office, and the other will be based out of AECL’s Ottawa, Ontario office.\n   This competition will have two rounds of interviews.\n   The selected candidate must successfully meet Government of Canada security clearance requirements.\n   While we sincerely appreciate all applications, only those candidates selected for an interview will be contacted.\n   Preference may be given to individuals who are bilingual.\n \n \n \n   At AECL, we are committed to building an authentic workplace; promoting diversity, equity, inclusion, and accessibility matters to us. We welcome applications from women, visible minorities, Indigenous Peoples, persons with disabilities, and persons of any gender identity, expression, and sexual orientation. Preference may be given to members of a designated group to address identified under-representation. We encourage candidates to self-identify.\n \n \n \n   AECL provides support and reasonable accommodations in its recruitment processes to applicants with disabilities including accommodations that consider an applicant’s accessibility needs. If you have a disability that requires accommodation during our recruitment process, let us know how we can assist you by emailing hr@aecl.ca.\n \n \n   \n \n About AECL:\n \n \n  \n   \n     www.aecl.ca\n   \n  \n  \n  \n   \n     @AECL\n   \n  \n  \n  \n   \n     @AECL_EACL\n   \n  \n  \n  \n   \n    \n      @atomicenergycanada\n    \n   \n  \n \n  \n  Description du poste: \n \n   Énergie atomique du Canada limitée (EACL) reconnaît avec gratitude que nous opérons sur des territoires qui, depuis des temps immémoriaux, sont les terres traditionnelles des peuples autochtones du Canada.\n \n \n   \n \n EACL vous convient?\n \n   En tant que société d’État canadienne, EACL a pour mandat de permettre le développement de la science et la technologie nucléaires, et de gérer les responsabilités du gouvernement du Canada en matière de déchets radioactifs. Depuis 2015, EACL exécute son mandat par l’intermediaire d’un modèle d’organisme gouvernemental exploité par un entrepreneur (OGEE), selon lequel une organisation du secteur privé, les Laboratoires nucléaires canadiens (LNC), est responsable de la gestion et de l’exploitation des sites d’EACL, en vertu d’accords à long terme. Les objectifs d’EACL dans le cadre du modèle OGEE comprennent l’accélération de la gestion de l’assainissement de l’environnement, la gestion du Plan de travail fédéral en matiere de science et de technologie nucléaires à l’appui des priorités et des besoins du gouvernement, et la construction d’un laboratoire nucléaire de calibre mondial qui répond aux priorités du gouvernement et qui augmente les revenus commerciaux, tout en réduisant ou en limitant les coûts et les risques pour le Canada.\n \n  Ce que vous ferez :\n \n   Sous la responsabilité d’un(e) vice-président(e), l’adjoint(e) de direction est chargé(e) d’assurer l’efficacité de l’organisation, le service à la clientèle, la gestion des relations et la realisation d’activités administratives clés pour un maximum de quatre dirigeants(es). Dans ce rôle, vous agissez avec professionnalisme et tact tout en gérant une vaste gamme de tâches administratives de niveau exécutif qui sont de nature sensible et confidentielle. Vous êtes organisé(e) et vous aidez à résoudre les difficultés administratives inhérentes au soutien d’une équipe diversifiée dans un environnement en constante évolution.\n \n \n \n   Vous prenez des initiatives et jonglez avec des demandes concurrentes tout en recherchant des possibilités d’améliorer les processus et pratiques administratives. Vous vous appuyez sur vos connaissances pratiques et spécialisées en matière des processus et procédures de soutien aux entreprises pour répondre aux besoins des intervenants internes et externes avec tact et discrétion. Vous pensez à l’avenir, vous anticipez les besoins et vous acquittez vos responsabilités avec un minimum de directives.\n \n  Ce que vous apportez :\n \n   Diplôme en administration des affaires.\n   Le bilinguisme (français et anglais) est considéré comme un atout.\n   5 ans d’expérience en soutien aux cadres supérieurs.\n   Une compréhension solide des normes documentaires de l’entreprise et une attention rigoureuse aux détails et à la précision dans la tenue des dossiers, des ordres du jour, des procès-verbaux, des fichiers électroniques, etc.\n   Solides compétences en matière de planification et approche très organisée du travail.\n   Doit avoir l’esprit d’équipe et savoir communiquer efficacement afin de promouvoir un environnement de travail positif.\n   Aptitude avérée à aborder le travail avec tact, diplomatie et un haut niveau de confiance et de discrétion dans le traitement d’informations sensibles et confidentielles.\n   Capacité et volonté de travailler avec un minimum de supervision dans un environnement d’équipe qui requiert de l’initiative.\n   Capacité à s’auto-motiver et à travailler efficacement avec tous les niveaux d’employés, tant en personne qu’au téléphone; capacité d’interagir efficacement avec d’autres groupes, en particulier ceux des autres sites d’EACL, et d’autres groupes externes à EACL.\n   Motivé pour trouver des gains d’efficacité et améliorer continuellement les processus et les procédures.\n   Capacité àrésoudre des problèmes et à faire preuve d’un esprit critique efficace.\n   Connaissances avancées des produits Microsoft Office (Word, Outlook, PowerPoint et Excel) et aptitude à apprendre de nouveaux logiciels, technologies et systèmes.\n   Créativité, innovation, flexibilité et adaptabilité pour gérer les multiples priorités et calendriers d’EACL.\n \n  Ce que nous offrons :\n \n   Prestations médicales et dentaires complètes par l’entremise du gouvernement du Canada.\n   Participation au Régime de pension de retraite de la fonction publique (un régime de retraite à prestations déterminées indexées) pour vous aider à planifier votre retraite.\n   Des vacances, des conges personnels et des jours flottants à utiliser pour favoriser votre bien-être physique et mental.\n   Un programme confidentiel d’aide aux employés pour vous aider à relever les défis auxquels vous ou vos personnes à votre charge pouvez être confrontés.\n   Accès instantané, 24 heures sur 24 et 7 jours sur 7, à des médecins en ligne par l’intermédiaire de Maple, qui vous couvre, et vos personnes à votre charge en cas de besoin médical.\n   Ressources sur la pleine conscience et la méditation par l’intermédiaire de Headspace pour soutenir votre santé mentale.\n   Un modèle de travail hybride flexible qui vous permet de trouver un équilibre entre le travail à domicile et l’entretien des relations en personnes.\n \n  Ce à quoi vous pouvez vous attendre :\n \n   Cette annonce demeurera affichée, mais nous commencerons à examiner les candidatures le 23 octobre 2023.\n   Cette annonce concerne deux postes temporaires à temps plein d’une durée d’un an. Le premier poste sera base au bureau d’EACL à Chalk River, en Ontario, et le second au bureau d’EACL à Ottawa, en Ontario.\n   Ce concours comporte deux séries d’entrevues.\n   Le candidat sélectionné doit satisfaire aux exigences du gouvernement du Canada en matière d’habilitation de sécurité.\n   Bien que nous apprécions sincèrement toutes les demandes d’emploi, seuls les candidats sélectionnés pour une entrevue seront contactés.\n   La préférence peut être donnée aux personnes bilingues.\n \n \n   \n \n \n  A EACL, nous nous engageons à créer un milieu de travail authentique; la promotion de la diversité, de l’équité, de l’inclusion et de l’accessibilité nous tient à cœur. Nous accueillons les candidatures des femmes, des minorités visibles, des autochtones, des personnes handicapées et des personnes de toute identité, et expression de genre et de toute orientation sexuelle. La préférence peut être donnée aux membres d’un groupe désigné afin de remédier à une sous-représentation identifiée. Nous encourageons les candidats à s’identifier.\n \n \n   \n \n \n  EACL fournit un soutien et des aménagements raisonnable dans les processus de recrutement aux candidats handicapes, y compris des aménagements qui prennent en compte les besoins d’accessibilite d’un candidat. Si vous souffrez d’un handicap qui nécessite une mesure d’adaptation pendant notre processus de recrutement, faites-nous savoir comment nous pouvons vous aider en envoyant un courriel à \n  hr@aecl.ca.\n \n  À propos d’EACL :\n \n \n  \n   \n     www.aecl.ca\n   \n  \n  \n  \n   \n     @AECL\n   \n  \n  \n  \n   \n     @AECL_EACL\n   \n  \n  \n  \n   \n    \n      @atomicenergycanada",
    "preprocessed_description": "Job Description: AECL acknowledges with gratitude that we operate on territories that have, since time immemorial, been the traditional lands of Indigenous peoples in Canada. Is AECL right for you? As a federal Crown corporation, Atomic Energy of Canada Limited (AECL) has a mandate to enable nuclear science and technology and manage the Government of Canada's radioactive waste liabilities. Since 2015, AECL has been delivering its mandate through a Government-owned, Contractor-operated (GoCo) business model, whereby a private-sector organization, Canadian Nuclear Laboratories (CNL), is responsible for managing and operating AECL's sites on its behalf, pursuant to long term agreements. AECL's objectives under the GoCo model include accelerating Environmental Remediation Management, managing the Federal Nuclear Science and Technology Work Plan in support of government priorities and needs, and building a world-class nuclear laboratory that fulfils government priorities and grows commercial revenues, while reducing or containing costs and risks to Canada. What you will do: Reporting to a vice president, the Executive Assistant is responsible for ensuring organization efficiency, customer service, relationships management and delivery on key administrative activities for up to four executives. In this role, you act with professionalism and tact while managing an extensive range of executive-level administrative tasks that are sensitive and confidential in nature. You are organized and thrive in resolving administrative difficulties that are inherent in supporting a diversified team within a fast-paced environment. What you bring: Diploma in Business Administration. Bilingualism in English and French is considered an asset. 5 years of previous experience supporting executives. Solid understanding of corporate document standards and strict attention to detail and accuracy in the maintenance of records, agenda, minutes, electronic files, etc. Solid planning skills and a highly organized approach to work. Must be team oriented and an effective communicator to promote a positive work environment. Demonstrated ability to approach work tactfully, with diplomacy and high a level of trust and discretion in handling of sensitive and confidential information. Ability and willingness to work with minimal supervision in a team environment that requires initiative. Ability to be self-motivated and work efficiently with all levels of employees both in person and on the telephone; ability to effectively interface with other groups, particularly those at other AECL sites, and other groups external to AECL. Motivated to find efficiencies and continuously improve processes and procedures. Ability to problem solve and be an effective critical thinker Advanced proficiency with Microsoft Office Products (Word, Outlook, PowerPoint, and Excel) as well as an aptitude for learning new software, technologies, and systems. Creativity, innovation, flexibility, and adaptability to handle the multiple priorities and schedules of AECL. What you can expect: While this ad will remain posted, we will begin reviewing applications on October 23, 2023. This posting is for two, full-time temporary positions that will be one year in duration. One position will be based out of AECL's Chalk River, Ontario office, and the other will be based out of AECL's Ottawa, Ontario office. This competition will have two rounds of interviews. The selected candidate must successfully meet Government of Canada security clearance requirements. While we sincerely appreciate all applications, only those candidates selected for an interview will be contacted. Preference may be given to individuals who are bilingual. At AECL, we are committed to building an authentic workplace; promoting diversity, equity, inclusion, and accessibility matters to us. We welcome applications from women, visible minorities, Indigenous Peoples, persons with disabilities, and persons of any gender identity, expression, and sexual orientation. Preference may be given to members of a designated group to address identified under-representation. We encourage candidates to self-identify. AECL provides support and reasonable accommodations in its recruitment processes to applicants with disabilities including accommodations that consider an applicant's accessibility needs. If you have a disability that requires accommodation during our recruitment process, let us know how we can assist you by emailing hr@aecl.ca. About AECL: www.aecl.ca @AECL @AECL_EACL @atomicenergycanada Description du poste: Énergie atomique du Canada limitée (EACL) reconnaît avec gratitude que nous opérons sur des territoires qui, depuis des temps immémoriaux, sont les terres traditionnelles des peuples autochtones du Canada. EACL vous convient? En tant que société d'État canadienne, EACL a pour mandat de permettre le développement de la science et la technologie nucléaires, et de gérer les responsabilités du gouvernement du Canada en matière de déchets radioactifs. Depuis 2015, EACL exécute son mandat par l'intermediaire d'un modèle d'organisme gouvernemental exploité par un entrepreneur (OGEE), selon lequel une organisation du secteur privé, les Laboratoires nucléaires canadiens (LNC), est responsable de la gestion et de l'exploitation des sites d'EACL, en vertu d'accords à long terme. Les objectifs d'EACL dans le cadre du modèle OGEE comprennent l'accélération de la gestion de l'assainissement de l'environnement, la gestion du Plan de travail fédéral en matiere de science et de technologie nucléaires à l'appui des priorités et des besoins du gouvernement, et la construction d'un laboratoire nucléaire de calibre mondial qui répond aux priorités du gouvernement et qui augmente les revenus commerciaux, tout en réduisant ou en limitant les coûts et les risques pour le Canada. Ce que vous ferez : Sous la responsabilité d'un(e) vice-président(e), l'adjoint(e) de direction est chargé(e) d'assurer l'efficacité de l'organisation, le service à la clientèle, la gestion des relations et la realisation d'activités administratives clés pour un maximum de quatre dirigeants(es). Dans ce rôle, vous agissez avec professionnalisme et tact tout en gérant une vaste gamme de tâches administratives de niveau exécutif qui sont de nature sensible et confidentielle. Vous êtes organisé(e) et vous aidez à résoudre les difficultés administratives inhérentes au soutien d'une équipe diversifiée dans un environnement en constante évolution. Vous prenez des initiatives et jonglez avec des demandes concurrentes tout en recherchant des possibilités d'améliorer les processus et pratiques administratives. Vous vous appuyez sur vos connaissances pratiques et spécialisées en matière des processus et procédures de soutien aux entreprises pour répondre aux besoins des intervenants internes et externes avec tact et discrétion. Vous pensez à l'avenir, vous anticipez les besoins et vous acquittez vos responsabilités avec un minimum de directives. Ce que vous apportez : Diplôme en administration des affaires. Le bilinguisme (français et anglais) est considéré comme un atout. 5 ans d'expérience en soutien aux cadres supérieurs. Une compréhension solide des normes documentaires de l'entreprise et une attention rigoureuse aux détails et à la précision dans la tenue des dossiers, des ordres du jour, des procès-verbaux, des fichiers électroniques, etc. Solides compétences en matière de planification et approche très organisée du travail. Doit avoir l'esprit d'équipe et savoir communiquer efficacement afin de promouvoir un environnement de travail positif. Aptitude avérée à aborder le travail avec tact, diplomatie et un haut niveau de confiance et de discrétion dans le traitement d'informations sensibles et confidentielles. Capacité et volonté de travailler avec un minimum de supervision dans un environnement d'équipe qui requiert de l'initiative. Capacité à s'auto-motiver et à travailler efficacement avec tous les niveaux d'employés, tant en personne qu'au téléphone; capacité d'interagir efficacement avec d'autres groupes, en particulier ceux des autres sites d'EACL, et d'autres groupes externes à EACL. Motivé pour trouver des gains d'efficacité et améliorer continuellement les processus et les procédures. Capacité àrésoudre des problèmes et à faire preuve d'un esprit critique efficace. Connaissances avancées des produits Microsoft Office (Word, Outlook, PowerPoint et Excel) et aptitude à apprendre de nouveaux logiciels, technologies et systèmes. Créativité, innovation, flexibilité et adaptabilité pour gérer les multiples priorités et calendriers d'EACL. Ce que nous offrons : Prestations médicales et dentaires complètes par l'entremise du gouvernement du Canada. Participation au Régime de pension de retraite de la fonction publique (un régime de retraite à prestations déterminées indexées) pour vous aider à planifier votre retraite. Des vacances, des conges personnels et des jours flottants à utiliser pour favoriser votre bien-être physique et mental. Un programme confidentiel d'aide aux employés pour vous aider à relever les défis auxquels vous ou vos personnes à votre charge pouvez être confrontés. Accès instantané, 24 heures sur 24 et 7 jours sur 7, à des médecins en ligne par l'intermédiaire de Maple, qui vous couvre, et vos personnes à votre charge en cas de besoin médical. Ressources sur la pleine conscience et la méditation par l'intermédiaire de Headspace pour soutenir votre santé mentale. Un modèle de travail hybride flexible qui vous permet de trouver un équilibre entre le travail à domicile et l'entretien des relations en personnes. Ce à quoi vous pouvez vous attendre : Cette annonce demeurera affichée, mais nous commencerons à examiner les candidatures le 23 octobre 2023. Cette annonce concerne deux postes temporaires à temps plein d'une durée d'un an. Le premier poste sera base au bureau d'EACL à Chalk River, en Ontario, et le second au bureau d'EACL à Ottawa, en Ontario. Ce concours comporte deux séries d'entrevues. Le candidat sélectionné doit satisfaire aux exigences du gouvernement du Canada en matière d'habilitation de sécurité. Bien que nous apprécions sincèrement toutes les demandes d'emploi, seuls les candidats sélectionnés pour une entrevue seront contactés. La préférence peut être donnée aux personnes bilingues. A EACL, nous nous engageons à créer un milieu de travail authentique; la promotion de la diversité, de l'équité, de l'inclusion et de l'accessibilité nous tient à cœur. Nous accueillons les candidatures des femmes, des minorités visibles, des autochtones, des personnes handicapées et des personnes de toute identité, et expression de genre et de toute orientation sexuelle. La préférence peut être donnée aux membres d'un groupe désigné afin de remédier à une sous-représentation identifiée. Nous encourageons les candidats à s'identifier. EACL fournit un soutien et des aménagements raisonnable dans les processus de recrutement aux candidats handicapes, y compris des aménagements qui prennent en compte les besoins d'accessibilite d'un candidat. Si vous souffrez d'un handicap qui nécessite une mesure d'adaptation pendant notre processus de recrutement, faites-nous savoir comment nous pouvons vous aider en envoyant un courriel à hr@aecl.ca. À propos d'EACL : www.aecl.ca @AECL @AECL_EACL @atomicenergycanada",
    "processed_description": "Description acknowledge gratitude operate territory immemorial traditional land indigenous people . federal Crown corporation mandate enable nuclear science technology manage radioactive waste liability . deliver mandate government contractor operate GoCo business model private sector organization responsible manage operate aecl's site behalf pursuant long term agreement . AECL's objective GoCo model include accelerate manage support government priority build class nuclear laboratory fulfil government priority grow commercial revenue reduce cost risk . report vice president Executive Assistant responsible ensure organization efficiency customer service relationship management delivery key administrative activity executive . role professionalism tact manage extensive range executive level administrative task sensitive confidential nature . organize thrive resolve administrative difficulty inherent support diversified team fast pace environment . bring Diploma . Bilingualism consider asset . previous support executive . solid understanding corporate document standard strict attention detail accuracy maintenance record agenda electronic file . solid planning skill highly organize approach . team orient effective communicator promote positive environment . demonstrate approach tactfully diplomacy high level trust discretion handling sensitive confidential information . willingness minimal supervision team environment require initiative . motivated efficiently level employee person effectively interface group aecl site group external . motivate find efficiency continuously improve process procedure . problem solve effective critical thinker advanced proficiency Word Outlook aptitude learn software technology system . creativity innovation flexibility adaptability handle multiple priority schedule . expect ad remain post review application . posting temporary position duration . position base office base AECL's office . competition round interview . select meet Government security clearance requirement . sincerely appreciate application select interview contact . individual . committed build authentic workplace promote diversity equity inclusion accessibility matter . application woman visible minority person person gender identity expression sexual orientation . designate group address identify representation . encourage identify . provide support reasonable accommodation recruitment process applicant include accommodation consider applicant accessibility . require accommodation recruitment process assist email . Description du poste energie atomique du limitee EACL reconnait avec sont les terres traditionnelles des peuples autochtone . EACL vous convient EACL pour mandat permettre developpement science technologie nucleaires gerer les responsabilites du gouvernement du matiere dechets radioactifs . Depuis EACL execute son mandat par l'intermediaire d'un modele d'organisme gouvernemental exploite par entrepreneur est responsable gestion l'exploitation des site d'EACL vertu d'accords long terme . Les objectifs d'EACL gestion du Plan travail federal matiere science technologie nucleaire construction d'un laboratoire nucleaire calibre mondial repond aux priorites du gouvernement augmente les revenus commerciaux tout reduisant limitant . Ce vous Sous responsabilite d'un vice president charge d'assurer l'efficacite l'organisation service clientele gestion des relations realisation d'activites administrative cles pour maximum quatre dirigeants es . vous agissez tact tout gerant une vaste gamme taches administrative niveau executif sont nature sensible confidentielle . Vous etes organise vous aidez resoudre les difficultes administrative equipe diversifiee dans environnement constante evolution . des initiative concurrente tout recherchant des possibilites d'ameliorer les processus pratiques administrative . Vous vous specialisees matiere des processus procedures soutien aux entreprises pour discretion . vous acquittez vos responsabilites minimum directive . Ce vous apportez Diplome administration des affaire . francais anglais est considere comme atout . . Une comprehension solide des normes documentaires l'entreprise une attention precision dans tenue des dossiers des fichiers electroniques . solide competence matiere planification approche tres organisee du travail . Doit avoir l'esprit d'equipe savoir communiquer efficacement afin promouvoir environnement travail positif . aptitude averee traitement d'information sensible . minimum supervision dans environnement d'equipe requiert l'initiative . Capacite s'auto motiver travailler efficacement avec tous les niveaux dthemployes capacite d'interagir efficacement avec d'autres groupe particulier ceux des autres sites d'EACL d'autres groupes externe EACL . Motive pour les procedure . capacite aresoudre des problemes faire preuve d'un esprit critique efficace . Word Outlook aptitude apprendre nouveaux logiciels technologies systemes . Creativite innovation flexibilite adaptabilite pour gerer les multiple priorites calendriers d'EACL . Ce nous offron Prestations medicales dentaires completes par l'entremise du gouvernement du . participation au Regime pension retraite fonction publique pour vous aider planifier . Des vacance des conge personnel des jours flottants utiliser pour favoriser votre bien etre physique mental . programme vous aider vos personnes votre charge pouvez etre confrontes . heure sur jour sur des medecins ligne par l'intermediaire Maple vous couvre vos personnes votre charge cas besoin medical . ressource sur pleine conscience meditation par l'intermediaire Headspace pour . modele travail hybride flexible vous permet trouver equilibre entre travail domicile l'entretien des relations personne . mais nous commencerons examiner les candidature octobre . Cette annonce concerne deux postes temporaire temps plein d'une duree d'un . premier poste sera base au bureau second au bureau d'EACL . Ce concours comporte deux serie d'entrevue . . pour une entrevue seront contactes . . EACL nous nous engageon creer milieu travail authentique l'equite l'inclusion l'accessibilite nous tient cœur . nous accueillon les candidature des femmes des minorites visible des autochtone des personnes toute identite expression genre toute orientation sexuelle . une sous representation identifiee . nous encourageon les candidats s'identifier . raisonnable dans les processus recrutement aux candidats handicapes compris . d'un handicap necessite une mesure d'adaptation pendant faite nous savoir comment nous . propos d'EACL",
    "results_group": {
        "extracted_noun_chunks": [
            "thrive",
            "tous les niveaux dthemployes capacite d'interagir efficacement avec d'autres groupe",
            "representation",
            "aecl's site behalf pursuant long term agreement",
            "une mesure d'adaptation pendant faite nous savoir comment",
            "federal matiere",
            "visible minority person person",
            "candidats handicapes compris",
            "gender identity expression",
            "Doit avoir l'esprit d'equipe savoir communiquer efficacement afin promouvoir environnement travail positif",
            "aptitude averee traitement d'information",
            "participation au Regime pension retraite fonction publique pour",
            "attention precision",
            "support",
            "l'intermediaire Headspace",
            "des initiative concurrente",
            "flexible vous",
            "gratitude",
            "Ce vous Sous responsabilite d'un vice president charge d'assurer l'efficacite l'organisation service clientele gestion des relations realisation d'activites administrative cles",
            "AECL's objective GoCo model",
            "inherent support diversified team fast pace environment",
            "les processus",
            "multiple priority schedule",
            "willingness minimal supervision team environment",
            "environnement constante evolution",
            "accommodation",
            "identite expression genre toute orientation sexuelle",
            "support government priority build class nuclear laboratory",
            "Les objectifs d'EACL",
            "nous accueillon les candidature des femmes des minorites",
            "vice president Executive Assistant",
            "government priority",
            "capacite aresoudre des problemes faire preuve d'un esprit critique efficace",
            "atout",
            "position base office base AECL's office",
            "science technologie nucleaire construction d'un laboratoire nucleaire calibre mondial repond aux priorites du gouvernement augmente les revenus commerciaux tout reduisant",
            "gerer les multiple priorites calendriers",
            "accommodation recruitment process",
            "role professionalism tact",
            "previous support executive",
            "mandate government contractor",
            "favoriser votre bien etre physique mental",
            "organization efficiency customer service relationship management delivery key administrative activity executive",
            "responsible manage",
            "asset",
            "Creativite innovation flexibilite",
            "son mandat par",
            "initiative",
            "solide competence matiere planification approche tres",
            "commercial revenue",
            "vous agissez tact tout gerant une",
            "vos",
            "difficultes administrative equipe diversifiee",
            "authentic workplace",
            "email",
            "sous representation identifiee",
            "competition round interview",
            "sensitive confidential nature",
            "Depuis EACL",
            "GoCo business model private sector organization",
            "Description",
            "EACL vous convient EACL",
            "d'EACL",
            "reasonable accommodation recruitment process applicant",
            "software technology system",
            "extensive range executive level administrative task",
            "minimum supervision",
            "tactfully diplomacy high level trust discretion",
            "problem",
            "du gouvernement du matiere dechets radioactifs",
            "environnement d'equipe requiert l'initiative",
            "une entrevue seront contactes",
            "Capacite s'auto motiver travailler efficacement",
            "l'intermediaire d'un modele d'organisme gouvernemental exploite par entrepreneur est responsable gestion l'exploitation des site",
            "nous encourageon les candidats s'identifier",
            "l'entretien des relations personne",
            "Bilingualism",
            "Des vacance des conge personnel des jours flottants utiliser",
            "d'EACL d'autres groupes externe EACL",
            "programme vous aider vos personnes votre charge pouvez etre confrontes",
            "d'un handicap necessite",
            "Description du poste energie atomique du limitee EACL reconnait avec sont les",
            "Diplome administration des affaire",
            "team orient effective communicator",
            "particulier ceux des autres sites",
            "Une comprehension solide des normes documentaires l'entreprise",
            "propos d'EACL",
            "des autochtone des personnes",
            "modele travail hybride",
            "solid understanding corporate document standard strict attention detail accuracy maintenance record agenda electronic file",
            "Ce vous",
            "effective critical thinker advanced proficiency Word Outlook aptitude",
            "radioactive waste liability",
            "solid planning skill",
            "creativity innovation flexibility adaptability",
            "du travail",
            "deux postes",
            "territory immemorial traditional land indigenous people",
            "trouver equilibre entre travail",
            "motivated efficiently level employee person",
            "ressource sur pleine conscience meditation par",
            "cost risk",
            "Diploma",
            "specialisees matiere",
            "personnes votre charge cas besoin medical",
            "mais",
            "post review application",
            "vous aidez resoudre",
            "Word Outlook aptitude apprendre nouveaux logiciels technologies systemes",
            "administrative difficulty",
            "terres traditionnelles des peuples autochtone",
            "soutien aux entreprises",
            "mandat permettre developpement science technologie nucleaires gerer les responsabilites",
            "nuclear science technology",
            "vous aider",
            "designate group address",
            "positive environment",
            "les processus recrutement",
            "vous acquittez vos",
            "procedure",
            "applicant accessibility",
            "maximum quatre dirigeants es",
            "heure sur jour sur des medecins ligne par l'intermediaire Maple vous couvre",
            "temporaire temps plein d'une duree d'un .",
            "federal Crown corporation mandate",
            "approach",
            "Ce concours",
            "diversity equity inclusion accessibility matter",
            "select meet Government security clearance requirement",
            "ad",
            "Vous etes",
            "Cette annonce",
            "efficiency",
            "premier poste sera base au bureau second au bureau d'EACL",
            "process procedure",
            "sensitive confidential information",
            "minimum directive",
            "application select interview contact",
            "individual",
            "EACL nous nous engageon creer milieu travail authentique l'equite l'inclusion l'accessibilite nous tient cœur",
            "francais anglais est considere",
            "temporary position duration",
            "long terme",
            "discretion"
        ],
        "combined_lemmatized_tokens": "Description acknowledge gratitude operate territory immemorial traditional land indigenous people . federal Crown corporation mandate enable nuclear science technology manage radioactive waste liability . deliver mandate government contractor operate GoCo business model private sector organization responsible manage operate aecl's site behalf pursuant long term agreement . AECL's objective GoCo model include accelerate manage support government priority build class nuclear laboratory fulfil government priority grow commercial revenue reduce cost risk . report vice president Executive Assistant responsible ensure organization efficiency customer service relationship management delivery key administrative activity executive . role professionalism tact manage extensive range executive level administrative task sensitive confidential nature . organize thrive resolve administrative difficulty inherent support diversified team fast pace environment . bring Diploma . Bilingualism consider asset . previous support executive . solid understanding corporate document standard strict attention detail accuracy maintenance record agenda electronic file . solid planning skill highly organize approach . team orient effective communicator promote positive environment . demonstrate approach tactfully diplomacy high level trust discretion handling sensitive confidential information . willingness minimal supervision team environment require initiative . motivated efficiently level employee person effectively interface group aecl site group external . motivate find efficiency continuously improve process procedure . problem solve effective critical thinker advanced proficiency Word Outlook aptitude learn software technology system . creativity innovation flexibility adaptability handle multiple priority schedule . expect ad remain post review application . posting temporary position duration . position base office base AECL's office . competition round interview . select meet Government security clearance requirement . sincerely appreciate application select interview contact . individual . committed build authentic workplace promote diversity equity inclusion accessibility matter . application woman visible minority person person gender identity expression sexual orientation . designate group address identify representation . encourage identify . provide support reasonable accommodation recruitment process applicant include accommodation consider applicant accessibility . require accommodation recruitment process assist email . Description du poste energie atomique du limitee EACL reconnait avec sont les terres traditionnelles des peuples autochtone . EACL vous convient EACL pour mandat permettre developpement science technologie nucleaires gerer les responsabilites du gouvernement du matiere dechets radioactifs . Depuis EACL execute son mandat par l'intermediaire d'un modele d'organisme gouvernemental exploite par entrepreneur est responsable gestion l'exploitation des site d'EACL vertu d'accords long terme . Les objectifs d'EACL gestion du Plan travail federal matiere science technologie nucleaire construction d'un laboratoire nucleaire calibre mondial repond aux priorites du gouvernement augmente les revenus commerciaux tout reduisant limitant . Ce vous Sous responsabilite d'un vice president charge d'assurer l'efficacite l'organisation service clientele gestion des relations realisation d'activites administrative cles pour maximum quatre dirigeants es . vous agissez tact tout gerant une vaste gamme taches administrative niveau executif sont nature sensible confidentielle . Vous etes organise vous aidez resoudre les difficultes administrative equipe diversifiee dans environnement constante evolution . des initiative concurrente tout recherchant des possibilites d'ameliorer les processus pratiques administrative . Vous vous specialisees matiere des processus procedures soutien aux entreprises pour discretion . vous acquittez vos responsabilites minimum directive . Ce vous apportez Diplome administration des affaire . francais anglais est considere comme atout . . Une comprehension solide des normes documentaires l'entreprise une attention precision dans tenue des dossiers des fichiers electroniques . solide competence matiere planification approche tres organisee du travail . Doit avoir l'esprit d'equipe savoir communiquer efficacement afin promouvoir environnement travail positif . aptitude averee traitement d'information sensible . minimum supervision dans environnement d'equipe requiert l'initiative . Capacite s'auto motiver travailler efficacement avec tous les niveaux dthemployes capacite d'interagir efficacement avec d'autres groupe particulier ceux des autres sites d'EACL d'autres groupes externe EACL . Motive pour les procedure . capacite aresoudre des problemes faire preuve d'un esprit critique efficace . Word Outlook aptitude apprendre nouveaux logiciels technologies systemes . Creativite innovation flexibilite adaptabilite pour gerer les multiple priorites calendriers d'EACL . Ce nous offron Prestations medicales dentaires completes par l'entremise du gouvernement du . participation au Regime pension retraite fonction publique pour vous aider planifier . Des vacance des conge personnel des jours flottants utiliser pour favoriser votre bien etre physique mental . programme vous aider vos personnes votre charge pouvez etre confrontes . heure sur jour sur des medecins ligne par l'intermediaire Maple vous couvre vos personnes votre charge cas besoin medical . ressource sur pleine conscience meditation par l'intermediaire Headspace pour . modele travail hybride flexible vous permet trouver equilibre entre travail domicile l'entretien des relations personne . mais nous commencerons examiner les candidature octobre . Cette annonce concerne deux postes temporaire temps plein d'une duree d'un . premier poste sera base au bureau second au bureau d'EACL . Ce concours comporte deux serie d'entrevue . . pour une entrevue seront contactes . . EACL nous nous engageon creer milieu travail authentique l'equite l'inclusion l'accessibilite nous tient cœur . nous accueillon les candidature des femmes des minorites visible des autochtone des personnes toute identite expression genre toute orientation sexuelle . une sous representation identifiee . nous encourageon les candidats s'identifier . raisonnable dans les processus recrutement aux candidats handicapes compris . d'un handicap necessite une mesure d'adaptation pendant faite nous savoir comment nous . propos d'EACL"
    }
}