{
    "id": "6fb549a1ef3eff53",
    "company": "United Rentals, Inc.",
    "positionName": "Field Service Mechanic - CES",
    "jobType": null,
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-26T12:13:19.235Z",
    "url": "https://www.indeed.ca/rc/clk?jk=6fb549a1ef3eff53&from=jasx&tk=1hl5dd1pui7nm800&bb=NiGljfghLwyJxtbyZy8vsxmolxgv4gni07OgQfHSIM0S6gSgRHh0lyiFkPa-Ya_70m2djOU6-BN6P6FEMKXC-IKXIk5ccFbJOS6nH_RSyy0ZZq9O4I1rOQ%3D%3D&xkcb=SoAM67M3FlS757AVJj0MbzkdCdPP&vjs=3",
    "externalApplyLink": "https://jobs.unitedrentals.com/search/jobdetails/field-service-mechanic---ces/1343b18c-02de-4dec-a5ed-83d21f7d799b?utm_campaign=indeed_organic&utm_medium=organic_job_board&utm_source=indeed&afid=7e4b4b81-9150-4242-8f3f-b01b1b260292&sid=65",
    "job_info_group": {
        "extracted_phone_numbers": [],
        "extracted_links": [
            "HTTP/HTTPS Links",
            "General Links",
            "WWW Links",
            "TLDs"
        ],
        "extracted_emails": [
            "careers@ur.com"
        ],
        "extracted_location_data": [
            "US"
        ],
        "extracted_dates": [
            "2023",
            "Every day",
            "an acceptable driving record 3-5 years"
        ],
        "extracted_languages": [],
        "extracted_laws": [],
        "extracted_norps": [],
        "extracted_orgs": [
            "an Equal Opportunity Employer",
            "United Rentals",
            "a daily basis Upsell",
            "a Field Diesel Mechanic",
            "United Rentals, Inc.",
            "our Service Department",
            "a Glassdoor Best Place to Work"
        ],
        "extracted_persons": [],
        "extracted_products": [],
        "extracted_money": [],
        "processed_text": "great company . great people . great . chance mark world's large equipment rental provider build future – Customer Equipment Solutions CES skill perform maintenance repair complex equipment customer equipment limited supervision highly skilled safe professional manner . improve challenge desire ambition potential high level Service Technician leadership role . team rely provide exceptional customer service customer . safe maintenance repair complex mechanical electrical hydraulic diesel system variety customer equipment tool high degree independent judgment maintain paperwork electronic documentation perform order complete timely manner demonstrate wide array complex equipment customer travel customer site repair maintenance customer equipment maintain service vehicle clean professional manner assist pick delivery equipment duty assign Requirements High School diploma equivalent valid driver's license repair maintain equipment tool advanced mechanical aptitude knowledge tool knowledge construction equipment strong mechanical background knowledge engine tool applicable position Superior customer service teamwork verbal write communication skill frequently lift item lb . position deem Safety Sensitive purpose United Rentals' policy procedure . join talk talk award win company care people offer class benefit perk support family . addition health financial plan offer Paid Parental Leave United Compassion Fund Employee Discount Program Career Development Promotional Opportunities Additional Vacation buy Program early wage access Payactiv Hourly Paid sick leave inclusive welcoming culture learn benefit offering . mutual respect dignity fundamental person define culture . employment decision race color religion sex national origin age genetic information citizenship status veteran status sexual orientation gender identity status protect law . reasonable accommodation point application process email assistance . consist wide variety role duty responsibility . actual pay rate offer vary depend wide range factor include specific position education training skill ."
    },
    "companyDescription": "No cash to buy a bulldozer? No worries -- just lease one from United Rentals. The company considers itself the #1 commercial and construction equipment renter in the world, serving customers in the commercial, infrastructure, industrial, and residential sectors. It operates through a network of more than 970 locations in the US and Canada, and provides about 3,000 equipment items -- everything from general to heavy construction and industrial equipment to hand tools, special-event items (such as aerial towers), power (diesel generators) and HVAC equipment, and trench-safety equipment. It also sells new and used equipment, as well as rental-related and contractor supplies and parts. \r\n\r\nIn 2012 United Rentals increased its outlet count from more than 530 to more than 970 after it bought rival RSC Holdings in a cash-and-stock transaction valued at $4.2 billion, or $18 per share, including $2.3 billion in debt. Both companies have suffered from the recession and combining the two will save more than $200 million a year by eliminating redundant infrastructure, branches, and overhead. The combined businesses will also be in a more strategic position for serving industrial customers.\r\n\r\nBefore the acquisition, United Rentals held about a 9% market share in the US construction/industrial equipment rental industry. It counts commercial construction as its largest end-market, representing about 54% of its rental revenues. The company's general rentals operations cover seven geographic regions throughout the US and northeast Canada. United Rentals expanded its Canadian operations in 2011 with two acquisitions, first buying Venetor Group, a rental equipment company with seven locations in Ontario, and then Ontario Laser Rentals, a lessor of trench safety equipment with two locations in Ontario and one in Montreal.\r\n\r\nRevenue rose about 17% in 2011 compared with 2010. Equipment rentals, accounting for 82% of revenue, surged 17% while the company's next largest segment, sales of rental equipment, 8% of revenue, soared 44%. Sales of new equipment increased 7%. Contractor supply sales and service and other revenue were down 10% and 3%, respectively. Equipment rentals did well behind an increase in the volume of original equipment cost on rent. An increase in rental rates also contributed. Sales of rental equipment were pushed up by increased volume, better pricing, and a new mix of equipment. After weathering a net loss of $62 million in 2009 and one of $26 million in 2010 amid a tough economy, United Rentals enjoyed a net income of $101 million in 2011 along with its strong sales uptick.\r\n\r\nUnited Rentals enhances its operating efficiencies by ramping up through consolidation of functions, including payroll and accounts payable. In order to manage the age, composition and size of its fleet, the company routinely sells used rental equipment and invests in new equipment. United Rentals acts as a dealer of new equipment for many leading equipment makers such as Genie Industries, Skyjack (aerial lifts), Sullair (compressors), and Terex (telehandlers). At most branches United Rentals sells various supplies and merchandise and offers repair and maintenance services.\r\n\r\nUnited Rentals has simultaneously beefed up its presence in the energy market. In late 2011 it purchased the assets of Blue Mountain Equipment Rental Corporation, which caters to the oil and gas industry working in the Marcellus Shale through two locations in Pennsylvania and one in West Virginia. Earlier that year it bought GulfStar Rental Solutions, a power and HVAC equipment rental company in the south. GulfStar adds three locations in Texas and Louisiana, deepening its customer base along the Gulf Coast, as well as paving the way for cross-marketing its general and aerial rental portfolio. \r\n\r\nAlthough United Rentals' customers range from FORTUNE 500 companies to small businesses and homeowners, it targets larger customers, which tend to rent for longer terms and are timely in payment. Because of its size, United Rentals rallies more resources over smaller businesses. Competitive advantages include more purchasing leverage, a wider range of equipment and services, and the more convenient movement of assets between locations. \r\n\r\nBlackRock, Inc. holds a stake of more than 10% in the rental business. The investment firm is among the world's most established financial advisors",
    "description": "Great company. Great people. Great opportunities.\n \n  If you’d like the chance to make your mark with the world’s largest equipment rental provider, come build your future with United Rentals! \n \n As a Field Diesel Mechanic – Customer Equipment Solutions (CES), you’ll use your skills to perform maintenance and repairs of complex equipment on customer-owned equipment with limited or no supervision in a highly skilled, safe, and professional manner. Every day, you can improve and challenge yourself, and if you have the desire and ambition, you’ll have the potential to work towards higher levels of Service Technician and leadership roles in our Service Department. Like every member of our team, we will rely on you to provide exceptional customer service to our customers.\n \n  What you'll do:\n \n   Safe maintenance and repair of complex mechanical, electrical, hydraulic, and diesel systems on a variety of customer equipment and tools while using a high degree of independent judgment\n   Maintain paperwork/electronic documentation of work performed (work orders) in a complete and timely manner on a daily basis\n   Upsell and demonstrate a wide array of complex equipment for customers\n   Travel to customer job sites for repair/maintenance of customer-owned equipment; must maintain service vehicle in a clean and professional manner\n   Assist with pick-up and delivery of equipment & parts\n   Other duties assigned as needed\n \n \n  Requirements:\n \n   High School diploma or equivalent\n   Valid driver's license with an acceptable driving record\n   3-5 years of experience repairing/maintaining equipment and tools \n  Advanced mechanical aptitude and working knowledge of tools\n   Knowledge of construction equipment and strong mechanical background knowledge of various engines\n   Must own tools applicable to the position\n   Superior customer service, teamwork, and verbal/written communication skills\n   Ability to frequently lift items up to 45 lbs.\n \n \n  This position is deemed Safety Sensitive for purposes of United Rentals’ policies and procedures.\n  Why join us?\n  We don’t just “talk the talk!” We’re an award-winning company (recently named a Glassdoor Best Place to Work in 2023) that truly cares about our people - That’s why we offer best-in-class benefits and perks that will support you and your family. In addition to our health and financial plans, we also offer:\n \n   Paid Parental Leave\n   United Compassion Fund\n   Employee Discount Program\n   Career Development & Promotional Opportunities\n   Additional Vacation Buy Up Program (US Only)\n   Early Wage Access through Payactiv (US Hourly Only)\n   Paid Sick Leave\n   An inclusive and welcoming culture\n \n \n  Learn more about our full US benefit offerings here.\n \n  Mutual respect for the dignity and fundamental rights of all persons defines our culture. United Rentals, Inc. is an Equal Opportunity Employer and makes employment decisions regardless of race, color, religion, sex, national origin, age, genetic information, citizenship status, veteran status, sexual orientation, gender identity, disability, or any other status protected by law. If you need a reasonable accommodation at any point of the application process, please email careers@ur.com for assistance.\n \n  United Rentals consists of a wide variety of roles with different duties and responsibilities. The actual pay rate offered to candidates varies depending upon a wide range of factors including specific position, education, training, experience, skills, and ability."
}