{
    "id": "f6b4faa5f1933032",
    "company": "Canadian Institute for Health Information",
    "positionName": "Senior Analyst, Canadian Organ Replacement Register (CORR)",
    "jobType": [],
    "location": "495 Richmond Road, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-17T05:14:06.913Z",
    "url": "https://www.indeed.ca/rc/clk?jk=f6b4faa5f1933032&from=jasx&tk=1hkikh137kp3h801&bb=MbdkWoTc0uPjBzci8Lm-Jaqf_wWyoMZFdeEUzbDa8yiWB6xAPDxqqatxrB0L2WY229q6b16SbyG70EpM8B4gFw7fW9V6zNJB9TaTY_g5J5TgSePEiVOQzA%3D%3D&xkcb=SoBD67M3FShL_WzU3h0EbzkdCdPP&vjs=3",
    "externalApplyLink": "https://clients.njoyn.com/CL3/ex/JobBoards/JobBoards_jobdetails.asp?CLID=053103&BDID=1&JID=J0124-0713&BRID=255264&LGID=1&ForceSBDID=936",
    "companyDescription": "",
    "description": "Category\n    \n   \n    Data Analysis\n    \n  \n   \n  \n   \n    City\n    \n   \n    Ottawa, Toronto, Ontario, Canada\n   \n    \n  \n   \n   \n  \n  \n   \n    Job Description\n    \n   \n    Senior Analyst, Canadian Organ Replacement Register (CORR) \n     \n     Who we are\n     \n    We are an organization comprised of industry thought leaders who are passionate about health data and want to make a difference in the health care field. We are an independent, not-for-profit organization and together with our partners we provide essential information on Canada's health systems, enabling decisions that lead to healthier Canadians. As a valued member of the CIHI team, you and your work will have a pivotal role in the evolution of Canada's health care systems.\n     CIHI is recognized as an exceptional place to work that embraces diversity, respect, integrity, collaboration and innovation. Learn about our Equity, Diversity and Inclusion Strategy and the work being done to create a more inclusive and welcoming organization by focusing on how we learn, govern and practise.\n     At CIHI, we recognize what matters to our employees. Some of the benefits of working at CIHI include\n    \n      HOOPP Pension Plan (Defined Benefits Pension)\n      Retirement Planning Program\n      Generous vacation days for permanent and long-term contracts\n      Work-life balance\n      Career Planning Program\n      Learning and Professional Development Program\n      Flexible benefits program from your first day on the job for permanent and long-term contracts\n    \n     \n     \n     Why is this role important?\n     The Senior Analyst plays a key role in a variety of activities related to the data collection and reporting for the Canadian Organ Replacement Register (CORR). Major activities for the Senior Analyst, CORR include: producing standard and special study reports related to organ replacement therapies, conducting data quality analyses, supporting data collection activities, and database and system enhancements. The Senior Analyst will lead responding to data requests, consulting with clients, analyzing data, implementing and enhancing quality assurance activities, and generating analytic outputs. Additionally, they may contribute to specific activities for the Pan-Canadian Organ Donation and Transplantation (ODT) Data and Performance Reporting System project co-executed by CIHI and Canada Health Infoway. \n     \n     What you'll do\n     1. Leads analytic activities including planning, data analysis, documentation, research and proposal development, and verification in development of analytic products such as the CORR Annual Statistics report.\n     \n     2. Migrates existing SAS code to Python/R, ensuring high quality and accuracy of assigned products.\n     \n     3. Leads and maintains all phases of data updates, including the production and updating of relevant documentation. Supports data submission cycle processes, performs ongoing data quality checks and produces comprehensive documentation as per the CIHI corporate data quality framework. \n     \n     4. Supports CORR application development, enhancement, and testing activities, including review / updates to technical documentation, and conducts investigations, in collaboration with CIHI team members.\n     \n     5. Participates and supports CORR Board meetings and expert working groups. Delivers presentations to external stakeholders and groups at meetings and conferences.\n     \n     6. Responds to customized requests for information from internal and external clients. Key activities include consultation with clients to determine data requirements, development of detailed specifications, design of outputs, preparation of cost estimates, communication and consultation with internal CIHI resources as required, and conducting quality assurance activities.\n     \n     7. Evaluates all data requests to ensure that they are completed in compliance with CIHI Privacy and Confidentiality Policy, and prepares documentation required for the data release process.\n     \n     8. Provides mentoring to other members of the analytical team and departmental staff.\n     \n     9. As needed, contribute to specific analytical activities for the Pan-Canadian Organ Donation and Transplantation (ODT) Data and Performance Reporting System project co-executed by CIHI and Canada Health Infoway. \n     \n     What you'll bring to the table\n     \n    Undergraduate degree in epidemiology, biostatistics, health sciences, health policy, health economics, social sciences, statistics or similar field. Graduate degree is an asset.\n     \n    Three to five years’ experience working with relational or large health information databases, including data submission and support, manipulation, quality improvement and research and analysis. \n     \n    Knowledge of quantitative methods. \n     \n    Experience with data manipulation and statistical software, including SAS, Python and R.\n     \n    Experience in the use of Microsoft Office applications including Excel, Word, and PowerPoint.\n     \n    Excellent interpersonal as well as verbal and written communication skills. \n     \n    Strong conceptual and problem-solving skills.\n     \n    Proven ability to work as part of a team, and to work independently with minimal supervision.\n     \n    Strong organizational and time management skills with a demonstrated ability to manage multiple tasks, activities and priorities effectively to meet deadlines.\n     \n    Knowledge of CIHI’s databases (e.g., CORR, DAD, NACRS) is an asset. \n     \n    Ability to meet travel requirements, as required. \n     \n    Fluency in both official languages is an asset. \n     \n     Closing Statement\n     \n    To find out more about this role and other exciting opportunities visit our website at www.cihi.ca and check out our 'Careers' section.\n     We thank all those who apply, however, only candidates selected for an interview will be contacted.\n     \n     \n     Employment Equity\n     \n    At CIHI we are committed to fostering an inclusive, barrier-free and accessible environment. Part of this commitment includes arranging accommodations to ensure an equitable opportunity to participate in the recruitment and selection process. If you require an accommodation, we will work with you to meet your needs.\n     \n     \n     \n     \n     \n    Analyste principal, Registre canadien des insuffisances et des transplantations d’organes (RCITO) \n     \n     Notre organisation\n     \n    Notre organisation regroupe des leaders d'opinion de l'industrie qui sont passionnés par les données et veulent faire bouger les choses dans le domaine de la santé. À titre d'organisme autonome et sans but lucratif, nous collaborons avec nos partenaires pour fournir de l'information essentielle sur les systèmes de santé au pays, favorisant la prise de décisions éclairées qui visent à améliorer la santé des Canadiens. À titre d'employé de l'ICIS, vous jouerez un rôle déterminant dans l'évolution du système de santé canadien.\n     L'ICIS offrons un milieu de travail exceptionnel qui favorise la diversité, le respect, l'intégrité, la collaboration et l'innovation. Renseignexz-vous sur notre strategie sur l'équité, la diversité et l'inclusion et les efforts que nous déployons pour créer un environnmenent plus inclusif et accueillant en misant sur nos apprentissages, notre gouvernance et nos pratiques.\n     L'ICIS, sachant ce qui importe à ses employés, leur offre une gamme d'avantages, dont les suivants : \n    \n     une structure salariale concurrentielle\n      un régime d'avantages sociaux flexible dès le premier jour de travail\n      l'adhésion au régime de retraite HOOPP\n      un programme de planification de la retraite\n      un équilibre travail-vie personnelle\n      un programme de planification de carrière\n      des programmes d'apprentissage et de perfectionnement professionnel\n    \n     \n     \n     Pourquoi ce rôle est-il important ?\n     L’analyste principal joue un rôle clé dans diverses activités touchant la collecte et la déclaration de données au Registre canadien des insuffisances et des transplantations d’organes (RCITO). Il doit notamment participer à la production de rapports standard et spéciaux sur les remplacements d’organes, réaliser des analyses de la qualité des données, et appuyer les activités de collecte des données et d’amélioration des bases de données et des systèmes. Il joue également un rôle de premier plan dans le traitement des demandes de données, la consultation de clients, l’analyse de données, la mise en œuvre d’activités d’assurance et d’amélioration de la qualité, ainsi que l’élaboration de produits analytiques. Il peut aussi être appelé à participer à certaines activités pour le projet de système pancanadien de déclaration de données et de mesure de la performance pour les dons d’organes et les transplantations (DOT), exécuté conjointement par l’ICIS et Inforoute Santé du Canada. \n     \n     Quelles seront vos responsabilités ?\n     1. Diriger des activités analytiques, notamment la planification, l’analyse de données, la consignation, la recherche et l’élaboration de propositions, ainsi que la vérification dans le cadre de l’élaboration de produits analytiques tels que le rapport des statistiques annuelles du RCITO.\n     \n     2. Réaliser la transition du code SAS vers Python et R en veillant à la qualité et à l’exactitude des produits sous sa responsabilité.\n     \n     3. Diriger et mener à bien toutes les phases du traitement des données, notamment la production et la mise à jour des documents pertinents. Appuyer les processus liés au cycle de soumission des données, effectuer des vérifications périodiques de la qualité des données, et préparer des documents exhaustifs conformément au cadre de la qualité des données de l’ICIS.\n     \n     4. Appuyer les activités d’élaboration, d’amélioration et de mise à l’essai de l’application du RCITO, ce qui comprend la révision et la mise à jour de la documentation technique, ainsi que la réalisation d’évaluations, en collaboration avec le personnel de l’ICIS.\n     \n     5. Participer aux réunions du conseil d’administration du RCITO et aux groupes d’experts et offrir un soutien. Donner des présentations aux intervenants et groupes externes lors de réunions et de conférences.\n     \n     6. Répondre aux demandes d’information personnalisées des clients internes et externes. Pour ce faire, consulter les clients afin de déterminer leurs exigences en matière de données, élaborer des spécifications détaillées, concevoir des produits, préparer des estimations de coûts, consulter des ressources internes de l’ICIS, au besoin, et réaliser des activités d’assurance de la qualité.\n     \n     7. Évaluer toutes les demandes de données pour s’assurer qu’elles sont traitées en conformité avec les politiques de l’ICIS sur le respect de la vie privée et la confidentialité, et préparer les documents nécessaires à la demande.\n     \n     8. Encadrer les autres membres de l’équipe responsables des analyses et le personnel de la Division.\n     \n     9. Participer, au besoin, à certaines activités d’analyse pour le projet de système pancanadien de déclaration de données et de mesure de la performance pour les DOT, exécuté conjointement par l’ICIS et Inforoute Santé du Canada. \n     \n     Que mettriez-vous à profit ? \n     \n    Baccalauréat en épidémiologie, en biostatistique, en sciences de la santé, en politiques de la santé, en économie de la santé, en sciences sociales, en statistique ou dans un domaine connexe. Diplôme d’études supérieures, un atout.\n     \n    De 3 à 5 ans d’expérience de travail avec des bases de données relationnelles ou d’envergure contenant de l’information sur la santé (p. ex. soumission de données et soutien, manipulation, amélioration de la qualité, recherche et analyse).\n     \n    Connaissance des méthodes quantitatives.\n     \n    Expérience de la manipulation de données et de l’utilisation de logiciels statistiques, y compris SAS, Python et R.\n     \n    Expérience de l’utilisation des applications de Microsoft Office, y compris Excel, Word et PowerPoint.\n     \n    Entregent et excellentes aptitudes pour la communication verbale et écrite.\n     \n    Excellentes aptitudes pour la conceptualisation et la résolution de problèmes.\n     \n    Capacité manifeste à travailler au sein d’une équipe de façon autonome et avec un minimum de supervision.\n     \n    Excellentes aptitudes pour l’organisation et la gestion du temps, et capacité manifeste à gérer efficacement plusieurs tâches, activités et priorités en fonction des échéances.\n     \n    Connaissance des bases de données de l’ICIS (p. ex. RCITO, BDCP, SNISA), un atout.\n     \n    Capacité à répondre aux exigences de déplacement au besoin.\n     \n    Maîtrise de l’anglais essentielle; maîtrise du français, un atout. \n     \n     Declaration\n     \n    Pour en savoir plus sur cette offre ou sur d'autres excellentes possibilités, visitez-nous au www.icis.ca et parcourez notre section Carrières.\n     Nous remercions tous les participants, mais nous ne communiquerons qu'avec les candidats retenus.\n     L’utilisation dans le présent document de la forme masculine ou féminine, selon le contexte, a pour seul but d’alléger le texte.\n     \n     \n     Équité en emploi\n     \n    L'ICIS s'engage à offrir un milieu de travail inclusif, sans obstacle et accessible. Il s'engage entre autres à prendre les mesures d'adaptation nécessaires en vue de favoriser une participation équitable aux processus de recrutement et de sélection. Par conséquent, si vous avez des besoins spéciaux, nous nous efforcerons d'y répondre.\n     \n     \n     \n   \n  \n   \n   \n  \n  \n   \n    Skills\n   \n    \n  \n   \n   \n  \n  \n   \n    Reference\n    \n   \n    255264"
}