{
    "id": "a6498f4f5adc8180",
    "companyDescription": "We want to help you do what you do best. At CBI Health, our extensive national network is here to help you increase your local impact. By joining our care team, you’ll receive the independence and experienced support structure you need to provide life-changing care for your clients and their families. And while you do that, our team of over 13,000 healthcare professionals has your back!\r\n\r\nFor millions of Canadians, CBI Health is where better begins. We are Canada’s leading community healthcare provider, reliably delivering innovative Rehabilitation and Home Health care programs that help our clients achieve their health goals. With 250+ locations in more than 800 communities, people are at the heart of what we do. Every day, all across the country, our team members work together to make a meaningful difference in our clients’ lives and help shape healthcare for the better. \r\nLearn more about CBI Health.\r\n\r\nCompany Mission/Culture\r\nPeople are at the heart of what we do. Together, we serve local clients and communities by delivering nationally supported Rehabilitation and Home Health services. We also serve every member of our team by helping them achieve their health career goals through meaningful work and impactful outcomes.\r\n\r\nOur Purpose, Promise, and Values are what inform and guide this mission. These essential elements are at the heart of the decisions we make, the programs we implement, and the strategies we develop. Across the country, the CBI Health team is committed to delivering on Our Purpose, keeping Our Promise, and living Our Values in every community we serve.\r\n\r\nOur Purpose: The health and well-being of Canadians is at the heart of what we do. Every day, we make a meaningful difference in people’s lives by supporting them in achieving their goals. Together, we shape healthcare for the better. \r\n\r\nOur Promise: For our clients, we promise to always:  \r\nTreat you with dignity, respect and kindness \r\nUnderstand you, your goals and what matters most \r\nEngage, motivate, and inspire you on your health journey \r\nBring together our knowledge, expertise and experience to deliver the best care \r\nEarn and appreciate the trust you place in us \r\n\r\nOur Values:\r\nHeart – We are passionate about making a positive difference \r\nRespect – We accept and value everyone \r\nReliability – We do what we say we will do \r\nTeamwork – We work well together and support each other \r\nInnovation – We are committed to learning, improving and growing.\r\n \r\nLearn more about the CBI Health culture.\r\n\r\nDiversity Programs and Initiatives: CBI Health continually strives to be an inclusive organization and create a respectful work environment where everyone feels included and valued. Diversity in our workplace allows us to share and implement different perspectives, which we believe inevitably leads to better internal and external outcomes. Accepting and valuing everyone, part of Our Values, ensures that the CBI Health culture is strong, enhances the well-being of all team members, and allows us to effectively work together to fulfill Our Purpose: shaping healthcare for the better. \r\n\r\nOur employee-led Diversity, Equity and Inclusion (DEI) Committee is now in its third year running and continues to make great progress in developing meaningful initiatives to help team members feel safe and accepted as their authentic selves. Creating impactful new DEI initiatives and enhancing existing initiatives will remain a CBI Health priority moving forward.\r\n\r\nAwards: CBI Health is proud to be a national leader in the field of community healthcare. We are regularly recognized for our exemplary Rehabilitation and Home Health expertise, as well as our commitment to industry-recognized organizational best practices. ",
    "description": "Meet our New Team! The Ottawa location is under NEW MANAGEMENT! \n  Number of Positions: 6 \n  Work Assignment: Community Visit Nurse (RN/ RPN) \n  Status: Full Time, Part Time & Casual \n  Schedule: Flexible day shift scheduling between 07:00 to 17:00, Evening Shift 15:00 to 23:00, Swing Shift 12:00 to 20:00 \n  Ask about our Sign-On Bonus for Full Time* \n  Here’s a look at our total rewards: \n  \n  Competitive compensation package and benefits \n  Shift & Weekend premiums \n  Transportation/ Mileage allowance \n  Paid orientation and training time \n  Group benefit plan, including Employee Assistance program \n  Mobile technology and training provided \n  Flexible scheduling for a great work-life balance \n  Supportive supervisory and management team who listen and support you \n  Safety-first work culture a top priority \n  Opportunities to grow your career within CBI Health’s national network \n  CBI Health is an approved employer in the Community Commitment Program for Nurses (CCPN) through Health Force Ontario. Eligible nurses can earn a $25,000 incentive! \n  \n Every day will be different! As a Community Visit Nurse (RN/ RPN), you will make a difference in the lives of people within their homes, clinics and other community locations. You will be able to apply your clinical skills in areas such as wound care, IV therapy, tube feeding and medication administration, palliative care, paediatric care as well as health teaching. Your person and family centered approach to care will guide your decision making and facilitate collaborative care with each member of the interdisciplinary team. Your managers and peers are easily accessible to you to provide mentorship and support for ongoing development and clinical excellence. Your critical role of home health care supports the larger health system, and you will demonstrate confidence in navigating clients and families to other resources to help them meet their goals. \n  What you will need to be successful: \n  \n  Registered with the College of Nurses of Ontario in good standing \n  A clear criminal record check with vulnerable sector screening \n  Proof of negative TB test and professional liability insurance \n  Ability to work independently and within a team \n  Strong critical thinking skills \n  Strong verbal and written English communication skills, bilingual in French an asset \n  Ability to travel within the community - a valid driver's license and vehicle insurance are required \n  \n Grow your career with us! \n  When you join our team as a Registered Nurse/ Registered Practical Nurse (RN/ RPN), you will belong to one of Canada’s leaders in the healthcare industry, with 250 locations across the country. As one of the largest healthcare networks in Canada, we are proud to be named one of Canada’s Best Managed Companies, Platinum Member and Canada’s 10 Most Admired Company Cultures. \n  Join us at CBI Health – Because Your Care Matters \n  CBI Health is committed to providing a diverse, equitable, and inclusive workplace where everyone feels safe and accepted as their authentic selves. We actively seek qualified candidates who share our commitment to equity and inclusion and contribute to the diversification of ideas and perspectives that help us innovate and provide the best possible care to our clients. \n We are committed to fostering a positive experience for all Indigenous applicants whether you’re First Nations (status or non-status), Inuit or Metis and welcome applications from all individuals regardless of race, colour, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or any other characteristics that make each of us different. \n In accordance with the Ontario Human Rights Code, Accessibility for Ontarians with Disabilities Act and CBI Policies on Accommodation, a request for accommodation will be accepted as part of our hiring process. Please inform your recruiter if you have any accommodation requests. \n \n  Ask Interviewer about eligibility\n  \n  #HHEAST",
    "preprocessed_description": "Meet our New Team! The Ottawa location is under NEW MANAGEMENT! Number of Positions: 6 Work Assignment: Community Visit Nurse (RN/ RPN) Status: Full Time, Part Time & Casual Schedule: Flexible day shift scheduling between 07:00 to 17:00, Evening Shift 15:00 to 23:00, Swing Shift 12:00 to 20:00 Ask about our Sign-On Bonus for Full Time Here's a look at our total rewards: Competitive compensation package and benefits Shift & Weekend premiums Transportation/ Mileage allowance Paid orientation and training time Group benefit plan, including Employee Assistance program Mobile technology and training provided Flexible scheduling for a great work-life balance Supportive supervisory and management team who listen and support you Safety-first work culture a top priority Opportunities to grow your career within CBI Health's national network CBI Health is an approved employer in the Community Commitment Program for Nurses (CCPN) through Health Force Ontario. Eligible nurses can earn a $25,000 incentive! Every day will be different! As a Community Visit Nurse (RN/ RPN), you will make a difference in the lives of people within their homes, clinics and other community locations. You will be able to apply your clinical skills in areas such as wound care, IV therapy, tube feeding and medication administration, palliative care, paediatric care as well as health teaching. Your person and family centered approach to care will guide your decision making and facilitate collaborative care with each member of the interdisciplinary team. Your managers and peers are easily accessible to you to provide mentorship and support for ongoing development and clinical excellence. Your critical role of home health care supports the larger health system, and you will demonstrate confidence in navigating clients and families to other resources to help them meet their goals. What you will need to be successful: Registered with the College of Nurses of Ontario in good standing A clear criminal record check with vulnerable sector screening Proof of negative TB test and professional liability insurance Ability to work independently and within a team Strong critical thinking skills Strong verbal and written English communication skills, bilingual in French an asset Ability to travel within the community - a valid driver's license and vehicle insurance are required Grow your career with us! When you join our team as a Registered Nurse/ Registered Practical Nurse (RN/ RPN), you will belong to one of Canada's leaders in the healthcare industry, with 250 locations across the country. As one of the largest healthcare networks in Canada, we are proud to be named one of Canada's Best Managed Companies, Platinum Member and Canada's 10 Most Admired Company Cultures. Join us at CBI Health – Because Your Care Matters CBI Health is committed to providing a diverse, equitable, and inclusive workplace where everyone feels safe and accepted as their authentic selves. We actively seek qualified candidates who share our commitment to equity and inclusion and contribute to the diversification of ideas and perspectives that help us innovate and provide the best possible care to our clients. We are committed to fostering a positive experience for all Indigenous applicants whether you are First Nations (status or non-status), Inuit or Metis and welcome applications from all individuals regardless of race, colour, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or any other characteristics that make each of us different. In accordance with the Ontario Human Rights Code, Accessibility for Ontarians with Disabilities Act and CBI Policies on Accommodation, a request for accommodation will be accepted as part of our hiring process. Please inform your recruiter if you have any accommodation requests. Ask Interviewer about eligibility #HHEAST",
    "processed_description": "meet Team location management number Positions Assignment Community Visit Nurse RN RPN status casual schedule flexible shift scheduling Evening shift Swing shift sign bonus total reward competitive compensation package benefit Shift Weekend premium transportation mileage allowance paid orientation training benefit plan include Employee Assistance program Mobile technology training provide flexible scheduling great life balance supportive supervisory management team listen support Safety culture priority grow career approve employer CCPN . eligible nurse earn incentive Community Visit Nurse difference life people clinic community location . apply clinical skill area wound care IV therapy tube feeding medication administration palliative care paediatric care health teaching . person family center approach care guide decision making facilitate collaborative care interdisciplinary team . manager peer easily accessible provide mentorship support ongoing development clinical excellence . critical role health care support large health system demonstrate confidence navigate client family resource help meet goal . successful register good standing clear criminal record check vulnerable sector screen Proof negative tb test professional liability insurance independently team strong critical thinking skill strong verbal write english communication skill asset travel community valid driver's license vehicle insurance require grow career join team belong Canada's leader healthcare industry location country . large healthcare network Platinum Canada's admired Company Cultures . join – commit provide diverse equitable inclusive workplace feel safe accept authentic . actively seek qualified share commitment equity inclusion contribute diversification idea perspective help innovate provide good care client . committed foster positive indigenous applicant status status application individual race colour religion gender gender identity expression sexual orientation national origin genetic age veteran status characteristic . Accessibility Ontarians Disabilities request accommodation accept hiring process . inform recruiter accommodation request . Interviewer eligibility",
    "results_group": {
        "extracted_noun_chunks": [
            "flexible scheduling great life balance supportive supervisory management team",
            "diverse equitable inclusive workplace",
            "diversification idea perspective help",
            "client family resource help",
            "support Safety culture priority",
            "grow career",
            "strong verbal write english communication skill asset travel community valid driver's license vehicle insurance",
            "critical role health care support",
            "Accessibility Ontarians Disabilities",
            "eligible nurse",
            "strong critical thinking skill",
            "foster positive indigenous applicant status status application individual race colour religion gender gender identity expression",
            "professional liability insurance",
            "confidence",
            "bonus total reward",
            "ongoing development clinical excellence",
            "collaborative care interdisciplinary team",
            "incentive Community Visit Nurse difference life people clinic community location",
            "large health system",
            "good care client",
            "goal",
            "sexual orientation national origin",
            "Interviewer eligibility",
            "person family center approach care guide decision making",
            "good standing clear criminal record check vulnerable sector screen",
            "large healthcare network Platinum Canada's admired Company Cultures",
            "Canada's leader healthcare industry location country",
            "recruiter accommodation request",
            "grow career join team",
            "qualified share commitment equity inclusion",
            "Proof negative tb",
            "employer CCPN",
            "mentorship support",
            "Employee Assistance program Mobile technology training",
            "manager",
            "clinical skill area wound care IV therapy tube feeding medication administration palliative care paediatric care health teaching",
            "orientation training benefit plan",
            "hiring process"
        ],
        "combined_lemmatized_tokens": "meet Team location management number Positions Assignment Community Visit Nurse RN RPN status casual schedule flexible shift scheduling Evening shift Swing shift sign bonus total reward competitive compensation package benefit Shift Weekend premium transportation mileage allowance paid orientation training benefit plan include Employee Assistance program Mobile technology training provide flexible scheduling great life balance supportive supervisory management team listen support Safety culture priority grow career approve employer CCPN . eligible nurse earn incentive Community Visit Nurse difference life people clinic community location . apply clinical skill area wound care IV therapy tube feeding medication administration palliative care paediatric care health teaching . person family center approach care guide decision making facilitate collaborative care interdisciplinary team . manager peer easily accessible provide mentorship support ongoing development clinical excellence . critical role health care support large health system demonstrate confidence navigate client family resource help meet goal . successful register good standing clear criminal record check vulnerable sector screen Proof negative tb test professional liability insurance independently team strong critical thinking skill strong verbal write english communication skill asset travel community valid driver's license vehicle insurance require grow career join team belong Canada's leader healthcare industry location country . large healthcare network Platinum Canada's admired Company Cultures . join – commit provide diverse equitable inclusive workplace feel safe accept authentic . actively seek qualified share commitment equity inclusion contribute diversification idea perspective help innovate provide good care client . committed foster positive indigenous applicant status status application individual race colour religion gender gender identity expression sexual orientation national origin genetic age veteran status characteristic . Accessibility Ontarians Disabilities request accommodation accept hiring process . inform recruiter accommodation request . Interviewer eligibility"
    }
}