{
    "id": "3180e92c8bf468c6",
    "companyDescription": "",
    "description": "Job Type:\n  Employee\n \n \n   Duration in Months (for fixed-term jobs):\n  24\n \n \n   Job Family:\n  Environmental Health and Safety\n \n \n   # of Open Positions:\n  1\n \n \n   Faculty/Service - Department:\n  Health, Safety & Risk Management\n \n \n   Campus:\n  Roger Guindon Hall\n \n \n   Union Affiliation:\n  SSUO\n \n \n   Date Posted:\n  janvier 04, 2024\n \n \n   Closing Date:\n  janvier 15, 2024\n \n   Note: Applications will be accepted until 11:59 PM on the day prior to the Posting End Date above\n \n \n \n   Hours per week:\n  35\n \n \n   Salary Grade:\n  SSUO Grade 09\n \n \n   Salary Range:\n  $67,783.00 - $85,623.00\n  About the Faculty of Medicine\n  Welcome to the University of Ottawa Faculty of Medicine, the first and largest bilingual medical faculty in Canada. Our learners have access to state-of-the art facilities and specialized institutions as they learn alongside world-class physicians and scientists. Consistently ranked among the top 10 medical schools in Canada, our faculty is among the top faculties of medicine in the world for research impact in biomedical and health sciences.\n \n \n   Position purpose:\n \n \n   The incumbent manages administrative operational activities relating to the Faculty Environmental Health and Safety Risk Management System (EHSRMS) to ensure the safety of the environment and the health and safety of all persons working and studying at the Faculty of Medicine. Specific operational activities include planning and executing workplace inspections to identify health and safety issues, hazards and trends, and verifying compliance with federal, provincial and municipal acts & regulations, and uOttawa policies and guidelines. Communicates infractions to the responsible party and tracks future compliance.\n \n \n \n   In this role, your responsibilities will include:\n \n \n   Project Coordination : Plans, coordinates, conducts, and documents Workplace Health and Safety inspections for the Alta Vista Functional Occupational Health and Safety Committee (the Committee), ensuring a seamless coordination of this regulated inspection process with all involved parties. Identifies and communicates trends (good and bad) to influence health and safety messaging and training. Performs regular, frequent unannounced inspections as a means of identifying deficiencies in personnel performance and as well as the building’s infrastructure. Independently responds to action items by recommending safer working practices as well as by raising work orders, for example. Performs lower order risk assessments in support of the risk identification process at the faculty level.\n   Records Management: Utilizes multiple information management systems and software to maintain records/databases and compile reports identifying trends, areas of concern, and corrective measures to be implemented in order to improve health and safety of the community in accordance with University procedures. These systems include year-to-date Workplace Inspection performance, personnel training, chemical inventory, and chemical waste management, and our emergency management system. Keeps all pertinent information concerning changes in policy, hazard assessments, and the regulatory climate up-to-date. Formats documents and reports a necessary, many of which are technical in nature (symbols, formulae and graphics).\n   Waste Management: Counsels lab staff in the effective and safe management of hazardous waste by ensuring that practices comply with regulatory requirements and university procedures.\n   Access Card Management: Programs electronic building access cards for the Faculty to support onboarding of new staff and students, as well as contract extensions. If required, will support card processing demands for the Department of Anatomy and Animal Care & Veterinary Services (ACVS).\n   Program Support: Responsible for the Faculty’s Health and Safety website, including required updates and innovative design of new pages, as necessary, to enhance communications. Maintains Health and Safety bulletin boards, faculty first aid kits, and ensures emergency eyewash/safety shower stations are regularly inspected. Monitors the Health, Safety and Risk Management group email account and responds in a timely manner to correspondence by composing and sending letters and memos on behalf of the department. Produces letters related to more complex issues for review by the Manager, Environmental Health and Safety.\n   Community Engagement: Plans, facilitates, and participates in all aspects of workshops and events that harness a wide range of engagement techniques, such as “Take Your Kids to Work” day, Focus Santé, North American Occupational Safety and Health (NAOSH) week, Earth Day and Lunch & Learn sessions. Develops a strong rapport and relationships with stakeholders. Proactively works to build a positive image, increase reputation, prepares event schedules and makes all logistical arrangements such as catering, room bookings and parking. Manages the online registration process for workshops. Manages all workshop logistics, such as scheduling, room bookings and equipment reservations.\n \n \n \n   What you will bring:\n \n \n   Essential Qualifications\n \n \n   B.Sc. degree in Basic Science, Biology, Chemistry, or Engineering or other relevant discipline.\n   Minimum 3 years’ experience in a research lab environment or in a regulatory/consulting field emphasizing health, safety and environmental programs, or an equivalent combination of education and work experience.\n \n \n \n   Other Skills and Competencies\n \n \n   Knowledge of relevant federal, provincial, and municipal health and safety legislation, regulations and best practices.\n   Experience in interpretation of health and safety codes, standards, or legislation.\n   Experience in conducting inspections of environments typically found in a university setting.\n   Must be willing to immediately respond and participate as necessary to emergency incidents within the group’s remit (e.g., fire alarms, chemical spills).\n   Strong organizational skills and attention to detail in a fast-paced environment\n   Able to facilitate effective and diverse community consultations, programs, and initiatives.\n   Keen attention to discretion, confidentiality, and tact\n   Strong communication skills, including experience with web-design and creating content required to reach different stakeholder audiences.\n   Experience in database functions and tools (MS Access)\n   Bilingual, French and English, spoken and written\n \n \n \n   Key Competencies at uOttawa:\n   Here are the required competencies for all or our employees at uOttawa:\n   \n   Planning: Organize in time a series of actions or events in order to realize an objective or a project. Plan and organize own work and priorities in regular daily activities.\n   Initiative: Demonstrate creativity and initiative to suggest improvements and encourage positive results. Is proactive and self-starting. Show availability and willingness to go above and beyond whenever it is possible.\n   Client Service Orientation: Help or serve others to meet their needs. This implies anticipating and identifying the needs of internal and external clients and finding solutions on how to meet them.\n   Teamwork and Cooperation: Cooperate and work well with other members of the team to reach common goal(s). Accept and give constructive feedback. Able to adjust own behaviour to reach the goals of the team.\n   \n   The University of Ottawa embraces diversity and inclusion in the workplace. We are passionate about our people and committed to employment equity. We foster a culture of respect, teamwork and inclusion, where collaboration, innovation, and creativity fuel our quest for research and teaching excellence. While all qualified persons are invited to apply, we welcome applications from qualified Indigenous persons, racialized persons, persons with disabilities, women and LGBTQIA2S+ persons. The University is committed to creating and maintaining an accessible, barrier-free work environment. The University is also committed to working with applicants with disabilities requesting accommodation during the recruitment, assessment and selection processes. Applicants with disabilities may contact hrtalentmanagement@uottawa.ca to communicate the accommodation need. All qualified candidates are encouraged to apply; however, Canadians and permanent residents will be given priority.\n   \n   Note: if this is a union position: The hiring process will be governed by the current collective agreement related to the union affiliation noted above; you can click \n  \n   here\n   to find out more.\n   \n   \n  If this is a front-line position with responsibilities to interact with students, selected candidates must be rated at the Low Advanced proficiency level or higher for both oral comprehension and reading comprehension in their second official language. The rating is determined by a proficiency test designed by the Official Languages and Bilingualism Institute.\n \n \n \n   Prior to May 1, 2022, the University required all students, faculty, staff, and visitors (including contractors) to be fully vaccinated against Covid-19 as defined in Policy 129 – Covid-19 Vaccination. This policy was suspended effective May 1, 2022 but may be reinstated at any point in the future depending on public health guidelines and the recommendations of experts.",
    "preprocessed_description": "Job Type: Employee Duration in Months (for fixed-term jobs): 24 Job Family: Environmental Health and Safety # of Open Positions: 1 Faculty/Service - Department: Health, Safety & Risk Management Campus: Roger Guindon Hall Union Affiliation: SSUO Date Posted: janvier 04, 2024 Closing Date: janvier 15, 2024 Note: Applications will be accepted until 11:59 Project Manager on the day prior to the Posting End Date above Hours per week: 35 Salary Grade: SSUO Grade 09 Salary Range: $67,783.00 - $85,623.00 About the Faculty of Medicine Welcome to the University of Ottawa Faculty of Medicine, the first and largest bilingual medical faculty in Canada. Our learners have access to state-of-the art facilities and specialized institutions as they learn alongside world-class physicians and scientists. Consistently ranked among the top 10 medical schools in Canada, our faculty is among the top faculties of medicine in the world for research impact in biomedical and health sciences. Position purpose: The incumbent manages administrative operational activities relating to the Faculty Environmental Health and Safety Risk Management System (EHSRMS) to ensure the safety of the environment and the health and safety of all persons working and studying at the Faculty of Medicine. Specific operational activities include planning and executing workplace inspections to identify health and safety issues, hazards and trends, and verifying compliance with federal, provincial and municipal acts & regulations, and uOttawa policies and guidelines. Communicates infractions to the responsible party and tracks future compliance. In this role, your responsibilities will include: Project Coordination : Plans, coordinates, conducts, and documents Workplace Health and Safety inspections for the Alta Vista Functional Occupational Health and Safety Committee (the Committee), ensuring a seamless coordination of this regulated inspection process with all involved parties. Identifies and communicates trends (good and bad) to influence health and safety messaging and training. Performs regular, frequent unannounced inspections as a means of identifying deficiencies in personnel performance and as well as the building's infrastructure. Independently responds to action items by recommending safer working practices as well as by raising work orders, for example. Performs lower order risk assessments in support of the risk identification process at the faculty level. Records Management: Utilizes multiple information management systems and software to maintain records/databases and compile reports identifying trends, areas of concern, and corrective measures to be implemented in order to improve health and safety of the community in accordance with University procedures. These systems include year-to-date Workplace Inspection performance, personnel training, chemical inventory, and chemical waste management, and our emergency management system. Keeps all pertinent information concerning changes in policy, hazard assessments, and the regulatory climate up-to-date. Formats documents and reports a necessary, many of which are technical in nature (symbols, formulae and graphics). Waste Management: Counsels lab staff in the effective and safe management of hazardous waste by ensuring that practices comply with regulatory requirements and university procedures. Access Card Management: Programs electronic building access cards for the Faculty to support onboarding of new staff and students, as well as contract extensions. If required, will support card processing demands for the Department of Anatomy and Animal Care & Veterinary Services (ACVS). Program Support: Responsible for the Faculty's Health and Safety website, including required updates and innovative design of new pages, as necessary, to enhance communications. Maintains Health and Safety bulletin boards, faculty first aid kits, and ensures emergency eyewash/safety shower stations are regularly inspected. Monitors the Health, Safety and Risk Management group email account and responds in a timely manner to correspondence by composing and sending letters and memos on behalf of the department. Produces letters related to more complex issues for review by the Manager, Environmental Health and Safety. Community Engagement: Plans, facilitates, and participates in all aspects of workshops and events that harness a wide range of engagement techniques, such as \"Take Your Kids to Work\" day, Focus Santé, North American Occupational Safety and Health (NAOSH) week, Earth Day and Lunch & Learn sessions. Develops a strong rapport and relationships with stakeholders. Proactively works to build a positive image, increase reputation, prepares event schedules and makes all logistical arrangements such as catering, room bookings and parking. Manages the online registration process for workshops. Manages all workshop logistics, such as scheduling, room bookings and equipment reservations. What you will bring: Essential Qualifications B.Sc. degree in Basic Science, Biology, Chemistry, or Engineering or other relevant discipline. Minimum 3 years' experience in a research lab environment or in a regulatory/consulting field emphasizing health, safety and environmental programs, or an equivalent combination of education and work experience. Other Skills and Competencies Knowledge of relevant federal, provincial, and municipal health and safety legislation, regulations and best practices. Experience in interpretation of health and safety codes, standards, or legislation. Experience in conducting inspections of environments typically found in a university setting. Must be willing to immediately respond and participate as necessary to emergency incidents within the group's remit (e.g., fire alarms, chemical spills). Strong organizational skills and attention to detail in a fast-paced environment Able to facilitate effective and diverse community consultations, programs, and initiatives. Keen attention to discretion, confidentiality, and tact Strong communication skills, including experience with web-design and creating content required to reach different stakeholder audiences. Experience in database functions and tools (MS Access) Bilingual, French and English, spoken and written Key Competencies at uOttawa: Here are the required competencies for all or our employees at uOttawa: Planning: Organize in time a series of actions or events in order to realize an objective or a project. Plan and organize own work and priorities in regular daily activities. Initiative: Demonstrate creativity and initiative to suggest improvements and encourage positive results. Is proactive and self-starting. Show availability and willingness to go above and beyond whenever it is possible. Client Service Orientation: Help or serve others to meet their needs. This implies anticipating and identifying the needs of internal and external clients and finding solutions on how to meet them. Teamwork and Cooperation: Cooperate and work well with other members of the team to reach common goal(s). Accept and give constructive feedback. Able to adjust own behaviour to reach the goals of the team. The University of Ottawa embraces diversity and inclusion in the workplace. We are passionate about our people and committed to employment equity. We foster a culture of respect, teamwork and inclusion, where collaboration, innovation, and creativity fuel our quest for research and teaching excellence. While all qualified persons are invited to apply, we welcome applications from qualified Indigenous persons, racialized persons, persons with disabilities, women and LGBTQIA2S+ persons. The University is committed to creating and maintaining an accessible, barrier-free work environment. The University is also committed to working with applicants with disabilities requesting accommodation during the recruitment, assessment and selection processes. Applicants with disabilities may contact hrtalentmanagement@uottawa.ca to communicate the accommodation need. All qualified candidates are encouraged to apply; however, Canadians and permanent residents will be given priority. Note: if this is a union position: The hiring process will be governed by the current collective agreement related to the union affiliation noted above; you can click here to find out more. If this is a front-line position with responsibilities to interact with students, selected candidates must be rated at the Low Advanced proficiency level or higher for both oral comprehension and reading comprehension in their second official language. The rating is determined by a proficiency test designed by the Official Languages and Bilingualism Institute. Prior to May 1, 2022, the University required all students, faculty, staff, and visitors (including contractors) to be fully vaccinated against Covid-19 as defined in Policy 129 – Covid-19 Vaccination. This policy was suspended effective May 1, 2022 but may be reinstated at any point in the future depending on public health guidelines and the recommendations of experts.",
    "processed_description": "type employee duration term Family Environmental Health Safety Open position Roger Guindon Hall Union Affiliation SSUO post janvier closing janvier note application accept Project Manager week Salary grade SSUO Grade Salary range large medical faculty . learner access state art facility specialized institution learn alongside class physician scientist . consistently rank medical school faculty faculty medicine research impact biomedical health science . position purpose incumbent manage administrative operational activity relate ensure safety environment health safety person study . specific operational activity include plan execute workplace inspection identify health safety issue hazard trend verify compliance federal provincial municipal regulation uOttawa policy guideline . communicate infraction responsible party track future compliance . role responsibility include coordinate conduct document Workplace Health Safety inspection ensure seamless coordination regulated inspection process involved party . identifie communicate trend good bad influence health safety messaging training . perform regular frequent unannounced inspection identify deficiency personnel performance building's infrastructure . independently respond action item recommend safe working practice raise order example . perform low order risk assessment support risk identification process faculty level . utilize multiple information management system software maintain record database compile report identify trend area concern corrective measure implement order improve health safety community University procedure . system include Workplace Inspection performance personnel training chemical inventory chemical waste management emergency management system . pertinent information concern change policy hazard assessment regulatory climate . format document report technical nature symbol formulae graphic . waste Management counsel lab staff effective safe management hazardous waste ensure practice comply regulatory requirement university procedure . electronic building access card support onboarding staff student contract extension . require support card processing demand ACVS . program Support responsible Faculty's Health Safety website include require update innovative design enhance communication . maintain Health Safety bulletin board faculty aid kit ensure emergency eyewash safety shower station regularly inspect . monitor Health Safety Risk Management group email account respond timely manner correspondence compose send letter memo behalf department . produce letter relate complex issue review Manager . Community Engagement plan facilitate participate aspect workshop event harness wide range engagement technique NAOSH week Earth session . develop strong rapport relationship stakeholder . proactively build positive image increase reputation prepare event schedule logistical arrangement catering room booking parking . manage online registration process workshop . manage workshop logistic scheduling room booking equipment reservation . bring Essential Qualifications B.Sc . degree Engineering relevant discipline . minimum year' research lab environment regulatory consulting field emphasize health safety environmental program equivalent combination education . Skills Competencies Knowledge relevant federal provincial municipal health safety legislation regulation good practice . interpretation health safety code standard legislation . conduct inspection environment typically find university setting . respond participate emergency incident group's remit e.g. fire alarm chemical spill . strong organizational skill attention detail fast pace environment facilitate effective diverse community consultation program initiative . Keen attention discretion confidentiality tact strong communication skill include web design create content require reach stakeholder audience . database function tool speak write require competency employee planning organize series action event order realize objective project . plan organize priority regular daily activity . initiative demonstrate creativity initiative improvement encourage positive result . proactive starting . availability willingness . Client Service Orientation help serve meet . imply anticipate identify internal external client find solution meet . teamwork Cooperation cooperate team reach common goal . accept constructive feedback . adjust behaviour reach goal team . embrace diversity inclusion workplace . passionate people commit employment equity . foster culture respect teamwork inclusion collaboration innovation creativity fuel quest research teaching excellence . qualified person invite apply application qualified indigenous person racialize person person woman lgbtqia2s+ person . commit create maintain accessible barrier free environment . committed applicant request accommodation recruitment assessment selection process . applicant contact communicate accommodation . qualified encourage apply permanent resident priority . note union position hiring process govern current collective agreement relate union affiliation note click find . position responsibility interact student select rate low advanced proficiency level high oral comprehension reading comprehension second official language . rating determine proficiency test design . prior require student faculty staff visitor include contractor fully vaccinate Covid define Policy – Covid Vaccination . policy suspend effective reinstate point future depend public health guideline recommendation expert .",
    "results_group": {
        "extracted_noun_chunks": [
            "pertinent information concern",
            "medical school faculty faculty medicine research impact biomedical health science",
            "accessible barrier free environment",
            "creativity initiative improvement",
            "passionate people",
            "plan",
            "degree",
            "identifie",
            "contractor",
            "safe management hazardous waste",
            "goal team",
            "effective diverse community consultation program initiative",
            "Keen attention discretion confidentiality tact strong communication skill",
            "foster culture respect teamwork inclusion collaboration innovation creativity fuel quest research teaching excellence",
            "safe working practice",
            "Covid Vaccination",
            "seamless coordination regulated inspection process",
            "minimum year' research lab environment regulatory consulting field",
            "trend area concern",
            "union affiliation note click find",
            "support card processing demand",
            "fire alarm chemical spill",
            "type employee duration term Family Environmental Health Safety Open position",
            "internal external client",
            "database function tool",
            "accommodation",
            "priority regular daily activity",
            "event schedule logistical arrangement catering room booking parking",
            "current collective agreement",
            "proficiency test design",
            "specific operational activity",
            "write",
            "technical nature symbol formulae graphic",
            "Management counsel lab staff",
            "Covid",
            "content",
            "format document report",
            "initiative",
            "administrative operational activity",
            "Health Safety bulletin board faculty aid kit",
            "Project Manager week Salary grade",
            "workshop logistic scheduling room booking equipment reservation",
            "corrective measure",
            "series action event order",
            "effective reinstate point future",
            "health safety environmental program equivalent combination education",
            "electronic building access card support onboarding staff student contract extension",
            "timely manner correspondence",
            "health safety issue hazard trend",
            "competency employee planning",
            "janvier closing janvier",
            "Engineering relevant discipline",
            "wide range engagement technique",
            "solution",
            "policy hazard assessment regulatory climate",
            "record database compile report",
            "policy",
            "workplace inspection",
            "online registration process workshop",
            "diversity inclusion workplace",
            "conduct inspection environment",
            "update innovative design enhance communication",
            "university setting",
            "union position hiring process",
            "availability willingness",
            "learner access state art facility specialized institution",
            "public health guideline recommendation expert",
            "teamwork Cooperation cooperate team",
            "stakeholder audience",
            "low order risk assessment support risk identification process faculty level",
            "SSUO Grade Salary",
            "system",
            "letter memo behalf department",
            "rating",
            "practice",
            "Client Service Orientation help",
            "action item",
            "Skills Competencies Knowledge relevant federal provincial municipal health safety legislation regulation good practice",
            "role responsibility",
            "produce letter",
            "participate aspect workshop event",
            "strong organizational skill attention detail fast pace environment",
            "permanent resident priority",
            "common goal",
            "Faculty's Health Safety website",
            "health safety code standard legislation",
            "application",
            "complex issue review Manager",
            "positive image increase reputation",
            "applicant contact",
            "deficiency personnel performance building's infrastructure",
            "positive result",
            "participate emergency incident group's remit",
            "qualified encourage",
            "Health Safety Risk Management group email account",
            "application qualified indigenous person racialize person person woman",
            "interpretation",
            "Policy",
            "order",
            "safety environment health safety person study",
            "order example",
            "Community Engagement plan",
            "regulatory requirement university procedure",
            "trend good bad influence health safety messaging training",
            "objective project",
            "coordinate conduct document Workplace Health Safety inspection",
            "proactive starting",
            "student select rate low advanced proficiency level high oral comprehension reading comprehension second official language",
            "constructive feedback",
            "compliance federal provincial municipal regulation uOttawa policy guideline",
            "applicant request accommodation recruitment assessment selection process",
            "behaviour",
            "student faculty staff visitor",
            "Roger Guindon Hall Union Affiliation SSUO post",
            "class physician scientist",
            "qualified person",
            "employment equity",
            "position responsibility",
            "multiple information management system software",
            "Essential Qualifications B.Sc .",
            "large medical faculty",
            "party",
            "infraction responsible party track future compliance",
            "Workplace Inspection performance personnel training chemical inventory chemical waste management emergency management system",
            "emergency eyewash safety shower station",
            "position purpose incumbent",
            "waste",
            "health safety community University procedure",
            "strong rapport relationship stakeholder"
        ],
        "combined_lemmatized_tokens": "type employee duration term Family Environmental Health Safety Open position Roger Guindon Hall Union Affiliation SSUO post janvier closing janvier note application accept Project Manager week Salary grade SSUO Grade Salary range large medical faculty . learner access state art facility specialized institution learn alongside class physician scientist . consistently rank medical school faculty faculty medicine research impact biomedical health science . position purpose incumbent manage administrative operational activity relate ensure safety environment health safety person study . specific operational activity include plan execute workplace inspection identify health safety issue hazard trend verify compliance federal provincial municipal regulation uOttawa policy guideline . communicate infraction responsible party track future compliance . role responsibility include coordinate conduct document Workplace Health Safety inspection ensure seamless coordination regulated inspection process involved party . identifie communicate trend good bad influence health safety messaging training . perform regular frequent unannounced inspection identify deficiency personnel performance building's infrastructure . independently respond action item recommend safe working practice raise order example . perform low order risk assessment support risk identification process faculty level . utilize multiple information management system software maintain record database compile report identify trend area concern corrective measure implement order improve health safety community University procedure . system include Workplace Inspection performance personnel training chemical inventory chemical waste management emergency management system . pertinent information concern change policy hazard assessment regulatory climate . format document report technical nature symbol formulae graphic . waste Management counsel lab staff effective safe management hazardous waste ensure practice comply regulatory requirement university procedure . electronic building access card support onboarding staff student contract extension . require support card processing demand ACVS . program Support responsible Faculty's Health Safety website include require update innovative design enhance communication . maintain Health Safety bulletin board faculty aid kit ensure emergency eyewash safety shower station regularly inspect . monitor Health Safety Risk Management group email account respond timely manner correspondence compose send letter memo behalf department . produce letter relate complex issue review Manager . Community Engagement plan facilitate participate aspect workshop event harness wide range engagement technique NAOSH week Earth session . develop strong rapport relationship stakeholder . proactively build positive image increase reputation prepare event schedule logistical arrangement catering room booking parking . manage online registration process workshop . manage workshop logistic scheduling room booking equipment reservation . bring Essential Qualifications B.Sc . degree Engineering relevant discipline . minimum year' research lab environment regulatory consulting field emphasize health safety environmental program equivalent combination education . Skills Competencies Knowledge relevant federal provincial municipal health safety legislation regulation good practice . interpretation health safety code standard legislation . conduct inspection environment typically find university setting . respond participate emergency incident group's remit e.g. fire alarm chemical spill . strong organizational skill attention detail fast pace environment facilitate effective diverse community consultation program initiative . Keen attention discretion confidentiality tact strong communication skill include web design create content require reach stakeholder audience . database function tool speak write require competency employee planning organize series action event order realize objective project . plan organize priority regular daily activity . initiative demonstrate creativity initiative improvement encourage positive result . proactive starting . availability willingness . Client Service Orientation help serve meet . imply anticipate identify internal external client find solution meet . teamwork Cooperation cooperate team reach common goal . accept constructive feedback . adjust behaviour reach goal team . embrace diversity inclusion workplace . passionate people commit employment equity . foster culture respect teamwork inclusion collaboration innovation creativity fuel quest research teaching excellence . qualified person invite apply application qualified indigenous person racialize person person woman lgbtqia2s+ person . commit create maintain accessible barrier free environment . committed applicant request accommodation recruitment assessment selection process . applicant contact communicate accommodation . qualified encourage apply permanent resident priority . note union position hiring process govern current collective agreement relate union affiliation note click find . position responsibility interact student select rate low advanced proficiency level high oral comprehension reading comprehension second official language . rating determine proficiency test design . prior require student faculty staff visitor include contractor fully vaccinate Covid define Policy – Covid Vaccination . policy suspend effective reinstate point future depend public health guideline recommendation expert ."
    }
}