{
    "id": "3403598327e96e3b",
    "companyDescription": "McKesson Corporation is a diversified healthcare services leader dedicated to advancing health outcomes for patients everywhere. Our teams partner with biopharma companies, care providers, pharmacies, manufacturers, governments, and others to deliver insights, products and services to help make quality care more accessible and affordable. Learn more about how McKesson is impacting virtually every aspect of healthcare at McKesson.com.",
    "description": "McKesson is an impact-driven, Fortune 10 company that touches virtually every aspect of healthcare. We are known for delivering insights, products, and services that make quality care more accessible and affordable. Here, we focus on the health, happiness, and well-being of you and those we serve – we care. What you do at McKesson matters. We foster a culture where you can grow, make an impact, and are empowered to bring new ideas. Together, we thrive as we shape the future of health for patients, our communities, and our people. If you want to be part of tomorrow’s health today, we want to hear from you.\n \n  McKesson requires new employees to be fully vaccinated for COVID-19 as defined by Health Canada, subject to applicable, verified accommodation requests.\n \n  McKesson is in the business of better health and we touch the lives of patients in virtually every aspect of healthcare. At McKesson Canada, we touch the lives of 12 million Canadians every day. We carry more than 35,000 products in 12 distribution centers and ultimately provide distribution to 6,300 retail pharmacies, 1,350 hospitals, long-term care centers, clinics and institutions all over Canada. But we're so much more than a distribution company. We've automated 2,500 retail pharmacies and dispense over 100 million doses a year through our automation solutions. Manufacturers, healthcare providers and patients count on us for a full range of services that contribute to the quality and safety of care for us all.\n \n  At McKesson Canada, you’ll help us carry out our mission to improve lives and advance healthcare. Working here is your opportunity to shape an industry that’s vital to us all.\n \n  Job Summary\n  Position is responsible for providing professional nursing care to individuals including the intravenous or injection administration of biologics or other specialty pharmaceutical products and promotes patient health by completing health reviews prior to treatment, reviews patient files and collaborates with physicians and multidisciplinary team members as required, with the end goal of providing medical therapies or self- administration teaching to patients in an ambulatory setting.\n \n  The nurse uses critical thinking, therapeutic communication and clinical decision making skills to assess, plan, implement, educate and evaluate the patients’ health situation throughout their treatment therapy.\n \n  Clinic Hours: Sun/Mon/Fri/Sat 8:00am - 4:00pm, Tues/Wed/Thurs 8:00am - 8:00pm\n  Address: 595 Montreal Rd., Ottawa, ON\n \n  Specific Responsibilities\n \n   Assessing the health status of patients using a pre-screening process that covers contraindications, objective and subjective data, to determine eligibility in receiving medical therapies.\n   Insertion of peripheral intravenous or establishing access via central lines using sterile technique and best practices from the standards and practices of the college.\n   Studying patient files and prior post-administration records to understand patient’s history.\n   Handling and reconstituting biologic or oncology medication as per manufacturer and Heath Canada guidelines.\n   Following provincial College of Nurses standards and guidelines on medication administration.\n   Identifying patient care requirements; educating and providing counseling.\n   Promoting patient independence; answering questions and teaching patients to understand their condition and medication.\n   Documenting patient care services and managing records in accordance with INVIVA policies.\n   Following INVIVA and nursing philosophies and standards of care.\n   Following patient specific medical directives for administration and treatment of adverse events.\n   Reporting adverse events in accordance with manufacturer specific requirements, Health Canada and INVIVA policy.\n   Providing medical therapy monitoring and post administration observation and assessment.\n   Maintaining knowledge of medical therapies as per Health Canada’s Product Monograph.\n   Maintaining knowledge of INVIVA policies and procedures.\n   Participating with drug and clinic audits upon request.\n   Following drug accountability requirements as per INVIVA policy and standard operating procedure.\n   Actively participates in training and mentoring of new clinic staff.\n   Completing training as required by INVIVA on: products and services, policies, technology, quality assurance and communications.\n   Maintaining quality, safety and infection control standards to ensure safe nursing practice\n \n \n  General Responsibilities\n \n   Maintaining continuity among nursing teams by documenting and communicating actions, irregularities, and continuing needs.\n   Establishing a compassionate environment and supporting patients.\n   Maintaining and protecting patient confidentiality.\n   Maintaining safe and clean working environment by complying with procedures, rules, and regulations.\n   Ensuring proper operation of equipment by completing preventive maintenance requirements.\n   Maintaining clinic medical and stationary supply levels.\n   Maintaining up-to-date professional and technical knowledge by completing/attending educational workshops.\n   Maintaining a cooperative relationship among health care teams by communicating information; responding to requests; building rapport; participating in team problem- solving methods.\n   Contributing to team effort and corporate goals.\n \n \n  Minimum Qualifications\n \n   2+ years of relevant experience, degree or equivalent\n   RN with the College of Nurses of Ontario, Canada. Must be a member in good standing\n \n \n  Key Competencies\n \n   Infusion certification or equivalent experience a must\n   Maintains CPR certification\n   ACLS certification is an asset\n   Maintains yearly practice membership with provincial College of Nurses Association must be in good standing\n   Ability to work at various clinics depending on region\n   If applicable - maintains yearly professional liability insurance (Ontario applicants)\n   Critical care specific designation is an asset\n   Professional designation\n   Registered Nurse\n   Excellent assessment and clinical decision-making skills\n   Clinical, nursing and listening skills\n   Ability to work autonomously and proficiently, especially in emergency situations\n   Excellent communication skills with patients, colleagues and customers\n   Ability to work in a dynamic and rapidly changing environment\n   Team player\n   Ability to work in a computerized environment (i.e. computer, MS Office, email, and electronic patient records)\n   Adaptable to different kind of corporative environment\n \n \n  At McKesson, we care about the well-being of the patients and communities we serve, and that starts with caring for our people. That’s why we have a Total Rewards package that includes comprehensive benefits to support physical, mental, and financial well-being. Our Total Rewards offerings serve the different needs of our diverse employee population and ensure they are the healthiest versions of themselves. For more information regarding benefits at McKesson, please click here.\n \n  As part of Total Rewards, we are proud to offer a competitive compensation package at McKesson. This is determined by several factors, including performance, experience and skills, equity, regular job market evaluations, and geographical markets. In addition to base pay, other compensation, such as an annual bonus or long-term incentive opportunities may be offered.\n \n  Our Base Pay Range for this position\n  $29.57 - $49.28\n \n  McKesson is an Equal Opportunity employer.\n \n  The material contained herein is provided for informational purpose only. All open jobs offered by McKesson on this recruitment system are subject to specific job skill requirements. The job skill requirements, qualifications, and preferred experience are determined by a subsidiary, office or department within the company which is offering the position, and all positions are subject to local prevailing employment laws and restrictions. This would include immigration laws pertaining to work authorization requirements and any other applicable government permissions or compliance.\n \n  The materials on this site are provided without warranties of any kind, either expressed or implied, including but not limited to warranties regarding the completeness of information contained on this site or in any referenced links. While McKesson attempts to update this site on a timely basis, the information is effective only as of the time and date of posting.\n \n  McKesson is an equal opportunity employer and values diversity in its workforce. We encourage applications from all qualified individuals and will accommodate applicants' needs, up to the point of undue hardship, throughout all stages of the recruitment and selection process.\n \n  The information on this site is for information purpose only and is not intended to be relied upon with legal consequence.\n \n  Current employees must apply through internal career site.\n \n  Join us at McKesson!",
    "preprocessed_description": "McKesson is an impact-driven, Fortune 10 company that touches virtually every aspect of healthcare. We are known for delivering insights, products, and services that make quality care more accessible and affordable. Here, we focus on the health, happiness, and well-being of you and those we serve – we care. What you do at McKesson matters. We foster a culture where you can grow, make an impact, and are empowered to bring new ideas. Together, we thrive as we shape the future of health for patients, our communities, and our people. If you want to be part of tomorrow's health today, we want to hear from you. McKesson requires new employees to be fully vaccinated for COVID-19 as defined by Health Canada, subject to applicable, verified accommodation requests. McKesson is in the business of better health and we touch the lives of patients in virtually every aspect of healthcare. At McKesson Canada, we touch the lives of 12 million Canadians every day. We carry more than 35,000 products in 12 distribution centers and ultimately provide distribution to 6,300 retail pharmacies, 1,350 hospitals, long-term care centers, clinics and institutions all over Canada. But we are so much more than a distribution company. We've automated 2,500 retail pharmacies and dispense over 100 million doses a year through our automation solutions. Manufacturers, healthcare providers and patients count on us for a full range of services that contribute to the quality and safety of care for us all. At McKesson Canada, you will help us carry out our mission to improve lives and advance healthcare. Working here is your opportunity to shape an industry that is vital to us all. Job Summary Position is responsible for providing professional nursing care to individuals including the intravenous or injection administration of biologics or other specialty pharmaceutical products and promotes patient health by completing health reviews prior to treatment, reviews patient files and collaborates with physicians and multidisciplinary team members as required, with the end goal of providing medical therapies or selfadministration teaching to patients in an ambulatory setting. The nurse uses critical thinking, therapeutic communication and clinical decision making skills to assess, plan, implement, educate and evaluate the patients' health situation throughout their treatment therapy. Clinic Hours: Sun/Mon/Fri/Sat 8:00am - 4:00pm, Tues/Wed/Thurs 8:00am - 8:00pm Address: 595 Montreal Rd., Ottawa, ON Specific Responsibilities Assessing the health status of patients using a pre-screening process that covers contraindications, objective and subjective data, to determine eligibility in receiving medical therapies. Insertion of peripheral intravenous or establishing access via central lines using sterile technique and best practices from the standards and practices of the college. Studying patient files and prior post-administration records to understand patient's history. Handling and reconstituting biologic or oncology medication as per manufacturer and Heath Canada guidelines. Following provincial College of Nurses standards and guidelines on medication administration. Identifying patient care requirements; educating and providing counseling. Promoting patient independence; answering questions and teaching patients to understand their condition and medication. Documenting patient care services and managing records in accordance with INVIVA policies. Following INVIVA and nursing philosophies and standards of care. Following patient specific medical directives for administration and treatment of adverse events. Reporting adverse events in accordance with manufacturer specific requirements, Health Canada and INVIVA policy. Providing medical therapy monitoring and post administration observation and assessment. Maintaining knowledge of medical therapies as per Health Canada's Product Monograph. Maintaining knowledge of INVIVA policies and procedures. Participating with drug and clinic audits upon request. Following drug accountability requirements as per INVIVA policy and standard operating procedure. Actively participates in training and mentoring of new clinic staff. Completing training as required by INVIVA on: products and services, policies, technology, quality assurance and communications. Maintaining quality, safety and infection control standards to ensure safe nursing practice General Responsibilities Maintaining continuity among nursing teams by documenting and communicating actions, irregularities, and continuing needs. Establishing a compassionate environment and supporting patients. Maintaining and protecting patient confidentiality. Maintaining safe and clean working environment by complying with procedures, rules, and regulations. Ensuring proper operation of equipment by completing preventive maintenance requirements. Maintaining clinic medical and stationary supply levels. Maintaining up-to-date professional and technical knowledge by completing/attending educational workshops. Maintaining a cooperative relationship among health care teams by communicating information; responding to requests; building rapport; participating in team problemsolving methods. Contributing to team effort and corporate goals. Minimum Qualifications 2+ years of relevant experience, degree or equivalent RN with the College of Nurses of Ontario, Canada. Must be a member in good standing Key Competencies Infusion certification or equivalent experience a must Maintains CPR certification ACLS certification is an asset Maintains yearly practice membership with provincial College of Nurses Association must be in good standing Ability to work at various clinics depending on region If applicable - maintains yearly professional liability insurance (Ontario applicants) Critical care specific designation is an asset Professional designation Registered Nurse Excellent assessment and clinical decision-making skills Clinical, nursing and listening skills Ability to work autonomously and proficiently, especially in emergency situations Excellent communication skills with patients, colleagues and customers Ability to work in a dynamic and rapidly changing environment Team player Ability to work in a computerized environment (i.e. computer, MS Office, email, and electronic patient records) Adaptable to different kind of corporative environment At McKesson, we care about the well-being of the patients and communities we serve, and that starts with caring for our people. That's why we have a Total Rewards package that includes comprehensive benefits to support physical, mental, and financial well-being. Our Total Rewards offerings serve the different needs of our diverse employee population and ensure they are the healthiest versions of themselves. For more information regarding benefits at McKesson, please click here. As part of Total Rewards, we are proud to offer a competitive compensation package at McKesson. This is determined by several factors, including performance, experience and skills, equity, regular job market evaluations, and geographical markets. In addition to base pay, other compensation, such as an annual bonus or long-term incentive opportunities may be offered. Our Base Pay Range for this position $29.57 - $49.28 McKesson is an Equal Opportunity employer. The material contained herein is provided for informational purpose only. All open jobs offered by McKesson on this recruitment system are subject to specific job skill requirements. The job skill requirements, qualifications, and preferred experience are determined by a subsidiary, office or department within the company which is offering the position, and all positions are subject to local prevailing employment laws and restrictions. This would include immigration laws pertaining to work authorization requirements and any other applicable government permissions or compliance. The materials on this site are provided without warranties of any kind, either expressed or implied, including but not limited to warranties regarding the completeness of information contained on this site or in any referenced links. While McKesson attempts to update this site on a timely basis, the information is effective only as of the time and date of posting. McKesson is an equal opportunity employer and values diversity in its workforce. We encourage applications from all qualified individuals and will accommodate applicants' needs, up to the point of undue hardship, throughout all stages of the recruitment and selection process. The information on this site is for information purpose only and is not intended to be relied upon with legal consequence. Current employees must apply through internal career site. Join us at McKesson!",
    "processed_description": "impact drive Fortune company touch virtually aspect healthcare . deliver insight product service quality care accessible affordable . focus health happiness serve – care . McKesson matter . foster culture grow impact empower bring idea . thrive shape future health patient community people . tomorrow's health hear . require employee fully vaccinate covid define subject applicable verify accommodation request . business health touch life patient virtually aspect healthcare . touch life . carry product distribution center ultimately provide distribution retail pharmacy hospital long term care center clinic institution . distribution company . automate retail pharmacy dispense dose automation solution . manufacturer healthcare provider patient count range service contribute quality safety care . help carry mission improve life advance healthcare . shape industry vital . Summary Position responsible provide professional nursing care individual include intravenous injection administration biologic specialty pharmaceutical product promote patient health complete health review prior treatment review patient file collaborate physician multidisciplinary team require goal provide medical therapy selfadministration teaching patient ambulatory setting . nurse critical thinking therapeutic communication clinical decision skill assess plan implement educate evaluate patient' health situation treatment therapy . clinic hour Sun Mon Fri Sat 00am 00pm address . assess health status patient pre screening process cover contraindication objective subjective datum determine eligibility receive medical therapy . insertion peripheral intravenous establish access central sterile technique good practice standard practice college . study patient file prior post administration record understand patient's history . handling reconstitute biologic oncology medication manufacturer guideline . follow provincial College Nurses standard guideline medication administration . identify patient care requirement educate provide counseling . promote patient independence answer question teach patient understand condition medication . document patient care service managing record INVIVA policy . follow nursing philosophy standard care . follow patient specific medical directive administration treatment adverse event . report adverse event manufacturer specific requirement inviva policy . provide medical therapy monitoring post administration observation assessment . maintain knowledge medical therapy Health Canada's Product Monograph . maintain knowledge inviva policy procedure . participate drug clinic audits request . follow drug accountability requirement inviva policy standard operating procedure . actively participate training mentoring clinic staff . complete training require product service policy technology quality assurance communication . maintain quality safety infection control standard ensure safe nursing practice General Responsibilities maintain continuity nursing team document communicate action irregularity continue . establish compassionate environment support patient . maintain protect patient confidentiality . maintain safe clean environment comply procedure rule regulation . ensure proper operation equipment complete preventive maintenance requirement . maintain clinic medical stationary supply level . maintain professional technical knowledge complete attend educational workshop . maintain cooperative relationship health care team communicate information respond request building rapport participate team problemsolving method . contribute team effort corporate goal . Minimum qualification relevant degree equivalent RN . good stand Key Competencies Infusion certification equivalent maintain cpr certification ACLS certification asset maintain yearly practice membership good stand clinic depend region applicable maintain yearly professional liability insurance applicant critical care specific designation asset professional designation Registered Nurse excellent assessment clinical decision skill clinical nursing listening skill autonomously proficiently emergency situation excellent communication skill patient colleague customer dynamic rapidly change environment Team player computerized environment i.e. computer email electronic patient record adaptable kind corporative environment care patient community serve start care people . total reward package include comprehensive benefit support physical mental financial . total reward offering serve diverse employee population ensure healthy version . information regard benefit click . offer competitive compensation package . determine factor include performance skill equity regular market evaluation geographical market . addition base pay compensation annual bonus long term incentive offer . Base pay Range position Equal employer . material provide informational purpose . open offer recruitment system subject specific skill requirement . skill requirement qualification preferred determine subsidiary office department company offer position position subject local prevail employment law restriction . include immigration law pertain authorization requirement applicable government permission compliance . material site provide warranty kind express imply include limit warranty regard completeness information site reference link . attempt update site timely basis information effective posting . equal employer diversity workforce . encourage application qualified individual accommodate applicant' point undue hardship stage recruitment selection process . information site information purpose intend rely legal consequence . current employee apply internal career site . join",
    "results_group": {
        "extracted_noun_chunks": [
            "internal career site",
            "cooperative relationship health care team",
            "plan implement educate",
            "applicant' point undue hardship stage recruitment selection process",
            "knowledge medical therapy Health Canada's Product Monograph",
            "insertion peripheral intravenous establish access central sterile technique good practice standard practice college",
            "limit warranty regard completeness information site reference link",
            "compassionate environment support patient",
            "inviva policy",
            "study",
            "addition base pay compensation annual bonus long term incentive offer",
            "authorization requirement applicable government permission compliance",
            "quality safety care",
            "equal employer diversity workforce",
            "mission",
            "drug accountability requirement inviva policy standard operating procedure",
            "problemsolving method",
            "safe clean environment",
            "Key Competencies Infusion certification equivalent",
            "skill requirement qualification",
            "adverse event manufacturer specific requirement",
            "information regard benefit",
            "diverse employee population",
            "training",
            "open offer recruitment system subject specific skill requirement",
            "patient independence answer question",
            "information site information purpose",
            "life",
            "manufacturer healthcare provider patient count range service",
            "professional technical knowledge complete",
            "patient's history",
            "warranty",
            "procedure rule regulation",
            "patient' health situation treatment therapy",
            "determine factor",
            "drug clinic audits request",
            "position position subject local prevail employment law restriction",
            "patient ambulatory setting",
            "goal",
            "clinic medical stationary supply level",
            "certification ACLS certification asset",
            "total reward package",
            "nursing philosophy standard care",
            "idea",
            "comprehensive benefit support physical mental financial",
            "distribution retail pharmacy hospital long term care center clinic institution",
            "subsidiary office department company",
            "patient care requirement educate",
            "proper operation equipment",
            "medical therapy",
            "post administration record",
            "product service policy technology quality assurance communication",
            "healthcare",
            "yearly professional liability insurance applicant critical care specific designation asset professional designation Registered Nurse excellent assessment clinical decision skill clinical nursing listening skill",
            "kind express",
            "nurse critical thinking therapeutic communication clinical decision skill",
            "action irregularity",
            "patient file",
            "team",
            "condition medication",
            "McKesson matter",
            "material",
            "General Responsibilities",
            "corporate goal",
            "immigration law",
            "foster culture",
            "impact",
            "performance skill equity regular market evaluation geographical market",
            "business health touch life patient",
            "clinic hour Sun Mon Fri Sat 00am 00pm address",
            "tomorrow's health hear",
            "Base pay Range position Equal employer",
            "educational workshop",
            "life advance healthcare",
            "product distribution center",
            "Summary Position",
            "information",
            "subject applicable verify accommodation request",
            "material site",
            "employee",
            "health status patient pre screening process",
            "intravenous injection administration biologic specialty pharmaceutical product",
            "complete training",
            "Minimum qualification relevant degree equivalent RN",
            "document patient care service managing record INVIVA policy",
            "Fortune company",
            "patient",
            "continuity nursing team document",
            "health happiness",
            "insight product service quality care",
            "attempt update site timely basis information",
            "request building rapport",
            "application qualified individual",
            "knowledge inviva policy procedure",
            "protect patient confidentiality",
            "competitive compensation package",
            "current employee",
            "patient specific medical directive administration treatment adverse event",
            "contraindication objective subjective datum determine eligibility",
            "thrive shape future health patient community people",
            "safe nursing practice",
            "distribution company",
            "quality safety infection control standard",
            "patient health complete health review prior treatment review patient file",
            "rapidly change environment Team player computerized environment i.e. computer email electronic patient record adaptable kind corporative environment care patient community",
            "medical therapy monitoring post administration observation assessment",
            "professional nursing care individual",
            "informational purpose",
            "counseling",
            "legal consequence",
            "provincial College Nurses standard guideline medication administration",
            "healthy version",
            "reconstitute biologic oncology medication manufacturer guideline",
            "yearly practice membership good stand clinic",
            "clinic staff",
            "care people",
            "automate retail pharmacy"
        ],
        "combined_lemmatized_tokens": "impact drive Fortune company touch virtually aspect healthcare . deliver insight product service quality care accessible affordable . focus health happiness serve – care . McKesson matter . foster culture grow impact empower bring idea . thrive shape future health patient community people . tomorrow's health hear . require employee fully vaccinate covid define subject applicable verify accommodation request . business health touch life patient virtually aspect healthcare . touch life . carry product distribution center ultimately provide distribution retail pharmacy hospital long term care center clinic institution . distribution company . automate retail pharmacy dispense dose automation solution . manufacturer healthcare provider patient count range service contribute quality safety care . help carry mission improve life advance healthcare . shape industry vital . Summary Position responsible provide professional nursing care individual include intravenous injection administration biologic specialty pharmaceutical product promote patient health complete health review prior treatment review patient file collaborate physician multidisciplinary team require goal provide medical therapy selfadministration teaching patient ambulatory setting . nurse critical thinking therapeutic communication clinical decision skill assess plan implement educate evaluate patient' health situation treatment therapy . clinic hour Sun Mon Fri Sat 00am 00pm address . assess health status patient pre screening process cover contraindication objective subjective datum determine eligibility receive medical therapy . insertion peripheral intravenous establish access central sterile technique good practice standard practice college . study patient file prior post administration record understand patient's history . handling reconstitute biologic oncology medication manufacturer guideline . follow provincial College Nurses standard guideline medication administration . identify patient care requirement educate provide counseling . promote patient independence answer question teach patient understand condition medication . document patient care service managing record INVIVA policy . follow nursing philosophy standard care . follow patient specific medical directive administration treatment adverse event . report adverse event manufacturer specific requirement inviva policy . provide medical therapy monitoring post administration observation assessment . maintain knowledge medical therapy Health Canada's Product Monograph . maintain knowledge inviva policy procedure . participate drug clinic audits request . follow drug accountability requirement inviva policy standard operating procedure . actively participate training mentoring clinic staff . complete training require product service policy technology quality assurance communication . maintain quality safety infection control standard ensure safe nursing practice General Responsibilities maintain continuity nursing team document communicate action irregularity continue . establish compassionate environment support patient . maintain protect patient confidentiality . maintain safe clean environment comply procedure rule regulation . ensure proper operation equipment complete preventive maintenance requirement . maintain clinic medical stationary supply level . maintain professional technical knowledge complete attend educational workshop . maintain cooperative relationship health care team communicate information respond request building rapport participate team problemsolving method . contribute team effort corporate goal . Minimum qualification relevant degree equivalent RN . good stand Key Competencies Infusion certification equivalent maintain cpr certification ACLS certification asset maintain yearly practice membership good stand clinic depend region applicable maintain yearly professional liability insurance applicant critical care specific designation asset professional designation Registered Nurse excellent assessment clinical decision skill clinical nursing listening skill autonomously proficiently emergency situation excellent communication skill patient colleague customer dynamic rapidly change environment Team player computerized environment i.e. computer email electronic patient record adaptable kind corporative environment care patient community serve start care people . total reward package include comprehensive benefit support physical mental financial . total reward offering serve diverse employee population ensure healthy version . information regard benefit click . offer competitive compensation package . determine factor include performance skill equity regular market evaluation geographical market . addition base pay compensation annual bonus long term incentive offer . Base pay Range position Equal employer . material provide informational purpose . open offer recruitment system subject specific skill requirement . skill requirement qualification preferred determine subsidiary office department company offer position position subject local prevail employment law restriction . include immigration law pertain authorization requirement applicable government permission compliance . material site provide warranty kind express imply include limit warranty regard completeness information site reference link . attempt update site timely basis information effective posting . equal employer diversity workforce . encourage application qualified individual accommodate applicant' point undue hardship stage recruitment selection process . information site information purpose intend rely legal consequence . current employee apply internal career site . join"
    }
}