[
    {
        "id": "3a312477eb3d65fe",
        "company": "Ranovus",
        "positionName": "Lab Manager",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-29T06:48:20.262Z",
        "url": "https://www.indeed.ca/rc/clk?jk=3a312477eb3d65fe&from=jasx&tk=1hbkvt5cukf2u802&vjs=3",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "Location: Ottawa, Ontario \n  Social networking, machine learning, artificial intelligence, and big data analytics demand ever-increasing network connectivity. With operations in the US, Canada, and Germany, RANOVUS is a solution provider for the next generation data center infrastructures. We aim to deliver advanced technology that maximizes data throughput and minimizes environmental impact through lower power dissipation. Working with world class fabrication partners, RANOVUS is the leader in the application of unique new technologies to fiber-optic communications products for data centers. \n  We are looking for an Ottawa Lab Manager to support R&D activities by maintaining lab facility infrastructure, hardware and providing on-site support to lab users. \n  Key Responsibilities: \n \n  Ensuring efficient and effective delivery of lab infrastructure for both on-site and remote users. \n  Ensuring lab operation meets requirements for high-reliability, stability, and security. \n  Ensuring efficient delivery of hardware installation services, operations, and support. \n  Ensuring ESD safe practices are being used in the lab. \n  Ensuring equipment inventory and calibration is current and assign preventative maintenance. \n  Deploying and maintaining design and test environments. \n  Mentoring and development of staff capabilities. \n  Leading change including future evolution of Lab Operations in Ottawa. \n  Ensuring good stakeholder relations in coordination with all lab users. \n  Ontario Health and Safety responsibility: Lab Site Crisis Management. \n  Purchasing and maintenance of lab equipment and supplies. \n  \n Required Skills and Experience: \n  \n  Bachelor’s degree in an engineering subject area or Electronic Technician with management experience. \n  5+ years of experience managing an electronic lab and / or working in product development. \n  Experience working within a service organization. \n  Knowledge of IT products, solutions, and Network architecture. \n  Excellent English language skills. \n  Experience interacting with stakeholders in an R&D lab environment. \n  Ability to work independently. \n  Excellent interpersonal skills. \n  \n Preferred Skills and Experience: \n  \n  Experience with Linux: use, development, and deployment. \n  Experience with modern development tools, e.g., issue/defect tracking. \n  Ability to use lab equipment such as oscilloscope, data analyzer, power meter. \n  Experience with HW Board Bring-up, Functional Test and debug with ability to read schematics. \n  Skills for PCBA modification, soldering, circuit repair. \n  Experience assembling various kinds of cables including digital, cable and power."
    },
    {
        "id": "812e5aba08fd1e14",
        "company": "Live Dental Studio",
        "positionName": "Dental Laboratory Office Assistant",
        "jobType": [],
        "location": "346 Moodie Dr, Nepean, ON",
        "salary": null,
        "postingDateParsed": "2023-09-19T06:48:27.750Z",
        "url": "https://www.indeed.ca/rc/clk?jk=812e5aba08fd1e14&from=jasx&tk=1hbkvt5cukf2u802&vjs=3",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "We are a Quality Fast growing dental lab looking for an office assistant. No experience necessary!\nIt is a very fast paced environment with tight deadlines!\nDuties will include but are not limited to:\n\n Answering phones\n Unpacking/disinfecting dental cases as they arrive\n Packing cases for delivery\n Organizing deliveries\n Data entry\n Keeping lab organized with cases coming out\n Attention to detail is an absolute must!\n Computer skills a must\n Ability to multitask efficiently\n Punctual\n Pleasant phone mannerism\n Work well as a part of our team or individually\n No experience necessary, we are willing to train the right person\n\nHours are Monday to Friday, no weekends!\nBenefits, bonuses, plenty of on site-parking! If this sounds like it could be a good fit for you, please forward your resume.\nHours are Monday to Friday, no weekends!\nJob Types: Full-time, Permanent\nBenefits:\n\n Casual dress\n Dental care\n Extended health care\n On-site parking\n Wellness program\n\nSchedule:\n\n Monday to Friday\n\nEducation:\n\n Secondary School (preferred)\n\nWork Location: In person"
    },
    {
        "id": "7012da08fb969750",
        "company": "Calian",
        "positionName": "Intermediate Technician (Fuel Lab Support)",
        "jobType": [],
        "location": "Gatineau, QC",
        "salary": null,
        "postingDateParsed": "2023-09-21T06:48:23.400Z",
        "url": "https://www.indeed.ca/rc/clk?jk=7012da08fb969750&from=jasx&tk=1hbkvt5cukf2u802&vjs=3",
        "externalApplyLink": "https://careers.calian.com/careers/df-intermediate-technician-fuel-lab-support-48822/",
        "companyDescription": "",
        "description": "Position Overview \n  Calian is looking for Intermediate Technician for a Fuel Laboratory in Gatineau. \n \n  \n   \n     Location\n    \n      Gatineau, QC\n    \n   \n   \n     Job Type\n    \n      Full Time\n    \n   \n  \n  \n Responsibilities \n \n  Provide technical support to the section or the development of other ISO 17025, training and/or information management; proposing suitable procedures and appropriate recommendations in order to improve work quality \n  Plan and organize work to meet deadlines. Analyze, evaluate and resolve technical problems in a logical manner \n  Draft and maintain SOPs associated with ISO 17025 certification \n  Draft general correspondence and provide briefings in order to communicate issues, resolve problems, update work status, and disseminate information \n  Coordinate quality system audits and assist in the performance of quality system audits \n \n Qualifications \n \n  Must currently hold or be eligible for Secret – Level II Clearance with the Government of Canada \n  College certificate in analytical chemistry or 9 years of experience in the past 15 as a technician performing chemical analysis \n  Four years of experience in providing advice and direction on regulations, acquisition and control of petroleum, oil, fuels, and lubricants related to but not limited to aviation \n  One year of experience in coordinating the field audits and assisting in the performance of field audits at fueling facilities"
    },
    {
        "id": "831baf01349602d2",
        "company": "Smile Innovations Group",
        "positionName": "Dental Technician - Case Consultant & Quality Control",
        "jobType": [],
        "location": "Gatineau, QC",
        "salary": null,
        "postingDateParsed": "2023-09-30T06:48:25.942Z",
        "url": "https://www.indeed.ca/rc/clk?jk=831baf01349602d2&from=jasx&tk=1hbkvt5cukf2u802&vjs=3",
        "externalApplyLink": "https://smileinnovationsgroup.bamboohr.com/careers/44?source=indeed&src=indeed&postedDate=2023-09-28",
        "companyDescription": "",
        "description": "Dental Technician - Case Consultant & Quality Control \n  (Français version suit)\n \n  ABOUT MILIDENT \n  Opened in June 1995, Milident Inc specializes in the creation of complex cases, implant-supported crown and bridge, fixed and removable dentures as well as orthodontic appliances. Always at the forefront of technology, Milident Inc. continues to offer its products and services tailored to the specific needs of its clientele. Through its internal research and development program, Milident Inc. is continually exploring new technological advances in manufacturing its high-precision dental prosthesis.\n  \n  \n Description: \n  The Case Consultant is responsible for client communication with regards to case support and treatment planning, while maintaining a high level of customer satisfaction. This position will also be responsible for managing final quality control and providing internal team training around technical aspects of all cases.\n  \n  \n If you have at least 5 years’ experience in the dental lab industry, together with strong supervisory skills, we want to hear from you! A relocation package will be available.\n  \n  \n  General Responsibilities:\n \n  Case Consultant \n  \n  Assess, identify, and offer solutions for problem restorative cases \n  Discuss restorative options with doctors via phone/email \n  Ensure proper instructions are given to the technicians regarding problem cases \n  \n \n Final Quality Control \n  \n  Ensure final restoration and appliances meet the company quality control standards\n \n  \n  \n  Qualifications:\n  \n  \n  \n  Technical School – Certification as a Registered Dental Technician or equivalent education and experience \n  5 years of experience in dental lab industry \n  Must be able to manage people, processes, and technology \n  Must possess effective English and French communication skills (both oral and written,) while offering strong interpersonal skills \n  Excellent time management skills; acts skillfully with a sense of urgency \n  High attention to detail and accuracy \n  Ability to think strategically and to lead \n  Advanced troubleshooting and multi-tasking experience \n  Awareness of relevant industry technology trends and applications\n \n  \n  \n Technicien dentaire - Consultant cas et contrôle de la qualité\n \n  À PROPOS DE NOUS \n  Fondée en juin 1995, nous nous spécialisons dans la création de cas complexes, de prothèses dentaires fixes et amovibles ainsi que d’appareils orthodontiques. Toujours à l’avant-garde de la technologie, nous continuons d’offrir des produits et services adaptés aux besoins particuliers de notre clientèle. Par l’entremise de nos programmes interne de recherche et développement, nous explorons continuellement les nouvelles avancées technologiques dans la fabrication de prothèse dentaire de haute précision. \n  Description: \n  Le consultant en cas est responsable de la communication avec les clients en ce qui concerne le soutien aux cas et la planification du traitement, tout en maintenant un niveau élevé de satisfaction de la clientèle. Ce poste sera également responsable de la gestion du contrôle final de la qualité et de la formation interne de l’équipe sur les aspects techniques de tous les cas.\n  \n  \n Si vous avez au moins 5 ans d’expérience dans l’industrie des laboratoires dentaires, ainsi que de solides compétences en supervision, nous voulons avoir de vos nouvelles!\n  \n  Responsabilités Principales:\n \n  Consultante en cas \n \n  Évaluer, identifier et proposer des solutions aux cas de restauration problématique \n  Discuter des options réparatrices avec les médecins par téléphone / courriel \n  S’assurer que des instructions appropriées sont données aux techniciens concernant les cas problématiques \n  \n \n Contrôle final de la qualité \n  \n  S’assurer que la restauration finale et les appareils répondent aux normes de contrôle de la qualité de l’entreprise\n \n  \n  \n  Qualifications:\n  \n  \n  \n  École technique – Certification en tant que technicien dentaire agréé ou formation et expérience équivalentes \n  5 ans d’expérience dans l’industrie des laboratoires dentaires \n  Doit être capable de gérer les personnes, les processus et la technologie \n  Doit posséder des compétences efficaces en anglais et en communication Français (à l’oral et à l’écrit) tout en offrant de solides compétences interpersonnelles \n  Excellentes compétences en gestion du temps; agit habilement avec un sentiment d’urgence \n  Grande attention aux détails et à la précision \n  Capacité à penser stratégiquement et à diriger \n  Dépannage avancé et expérience multitâche \n  Connaissance des tendances et des applications technologiques pertinentes de l’industrie"
    },
    {
        "id": "1f43c6643e5bfc42",
        "company": "GeneBio Systems, Inc.",
        "positionName": "Sales Marketing Associate, Lab Research in Life Sci.-Ottawa/Montreal Metro",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-20T06:48:31.394Z",
        "url": "https://www.indeed.ca/rc/clk?jk=1f43c6643e5bfc42&from=jasx&tk=1hbkvt5cukf2u802&vjs=3",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "GeneBio Systems is a biotech company dedicated to help our customers by providing solutions to research and clinical laboratories. GeneBio Systems was founded on the strong scientific foundation stemming from our founding team's extensive biotechnological and life science research experience. Our professionals have many years of research and development experience in pharmaceutical, medical device and life science and laboratory products.\nAs a result of rapid growth of our business, we are hiring additional talents to expand our team.\nGeneBio is seeking outstanding applicants for a Sales/Marketing Associate I, Molecular Biology Life Science Lab Research to support ongoing sales initiatives. This position is located in\nOttawa and Montreal\nCandidates currently located in a nearby community are strongly preferred.\nThe ideal candidate has experience in molecular biology, with BSc degree in a life science discipline, and has an ability to build relationships with clients, working with colleagues, increasing sales and providing solutions that benefit both the employer and the client. With a knowledge and passion for the life science research, and development, the successful candidate will bring energy and drive to our existing team, opening up opportunities and expanding our current business portfolio.\nResponsibilities and Duties\n· Represent the company in a professional, respectful manner\n· Build, maintain and expand a network of (new) external relations, detect and realize new business opportunities\n· Create sales and marketing presentations for a broad range of researchers in clients' laboratories or otherwise sites.\n· Comfortable communicating with people at all levels, field to principal scientists\n· Effectively manage timely customer and product information, forecast accuracy and provides custom solutions\n· Partner with product managers managers, technical support services and sales management to strategize on new business development activities and set sales and revenue targets\n· Excellent communication skills;\n· Provide consistent follow up on customer communications to maintain strong professional relationships and explore ongoing and new opportunities\nQualifications and Skills\n· A minimum of BSc in a life science discipline preferably with 1 or more years of experience in a laboratory; though those who graduated in the last year are also encouraged to apply\n· A understanding of the sales process or willingness to acquire new skills and knowledge, and a strong passion to be successful.\n· Self-motivated with the ability to develop within a dynamic, fast-paced environment\n· Strong interpersonal and communication skills\n· Results driven with a high sense of urgency\n· Has a desire to learn and develop within the sales and marketing industry\n· Working towards career progression and growth within a company\n· Prior experience in sales or a customer-focused environment is an asset\nAbove all, driven, a go-getter who is independent, hungry for successes. Must be a great communicator.\n· Must be over the age of 18 with no criminal conviction or penal offence related to the tasks and responsibilities of the role. Recent graduates are encouraged to apply.\nThis position is compensated in salary with a performance based bonus, with an opportunity to participate in Company's employee stock option plan and conversion to a salary based position after 12-month.\nJob Type: Full-time\nSalary: Up to $49,000.00 per year\nBenefits:\n\n On-site parking\n Paid time off\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n 8 hour shift\n\nSupplemental pay types:\n\n Bonus pay\n\nApplication question(s):\n\n Must have a BSc in Biological discipline.\n\nEducation:\n\n Bachelor's Degree (required)\n\nWork Location: On the road\nExpected start date: 2023-10-01"
    },
    {
        "id": "d66206e59c8b7f03",
        "company": "Paracel Laboratories",
        "positionName": "Junior Laboratory Analyst",
        "jobType": [],
        "location": "2319 St. Laurent Blvd Suite 300, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-24T06:48:38.737Z",
        "url": "https://www.indeed.ca/rc/clk?jk=d66206e59c8b7f03&from=jasx&tk=1hbkvt5cukf2u802&vjs=3",
        "externalApplyLink": "https://www.careerbeacon.com/en/job-9/348267/paracel-laboratories/junior-laboratory-analyst/ottawa-on",
        "companyDescription": "",
        "description": "Who We Are: \n  Paracel Laboratories Ltd. is a full-service environmental and Indoor Air Quality laboratory. Our main laboratory facilities are located in Ottawa and are supported by an environmental lab in Hamilton and microbiology and asbestos laboratories in Mississauga and Calgary. Additional service depots are located in Kingston, London, Niagara, Windsor, and Richmond Hill. We support a broad spectrum of projects for professional clients from across Canada and around the world. Our client base primarily consists of major environmental consultants, all levels of government and industrial manufacturers located predominantly in Ottawa, Toronto, Niagara, Eastern and Southwestern Ontario.\n   The Opportunity: \n  Paracel Laboratories is looking for a Junior Analyst to join our team at our St. Laurent lab in Ottawa. The ideal candidate for this role is detail-oriented, dexterous and driven to meet deadlines in a fast-paced environment. \n  The Junior Analyst is responsible for performing analyses within a discrete section of the Laboratory (i.e. Organic, Inorganic). This involves sample preparations and manipulations, standards/reagent preparation according to established methods and QC protocols, and assistance on research projects as required under the direct supervision of the Senior Analyst. This is a full-time, permanent position.\n   Key Responsibilities: \n  \n   Ensuring that all tests are performed according to the established in-house protocols.\n    Responsible for performing analyses, and the preparation of lab standards and reagent, for both routine and research related analyses.\n    Responsible for performing analysis QC.\n    Maintaining and cleaning workspace in the laboratory.\n    Assists in collating and tabulating data.\n    Monitoring and requisitioning supplies as required.\n    Comply with company QA/QC and Health & Safety policies and procedures.\n  \n   Qualifications: \n  \n   B.Sc. or Chemical/Biology/Biochemistry Technology Diploma or equivalent with less than 1 year related experience.\n    Superb attention to detail and accuracy.\n    Ability to effectively follow/interpret work instructions, methods and procedures.\n    High degree of manual dexterity.\n    Highly reliable and deadline-driven.\n    Strong communication skills.\n    Thrives in a fast-paced environment.\n    Good understanding of Quality Assurance (QA) and Quality Control (QC).\n    Good Laboratory Practices (GLPs).\n    Ability to work independently and with a team.\n    Proven computer skills including MS office (Word and Excel).\n  \n   To Apply: \n  In addition to your resume, please include a cover letter in your application. We thank all applicants for their interest; however, only those selected for an interview will be contacted. \n  Paracel Laboratories is an equal-opportunity employer. If you require accommodation during the recruitment process, please let us know, and all efforts to provide the appropriate accommodation will be put into place.\n   Powered by JazzHR\n   bg5RXA2j3N"
    },
    {
        "id": "9497a71a8d606679",
        "company": "University of Ottawa Heart Institute",
        "positionName": "Chemistry Technologist I",
        "jobType": [],
        "location": "40 Ruskin St, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-23T06:48:39.315Z",
        "url": "https://www.indeed.ca/rc/clk?jk=9497a71a8d606679&from=jasx&tk=1hbkvt5cukf2u802&vjs=3",
        "externalApplyLink": "https://www.ottawaheart.ca/career-opportunity/chemistry-technologist-i",
        "companyDescription": "",
        "description": "Start date \n    As soon as possible. \n    Purpose of position \n    Provide laboratory assistance in the daily operations of the Cardiac P.E.T. Radiochemistry laboratory by : \n    \n    Assisting with the daily production of radiopharmaceuticals using specialized radio-chemistry laboratory equipment. \n    Analysing all radiopharmaceuticals and maintain results (documentation) produced by the radio-chemistry laboratory. \n   \n   Responsibilities \n   \n    Daily production of radiopharmaceuticals. \n    Carry out the functions in the production of radiopharmaceuticals by preparing solutions, properly identifying, labeling, packaging for transportation. \n    Monitor production of radiopharmaceuticals, recognize problems and initiate established corrective protocols. \n    Run the cyclotron for producing radiopharmaceutical. \n    Work with the radio-chemists in developing technical protocols. \n    Quality control procedures, analysis, report all deficiencies, create and maintain current database per isotope and detector for the cyclotron. \n    Participate in research projects as directed. \n    Assist in the implementation of new techniques and protocols. \n   \n   Requirements \n   \n    BSc Chemistry or equivalent \n    2 years experience in a progressive chemical laboratory \n    Working experience with radioactive materials is considered an asset \n   \n   Preferred qualifications \n    Knowledge of: \n    \n    General laboratory equipment (HPLC, thin-layer chromatography, osmometer, gas chromatograph, radioactivity detectors) and their applications along with standard procedures. \n    Procedure instrumentation. \n    Legislated requirements related to practice and equipment operation relevant to job function. \n    Ability to troubleshoot to component level. \n   \n   To apply \n    To apply, please send your cover letter and CV to jobpostings@ottawaheart.ca. \n    Applications from Indigenous persons, members of racialized minorities, persons with disabilities, women, members of the LGBTQ+ community, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse and inclusive communities are strongly encouraged. \n    According to government policy, all qualified candidates are invited to apply; however, preference will be given to Canadians and permanent residents. When submitting your application, please indicate if you are legally entitled to work in Canada. \n    The University of Ottawa Heart Institute is committed to ensuring barrier-free selection processes and work environments. Accommodations will be provided in all parts of the hiring process relating to any specialty requirements. Please notify us of any accommodations that you require – any information you provide will be handled respectfully and in complete confidence. \n    The successful candidate will be required, prior to the start of employment, to complete mandatory organizational training available online, and provide the following: an official piece of photo identification and a satisfactory Criminal Record Check and proof of two doses of COVID-19 vaccine."
    },
    {
        "id": "7be67a486b9a85c4",
        "company": "GFL Environmental Inc.",
        "positionName": "Chemical Technician (Day Shift)",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-21T06:48:36.467Z",
        "url": "https://www.indeed.ca/rc/clk?jk=7be67a486b9a85c4&from=jasx&tk=1hbkvt5cukf2u802&vjs=3",
        "externalApplyLink": "https://wd3.myworkdaysite.com/recruiting/gflenv/Careers/job/Ottawa-Ontario/Chemical-Technician--Day-Shift-_R10318?source=Indeed",
        "companyDescription": "",
        "description": "The Chemical Technician (job title: Chemical Operator) is responsible for day-to-day operations with respect to waste receiving, sampling, handling, processing, and disposal. Client site visits to complete lab packing of waste, classification and sampling of waste products and preparing materials for transportation and disposal. Assisting Industrial Operations, Customer Service Representatives with projects as needed.\n \n \n   Who we are:\n \n \n  \n   \n    \n      GFL Environmental is the only major diversified environmental services company in North America; operating across Canada and the United States; offering services in solid waste management, liquid waste management, and infrastructure development.\n     \n      Recognized by our signature fleet of bright green trucks and equipment, we offer a wide range of environmental and industrial services to businesses, communities, and households, providing a consolidated and sophisticated approach to meeting our customers’ needs.\n     \n      GFL Benefits:\n     \n       Our industry leading benefits package (100% employer paid)\n       RRSP Matching: We support your future goals by matching your RRSP contributions\n       An environment to encourage professional growth and development\n       Be a part of the Full-Cycle Project initiative – a way to give back to the community\n     \n    \n   \n  \n \n  Key Responsibilities:\n \n   Receive all client waste – both bulk liquids/solids and containerized.\n   Take samples from waste vehicles and containers for lab analysis.\n   Load and unload waste vehicles including vacuum trucks, tankers, straight trucks, and van trailers.\n   Operate plant machinery and assist with general maintenance as needed.\n   Perform wastewater treatment and discharge according to our site-specific Environmental Certificate of Approvals (ECAs) and associated compliance requirements pertaining to treatment and discharge issued by the Region of Peel.\n   Perform acid/base neutralizations efficiently, safely, and effectively.\n   Assist with preparing shipments of hazardous and non-hazardous waste for transport.\n   Notify the Shift Supervisor/General Manager of any defects, damages, mistakes, errors, contamination, spills, other incidents, or accidents that are identified.\n \n \n  Knowledge, Skills & Competencies: \n \n  Post-Secondary education in Chemistry/Chemical Engineering/Technology or Internship in a related field.\n   Familiarity with waste management regulations, Ontario regulation 347, Transportation of Dangerous Goods is an asset.\n   Previous hazardous and non-hazardous waste management experience is an asset.\n   Must be comfortable working in a mostly outdoor environment.\n   Ability to lift upwards of 50 lbs.\n   Emergency response availability including evenings and weekends.\n \n \n  #GFLTalent\n \n  We thank you for your interest. Only those selected for an interview will be contacted. \n \n GFL Environmental is an equal opportunity employer and encourages women, Aboriginal people, persons with disabilities and members of visible minorities to apply. We seek to hire individuals with diverse characteristics, backgrounds and perspectives. We strongly believe that world-class talent makes no distinctions based on gender, ethnic or national origin, sexual identity and orientation, age, religion or disability, but enriches itself through these differences. GFL will provide accommodations to job applicants with disabilities throughout the recruitment process. If you require an accommodation, please notify us and we will work with you to meet your needs."
    },
    {
        "id": "7540af5a7629997f",
        "company": "Ciena",
        "positionName": "Lab Administrator",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-27T06:48:41.476Z",
        "url": "https://www.indeed.ca/rc/clk?jk=7540af5a7629997f&from=jasx&tk=1hbkvt5cukf2u802&vjs=3",
        "externalApplyLink": "https://careers.ciena.com/us/en/job/CIENUSR023467ENUS/Lab-Administrator?utm_source=indeed&utm_medium=phenom-feeds",
        "companyDescription": "",
        "description": "Ciena is committed to our people-first philosophy. Our teams enjoy a culture focused on prioritizing a personalized and flexible work environment that empowers an individual’s passions, growth, wellbeing and belonging. We’re a technology company that leads with our humanity—driving our business priorities alongside meaningful social, community, and societal impact. \n \n You know what your ideal career looks like: a competitive salary, freedom to live your life as you like, and recognition for your accomplishments—all in an inclusive and diverse people-first environment. Our success is driven by a supported, thriving team; this is why Ciena upholds these benefits for all our employees. Ciena empowers you with flexible paid time off, reimbursed and in-house development resources, support for mental and physical well-being, and assets you may need to attain your goals both at and away from work.\n \n  How You Will Contribute:\n  This is an onsite role at our lab in Ottawa. As a Lab Administrator you are a detail-oriented, dependable administrator reporting into the Senior Lab Manager. You will work with the Santa Clara and Petaluma and Ottawa lab teams, and learn about: remote Data Center Management tools to monitor and control the lab, help with inventory and lab assets counts, including lab space, lab racks, test instruments, etc.\n  Other duties include:\n \n   Handling lab equipment maintenance, and repair\n   Install and prepare lab test gear for projects based on HW design team specifications\n   Support lab safety protocols, ESD practices and good lab etiquette\n   Ensuring asset tracking and inventory procedures are followed. keep an accurate inventory of all assets\n   Answering JIRA tickets to keep lab in service and engineers productive\n   Learn proper rack mounting, cable management\n \n  What Does Ciena Expect of You: \n \n  A sense of urgency – what’s important to the customer is equally important to you. You make getting things done a priority.\n   Integrity – you hold yourself to the highest level of personal and professional standards of conduct.\n   A commitment to innovation – you continually seek to learn, understand new technologies and ever-changing market conditions, and endeavor to apply that knowledge to Ciena’s advantage.\n   You embrace change – thriving in a diverse environment of ever-changing priorities and sometimes stressful situations.\n \n \n  The Must Haves:\n \n   Interest in Computers, HW & SW\n   Experience in HW/SW development labs\n   Knowledge of Lab Equipment: routers, switches, servers, and test tools\n   Learn applications such as JIRA, CONFLUENCE, Artifactory, Bitbucket, etc\n   Proficiency in written and spoken English\n   Strong interpersonal skills\n \n \n  Assets:\n \n   College Diploma or University Degree in Computer Engineering, Computer Science, Electrical Engineering, or Electronics\n   Programming and scripting skills, Web, Bash, Expect, Python, Java, A plus\n \n \n  #LI-CM #LI-onsite\n \n  At Ciena, we are committed to building and fostering an environment in which our employees feel respected, valued, and heard. Ciena values the diversity of its workforce and respects its employees as individuals. We do not tolerate any form of discrimination.\n \n  If contacted in relation to a job opportunity, please advise Ciena of any accommodation measures you may require."
    },
    {
        "id": "83cab0578d8d2185",
        "company": "Ciena",
        "positionName": "Waveserver Lab Technician – New Grad",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-23T06:48:38.754Z",
        "url": "https://www.indeed.ca/rc/clk?jk=83cab0578d8d2185&from=jasx&tk=1hbkvt5cukf2u802&vjs=3",
        "externalApplyLink": "https://careers.ciena.com/us/en/job/CIENUSR023474ENUS/Waveserver-Lab-Technician-New-Grad?utm_source=indeed&utm_medium=phenom-feeds",
        "companyDescription": "",
        "description": "Ciena is committed to our people-first philosophy. Our teams enjoy a culture focused on prioritizing a personalized and flexible work environment that empowers an individual’s passions, growth, wellbeing and belonging. We’re a technology company that leads with our humanity—driving our business priorities alongside meaningful social, community, and societal impact. \n \n How You Will Contribute:\n \n  Requirements for telecommunications networks are constantly evolving, and our products also need to advance and scale to meet the needs of our customers while also delivering uniform and consistent user experiences.\n \n  As a Waveserver Lab Technician you will be hands on with our next generation optical network solutions in a dynamic team environment. You will work alongside experienced professionals to ensure the reliability and performance of projects that play critical roles in our network solutions and help build upon our innovative technology. You will also challenge yourself and others by bringing enthusiasm and fresh ideas to new challenges and leading by example.\n \n \n   You will be responsible for the installation, maintenance, and troubleshooting of optical network solutions\n   You will use a detail-oriented approach to service user tickets, maintain records of equipment and track new hardware orders and requests\n   You will assist in maintaining hardware and setups including cable management, labeling, and organization\n   You will be accountable for managing individual project priorities, assignments, and timelines.\n   You will participate in the full software development lifecycle, collaborating with multi-functional teams of developers, UX designers, quality assurance teams & release managers.\n \n \n  What Does Ciena Expect of You?\n \n   Initiative – You are a self-starter who works with limited direction and is committed to delivering against aggressive deadlines.\n   Agility – you are readily able to make key decisions and manage competing and ever-changing account priorities.\n \n \n   Communication expertise – the ability to influence and tailor your message and ideas to the audience to ensure understanding and buy in.\n   An ability to go ‘up and down the ladder’ – capable of seeing the big picture, but also understanding the importance of the details and analysis.\n   The flexibility to work independently and as part of a broader team – you thrive in a multi-disciplinary team environment, but are comfortable working independently as required.\n   Relationship builder – with an innate ability to influence, you can quickly develop trusted connections and get work done across multi sites.\n   A commitment to innovation – you keep abreast of the market and competitive developments and are always keen to formulate new ideas and problem solve.\n \n \n  The Must Haves:\n \n   College diploma in physical technology, electronics, or equivalent\n   Experience working with optical networking equipment\n   Knowledge of networking protocols such as TCP/IP, DNS, and DHCP\n   Strong organization skills and attention to detail\n   Must be in Ottawa or willing to relocate as this position is in person five days a week\n \n \n  Why Ciena:\n \n   We believe an inclusive, diverse, and barrier-free work environment makes for empowered and committed employees.\n   We recognize the importance of well-being and offer programs and benefits to support and sustain the mental and physical health of our employees and their families and provide a variety of paid family leave programs.\n   We are committed to employee development, offering tuition reimbursement, in-house learning, and mentorship opportunities.\n   We know that financial security is important. We offer competitive salaries and incentive programs, RSU’s (job level specific) and an employee share option purchase program.\n   We realize time away to recharge is non-negotiable. We offer unlimited paid time off!\n   Great work deserves recognition. We have a robust recognition program, with ongoing and enhanced awards for exemplary performance.\n \n \n  At Ciena, we are committed to building and fostering an environment in which our employees feel respected, valued, and heard. Ciena values the diversity of its workforce and respects its employees as individuals. We do not tolerate any form of discrimination.\n \n  If contacted in relation to a job opportunity, please advise Ciena of any accommodation measures you may require."
    },
    {
        "id": "0052e5087671f5f3",
        "company": "Live Dental Studio",
        "positionName": "Dental laboratory assistant. CAD/CAM technician",
        "jobType": [],
        "location": "346 Moodie Dr, Nepean, ON",
        "salary": null,
        "postingDateParsed": "2023-09-19T06:49:08.526Z",
        "url": "https://www.indeed.ca/rc/clk?jk=0052e5087671f5f3&from=jasx&tk=1hbkvuhndkf0v802&vjs=3",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "Job description\nWe are looking for a dental laboratory assistant to join our CAD/CAM department.\nThis is a permanent, full time job with 40 hours/ week\n\n 1 to 3 year experience in CAD/CAM (computer assisted designing and manufacturing)\n Scan, design and mill crowns & implant abutments.\n Operate and maintain various dental milling machines and 3D printers\n Previous experience in plaster and model work is an asset\n computer skills and hardware troubleshooting.\n attention to details and good communication skills\n\nWe have a ton of on-site FREE parking\nPaid vacation/ sick days/ personal days\nDental/ health benefits/ wellness program\nFamily like atmosphere\nPlease send your resume to ahmad@livedentalstudio.com\nJob Type: Full-time\nSalary: $27.00-$33.00 per hour\nBenefits:\n\n Casual dress\n Dental care\n Extended health care\n On-site parking\n Paid time off\n Profit sharing\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n 8 hour shift\n\nSupplemental pay types:\n\n Bonus pay\n\nAbility to commute/relocate:\n\n Kanata, ON: reliably commute or plan to relocate before starting work (preferred)\n\nEducation:\n\n Secondary School (preferred)\n\nExperience:\n\n dental technician: 2 years (required)\n\nLanguage:\n\n English (required)\n\nWork Location: In person"
    },
    {
        "id": "90bcf37fbddc9860",
        "company": "Alberta Precision Labs",
        "positionName": "Medical Laboratory Technologist (Alberta, Canada)",
        "jobType": [],
        "location": "Ontario",
        "salary": null,
        "postingDateParsed": "2023-09-14T06:49:07.549Z",
        "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0BKoA0KjMB2_2SITHdZiKR2tLJiDQwQdMraFBOtj0fmnfR-Td6qATq9uOZ1-TDWBDzwp6MAA8ZhePQnmA_4BK-jRHFdLentfbOKSaxw_jWzwNGt8tg98WkwNrLXBYhRjVOlT8oTR4k8vZQLaoFSbxwTowq64vZucQLk99AwoPUBuuk57mzX9N4tHT-51fF0KwEwb9g9w-gr1Jll7ExTuepNPiPF-ZBk4F5X0VCEeklVCCgN8K4LTKuJKcz_sqTluqVDCamU_tKmNYNGBbk4rE8XEJ-wnhosMavN-TggsNXBI47qnsrm5ne7cozL91U2v8P0xZNGFT7zm9WoJoDbp-Z_XN-EO2ubPCH-pWHZ1DpGrbLZQRxX5IFStqS_U6lo1-68zSx5h8hX_AVlsKcDgT3qy3xZxKeFd3kbXmZbEHYYTqk8Urzx4aT9suNOS06T3PSVEEG2pfkHrt6P5M0icIigS2V4Rh5h-FUW11_tn66GG6OSc865hlMZ0x0zfWXcsGAOYEfp6kcgWQw0yaas50xSCbViDdCarXsrCI_ZCv61KU0U9ITVESzQhWdSa82qzq0%3D&xkcb=SoCu-_M3K031mxALjb0ObzkdCdPP&p=5&fvj=1&vjs=3&jsa=5980&tk=1hbkvuhtbkf1t800&from=jasx&wvign=1",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "Your Opportunity:\nAlberta Precision Laboratories (APL) is hiring multiple Medical Laboratory Technologists throughout Alberta.\nAPL delivers high-quality, responsive diagnostic lab services to Albertans as a part of the provincial healthcare system. With competitive salaries, opportunities for professional development, and comprehensive benefits, you can truly thrive. Make a difference in your own community as you help healthcare professionals and patients get the information that they need to improve, optimize, or maintain health.\nCome and join our diverse team and get the opportunity to utilize all of the skills and experiences you have gained through school. This is a working level position utilizing technical skills and judgment performing a diverse range of diagnostic procedures in the Clinical Chemistry, Hematology, Transfusion Medicine, and Specimen Procurement departments, within the scope of practice of a Medical Laboratory Technologist.\nJoin our professional and engaging team that encourages promoting a positive and respectful work environment consistent with the APL Values: kindness, inclusion, innovation, agility & accuracy.\nJob Description:\nAs a Medical Laboratory Technologist (MLT) I, you will be responsible for the daily processing, testing, results analysis and reporting of diagnostic samples within the laboratory department. You will perform a variety of routine and specialized procedures in the processing of specimens used in diagnosis, treatment and research.\nQualifications:\nCompletion of an accredited Medical Laboratory Technology (MLT) program. Active or eligible for registration and practice permit with the College of Medical Laboratory Technologists of Alberta (CMLTA).\nJob Types: Casual, Permanent, Part-time, Full-time, Fixed term contract\nSalary: $34.75-$45.77 per hour\nBenefits:\n\n Company pension\n Dental care\n Disability insurance\n Extended health care\n Life insurance\n Paid time off\n Vision care\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n Day shift\n Evening shift\n Night shift\n\nWork Location: In person"
    },
    {
        "id": "90bcf37fbddc9860",
        "company": "Alberta Precision Labs",
        "positionName": "Medical Laboratory Technologist (Alberta, Canada)",
        "jobType": [],
        "location": "Ontario",
        "salary": null,
        "postingDateParsed": "2023-09-14T06:49:08.638Z",
        "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0BKoA0KjMB2_2SITHdZiKR2tLJiDQwQdMraFBOtj0fmnfR-Td6qATq9uOZ1-TDWBDzwp6MAA8ZhePQnmA_4BK-jRHFdLentfbOKSaxw_jWzwNGt8tg98WkwNrLXBYhRjVOlT8oTR4k8vZQLaoFSbxwTowq64vZucQLk99AwoPUBuuk57mzX9N4t3B9rEcLD8d40RL6oHFOVLSKH_JceKz5sKhcMsn3QcOfr0Kv89X2vMGapa1Y2oSbPANe5d0A0oa5zRFy5BKKzDrjDQV4r8Glk3Jp8CXlJQg4gJtWh2Upka0j0Ztsi_fgOLv18tIcvku3m3gGPbF1iAXqJFJq6jAtttNIwnnKEyrf6D-37U2K-M_ewrQZ1HctlBwz2lqCbwI6_kabrOlEFWYphHU2a2ALErOmlGIZStqIcFIRxC9J8huoPWEfms2HX2SG_RzmX5vAEIWQK3cgQqLk9nTup7L-JaErgN5lp1RxCUIpOgIiNljR2Af_kBG2sVExziKMDkHcuQRSRgl71yo8Kzwh5y022PzWJStJESL1eZ8Qhca0UBDw2IIXJWZ2nON5g9lE6X0A%3D&xkcb=SoDd-_M3K031gXSD1B0ObzkdCdPP&p=5&fvj=1&vjs=3&jsa=6831&tk=1hbkvuinuir0h801&from=jasx&wvign=1",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "Your Opportunity:\nAlberta Precision Laboratories (APL) is hiring multiple Medical Laboratory Technologists throughout Alberta.\nAPL delivers high-quality, responsive diagnostic lab services to Albertans as a part of the provincial healthcare system. With competitive salaries, opportunities for professional development, and comprehensive benefits, you can truly thrive. Make a difference in your own community as you help healthcare professionals and patients get the information that they need to improve, optimize, or maintain health.\nCome and join our diverse team and get the opportunity to utilize all of the skills and experiences you have gained through school. This is a working level position utilizing technical skills and judgment performing a diverse range of diagnostic procedures in the Clinical Chemistry, Hematology, Transfusion Medicine, and Specimen Procurement departments, within the scope of practice of a Medical Laboratory Technologist.\nJoin our professional and engaging team that encourages promoting a positive and respectful work environment consistent with the APL Values: kindness, inclusion, innovation, agility & accuracy.\nJob Description:\nAs a Medical Laboratory Technologist (MLT) I, you will be responsible for the daily processing, testing, results analysis and reporting of diagnostic samples within the laboratory department. You will perform a variety of routine and specialized procedures in the processing of specimens used in diagnosis, treatment and research.\nQualifications:\nCompletion of an accredited Medical Laboratory Technology (MLT) program. Active or eligible for registration and practice permit with the College of Medical Laboratory Technologists of Alberta (CMLTA).\nJob Types: Casual, Permanent, Part-time, Full-time, Fixed term contract\nSalary: $34.75-$45.77 per hour\nBenefits:\n\n Company pension\n Dental care\n Disability insurance\n Extended health care\n Life insurance\n Paid time off\n Vision care\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n Day shift\n Evening shift\n Night shift\n\nWork Location: In person"
    },
    {
        "id": "46e34efc327d8d60",
        "company": "Alberta Precision Labs",
        "positionName": "Medical Laboratory Assistant (Alberta, Canada)",
        "jobType": [],
        "location": "Ontario",
        "salary": null,
        "postingDateParsed": "2023-09-14T06:49:15.643Z",
        "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0BKoA0KjMB2_2SITHdZiKR2tLJiDQwQdMraFBOtj0fmnfR-Td6qATq9e8Dii-TEZmttxkF29KoVMomicbEbdo8mnwcyGUotTIf0wV1DxZBe_nj4g0BDCJNzF8mAErJuZgMTvqMC80EL98DVTmi4C73Ox8ljLHP1ZqOO73jiLk8AUmeuGfbKASmGe7wZZ7AHng38UUB5ljwwJJF24BHl6p9FBu3nAaSe2txUuvuHl224REUD9oOGnhuVhwJvWKf790Yayb6vsA1hK3RguHf4vRrjqI0R6KEP3Viy9kLwFtsd3iwD8DB9jvjfsRSkgiuWRcPvyi3NUjEoMzvJAeknXm31WnV8ezjlJiS6CnhG5BPkeE5nEOgNE_ayj53FDWigGpMPCBKoeW7PvvVpKhDuqHRqiu1dKp5CgLxsV92uSoR2tHLqz87b5DbSrdEb43L0ynqzpqynM--rqTNNzE5e_Rop9V7I935El3d6Kf8R1uwqN-5VoaIuph1jA1oJJnsWCFaWpisybNUBqWdi92Yqq7ZrD3cun9i1QP1e2Q71duL8yam02QieYY7JM6fpy94KZLc%3D&xkcb=SoDn-_M3K031gXSD1B0IbzkdCdPP&p=3&fvj=1&vjs=3&jsa=6831&tk=1hbkvuinuir0h801&from=jasx&wvign=1",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "Your Opportunity:\nAlberta Precision Laboratories (APL) is hiring multiple Medical Laboratory Assistants throughout Alberta.\nAPL delivers high-quality, responsive diagnostic lab services to Albertans as a part of the provincial healthcare system. With competitive salaries, opportunities for professional development, and comprehensive benefits, you can truly thrive. Make a difference in your own community as you help healthcare professionals and patients get the information that they need to improve, optimize, or maintain health.\nAs a successful candidate, you will have the opportunity to work both independently and as a member of our team where you may be responsible for performing all aspects within the scope of practice of a MLA including blood collection, specimen procurement and handling procedures, data entry, as well as Electrocardiogram (ECG) and Holter monitors, and urinalysis. You will have the opportunity to work in the community or hospital setting.\nWith a customer service focused approach, you build productive and respectful customer relations and take responsibility for customer satisfaction. You have an ability to encourage others, building positive, respectful and collaborative working relationships.\nJoin our professional and engaging team that encourages promoting a positive and respectful work environment consistent with the APL Values: kindness, inclusion, innovation, agility & accuracy.\nJob Description:\nAs an MLA, you will provide high quality service to clients of the clinical laboratory in an effective, efficient and safe manner. You will be responsible for a variety of laboratory functions including procurement, handling, processing, dispatching and testing of specimens, performing procedures and reporting results.\nQualifications:\nCompletion of an accredited Medical Laboratory Assistant program or equivalent.\nJob Types: Casual, Permanent, Part-time, Full-time, Fixed term contract\nSalary: $23.25-$28.98 per hour\nBenefits:\n\n Company pension\n Dental care\n Disability insurance\n Extended health care\n Life insurance\n Paid time off\n Vision care\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n Day shift\n Evening shift\n Night shift\n Weekends as needed\n\nWork Location: In person"
    },
    {
        "id": "7dc2a2353052d14a",
        "company": "University of Ottawa Heart Institute",
        "positionName": "Postdoctoral Researcher",
        "jobType": [],
        "location": "40 Ruskin St, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:49:20.819Z",
        "url": "https://www.indeed.ca/rc/clk?jk=7dc2a2353052d14a&from=jasx&tk=1hbkvuh1oj32s803&vjs=3",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "POSTDOCTORAL FELLOW Division of Cardiac Prevention & Rehabilitation Cardiac Rehabilitation Exercise Physiology and Cardiovascular Health Lab \nUniversity of Ottawa Heart Institute \nThe University of Ottawa Heart Institute is Canada's largest and foremost cardiovascular health centre dedicated to understanding, treating, and preventing heart disease. The Division of Cardiac Prevention & Rehabilitation has a unique array of initiatives and programs, with a particular emphasis on innovative approaches to preventing(primary and secondary) and managing cardiovascular disease. The Division is home to our Cardiac Rehabilitation program, one of the largest in Canada, and the Exercise Physiology and Cardiovascular Health Lab.\nThis fellowship affords the opportunity to acquire and contribute knowledge to the areas of cardiovascular rehabilitation, clinical exercise physiology, big data, and clinical trial conduct and management. Some of the current research projects include: (1) OPPORTUNITY – an RCT investigating the impact of different forms of exercise training in patients with atrial fibrillation; (2) CANSURVEY-AF – a multi-site observational cohort study examining the physical activity levels of patients with atrial fibrillation; (3) EXCEED – an RCT examining the effects of exercise programs delivered virtually in women with cardiovascular disease; and, (4) various projects examining practical approaches to prescribing physical activity and monitoring exercise intensity in patients with cardiovascular disease, with a focus on sex and gender differences.\nThe selected candidate will be expected to lead a large-scale / big-data evaluation of cardiac rehabilitation programming to advance quality of care, closely collaborating with scientists and healthcare professionals to develop and apply advanced data science methodologies. Access to several large integrated clinical and research databases spanning 15+ years is available and will serve as the foundation for publication and presentation opportunities. The fellowship also offers the opportunity to enhance and develop clinical exercise physiology / kinesiology skills (e.g., leading exercise training sessions, cardiopulmonary exercise testing, functional capacity testing) in patients with a range of cardiovascular conditions including, but not limited to, atrial fibrillation, coronary artery disease, heart failure (if the candidate possesses the minimum required education and qualifications, see below).\nIt is expected that the successful candidate will assume responsibility for the preparation and publication of manuscripts and assist with the submission of research grant applications. The fellow will also participate in training and educational activities (e.g., Grand Rounds, Cardiac Rehabilitation Rounds, Work-in-Progress Rounds, conferences), and may obtain additional support from our Research Services Department, medical librarian, andCardiovascular Methods Centre.\nThe successful candidate will possess: \n\n Ph.D. degree in a data science (statistics/computer science/engineering) or health-related (exercise physiology/kinesiology preferred, epidemiology) field, or M.D. degree.\n R. Kin, ACSM RCEP, CSEP CEP, or equivalent (preferred if contributing to clinical exercise physiology / kinesiology activities).\n A strong understanding of clinical research design, research methodology, and data analysis.\n Advanced statistical training and knowledge of statistical software packages.\n Demonstrated experience programming in statistical software (e.g., SPSS, SAS, R, Python).\n Evidence of experience in the preparation and publication of manuscripts.\n Excellent oral communication and technical writing skills in English.\n The ability to take guided initiatives and to work in an organized fashion within a fast-paced research environment, including flexibility in shifting between independent and collaborative work.\n The ability to work collegially in an exciting and dynamic research environment.\n\nThe position is a two-year fellowship with the possibility of a 1-year renewal contingent on performance and funding. Up to two positions may be available. While funding for this position(s) has been secured through theUniversity of Ottawa Heart Institute Foundation (Jan & Ian Craig Fellowship), the Canadian Institutes of HealthResearch, and the Heart and Stroke Foundation of Canada, successful applicants will be encouraged to apply for independent postdoctoral fellowships. Please send a letter of application including a 1-2 page description of research experience and interests, updated curriculum vitae, and names & contact information of three referees to Dr. Jennifer Reed, jreed@ottawaheart.ca (video and audio recordings of the application package are also acceptable). Applicants are encouraged to prepare their application materials following DORA guidelines to define their research contributions. A description of any barriers that may have limited their research contributions to date are encouraged. Applications are encouraged to reach out should they have questions regarding the application requirements. Applications will be reviewed as received.\n\n We are committed to a continued focus on equitable hiring, training, operations, and policies. We don’t just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our research and clinical programs. \n\nJob Type: Full-time\nSalary: $50,000.00-$60,000.00 per year\nBenefits:\n\n Flexible schedule\n\nSchedule:\n\n Monday to Friday\n Weekends as needed\n\nEducation:\n\n Doctoral Degree (preferred)\n\nWork Location: In person"
    },
    {
        "id": "e9b56301c10bbbc4",
        "company": "University of Ottawa Heart Institute",
        "positionName": "POSTDOCTORAL RESEARCH FELLOW - Cardiac Rehabilitation",
        "jobType": [],
        "location": "40 Ruskin St, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:49:17.626Z",
        "url": "https://www.indeed.ca/rc/clk?jk=e9b56301c10bbbc4&from=jasx&tk=1hbkvuh1oj32s803&vjs=3",
        "externalApplyLink": "https://careers.asq.org/jobs/19066786/postdoctoral-research-fellow-cardiac-rehabilitation?utm_source=Indeed&utm_medium=organic&utm_campaign=Indeed",
        "companyDescription": "",
        "description": "Details\n    \n   Posted: 28-Aug-23 \n   Location: ottawa, Ontario, Canada \n   Type: Fellowship \n   \n   Sector: \n   \n    Hospital, Public and Private\n    \n   \n   Salary Details: \n   \n    $50,000 - $60,000\n    \n   \n   Additional Information: \n   \n    2 openings available.\n    \n  \n \n \n \n  Internal Number: 1 \n \n POSTDOCTORAL FELLOW \n Division of Cardiac Prevention & Rehabilitation \n Cardiac Rehabilitation \n Exercise Physiology and Cardiovascular Health Lab \n University of Ottawa Heart Institute\n  \n The University of Ottawa Heart Institute is Canada's largest and foremost cardiovascular health centre dedicated to understanding, treating, and preventing heart disease. The Division of Cardiac Prevention & Rehabilitation has a unique array of initiatives and programs, with a particular emphasis on innovative approaches to preventing (primary and secondary) and managing cardiovascular disease. The Division is home to our Cardiac Rehabilitation program, one of the largest in Canada, and the Exercise Physiology and Cardiovascular Health Lab. \n This fellowship affords the opportunity to acquire and contribute knowledge to the areas of cardiovascular rehabilitation, clinical exercise physiology, big data, and clinical trial conduct and management. Some of the current research projects include: (1) OPPORTUNITY – an RCT investigating the impact of different forms of exercise training in patients with atrial fibrillation; (2) CANSURVEY-AF – a multi-site observational cohort study examining the physical activity levels of patients with atrial fibrillation; (3) EXCEED – an RCT examining the effects of exercise programs delivered virtually in women with cardiovascular disease; and, (4) various projects examining practical approaches to prescribing physical activity and monitoring exercise intensity in patients with cardiovascular disease, with a focus on sex and gender differences. \n The selected candidate will be expected to lead a large-scale / big-data evaluation of cardiac rehabilitation programming to advance quality of care, closely collaborating with scientists and healthcare professionals to develop and apply advanced data science methodologies. Access to several large integrated clinical and research databases spanning 15+ years is available and will serve as the foundation for publication and presentation opportunities. The fellowship also offers the opportunity to enhance and develop clinical exercise physiology / kinesiology skills (e.g., leading exercise training sessions, cardiopulmonary exercise testing, functional capacity testing) in patients with a range of cardiovascular conditions including, but not limited to, atrial fibrillation, coronary artery disease, heart failure (if the candidate possesses the minimum required education and qualifications, see below). \n It is expected that the successful candidate will assume responsibility for the preparation and publication of manuscripts and assist with the submission of research grant applications. The fellow will also participate in training and educational activities (e.g., Grand Rounds, Cardiac Rehabilitation Rounds, Work-in-Progress Rounds, conferences), and may obtain additional support from our Research Services Department, medical librarian, and Cardiovascular Methods Centre. \n The successful candidate will possess: \n \n  D. degree in a data science (statistics/computer science/engineering) or health-related (exercise physiology/kinesiology preferred, epidemiology) field, or M.D. degree. \n  Kin, ACSM RCEP, CSEP CEP, or equivalent (preferred if contributing to clinical exercise physiology / kinesiology activities). \n  A strong understanding of clinical research design, research methodology, and data analysis. \n  Advanced statistical training and knowledge of statistical software packages. \n  Demonstrated experience programming in statistical software (e.g., SPSS, SAS, R, Python). \n  Evidence of experience in the preparation and publication of manuscripts. \n  Excellent oral communication and technical writing skills in English. \n  The ability to take guided initiatives and to work in an organized fashion within a fast-paced research environment, including flexibility in shifting between independent and collaborative work. \n  The ability to work collegially in an exciting and dynamic research environment.\n \n  \n \n The position is a two-year fellowship with the possibility of a 1-year renewal contingent on performance and funding. Up to two positions may be available. While funding for this position(s) has been secured through the University of Ottawa Heart Institute Foundation (Jan & Ian Craig Fellowship), the Canadian Institutes of Health Research, and the Heart and Stroke Foundation of Canada, successful applicants will be encouraged to apply for independent postdoctoral fellowships. Please send a letter of application including a 1-2 page description of research experience and interests, updated curriculum vitae, and names & contact information of three referees to Dr. Jennifer Reed, jreed@ottawaheart.ca (video and audio recordings of the application package are also acceptable). Applicants are encouraged to prepare their application materials following DORA guidelines to define their research contributions. A description of any barriers that may have limited their research contributions to date are encouraged. Applications are encouraged to reach out should they have questions regarding the application requirements. Applications will be reviewed as received.\n  \n We are committed to a continued focus on equitable hiring, training, operations, and policies. We don’t just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our research and clinical programs. \n \n The successful candidate will possess: \n \n  D. degree in a data science (statistics/computer science/engineering) or health-related (exercise physiology/kinesiology preferred, epidemiology) field, or M.D. degree. \n  Kin, ACSM RCEP, CSEP CEP, or equivalent (preferred if contributing to clinical exercise physiology / kinesiology activities). \n  A strong understanding of clinical research design, research methodology, and data analysis. \n  Advanced statistical training and knowledge of statistical software packages. \n  Demonstrated experience programming in statistical software (e.g., SPSS, SAS, R, Python). \n  Evidence of experience in the preparation and publication of manuscripts. \n  Excellent oral communication and technical writing skills in English. \n  The ability to take guided initiatives and to work in an organized fashion within a fast-paced research environment, including flexibility in shifting between independent and collaborative work. \n  The ability to work collegially in an exciting and dynamic research environment."
    },
    {
        "id": "41c27771621d4f3d",
        "company": "Satcom Direct",
        "positionName": "Winter Term Co-op - Quality Assurance Test Automation Engineer",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:49:23.362Z",
        "url": "https://www.indeed.ca/rc/clk?jk=41c27771621d4f3d&from=jasx&tk=1hbkvuh1oj32s803&vjs=3",
        "externalApplyLink": "https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html?cid=fcc14518-cc1c-4e96-be30-c26622eabb9a&ccId=19000101_000001&jobId=465217&source=IN&lang=fr_CA&ittk=T54NHHJ4BN",
        "companyDescription": "",
        "description": "COMPANY OVERVIEW:\n  \n   Satcom Direct (SD) provides global connectivity solutions for business and general aviation, military, government, and land mobile services. Since 1997, SD has worked to solve the unsolvable and advance the technology of connectivity through our industry-leading hardware and flight operations software. Our company culture is based on innovation and creativity which allows our team members to thrive in a dynamic atmosphere. We are looking for people who are passionate about customer satisfaction and who excel in a constantly changing environment.\n   SD Avionics is a division of Satcom Direct located in Kanata, the high-tech hub of Ottawa, Ontario. Our second largest site globally, this location manufactures avionics hardware, cabin routers, and the SD Plane Simple Antenna System.\n   Satcom Direct offers an on-site gym and robust vacation time to have an excellent work/life balance.\n   JOB SUMMARY:\n   Consistently exemplifies the Satcom Direct (SD) mission, vision, and values focused around a philosophy directed toward customer service/satisfaction, job performance, and cooperative team interactions. Willingness to support organizational policies that foster \"continuous improvement\" activities, promote Satcom Direct's ongoing strategic growth plan, and maintain its position as the premier leader within the Aviation Satellite Communications industry.\n   SD is recruiting for a Co-op student to fulfill a role of a Quality Assurance (QA) Test Automation Professional. The primary focus of this role will be building and augmenting the automated test infrastructure for our tactical communications and satellite communication systems.\n   ESSENTIAL DUTIES/RESPONSIBILITIES:\n   To perform the job successfully, an individual must be able to perform each essential duty satisfactorily and should demonstrate the following competencies to consistently execute the functions of this position. All employees are expected to adhere to and be knowledgeable of Satcom Direct (SD) operations standards, established safety/security rules, and requirements for company work guidelines.\n   Main Responsibilities:\n  \n    Create and apply test strategies that deliver high-quality software and hardware products.\n    Use your software development skills to develop tools, test frameworks, and automation for the system under test\n    Analyze product requirements and define technical test cases\n    Collaborate with members from QA, SW, HW, Systems, Support, and Product Management\n    Continuous communication with our tight-knit development teams\n    Ability to work productively alone and in a team.\n    Ability to be proactive and work effectively with little direct supervision.\n    Support day-to-day Test efforts in the Lab and in the field.\n  \n   GENERAL QUALIFICATIONS, KNOWLEDGE, AND EXPERIENCE:\n   To perform this job successfully, an individual must be able to meet the minimum qualifications established for education, knowledge, and skills in order to be effective. The requirements listed below are representative of the traits required for the position:\n  \n    Coding in any of Python, C/C++, scripting\n    Familiarity with the Atlassian tools (JIRA, Confluence) and Git source control\n    Use of Linux\n    Basic IP networking knowledge and experience (function of switches, routers etc....)\n    “Hands-on” IT ability, i.e., able to setup small ad-hoc IP networks and install operating systems\n    Ability to document software designs\n    Experience in the use of test frameworks and unit tests in the testing of systems or software components (such as API’s or Libraries)\n  \n   PHYSICAL DEMANDS:\n   While performing general office duties for this position, the employee is regularly required to sit, stand and/or walk around (including the use of stairs). Other demands include the ability to openly communicate with others by talking, listening, and reading, able to lift light objects (<25lbs), and use standard office equipment such as computer, printer, phone and cell phone. In addition, there is an occasional need to bend, twist or stoop in order to open/close cabinets, reach for files or other standard office type objects.\n   WORK ENVIRONMENT:\n   The office environment is generally quiet and, in a temperature, controlled setting with random adjustments in noise or temperature due to others talking or laughing loudly, unscheduled maintenance repairs to the building or its interior offices or unpredictable situations due to weather or other acts beyond company control. An employee must be willing to work their regularly assigned work schedule for their particular duties and/or job responsibilities and in times of need, be able to work an extended schedule depending on company/department needs, project requirements or customer demands. Work may require some physical effort in the handling of light materials, boxes or equipment. The temperature at client locations can vary from controlled to variations off hot/cold when working, standing or walking in or near the flight-line or maintenance repair center.\n   If you are interested in applying for employment and need special assistance or an accommodation to apply for a posted position, contact our Human Resources department at (321) 777-3000\n   SD Avionics is committed to hiring the most qualified candidates for approved company positions, without preference to any individual on the basis of race, color, age, religion, gender, sexual orientation, disability, or national origin. Our policy is to engage in recruitment and selection practices that are in compliance with all applicable national or local employment laws. SD Avionics and its various international entities follow talent acquisition practices that identify qualified and diverse candidates, promote opportunities for employee development, and provide equal employment opportunity for all applicants and employees. SD Avionics promotes equity in employment: As an equal opportunity employer, we welcome applications from women, Indigenous peoples, persons with disabilities and members of visible minorities."
    },
    {
        "id": "b3aa354188da1fd5",
        "company": "Merrick & Company",
        "positionName": "Electrical Engineer III – Life Science",
        "jobType": [],
        "location": "580 Terry Fox Drive, Kanata, ON",
        "salary": null,
        "postingDateParsed": "2023-09-07T06:49:33.154Z",
        "url": "https://www.indeed.ca/rc/clk?jk=b3aa354188da1fd5&from=jasx&tk=1hbkvuh1oj32s803&vjs=3",
        "externalApplyLink": "https://careers.merrick.com/careers-home/jobs/5628/job?utm_source=indeed_integration&iis=Job%20Board&iisn=Indeed&indeed-apply-token=73a2d2b2a8d6d5c0a62696875eaebd669103652d3f0c2cd5445d3e66b1592b0f&mode=job",
        "companyDescription": "",
        "description": "Overview: \n \n   Merrick and Company is a nationally known multi-office and multi-discipline firm consisting of a diverse, dedicated and talented staff which has achieved design excellence throughout its 60+ years of existence. With offices worldwide, Merrick and Company has been ranked as one of the top 100 design firms by Engineering News Record. Merrick provides personalized services to various clients throughout the world. We are seeking an experienced Laboratory / Facility Electrical Engineer for our Life Sciences business unit in our Kanata office.\n \n \n   Candidates that have a desire for personal and professional growth, a well-defined understanding of design and construction document processes, and adaptability for short term and long-term projects in an environment that requires a blend of creativity and high technical skills. Successful candidates must be self-starting, motivated, innovative, articulate, self-disciplined, and confident in a demanding, exciting and fast-paced environment. This position requires a competent professional engineer who will be responsible for all phases of engineering production and BIM for a variety of work ranging from programming through construction administration. This includes interpreting, organizing, executing and coordinating the design and production effort for one or more large or complex projects.\n \n \n \n   Job Description\n \n \n   Design of electrical systems for facilities / laboratories for Government, University, and private clients.\n   Provide conceptual / detailed design and analysis for facility power distribution (600V), site power distribution (15kV), emergency power generation, grounding and lightning protection, lighting design, telecommunications (voice/data), fire alarm / mass notification, security, access control, and special systems.\n   Provide supporting documentation such as calculations, reports, and specifications.\n   This individual is expected to possess extensive knowledge on electrical regulatory codes.\n   Meet with clients to prepare and/or validate proposed scope of work.\n   Prepare fee proposals for engineering design work.\n   Work with other disciplines to ensure accuracy of the package, meet schedule, and budget commitments and meet expectations for attendance and punctuality.\n   Ability to communicate clearly and concisely; both verbally and in writing\n   Ability to work effectively within a collaborative team environment\n   Ability to complete tasks with accuracy and with strong attention to detail\n   Ability to consistently meet deadlines, completing tasks as previously defined\n   Ability to travel as needed.\n   Ability to write and edit specifications\n   Work in a design team environment, including directing and mentoring the work of junior engineers and designers, and delegating work as required as well as provide management of the local team.\n   Capable of performing all of the above with minimal direction\n   An agreed upon hybrid schedule, working from both home and office, is available to employees in good standing.\n \n \n   Required Experience\n \n \n   Eight (8) years of experience in facility Electrical Engineering design\n   Professional Engineer (P.E.) license is required\n   Minimum four (4) years of experience using REVIT/AutoCAD or other design software-based drawing generation\n   Experience using electrical calculation tools is desired, including lighting and power software such as AGi32, Elum Tools, SKM Power Tools, ETAP, and EasyPower.\n   Proficient using Microsoft Office Excel & Word\n   Experience with technical codes such as NEC, NESC, NFPA, IEEE is required\n   Experience with USDA, ARS, CDC and other laboratory clients is highly desired\n   Client projects for this position require Canadian Citizenship.\n   Local candidates are preferred.\n \n \n   Physical Requirements\n \n \n   Requires the ability to sit for extended periods at a computer workstation.\n   Be able to work in an environment with open discussions and visitors without getting distracted.\n   May be required to lift up to 20 lbs.\n   Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n   Meets expectations for attendance and punctuality.\n   The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.\n \n  Additional information:\n \n   Apply online only. No e-mail, hard copy or third-party resumes accepted.\n   Merrick & Company offers a competitive compensation and benefits package which includes RRSP, and unique work-life benefits.\n   We recognize the importance of developing top talent from within, our employees have access to a wide range of internal and external training and coaching programs and are rewarded for their achievements through excellent benefits and competitive salaries.\n   Merrick & Company is an Equal Opportunity Employer, including disability/vets."
    },
    {
        "id": "f777eb65db7af033",
        "company": "Oxford Learning Centres, Inc.",
        "positionName": "Math & Science Tutor/Teacher",
        "jobType": [],
        "location": "3619 Innes Road, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-09T06:49:31.408Z",
        "url": "https://www.indeed.ca/rc/clk?jk=f777eb65db7af033&from=jasx&tk=1hbkvuh1oj32s803&vjs=3",
        "externalApplyLink": "https://oxfordlearning.talentnest.com/en/posting/163464/location/197584?source=indeed",
        "companyDescription": "",
        "description": "High School Math/Science Teacher/Tutor Wanted \n  Motivated by mathematics? Sharp with science? Excited by equations in both fields? Eager to help students succeed in math and science? \n  Our hours count! Gain valuable teaching experience! Oxford Learning Orleans is currently seeking part-time teacher-tutors for a role in our learning centre. This position is perfect for anyone who loves working with students, enjoys numbers and equations, and is passionate about helping others build their skills in these areas. \n  Teacher-Tutors at Oxford Learning do not have to lesson plan before class, as all lessons are pre-planned. Applicants will be fully trained in our proprietary philosophy and methods. \n  Position Requirements \n  All Teacher-Tutors at Oxford Learning work during after-school and evening hours (4:00pm - 8:00pm) as well as some Saturdays (9:00am - 3:00pm). A commitment until the end of the school year is preferred. Continuing through the summer is even better. Your students will love working with you, and being reliable is a must. \n  This role is in-person. You must be able to commute to this location. This is not an online position. Relocation packages are not offered. Vulnerable sector screening is mandatory. \n  We encourage you to apply if you have the majority of the following requirements: \n  Education: \n  \n  Bachelor’s degree or similar certification in a relevant field \n  University students with extensive tutoring experience will be considered \n  Teaching certification an asset \n  Good knowledge of the current Grades 9-12 math and science curriculum, particularly senior math and including, but not limited to, Advanced Functions, Algebra, Trigonometry and Calculus, and Vectors, Physics, Chemistry, and Biology. \n  French is an asset but not required \n  \n Experience: \n  \n  Some experience teaching/tutoring math and science at a Grade 9 to 12 (or equivalent) level \n  Strong English written and oral communication skills \n  Strong math skills and ability to guide students’ understanding \n  Ability to multitask and balance working with up to three students at a time \n  \n Responsibilities (Position Details) \n  You will work directly with students as an Interactive Coach with the following responsibilities: \n  \n  Teaching up to 3 students at a time at different levels \n  Teaching online and in-person \n  Following the Oxford Learning methodologies and philosophies \n  Filling in post-lesson notes \n  Completing daily student communication updates \n  Maintaining a friendly and professional manner at all times \n  \n Smiles, High-Fives & Happy Students \n  In this position, you will play a key role in helping students develop their self-confidence and self-esteem. The rewards of helping children overcome academic hurdles and realize their inner potential can be very fulfilling. You will be rewarded with smiling faces and high-fives during every shift. Other rewards of the role include: \n  \n  fun staff events \n  ongoing training opportunities \n  frequent check-ins and feedback \n  company growth opportunities \n  hands-on development of your teaching skills \n  \n Job Type: Part-time \n  Hourly Rate: $17 - $19 / hour \n  Schedule: \n  \n  Evenings \n  Monday to Thursday \n  Saturday availability \n  \n About Oxford Learning \n  Oxford Learning is a Canadian supplemental education provider helping students get better grades since 1984. Offering a full range of programs for students of all ages and abilities, Oxford Learning uses the science of cognitive learning to help all students develop stronger learning skills they can rely on for life! \n  Are you the superstar teacher-tutor we have been searching for? Apply now! \n  Oxford Learning Orleans \n  3619 Innes Rd., Ottawa, ON \n  Tel: (613) 841-7321 \n  We thank all applicants for their interest in joining the team at Oxford Learning Orleans. However, only those selected for the interview process will be contacted."
    },
    {
        "id": "396c1a4303f522e5",
        "company": "MicroDental Laboratories",
        "positionName": "Dental Lab Technician-Metal Finisher",
        "jobType": [],
        "location": "1956 Robertson Rd, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-13T06:49:41.304Z",
        "url": "https://www.indeed.ca/rc/clk?jk=396c1a4303f522e5&from=jasx&tk=1hbkvuh1oj32s803&vjs=3",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "MicroDental Laboratories is a world-class, rapidly growing, global company with strong benefit packages and great long-term stability. We operate in over 25 locations in North America as both MicroDental Laboratories and Modern Dental Laboratory USA. With our focus on Quality, Value, and Legendary Customer Care, our Centers are devoted to building strong and lasting relationships with our dentists and their team members. We are looking for a determined, high energy, well organized Metal Finisher to join our team in Ottawa, ON Canada.\n*Qualified candidates with 5+ years of relevant experience are eligible for a sign on bonus of $1000 CAD, after 120 days of continuous employment.*\nOur Company has the following to offer:\n\n Excellent compensation plan with benefits including medical, dental, vacation and holidays\n Flexible working hours\n Career advancement opportunities\n Investments in the latest technology\n Exclusively focused in cosmetic, implant and digital design for fixed prosthodontics\n\nPrimary Responsibilities & Skills:\n\n Prepare metal surfaces for bonding with porcelain to create artificial teeth, using small hand tools.\n Remove excess metal or porcelain, and polish surfaces of prostheses or frameworks, using polishing machines.\n Have the ability to wax, contour, and finish gold crowns\n Can sit and comfortably work on large bridge frame to ensuring proper seating and no rocking\n Wax, spew and invest metal frameworks\n Divest metal from cast rings\n All other duties as assigned or as otherwise required\n\nQualifications:\n\n Knowledge of dental lab products, materials, terminology, and techniques preferred\n Previous experience in relevant field with a good productive mindset and skillset\n Background or foreknowledge of dental implants\n High level of attention to detail with exceptional quality standards\n Strong communication skills\n Excellent hand/eye coordination\n Ability to utilize magnification goggles for extended periods of time\n Team player is a must with a willingness to learn new responsibilities\n High School diploma or equivalent required\n\nMicroDental Laboratories and Modern Dental Laboratory USA are proud to be an Equal Opportunity/Affirmative Action employer. We recruit qualified applicants without regard to race, color, religion, gender, age, ethnic or national origin, veteran status, physical or mental disability, genetic information, sexual orientation or preference, gender identity, marital status, or citizenship status.\nJob Type: Full-time\nBenefits:\n\n Dental care\n Extended health care\n Paid time off\n Vision care\n\nSchedule:\n\n 8 hour shift\n Monday to Friday\n\nSupplemental pay types:\n\n Signing bonus\n\nAbility to commute/relocate:\n\n Ottawa, ON K2H 5B9: reliably commute or plan to relocate before starting work (preferred)\n\nApplication question(s):\n\n What are your salary expectations?\n\nExperience:\n\n dental laboratory: 1 year (preferred)\n\nWork Location: In person"
    },
    {
        "id": "fc3eb154c0b96009",
        "company": "Ciena",
        "positionName": "QA Automation Developer Co-op (Winter 2024)",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-07T06:49:40.825Z",
        "url": "https://www.indeed.ca/rc/clk?jk=fc3eb154c0b96009&from=jasx&tk=1hbkvuh1oj32s803&vjs=3",
        "externalApplyLink": "https://careers.ciena.com/us/en/job/CIENUSR023271ENUS/QA-Automation-Developer-Co-op-Winter-2024?utm_source=indeed&utm_medium=phenom-feeds",
        "companyDescription": "",
        "description": "Ciena is committed to our people-first philosophy. Our teams enjoy a culture focused on prioritizing a personalized and flexible work environment that empowers an individual’s passions, growth, wellbeing and belonging. We’re a technology company that leads with our humanity—driving our business priorities alongside meaningful social, community, and societal impact. \n \n Why Ciena?\n \n   We’re a company rooted in people—seeking to create a vibrant and inclusive environment, where everyone feels they can belong.\n   Accelerate your career path by gaining hands-on experience and exposure to the latest technology. Our interns and graduates work on real projects in real time in world class labs. Be a part of tomorrow’s future – today.\n \n \n   Mentoring. Networking. Leadership Opportunities. We recognize that the learning doesn’t stop when you leave school - we champion a team environment for development and provide the tools to achieve success.\n   We are big proponents of life-work integration. Our people make a big difference at Ciena, but we want to shine light on their differences outside of working hours too. CienaCares supports non-profit causes important to employees by matching employee financial contributions and dedicating time for volunteering.\n \n \n  The Opportunity:\n  8 month work term: January – August 2024\n \n  How You Will Contribute:\n \n  Ciena’s Management, Control and Plan (MCP) Applications is a next generation Network Management solution for IP, Packet, and Optical networks. Based on microservices architecture, MCP Applications helps Network operators plan, provision, and troubleshoot multi-layer networks quickly using a highly intuitive user interface in addition to available open REST APIs. As a QA Automation developer, you will:\n \n   Create REST API automation using postman/JavaScript and\n   Maintain automation builds on CI/CD platform (TeamCity).\n   Work closely with our team of developers QA Engineers to design, develop, execute, and maintain automated test scripts\n \n  What Does Ciena Expect of You? \n \n  A sense of urgency – what’s important to the customer is equally important to you. You make getting things done a priority.\n   Integrity – you hold yourself to the highest level of personal and professional standards of conduct.\n   A commitment to innovation – you continually seek to learn, understand new technologies and ever-changing market conditions, and endeavor to apply that knowledge to Ciena’s advantage. \n  You embrace change – thriving in a diverse environment of ever-changing priorities and sometimes stressful situations.\n   The flexibility to work independently with minimal supervision as well as part of a broader team.\n \n \n  The Must Haves:\n \n   Software programming experience in JavaScript\n   Experience with Postman\n   Understanding of REST APIs, JSON, and XML\n   Understanding of Windows, UNIX Operating systems\n   Knowledge of basic Linux commands\n   Enthusiasm for Automation development and willingness to learn\n   Ability to estimate, prioritize, plan, and coordinate testing activities within the Development Team\n \n  Assets:\n \n   Familiarity with Agile Scrum, Agile JIRA, Bitbucket and TeamCity\n \n  Experience with web services and API testing; experience testing microservices is a plus\n \n  At Ciena, we are committed to building and fostering an environment in which our employees feel respected, valued, and heard. Ciena values the diversity of its workforce and respects its employees as individuals. We do not tolerate any form of discrimination.\n \n  If contacted in relation to a job opportunity, please advise Ciena of any accommodation measures you may require."
    },
    {
        "id": "b343c3ceeec09214",
        "company": "Kinaxis",
        "positionName": "UX Research Intern",
        "jobType": [],
        "location": "3199 Palladium Dr, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-15T06:49:48.563Z",
        "url": "https://www.indeed.ca/rc/clk?jk=b343c3ceeec09214&from=jasx&tk=1hbkvuh1oj32s803&vjs=3",
        "externalApplyLink": "https://boards.greenhouse.io/kinaxis/jobs/6933144002?source=Indeed",
        "companyDescription": "",
        "description": "At Kinaxis, who we are is grounded in our common belief that people matter. Each one of us plays an important part in accomplishing our work, building our culture and making a global impact. \n   Every day, we’re empowered to work together to help our customers make fast, confident planning decisions. This is how we create a better planet – for each other, for our customers and for generations to come. Our cloud-based platform RapidResponse ensures that the products we need – everything from medicine and cars, to day-to-day items like toothpaste – make it to market and into our hands when we need them with minimal ecological footprint. \n   We make the world better, and you can too.\n  \n UX Research Intern \n  Job location: our office in Ottawa, Canada (preferred) or Remote; Canada (EST Time Zone) \n  Term length: 12 months starting January 2024 \n  About the Team \n  The UX team at Kinaxis is transforming the user experience of our product, RapidResponse. You’ll be integrated right into the UX team and treated like a permanent employee. You’ll work closely with developers, product managers, designers and other researchers on exciting and challenging research projects. You’ll have the opportunity to experiment, learn new skills and gain valuable real-world experience. \n  What you will do \n  Help broaden and accelerate UX research & testing at Kinaxis: \n  \n  Create and execute usability tests \n  \n   Work with UX designers to identify what to test (e.g. areas of risk or uncertainty). \n   Write study protocols. \n   Schedule and conduct moderated usability tests AND/OR prepare and execute unmoderated tests. \n   Analyze results. \n   Summarize and present findings. \n  \n  Support research activities \n  \n   Schedule and conduct interviews with users. \n   Create surveys. \n   Analyze results. \n   Summarize and present findings. \n  \n  Use Alchemer to create surveys. \n  Use Condens to analyze data and write reports. \n  Use Miro for collaborative story-mapping, brainstorming, and early concept generation. \n  Use Figma to collaborate on hi-fidelity visual designs and prototypes. \n  May perform additional projects as assigned. \n \n What we are looking for \n \n  An education in user experience research, psychology (experimental, social, cognitive), sociology, anthropology, human computer interaction, human factors, or a related field. \n  Demonstrable research expertise \n  Strong communication skills, team-orientation and are responsive to feedback. \n  Curiosity, empathy and attention to detail \n  A strong desire to create great products, and a motivation to keep learning and improving. \n \n \n  What we have to offer \n  \n   Challenging Work - We love solving highly complex problems. And as the global leaders in our industry, we never stop innovating—our work is never “done. That’s because across our teams and in all roles, every employee is empowered to bring their best ideas forward and to jump in and solve the problems they’re passionate about. \n   Great People - We take our work seriously, but we don’t take ourselves too seriously! It’s in our DNA to celebrate, laugh, and have fun. We are stronger, together, when we are open, honest, and above all, real. Every person is valued here and plays an important role in our shared success. \n   Global Impact - As a global team spanning continents, boundaries, and cultures, every day we are inspired by the impact our work has on our colleagues, our customers, our communities, and the world at large. \n   Diversity, Equity and Inclusion - Diversity, equity and inclusion are more than words to us. They are the guiding principles for building a culture where we celebrate each others’ differences, continuously strive for equality and recognize that inclusion makes us stronger as individuals, a company and a global citizen. \n   \n  For more information, visit the Kinaxis web site at www.kinaxis.com or the company’s blog at http://blog.kinaxis.com/. \n   Kinaxis strongly encourages diverse candidates to apply to our welcoming community. We strive to make our website and application process accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact us at recruitmentprograms@kinaxis.com. This contact information is for accessibility requests only and cannot be used to inquire about the status of applications."
    },
    {
        "id": "cd83ab8fee21d003",
        "company": "LifeLabs",
        "positionName": "Lab Patient Technician",
        "jobType": [],
        "location": "139 Greenbank Road, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-16T06:49:46.872Z",
        "url": "https://www.indeed.ca/rc/clk?jk=cd83ab8fee21d003&from=jasx&tk=1hbkvuh1oj32s803&vjs=3",
        "externalApplyLink": "https://jobs.lifelabs.com/job/Ottawa-Lab-Patient-Technician-ON/1076583500/?feedId=281500&utm_source=Indeed&utm_campaign=LifeLabs_Indeed&jobPipeline=Indeed",
        "companyDescription": "",
        "description": "LifeLabs is the largest community diagnostics laboratory in Canada, serving the healthcare needs of Canadians for over 50 years. Our team members are truly centred around our customers, and we know that behind every lab requisition, sample being tested, or investment in technology is an individual and their family counting on us. \n Consistently named one of Canada's Best Employers by Forbes, LifeLabs has also been recognized for having an award-winning Mental Health Program from Benefits Canada. The passion and commitment of over 6,000 diverse and innovative team members unites and motivates us to ensure our customers receive high quality tests and results that they can trust. Agile, customer-centred, caring and teamwork: we live these values every day in what we do to support our customers and healthcare providers, driving forward our vision of empowering a healthier you.\n  Make a difference – join the LifeLabs team today!\n \n  As a Lab Patient Technician, you will be responsible for the specimen collection process, from greeting patients through to preparation of specimens for transportation. This is an important role in patient care and our business and will let you see the difference that you make in patients’ lives.\n \n  This is a Part-Time position at 139 Greenbank Road, Ottawa, ON.\n \n  The successful candidate will support at the Greenbank site and the Centre point site weekdays and may occasionally be scheduled on Saturday mornings at the Carling site.\n  In this role you will:\n  \n \n   Greet and request required information from patients, explain the specimen collection process, and ensure patients have followed necessary test protocol prior to specimen collection.\n   Perform phlebotomies, connect/disconnect Holter monitors, and perform ECG tracings.\n   Perform special test collections, such as medical/legal drug screens, paternity tests, and clinical trials, and complete related documentation.\n   Maintain client relationships, including responding to inquiries and following up on requests.\n   Complete data entry of required patient demographics, requisition information, and other information related to processing test results.\n   Prepare specimens for transportation and testing.\n \n \n  The right person for this role will be focused on great customer/patient service and be able to relate to patients and clients even in stressful situations. Some key qualities include empathy, flexibility, adaptability to change, and problem-solving skills. Other requirements include\n  \n \n   Graduate of an approved Laboratory Assistant program or equivalent.\n   Phlebotomy experience.\n   Excellent communication skills.\n   Good computer skills with a minimum typing speed of 40 wpm.\n   Ability to maintain the strictest standards of patient privacy and confidentiality.\n \n  We are looking for passionate individuals who share in the importance of our values: Caring, Customer Driven, Agile and One Team and can live these values with us every day.\n \n  Ready to make a difference? Apply today.\n \n  At LifeLabs, we strive to create an inclusive and equitable workplace where our team members and the communities we serve feel accepted, valued, and respected.\n  In accordance with LifeLabs’ Accessibility Policy, the Accessibility for Ontarians with Disabilities Act, and the Ontario Human Rights Code, accommodations are available by request for candidates taking part in all aspects of the recruitment and selection process. For a confidential inquiry or to request an accommodation, please contact your recruiter or email careers@lifelabs.com. \n LifeLabs is committed to providing a safe environment for our employees, customers, and the communities we serve. We have been a leader throughout the COVID-19 pandemic regarding health and safety measures and have always put our employees and customers at the center of every decision that we make. As an organization in the health care sector, we believe the COVID vaccination adds a layer of protection that complements the extensive and necessary health and safety protocols that we have taken to date. With this in mind, we currently require all LifeLabs employees, contractors, students and volunteers to be fully vaccinated. \n LifeLabs operates under a distributed workforce model, where employee flexibility is a key priority. Further information will be provided during the interview process on what this means for employees."
    },
    {
        "id": "d2550197ced40f5c",
        "company": "BWX Technologies",
        "positionName": "Quality Control Technician",
        "jobType": [],
        "location": "447 March Road, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-06T06:49:44.941Z",
        "url": "https://www.indeed.ca/rc/clk?jk=d2550197ced40f5c&from=jasx&tk=1hbkvuh1oj32s803&vjs=3",
        "externalApplyLink": "https://careers.bwxt.com/job/Ottawa-Quality-Control-Technician-ON/1067395300/?jobPipeline=Indeed",
        "companyDescription": "",
        "description": "BWXT Medical Ltd. provides its customers, who conduct life-saving medical procedures for patients around the world, the benefit of decades of experience in the development, manufacturing, packaging and delivery of medical isotopes and radiopharmaceuticals. Headquartered in Kanata, Ontario, BWXT Medical Ltd. employs over 300 highly-skilled people in Kanata and Vancouver, British Columbia. BWXT Medical Ltd. is part of the BWXT nuclear power segment (NPG) of BWX Technologies, Inc.\n  \n  \n \n \n  BWXT Medical Ltd., is hiring an \n  Quality Control Technician who has at least 2-years experience in chemistry and microbiology. This position is located at our production facility in Kanata, ON.\n  \n \n \n  Job Summary:\n  \n \n  Reporting to the Manager, Quality Assurance, the Quality Control Technician will perform quality control analyses of raw materials to finished product. \n  \n \n \n  Responsibilities:\n  \n \n  \n   \n    Perform quality control analysis of raw materials and final product.\n    \n  \n   \n    Perform routine monitoring of controlled systems and facilities.\n    \n  \n   \n    Perform specific administrative duties such as maintaining accurate records of observations, results and data evaluations. \n   \n  \n   \n    Follow ongoing production processes for conformance to operating procedures, product specification, GMP regulations and ISO standards.\n    \n \n \n \n  Qualifications:\n  \n \n  \n   \n    Technologist Diploma (3 yrs) or B.Sc. in a science discipline plus 2-5 years of relevant experience in chemistry or microbiology.\n    \n  \n   \n    Must possess excellent communication skills - both oral and written.\n    \n  \n   \n    Must possess excellent interpersonal skills.\n    \n  \n   \n    Must be able to perform in a team environment and be a dedicated team player. \n   \n  \n   \n    Must be able to work a variety of shifts as per the collective agreement, which includes regular scheduled weekend shifts.\n    \n \n \n \n  Other:\n  \n \n  This position is classified as a Nuclear Energy Worker. \n \n \n Why join BWXT Medical? \n \n  \n   \n    Work within the growing and exciting nuclear medicine industry as well as with highly skilled employees.\n    \n  \n   \n    Competitive salaries.\n    \n  \n   \n    Company match pension plan.\n    \n  \n   \n    Comprehensive health and dental benefits.\n    \n  \n   \n    Education Reimbursement Program.\n    \n  \n   \n    Life insurance.\n    \n  \n   \n    Collaborative work environment... and so much more!\n    \n \n \n BWXT Medical Ltd. embraces diversity of thought, values individuality, encourages new perspectives and provides equal opportunity in employment for all qualified employees and applicants without regard to race, national or ethnic origin, colour, religion, age, sex, sexual orientation, marital status, family status, disability, a conviction for which a pardon has been granted or a record suspended or any other category protected by federal law."
    },
    {
        "id": "43afb68db10ab985",
        "company": "NOKIA",
        "positionName": "IP R&D Lab Technologist Co-op/Intern",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-15T06:49:46.571Z",
        "url": "https://www.indeed.ca/rc/clk?jk=43afb68db10ab985&from=jasx&tk=1hbkvuh1oj32s803&vjs=3",
        "externalApplyLink": "https://careers.nokia.com/jobs/ip-r-d-lab-technologist-co-op-intern-102008?src=JB-10760",
        "companyDescription": "",
        "description": "Position: IP R&D Lab Technologist Co-op/Intern\n    Duration: 3 months+\n    Date: January 8th to April 26th, 2024\n    Location: Onsite\n  \n \n \n   \n   \n  \n \n \n  \n   Come create the technology that helps the world act together\n  \n   \n  \n \n  We are a B2B technology innovation leader pioneering the future where networks meet cloud. At Nokia, you will have a positive impact on people’s lives and help build the capabilities needed for a more productive, sustainable, and accessible world. \n   Be part of a culture built on an inclusive way of working where we are open to your ideas, you are empowered to take risks, and are encouraged to be fearless in bringing your authentic self to work.\n \n \n   \n  \n    \n    \n   The team you'll be part of\n   \n  \n \n  \n   Network Infrastructure\n   \n  \n \n  \n   The pandemic has highlighted how important telecoms networks are to society. Nokia’s Network Infrastructure group is at the heart of a revolution to bring more and faster network capacity to people worldwide through our ambition, innovation, and technical expertise.\n  \n \n \n   \n   \n  \n \n \n  \n   Education Recommendations\n  \n \n  \n  \n  \n    Currently a 2nd-year candidate for a bachelor’s degree or diploma in Computer Networking or a related field with an accredited school in Canada.\n  \n \n \n   \n   \n  \n \n \n  \n   What you will learn and contribute to\n   \n  \n \n  \n   As part of our team, you will:\n   \n   \n   A central tool for inventory tracking OTS (serial numbers, loaned equipment, repairs, etc.) \n   Manage upgrades, and repairs (do some simple repairs; tracking what's out for repairs) \n   Proper storage and ESD \n   Deal with new equipment \n   Build custom PCs, install CentOS, and create Linux servers \n   Cabling and building basic topologies \n   Troubleshoot various issues with network and equipment \n   Configuring terminal servers, APCs, and cabling topologies for testbeds/infrastructure \n   Sniff the network to keep it running well. Find inefficiencies/problems and fix them. \n   Keep benches, cabling, etc. neat and clean. \n   Maintain a web page with troubleshooting tips, procedures \n   Find/implement ways to improve the lab \n   Monitor the performance of these nodes during long-duration tests, and report anomalies to the supervising engineers.\n  \n \n  \n  \n \n \n \n  \n   What is Nokia looking for from me\n    \n    You have:\n   \n  \n \n  \n   Strong interpersonal and communication (both written and verbal) skills are required \n   Demonstrated ability to learn quickly and to work in a fast-paced, innovative environment \n   Strong troubleshooting skills \n   Strong sense of ownership and accountability \n   Linux/Unix operating systems, installing servers, creating users, groups, and permissions \n   Windows Servers, installing DNS and Active Directory, and creating Group Policies \n   Familiar with networking tools, ie. TFTP, FTP, and Wireshark \n   Basic training in cable architecture and repair \n   The candidate must be able to successfully work in a team-oriented environment\n  \n \n  \n  \n \n \n \n  \n   Why we're awesome\n   \n  \n \n  \n   Nokia offers flexible and hybrid working schemes, continuous learning opportunities, well-being programs to support you mentally and physically, opportunities to join and get supported by employee resource groups, mentoring programs and highly diverse teams with an inclusive culture where people thrive and are empowered.\n    \n    Company Culture: We believe our people are our greatest asset and we aim to foster a fun, challenging, positive, and inclusive work environment. We offer 1-on-1 mentorship, learning and development opportunities, global impact and interaction, and flexible work/life balance.\n    \n    Meaningful Co-op Term: During your co-op term, you will have the opportunity to test out the latest technologies and work on innovative projects that could leave a global impact. You get to use skills learned in the classroom and apply it to real work situations while gaining professional hands-on experience.\n  \n \n \n   \n   \n  \n \n \n  \n   Nokia is committed to inclusion and is an equal opportunity employer\n   \n  \n \n  \n   Nokia has received the following recognitions for its commitment to inclusion & equality:\n   \n  \n \n  One of the World’s Most Ethical Companies by Ethisphere \n  Gender-Equality Index by Bloomberg \n  Workplace Pride Global Benchmark \n  \n \n  \n   At Nokia, we act inclusively and respect the uniqueness of people.\n  \n \n  \n  \n  \n    Nokia’s employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law.\n    We are committed to a culture of inclusion built upon our core value of respect.\n   \n  \n \n  \n   Join us and be part of a company where you will feel included and empowered to succeed.\n  \n \n \n   \n   \n  \n \n \n  \n   See you this Winter 2024!!!"
    },
    {
        "id": "c7a4762b555baf4b",
        "company": "exp",
        "positionName": "Lab Technician",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-15T06:49:54.187Z",
        "url": "https://www.indeed.ca/rc/clk?jk=c7a4762b555baf4b&from=jasx&tk=1hbkvuh1oj32s803&vjs=3",
        "externalApplyLink": "https://elcn.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX/job/106961",
        "companyDescription": "",
        "description": "Lab Technician (Contract until 2023) \n Ottawa, ON \n \n At EXP, we’re driven to provide innovative solutions for the world’s built and natural environments. As a team of engineers, architects, designers, scientists, creators and a community of professionals, we bring diverse and talented people together to solve the world’s most complex challenges. Here, you join a team that leverages differences, harnesses their entrepreneurial spirit in an employee-owned company, that believes diversity is what gives us strength, seeks sustainable results and shares ambitions for each other, our clients and the communities we are part of and serve. To be a part of EXP means to have your own experience, while staying connected to a global network of professionals, who believe we are a part of something bigger. Together, we are EXP. \n Are you ready to design your future? \n Be our next Lab Technician ! \n \n Your work environment at EXP \n EXP is currently searching for a Lab Technician to join our Earth and Environment group. This is a contract position until the end of 2023 with a possibility of extension. \n \n What a day at EXP has in store for you \n The successful candidate will spend their time in the material laboratory completing construction materials tests. \n \n  Lab based position – process concrete cylinders, conduct aggregate and soil testing Interact with other lab & field staff, engineers, etc. \n \n \n The Skills, Knowledge and Abilities We Seek \n \n  Must have strong people skills, and ability to work with wide variety of staff and clients \n  Must be able to communicate (verbally/writing) in English for field and formal reports \n  Ideally concrete/soils/asphalt testing experience would be advantageous \n  Strong general math skills \n  Diploma from an accredited Civil Technology program or equivalent would be an asset \n  Must have a valid Canadian driver’s license (Having access to a vehicle is an asset) Able to lift a minimum of 25kg \n \n \n #LI-AH1\n \n\n\n Our story   With a mission to understand, innovate, partner and deliver, EXP provides engineering, architecture, design and consulting services to the world’s built and natural environments. \n Our heritage dates back to 1906, when the earliest of EXP’s predecessor companies started its engineering infrastructure practice. Today, thousands of creative professionals across EXP work together to deliver extraordinary experiences year after year. \n What makes us different \n The passion, enthusiasm, diversity and industry-leading capabilities of our employees make us who we are. We’re committed to providing a challenging work environment that cultivates career growth, encourages creativity and rewards excellence. \n Find out more about life at EXP by visiting www.exp.com ."
    },
    {
        "id": "6aba07b710105191",
        "company": "Local Staffing",
        "positionName": "1402 - Junior Chemical Technician",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-30T06:50:09.121Z",
        "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0D7_li43lGEkKH59S9xgAlP2Hbfd6IWSF-UAaFkJZmMxilmWsN8VpTNTXqABoUdZFuZ4YsZ-kwZx6m9ptS__l3MncVHL6j19WYOgjX2k0X1SXWwNFWWtHG3KgG3iIElDFtFNqQ1CDvY0J49U0713FuNS9TfY5Nxb4B90nzOi91ytAI4TZy2rGefNo8lybwwYebWzbJI7xtifPCpvNlDgyUZppsZFy0RPPz1wi8x9OkJQeKxjo7vYvJ8guC1zX_oQ8Ob9NG92i15trcnSYrIRyN-OaU6DYa9aEQHsVcALb5a5juooaOvk_O5-LxF2JxJtNeP5tm9ZfJScH0XJ_ryIJj9UC14oJoS3KVQDeeKe6s47ctLW3A9W_toUys3mzWxjsTq3Zu5-AiDbEeyU0j0Uqusw6FJavHb6oW49Mzj42tqZIQL9yBNCxmFtydicWI-0L6v7QZUMTiFj4F0GyCHvj_lNZbXsvsZ_IK2PStymIl4w44sOaoY2ovPlsd-BxCqvvD8K2IzojxXLYX5C46nDUu2VU0PxEyIzUCWJw55dGHoCViwf_95N_k-CgI8ajsaDkM-otD8kZJEDhM_WnjwiVVQwXpq6IG8VDY%3D&xkcb=SoDe-_M3K037dFxwl50LbzkdCdPP&p=0&fvj=1&vjs=3&jsa=399&tk=1hbkvt5cukf2u802&from=jasx&wvign=1",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "We are currently looking for a Junior Chemical Technician to join our waste management client’s team. This is an excellent opportunity for a recent graduate looking to begin a career as a Chemical Technician.\nWhat the job involves:\n\n Sampling waste streams for laboratory testing and analysis\n Identifying the chemical composition of waste using various analysis techniques\n Sorting waste streams for shipment, disposal and recycling, as required\n Processing environmentally hazardous waste\n General warehousing duties and manual labour as directed\n Working in a fast-paced industrial environment\n\nWhat the job requires of you:\n\n An academic background in chemistry (ie: Chemical Technician Diploma or Bachelor of Chemical Engineering)\n Strong understanding of the periodic table of elements\n Positive attitude, flexible and adaptable, high energy, and self-motivated\n Ability to lift up to 50lbs on a repetitive basis\n Provide your own CSA-approved steel toe boots (all other PPE will be provided by the client)\n\nLocal Staffing is an Ottawa-based recruitment agency. We work primarily in the manufacturing, warehousing, and logistics industries. For more information, please visit our website at www.local-staffing.com\nWe are an inclusive and equal opportunity employer committed to providing diversity and accommodations for applicants upon request at any stage of the recruitment process in accordance with the Accessibility for Ontarians with Disabilities Act (AODA) and the Ontario Human Rights Code. All applicants must make their requirements known when contacted.\nJob Type: Full-time\nSalary: $18.00-$20.00 per hour\nExpected hours: 40 per week\nSchedule:\n\n 8 hour shift\n Day shift\n Evening shift\n Monday to Friday\n\nWork Location: In person"
    },
    {
        "id": "8ed65d7e3bf06ccf",
        "company": "Canadian Armed Forces",
        "positionName": "Water, Fuels and Environmental Technician",
        "jobType": [],
        "location": "Ontario",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:50:22.964Z",
        "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0AEijAmCurMlSbSrBcY9H30C0iyz3gfTTVX04Dc3K_3XaJw3e1ifqNkHf5_-wF_BypnmFiLyxI9OKeT6toul8_LktERRw8ShHHAS08Cbg3aOMgclKlEbIQnS4-3Am5wBIEiJ2L-bKdZPOjJ5j2T5IvoTX8ndCEfJEqEfjq1XseOZ5skwydZoyr2Z2Y5J3rdfP6u9VyTHOUAi4ugIVmmCSNewG9vaxdLH6vDNn76vK3D-tGAfRUL5bBi0MMR2RJJYBmNtJprtO9rfctGQAyTVR1la9IF9CgkxsFk1WMxlsN6DB2a3D4bcEEh3KROppPfOez3vseZ_Jjfq2thOANPNMLTzNxreKv2Mlstx9FD0J6T09VsVA2mRvTfZOyzo51sMahHf1vuCywWZoDdB23QheZiHsNyK8R59mVURa5h_hH3D4z0V-eTVEpC6WC-gdY8dlechHnWeBIKFyIaOFLKqYEIZ9j9tzgNaolAItDoNyr82M7yydL1eDp28fK392yVRhF0kTTgUjggsWa0BK1zaIEi7a95yCDKCKQVg3dwYar6CXR-pFfLEek5m79K36H6WGVT24rvW74V9jQTzXuMkIO3ErZcEcG3nQhJTHBsb9F0MfZIzIHR3I5sKR0Ppr2oJFDwtgx2Zspi7tnYKgRmaXb7Kl0R98_eutafRim7wwdfBT90Tv32sClFuQI4aRv12yfjfKn2-hiwGpH_k79nC_WL9vgdfEyrfjCjVZFfnXG0yRFdA7nq2avgdc5pRqMqpXsQYxy1RhDC7xlhKsxNX-2m4V3bKkMDXH179uqTC1WWMus5TXyS6KAB7JoGmwEjOJk%3D&xkcb=SoBG-_M3K1IL-HyRdp0GbzkdCdPP&p=13&fvj=1&vjs=3&jsa=6992&tk=1hbl01110kf0l800&from=jasx&wvign=1",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "Opportunity\nDo you have a passion for the outdoors and love to solve problems using technology? As a Water, Fuels and Environmental Technician, you’ll become an essential part of the Canadian Armed Forces (CAF). Water, Fuels and Environmental Technicians ensure that Canadian soldiers, sailors and air crews are provided with clean water wherever they are in the world and ensure military fuel delivery and storage is safe for both the people and the environment.\nNo previous work experience or career-related skills are required.\nOverviewWater, Fuels and Environmental Technicians give water supply, wastewater treatment and environmental engineering support to operational units at home and abroad.\nThe Water, Fuels and Environmental Technician is one of seven Construction Engineering positions that provide all construction, civil, electrical and mechanical engineering services to CAF operations. Their primary responsibilities include:\n\n Installing, operating and maintaining water treatment and supply systems\n Installing, operating and maintaining wastewater collection and treatment systems\n Setting up and monitoring various environmental programs\n Producing associated mechanical designs and specifications\n Producing associated mechanical drawings\n Conducting reconnaissance related to the above\n Assisting other Construction Engineering tradespersons\n\nTo be eligible to apply to the CAF, you must:\n\n Be a Canadian citizen or permanent resident living in Canada\n Be at least 18 years old (17 years old with parental consent), except:\n For the paid education programs you may be 16 years old (with parental consent)\n For the Primary Reserve you may be 16 years old (with parental consent) and must be enrolled as a full-time student\n Have completed at least Grade 10 or Secondaire IV in Quebec (some jobs need higher levels of education)\n\nWork Environment\nWater, Fuels and Environmental Technicians can work day or night and must deal with the challenges of varying environmental conditions. They maintain their skills while employed at home units or on humanitarian and United Nations operational assignments.\nBasic Military Qualification\nThe first stage of training is the Basic Military Qualification course, or Basic Training, held at the Canadian Forces Leadership and Recruit School in Saint-Jean-sur-Richelieu, Québec, or through various training establishments across Canada from Esquimalt, British Columbia, to Halifax, Nova Scotia. This training provides the basic core skills and knowledge common to all trades. One main goal of this course is to ensure all recruits maintain the CAF physical fitness standard; as a result, the training is physically demanding but achievable.\nWater, Fuels and Environmental Technician Training\nWater, Fuels and Environmental Technicians attend the Canadian Forces School of Military Engineering in Gagetown, New Brunswick. Training takes approximately 21 weeks and includes:\n\n Environmental skills (such as defensive tactics and firearms)\n Care and use of common and special purpose tools and test equipment\n Application of occupational codes and regulations\n Interpretation of drawings and schematics\n Water distribution and treatment systems\n Wastewater disposal and treatment systems\n Fuel storage and distribution systems\n Chemistry, fluids and mechanical principles\n Math and physics\n Brazing and welding techniques\n\nAvailable Specialty Training\nWater, Fuels and Environmental Technicians may be offered the opportunity to develop specialized skills through formal courses and on-the-job training for topics like:\n\n Water Plant Technician\n Wastewater Plant Technician\n Environmental Assessor\n Certified Engineering Technician (Mechanical)\n\nRequired Education\nThe minimum required education to apply for this position is the completion of the provincial requirements for Grade 10 or Secondaire IV in Quebec, including:\n\n Grade 10 Applied Math (Mathématiques 416 or Cultural, Social and Technical 4)\n\nForeign education may be accepted.\nDirect Entry Officer Plan\nNo previous work experience or career-related skills are required. A recruiter can help you decide if your interests and attributes fit. If you already have a university or college diploma, the CAF will decide if your academic program matches the criteria for this job and may place you directly into the necessary on-the-job training program following Basic Training. Basic Training is required before being assigned.\nJoin the CAF\nTo learn more about becoming a Water, Fuels and Environmental Technician, visit www.forces.ca, talk to a recruiter at a centre near youor call 1-800-856-8488.\nExplore over 100 different career opportunities at www.forces.ca/en/careers.\nJob Type: Full-time"
    },
    {
        "id": "500e852854dbd9a7",
        "company": "Adtran",
        "positionName": "R&D Engineer Optics",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:50:22.767Z",
        "url": "https://www.indeed.ca/rc/clk?jk=500e852854dbd9a7&from=jasx&tk=1hbl00v2ikedd801&vjs=3",
        "externalApplyLink": "https://adva.wd3.myworkdayjobs.com/en-US/ADTRAN/job/Ottawa-ON/R-D-Engineer-Optics_R000994-5",
        "companyDescription": "",
        "description": "Welcome!\n \n \n \n   Our Growth is Creating Great Opportunities!\n   \n   Our team is expanding, and we want to hire the most talented people we can. Continued success depends on it! Once you've had a chance to explore our current open positions, apply to the ones you feel suit you best and keep track of both your progress in the selection process, and new postings that might interest you!\n   \n   Thanks for your interest in working on our team!\n \n \n   The R&D Optics Engineer will primarily be responsible for working in collaboration with the silicon photonics design team to provide system models and experimental design validation regarding the performance of Adva's high speed coherent optical engines coupled with state-of-the-art DSPs.\n \n \n \n   Principal Tasks\n \n \n   R&D engineer for Photonics Integration team\n   Knowledge of optical packaging concepts and test of high speed RF/optical components\n   Experience with test automation software: Matlab, Labview or similar\n   Experience with silicon photonics (SiP) technologies\n   Experience with advanced coherent DSP capabilities and their use is highly desirable.\n   Develop and/or specify lab equipment required for die level SiP testing\n   Perform die level DVT on SiP using grating couplers, fiber arrays, RF/DC probes, and sub-micron translation stages/hexapod\n   Perform SiP module level DVT using advanced coherent DSPs, AWGs, OMAs, VNAs\n   Develop clear and concise test plans for transceiver DVT and Qualification test results (English Language)\n   Test of opto-electronic components and sub systems (small signal analysis NVA/LCA, wideband BER, scope, AWG measurements, noise/distortion loading, DWDM testbed)\n   Provide technical feedback to optical, mechanical, digital, firmware and software engineers to reach interface and packaging objectives.\n   Write component and sub system specifications and review vendor specifications (English language)\n   Work with vendors on driving product roadmap and specifications\n \n \n   Supplementary Tasks\n \n \n   Capable of working independently on the assigned design activities with minimal supervision.\n   Comprehensive understanding of the product architecture, design, processes, tools, etc. required to perform their assigned design activities.\n   Provide internal input into NPI, manufacturing, quality, Operations and Sales\n   Identify and mitigate project risks\n   Other duties as assigned\n \n \n   Customers (Internal & External)\n \n \n   Internal\n \n \n   Hardware development team in ATL and all Adva employees\n \n \n   External\n \n \n   All Adva customers\n \n \n   Skills/Qualifications/Training/Experience\n \n \n   MS or PHD in physics or electrical engineering\n   Knowledge in silicon photonics testing for communications applications\n   Optical communications systems, Coherent TX/RX, DSP for coherent systems, high speed electrical\n   Highly desirable: experience in modeling system impairments in coherent optical systems\n \n \n   Requirements & Work Environment\n \n \n   Work environment: office and lab environment. Some lifting of test equipment > 25 pounds. Lifting of test equipment into overhead storage shelves.\n   Bending over lab benches to view work. Example: viewing microscopes and instrumentation situated on large optical tables.\n \n \n   Success Criteria\n \n \n   Self-motivated, high degree of responsibility and ownership of work tasks, sense of urgency regarding project schedules while maintaining high level focus on work quality.\n \n \n   Team and Department\n \n \n   AOE\n   R&D Department\n \n \n   Licenses or certifications required\n \n \n   None\n \n \n   Travel requirements\n \n \n   <5% Travel\n \n \n   <5 % international\n   <5% domestic (1-2 times per month)\n \n \n   Scope of employment\n \n \n   Full Time\n   Employee\n   Permanent\n   Salaried position\n   Work authorization or permanent resident of Canada\n   Must be authorized to work in Ontario, Canada\n \n \n   Primary location of job\n \n \n   Ottawa, Ontario Canada\n   Office location with work from home opportunities <10% of time when feasible\n \n \n   Work schedule\n \n \n   M-F Weekdays or as agreed with manager\n   Office hours: Monday – Friday (flexible work schedule as agreed with manager)\n \n \n   Compensation scheme\n \n \n   Goal pay compensation scheme\n   \n     Base salary + individual goal pay + company goal pay"
    },
    {
        "id": "5100839a67ccad40",
        "company": "AECOM",
        "positionName": "Senior Ecologist",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:50:22.859Z",
        "url": "https://www.indeed.ca/rc/clk?jk=5100839a67ccad40&from=jasx&tk=1hbl00v2ikedd801&vjs=3",
        "externalApplyLink": "https://jobs.smartrecruiters.com/AECOM2/743999913821309-senior-ecologist",
        "companyDescription": "",
        "description": "Company Description\n  At AECOM, we’re delivering a better world.\n  We believe infrastructure creates opportunity for everyone. Whether it’s improving your commute, keeping the lights on, providing access to clean water or transforming skylines, our work helps people and communities thrive.\n  Our clients trust us to bring together the best people, ideas, technical expertise and digital solutions to our work in transportation, buildings, water, the environment and new energy. We’re one global team – 47,000 strong – driven by a common purpose to deliver a better world.\n  Here, you will have freedom to grow in a world of opportunity.\n  We will give you the flexibility you need to do your best work with hybrid work options. Whether you’re working from an AECOM office, remote location or at a client site, you will be working in a dynamic environment where your integrity, entrepreneurial spirit and pioneering mindset are championed.\n  You will help us foster a culture of equity, diversity and inclusion – a safe and respectful workplace, where we invite everyone to bring their whole selves to work using their unique talents, backgrounds and expertise to create transformational outcomes for our clients.\n  We will encourage you to grow and develop your career with us through our technical and professional development programs and diverse career opportunities. We believe in leadership at all levels. No matter where you sit in the organization you can make a lasting impact on the projects you work on, the teams and committees you join and our business.\n  We offer competitive pay and benefits, well-being programs to support you and your family, and the development resources you need to advance your career.\n  When you join us, you will connect and collaborate with a global network of experts – planners, designers, engineers, scientists, consultants, program and construction managers – leading the change toward a more sustainable and equitable future. Join us and let’s get started.\n \n \n\n Job Description\n  AECOM’s ecology team is looking for applicants for the position of a Senior Ecologist to help drive the delivery of our existing projects and to grow our capacity to serve clients on challenging and exciting projects across the province. The position may be based out of any of the following offices: Whitby , Markham, Mississauga, Kitchener, Hamilton, London, Ottawa, Barrie or Ottawa.\n  The successful candidate will have a minimum of 10 years of relevant experience, be highly motivated and enjoy working on a diversity of projects, is an effective communicator and is committed to producing high quality work.\n  The position will involve working with project managers to deliver timely environmental tasks and commitments including baseline studies, environmental impact assessments, permit applications, agency consultation, site plan drawings, restoration plans and mitigation plans and related scopes of work. Responsibilities include:\n \n   Manage and conduct biological surveys and provide technical support in vegetation, fish and fish habitat, wetland and/or wildlife ecology.\n   Supervise and mentor intermediate and junior staff through on-the-job training and project work.\n   Effectively manage and coordinate projects as a technical lead or project manager.\n   Write and deliver high quality reports, which may include: field reports; permit applications; compensation plans; sustainability/restoration plans; environmental impact assessments; land/watershed plans; management plans.\n   Quality control of data analysis and reports and a commitment to technical excellence.\n   Work collaboratively between different offices and groups;\n   Identify emerging markets and business opportunities with existing and new clients.\n   Develop appropriate marketing materials and strategies.\n   Write effective proposals.\n \n\n \n \n\n Qualifications\n  Must Have Skills/Experience (Including any required Certifications): \n \n  At least 10 years relevant work experience in a related field (ideally consultancy) with advanced field skills in terrestrial vegetation, wetlands, fisheries, water quality or wildlife ecology.\n   Strong reputation for ecological expertise, and capable of developing good client relationships\n   Solid understanding of the environmental documentation process including impact assessment and mitigation.\n   Knowledge and experience with federal, provincial and municipal acts, regulations, policies and guidelines in particular, the Planning Act and Provincial Policy Statement, Endangered Species Act, Species at Risk Act, Fisheries Act, the Ontario Environmental Assessment Act, Migratory Birds Convention Act, and the Canadian Environmental Assessment Act 2012.\n   Good communicator and able to liaise with all stakeholders including regulatory agencies.\n   Proven leadership and superior communication skills.\n   Project Management skills and experience in tracking schedules and delivering projects on time and within budget.\n   Demonstrated ability in developing new business opportunities.\n \n  Preferred Skills/Experience:\n \n   Ecological Land Classification training and certification\n   Ontario Wetland Evaluation System training and certification\n   Ontario Stream Assessment Protocol training and certification\n   Experience on Ministry of Transportation (MTO) projects\n   Experience writing and preparing technical reports\n   Familiarity with Microsoft Office Suite with proficiency in Microsoft Word and Excel\n   Valid Drivers License\n \n  Additional Information\n \n  With infrastructure investment accelerating worldwide, our services are in great demand, and there’s never been a better time to be at AECOM! Join us, and you’ll get all the benefits of being a part of a global, publicly traded firm – access to industry-leading technology and thinking and transformational work with big impact and work flexibility.\n  AECOM provides a wide array of compensation and benefits programs to meet the diverse needs of our employees and their families. We also provide a robust global well-being program. We’re the world’s trusted global infrastructure firm, and we’re in this together – your growth and success are ours too.\n  As an Equal Opportunity Employer, we believe in each person’s potential, and we’ll help you reach yours.\n  Join us and let’s get started."
    },
    {
        "id": "ae547c2e2a15f796",
        "company": "Lafarge Canada Inc",
        "positionName": "QC Technician",
        "jobType": [],
        "location": "5121 Hawthorne Rd, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:50:24.141Z",
        "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0AUSj4sjqAJYFmZDhQwD4zQDbNVBOynbLDW0uqNq4bxKDITBsgaboh9LaUx1isBORKVO7DpoOVaAH2E--oiEVHy4VtRzi5n-0sTyXQ6pgyrEtujmH-DvG1UGhHxR3aKABNwIyBi6kab7y2LvAkU_XYTjOmuWEgw_KLRq3UC-lfEmfmYBnr6OY1m0UCyTDGvHf4-NgYp0-xTtzuJuxBiZq4TuYQgfsYKF235swkqrIJxi2M22c6Fzr0asxKUBKi75rDXOtDN-lNOeZ2Os3Zcet2nBdYl8BsW5ne5xzGjDQ8FRbTFQgRbnsoksaTRC3W38mPozkEoMLO49daiqS_YMrAArSDcB9Cjt3qbOiJIQ17kNB1zM9ZX9sQEuD4tozqBEO3DWgKZNwhPhYGg1SlvzjcpA1mcIyTEmD8GkjIdTTmQTlWMsgn_SFtrcpSvCMQhzp_CbRM8OwnTUpr45ZbaEeRmBP1IwvbDnQwU14P-VWnP0LOTlvknzM5US_Kgii1iYKvfdwKtO-7HbwbmyAa-kaXgK2BSjDc3TJjt9Y2JuAXPu2LlSZZIo5H3ZtmCSVoZWcS91vO-IffM3sGeLQ5VjohtFMTO-bWfPslYlSHfSJnw026nq9OyW9u_eV6Tqk2xXrJcXoqJjgYi4kMiY3BhyoIAzYYcwu4s8BhRaNzw4z-iaplRzwoDRKheb1vTsIdwhQQy6u4E7kSPsPi7U3UrUkG5iou3osFWTG2XrntXZn9RoQphctZtAspLL8ZOiVWzNJteZq0FJmYg1kSN6rYjeaajsu24-KJAb7euaGxLXJWnbceCSzJVTpQ-ktfILcWmTfRCapULPghd3nsWfwht8culFU6MO5s1gEWGwUsIsIBy_OzL3C8eR3WsP4QF7Al-FgVxwRVs5VCGlyAneaq2TAHbFaxdMB35dQoQ4Ze4tk1dRK78nt1ks6Sz&xkcb=SoBN-_M3K1IL62ALjb0AbzkdCdPP&p=11&fvj=0&vjs=3&jsa=7409&tk=1hbl011e0kf25801&from=jasx&wvign=1",
        "externalApplyLink": "https://cacareers-lafarge-na.icims.com/jobs/18437/job?utm_source=indeed_integration&iis=Job%20Board&iisn=Indeed&indeed-apply-token=73a2d2b2a8d6d5c0a62696875eaebd669103652d3f0c2cd5445d3e66b1592b0f&mode=job&iis=Indeed&iisn=Indeed.com",
        "companyDescription": "",
        "description": "Why work for Lafarge?:\n \n \n   As the global leader in innovative and sustainable building materials, we’re committed to shaping a \n  greener, \n  smarter and \n  healthier world. At Lafarge Canada Inc., \n  safety comes first, \n  collaboration matters and \n  diversity is celebrated with people who share our desire to continually \n  make our materials better.\n \n \n \n   Do you have the drive, the skills, and the passion to join us?\n \n  \n  Overview:\n \n \n   Reporting to the Quality Control Manager, the QC Technician - Aggregates is responsible for safely implement Quality Control for production and shipping of our products. He makes sure our Quality Plan is respected across our sites in the NCR.\n  Responsibilities:\n \n \n   Health & Safety \n \n \n  Work in a safe and effective manner following the Lafarge Safety Program and applicable legislation. Be directly involved in risk analysis necessary for lab activities, development and application of improvement plans in relation to Health & Safety and ergonomics. Work efficiently and in collaboration with the different teams.\n \n \n   Support to Operations \n \n \n  Insure the Quality Plan is applied across NCR sites. Analyze results and share them with the Production Staff to insure products compliance with relevant Code, Standard and Specifications. Make sure all testing results are entered in our QC software. Participate with Production Staff to conduct production adjustments needed to insure product conformance. Insure all technical documentation is updated according to our Quality Plan. \n \n \n  Technical Support and Quality Control \n \n \n  Maintain excellent relationships with Sales, Production and Distribution Staffs. Provide Customer support by supplying technical documents and datasheets and/or by visiting customer job sites for technical troubleshooting. Perform administrative activities and insure all documentation is updated in order to maintain our CCIL Certification. Support the Sales, Production or Administrative Staffs when necessary (report preparation, special projects or other special requests). Participate in corrective/preventive action plans preparation and achievement to improve quality. \n \n \n  Physical Attributes \n \n \n  While performing the duties of this job, the employee is regularly required to use hands to finger, grasp, handle, or feel. The employee frequently is required to stand; walk; climb stairs & ladders; reach with hands and arms; talk, hear and smell. Infrequently the employee is required to work in awkward situations; balance; stoop, kneel or crouch. The employee must frequently lift and/or move up to 25 pounds, occasionally lift and/or move up to 50+ pounds. Specific vision abilities required by this job include close vision, color vision, peripheral vision, depth perception, and the ability to adjust focus. Employee must perform work outdoors in all weather conditions, and will work around moving mechanical parts and equipment. Various PPE will include safety boots, reflective clothing, safety glasses, gloves and hard hat. Additional PPE may be required depending upon tasks. \n \n \n  Relationship with Others \n \n \n  Reports to the EON & GMA Quality Control Manager Collaboration and Team work with other QC Technician Works closely with Production, Distribution, and Sales Staffs \n \n \n  Specific Accountabilities: \n \n \n  Safety \n  Product quality control and performance \n  Customer service and support \n  Troubleshooting \n  Implementation of best practices and quality control process \n  Quality Policies and Training \n \n \n  Dimensions: \n \n \n  Volume: 7 Million tons (3.5M production and 3.5M shipping) \n  Direct reports: None\n  Qualifications:\n \n \n   Education & Work Experience:\n \n \n   Post-secondary education in Civil engineering or equivalent\n   Experience in materials quality control (an advantage)\n \n \n   Knowledge & Skills:\n \n \n   Sound knowledge of OPSS, CSA and City of Ottawa standards.\n   Excellent knowledge of quality control tests and best construction practices at the job sites.\n   Fully valid Driver’s License Class G\n   Must also be able to work well as part of a team and independently\n   Good computer skills for Windows based software\n   Should have excellent written and oral communication skills and capable of creating good relationships internally and externally with our customers.\n   Motivated\n   Job Language: English (French an advantage)\n   Must be able to work in outdoor and indoor work environments.\n   Able to perform a variety of tasks, including moderate to heavy lifting.\n   This role is will require the handling of cements, aggregates, concrete and lab equipment.\n \n \n   Lominger Competencies:\n \n \n   Customer focus\n   Drive for results\n   Integrity and trust\n   Intellectual horsepower\n   Interpersonal savvy\n   Managing and measuring work\n   Process management\n  LafargeHolcim:\n \n \n   As we are reinventing the way the world builds, we need world-class talent to join our Lafarge Canada team: people who are \n  passionate, driven by \n  curiosity and keen to \n  grow, \n  learn, develop and \n  thrive in our high-performance culture.\n \n \n \n   Whatever you do, you will make a difference here. Because we know that your passion and curiosity are the natural resources the world needs.\n \n \n \n   We thank you for your interest. Only candidates selected for an interview will be contacted. Lafarge is committed to the principles of employment equity and encourages the applications from women, visible minorities, and persons with disabilities.\n \n \n \n   Lafarge Canada Inc. welcomes and encourages applications from people with disabilities. In Ontario, our organization/business is committed to fulfilling our requirements under the Accessibility for Ontarians with Disabilities Act. Accommodations are available on request for candidates taking part in all aspects of the selection process."
    },
    {
        "id": "47166dcc3de3d5ad",
        "company": "University of Ottawa",
        "positionName": "Assistant or Associate Professor of Chemistry",
        "jobType": [],
        "location": "40 Ruskin St, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:50:25.043Z",
        "url": "https://www.indeed.ca/rc/clk?jk=47166dcc3de3d5ad&from=jasx&tk=1hbl00rvqkp1k800&vjs=3",
        "externalApplyLink": "https://uottawa.wd3.myworkdayjobs.com/en-US/uOttawa_External_Career_Site/job/Ottawa-ON/Assistant-or-Associate-Professor-of-Chemistry_JR3174",
        "companyDescription": "",
        "description": "Job Family:\n  Academic Leadership and Faculty\n \n   Union affiliation:\n \n  APUO\n \n \n   Faculty/Department:\n  Department of Chemistry and Biomolecular Sciences_FT\n \n \n   Campus:\n  STEM\n \n \n   Date Posted:\n  juillet 04, 2023\n \n \n   Closing Date:\n  octobre 04, 2023\n \n   Note: Applications will be accepted until 11:59 PM on the day prior to the Posting End Date above\n \n \n \n   Assistant or Associate Professor of Chemistry\n \n \n \n   The University of Ottawa invites applications for appointment to a tenure-stream Assistant or Associate Professor position with expertise within the broad framework of Chemistry. This position is located on the traditional and unceded territory of the Anishinabe-Algonquin people.\n \n \n   The Department of Chemistry and Biomolecular Sciences at the University of Ottawa provides a thriving research environment with state-of-the-art research facilities (more information on Core Facilities and Research Centers can be found at: \n  \n   Research and innovation | University of Ottawa (uottawa.ca)\n  \n \n \n \n   Required qualifications and work experience:\n \n \n   PhD in Chemistry or a related field is mandatory. Candidates should demonstrate an excellent research track record. Furthermore, candidates should show enthusiasm for teaching and graduate training, a strong track record in and a commitment to interdisciplinary collaboration, the ability to obtain external research funds, and excellent communication skills in either English or French. Passive knowledge of the other official language in Canada is a requirement for tenure. English-French bilingualism is an asset.\n \n \n   Ideal candidates will have interests that complement the strengths of our department (\n  \n   Department of Chemistry and Biomolecular Sciences | Faculty of Science (uottawa.ca)\n  )\n \n \n \n   Preferential Hiring of Racialized and Indigenous Candidates. The University of Ottawa is committed to fostering a collegial culture grounded in equity, diversity and inclusiveness. The hiring for this position will be done in accordance with the University’s initiatives to combat systemic racial discrimination as announced by the University President in January 2021, which aim among other things, to remedy the under-representation of racialized and Indigenous peoples within the ranks of its faculty members. As such, only qualified applications from racialized or Indigenous peoples will be considered and evaluated for the position. Candidates who wish to be considered as members of one or more of these groups are asked to complete the confidential Self-Identification Questionnaire in their online profile at the time of application.\n \n \n   All qualified candidates are encouraged to apply; however, preference will be given to Canadians and permanent residents . The University recognizes the legitimate impact that leaves can have on a candidate’s record of research achievement and that these leaves will be taken into careful consideration during the assessment process.\n \n \n \n   Title of the position: Assistant or Associate Professor\n \n \n \n   Rank and salary: Regular tenure-track academic appointment in the Faculty of Science, with a salary consistent with the collective agreement of the Association of Professors of the University of Ottawa.\n \n \n \n   Application Package:\n \n \n  A cover letter;\n  A curriculum vitae;\n  A narrative summary of the candidate’s productivity, impact and education (if applicable, explain any career interruptions that might have affected research productivity);\n  A research plan demonstrating a strong commitment to research excellence (5 pages maximum, including short executive summary);\n  A statement of equity, diversity, and inclusion training and mentorship plan;\n  A teaching philosophy statement;\n  The names and contact information of three people who may be contacted by the University for letters of reference.\n  Self-Identification Form: We encourage all applicants to complete the confidential Employment Equity section in their online profile during the application process online.\n \n \n \n   The selection process will begin August 15th, 2023 and will continue until the position is filled. Only candidates selected for an interview will be contacted.\n \n \n \n   The application package should be submitted electronically through the uOttawa Academic Careers website (Academic and Executive Careers) and address the cover letter to :\n \n \n \n   Prof. John Pezacki, Chair\n   Department of Chemistry and Biomolecular Sciences\n   University of Ottawa\n   150 Louis Pasteur Private, STEM 341\n   Ottawa, ON Canada K1N 6N5\n   Ph 1-613-562-3346\n   Fax 1-613-562-5193\n   \n  \n   CHMChair@uottawa.ca\n  \n \n \n \n   Location of work: Department of Chemistry and Biomolecular Sciences, University of Ottawa, STEM Complex, 150 Louis Pasteur, Ottawa, ON K1N 6N5\n \n \n \n   Equity is a University of Ottawa policy; women, Indigenous peoples, members of visible minorities and persons with disabilities are encouraged to apply. If you are invited to continue the selection process, please notify us of any particular adaptive measures you might require by contacting the Office of the Vice-Provost, Faculty Relations at \n  \n   vra.affairesprofessorales@uottawa.ca\n  \n  .\n \n \n \n   The University of Ottawa is justly proud of its 160-year tradition of bilingualism. Through its Official Languages and Bilingualism Institute, the University provides training to staff members and their spouses in their second official language. At the time of tenure, professors are expected to be able to function in a bilingual setting. In certain cases, professors must have the ability to teach in both official languages to be granted tenure.\n \n \n \n   The University of Ottawa is committed to ensuring equity, diversity, and inclusion in the scholarly and leadership environments of our students, staff, and faculty. Accordingly, we strongly encourage applications from Indigenous Peoples in Canada, visible minorities members (racialized persons), persons with disabilities, women, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse, and inclusive communities. Candidates who wish to be considered as a member of one or more designated groups are asked to complete the confidential Self-Identification Questionnaire, to be completed at the time of application.\n \n \n \n   All qualified candidates are invited to apply; however, preference will be given to Canadians and permanent residents. When submitting your application, please indicate if you are legally entitled to work in Canada\n \n \n \n   The University of Ottawa provides accommodations for applicants with disabilities throughout the recruitment process. If you are invited to proceed in the selection process, please notify us of any accommodations that you require by contacting the Office of the Vice-Provost, Faculty Relations by email at \n  \n   vra.affairesprofessorales@uottawa.ca\n  . Any information you send us will be handled respectfully and in complete confidence.\n \n \n \n   The University of Ottawa is proud of its 160-year tradition of bilingualism. Through its Official Languages and Bilingualism Institute, the University provides training to staff members and to their spouses in their second official language.\n \n \n \n   Prior to May 1, 2022, the University required all students, faculty, staff, and visitors (including contractors) to be fully vaccinated against Covid-19 as defined in Policy 129 – Covid-19 Vaccination. This policy was suspended effective May 1, 2022 but may be reinstated at any point in the future depending on public health guidelines and the recommendations of experts."
    },
    {
        "id": "ae547c2e2a15f796",
        "company": "Lafarge Canada Inc",
        "positionName": "QC Technician",
        "jobType": [],
        "location": "5121 Hawthorne Rd, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:50:33.423Z",
        "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0AUSj4sjqAJYFmZDhQwD4zQDbNVBOynbLDW0uqNq4bxKDITBsgaboh9LaUx1isBORKVO7DpoOVaAH2E--oiEVHy4VtRzi5n-0sTyXQ6pgyrEtujmH-DvG1UGhHxR3aKABNwIyBi6kab7y2LvAkU_XYTjOmuWEgw_KLRq3UC-lfEmfmYBnr6OY1m0UCyTDGvHf4-NgYp0-xTtzuJuxBiZq4TyFrFLLdmSy8tylSJbNf02XT5SO2mmqExMs8ahVVSnp1K3Nwrz0gkrY1LXr3J3HCptDXoyOt-qhPwC_Bi8Wwcqy6-wln83iuSXaybC_0SOXX3TxbyEIF6X-N4hTDnYWyPP-6Z2_pflhd8EZJv7HUTS84DAu9KoCVzhAAz6f1CcQj2117NQim1PEPOq1IzQ1fr00ECQYobvR57VdQd5ZkEBZVvXZZYQcFhKSaWh3TmsNNFHJVnP28QiOtS58lIvWQOSWC6sET0AKAG6D7WamtkwouJzS9yBJmoAH3NqcNe0StDS-VO-5VgUkDLJnud4ygfoBrc7HlBnAm64DDdRFBYOEO6JQaTneecM0isdeQ3i4_TO4yJuBNrjqCaJ8t9CmGVzLzeJHKRFga9qL11cL5IfK_MrM59QKc3e_RjVLsKGyvyQFbfv_KdTknqKE2EUVkuxGQFD5Y7od4g_77u0zANa52nx91Dt2QLPssVp7AWH2cceaiaaT_999MoZa4nyae4nk9zaG_Kg2oDVaKOjakb7H56o55e77hve48svn_SCtjXFwbX0_BRsURGuJen5dxVhFjRWrkS7u97SVm7FmUoWclFXyZnCPepnMMk_7aVENOIkxF2jqx4OEC5JntoV-28ATQ9-cJDIMUvBRTyYRaMkxnnbKpysVTZRGz7XP0ggGLEJk2CdAWV-Inp0VK5xdoVSQ_eQOfEzZciPMJeZRuDOYq7MgdA7Vvt&xkcb=SoBV-_M3K1IL-HyRdp0CbzkdCdPP&p=9&fvj=0&vjs=3&jsa=6992&tk=1hbl01110kf0l800&from=jasx&wvign=1",
        "externalApplyLink": "https://cacareers-lafarge-na.icims.com/jobs/18437/job?utm_source=indeed_integration&iis=Job%20Board&iisn=Indeed&indeed-apply-token=73a2d2b2a8d6d5c0a62696875eaebd669103652d3f0c2cd5445d3e66b1592b0f&mode=job&iis=Indeed&iisn=Indeed.com",
        "companyDescription": "",
        "description": "Why work for Lafarge?:\n \n \n   As the global leader in innovative and sustainable building materials, we’re committed to shaping a \n  greener, \n  smarter and \n  healthier world. At Lafarge Canada Inc., \n  safety comes first, \n  collaboration matters and \n  diversity is celebrated with people who share our desire to continually \n  make our materials better.\n \n \n \n   Do you have the drive, the skills, and the passion to join us?\n \n  \n  Overview:\n \n \n   Reporting to the Quality Control Manager, the QC Technician - Aggregates is responsible for safely implement Quality Control for production and shipping of our products. He makes sure our Quality Plan is respected across our sites in the NCR.\n  Responsibilities:\n \n \n   Health & Safety \n \n \n  Work in a safe and effective manner following the Lafarge Safety Program and applicable legislation. Be directly involved in risk analysis necessary for lab activities, development and application of improvement plans in relation to Health & Safety and ergonomics. Work efficiently and in collaboration with the different teams.\n \n \n   Support to Operations \n \n \n  Insure the Quality Plan is applied across NCR sites. Analyze results and share them with the Production Staff to insure products compliance with relevant Code, Standard and Specifications. Make sure all testing results are entered in our QC software. Participate with Production Staff to conduct production adjustments needed to insure product conformance. Insure all technical documentation is updated according to our Quality Plan. \n \n \n  Technical Support and Quality Control \n \n \n  Maintain excellent relationships with Sales, Production and Distribution Staffs. Provide Customer support by supplying technical documents and datasheets and/or by visiting customer job sites for technical troubleshooting. Perform administrative activities and insure all documentation is updated in order to maintain our CCIL Certification. Support the Sales, Production or Administrative Staffs when necessary (report preparation, special projects or other special requests). Participate in corrective/preventive action plans preparation and achievement to improve quality. \n \n \n  Physical Attributes \n \n \n  While performing the duties of this job, the employee is regularly required to use hands to finger, grasp, handle, or feel. The employee frequently is required to stand; walk; climb stairs & ladders; reach with hands and arms; talk, hear and smell. Infrequently the employee is required to work in awkward situations; balance; stoop, kneel or crouch. The employee must frequently lift and/or move up to 25 pounds, occasionally lift and/or move up to 50+ pounds. Specific vision abilities required by this job include close vision, color vision, peripheral vision, depth perception, and the ability to adjust focus. Employee must perform work outdoors in all weather conditions, and will work around moving mechanical parts and equipment. Various PPE will include safety boots, reflective clothing, safety glasses, gloves and hard hat. Additional PPE may be required depending upon tasks. \n \n \n  Relationship with Others \n \n \n  Reports to the EON & GMA Quality Control Manager Collaboration and Team work with other QC Technician Works closely with Production, Distribution, and Sales Staffs \n \n \n  Specific Accountabilities: \n \n \n  Safety \n  Product quality control and performance \n  Customer service and support \n  Troubleshooting \n  Implementation of best practices and quality control process \n  Quality Policies and Training \n \n \n  Dimensions: \n \n \n  Volume: 7 Million tons (3.5M production and 3.5M shipping) \n  Direct reports: None\n  Qualifications:\n \n \n   Education & Work Experience:\n \n \n   Post-secondary education in Civil engineering or equivalent\n   Experience in materials quality control (an advantage)\n \n \n   Knowledge & Skills:\n \n \n   Sound knowledge of OPSS, CSA and City of Ottawa standards.\n   Excellent knowledge of quality control tests and best construction practices at the job sites.\n   Fully valid Driver’s License Class G\n   Must also be able to work well as part of a team and independently\n   Good computer skills for Windows based software\n   Should have excellent written and oral communication skills and capable of creating good relationships internally and externally with our customers.\n   Motivated\n   Job Language: English (French an advantage)\n   Must be able to work in outdoor and indoor work environments.\n   Able to perform a variety of tasks, including moderate to heavy lifting.\n   This role is will require the handling of cements, aggregates, concrete and lab equipment.\n \n \n   Lominger Competencies:\n \n \n   Customer focus\n   Drive for results\n   Integrity and trust\n   Intellectual horsepower\n   Interpersonal savvy\n   Managing and measuring work\n   Process management\n  LafargeHolcim:\n \n \n   As we are reinventing the way the world builds, we need world-class talent to join our Lafarge Canada team: people who are \n  passionate, driven by \n  curiosity and keen to \n  grow, \n  learn, develop and \n  thrive in our high-performance culture.\n \n \n \n   Whatever you do, you will make a difference here. Because we know that your passion and curiosity are the natural resources the world needs.\n \n \n \n   We thank you for your interest. Only candidates selected for an interview will be contacted. Lafarge is committed to the principles of employment equity and encourages the applications from women, visible minorities, and persons with disabilities.\n \n \n \n   Lafarge Canada Inc. welcomes and encourages applications from people with disabilities. In Ontario, our organization/business is committed to fulfilling our requirements under the Accessibility for Ontarians with Disabilities Act. Accommodations are available on request for candidates taking part in all aspects of the selection process."
    },
    {
        "id": "7a90f20fdc5aba78",
        "company": "BWX Technologies",
        "positionName": "Quality Assurance Manager",
        "jobType": [],
        "location": "447 March Road, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:50:38.249Z",
        "url": "https://www.indeed.ca/rc/clk?jk=7a90f20fdc5aba78&from=jasx&tk=1hbl00rvqkp1k800&vjs=3",
        "externalApplyLink": "https://careers.bwxt.com/job/Ottawa-Quality-Assurance-Manager-ON/1047615900/?jobPipeline=Indeed",
        "companyDescription": "",
        "description": "BWXT Medical Ltd. provides its customers, who conduct life-saving medical procedures for patients around the world, the benefit of decades of experience in the development, manufacturing, packaging and delivery of medical isotopes and radiopharmaceuticals. Headquartered in Kanata, Ontario, BWXT Medical Ltd. employs over 300 highly-skilled people in Kanata and Vancouver, British Columbia. BWXT Medical Ltd. is part of the BWXT nuclear power segment (NPG) of BWX Technologies, Inc.\n  \n  \n BWXT Medical Ltd., is hiring a Quality Assurance Manager at our production facility in Ottawa, Ontario, Canada.\n  \n  \n Position Summary: \n Reporting to the Director, Quality Assurance, the Quality Assurance (QA) Manager is responsible for ensuring that all performance targets and regulatory obligations to support compliance and reliability of operations and manufactured products are met. This position will provide technical guidance to new product and process development, and will participate as a member of development teams. \n \n  Applying a full working level of knowledge in Quality Assurance and Quality Management System procedures, the QA Manager is responsible for maintenance of various elements of the Quality Management system and procedures; \n  The QA Manager will perform batch release of products, and ensure high product quality; \n  Responsible to ensure the Quality Control functions are in compliance with Good Manufacturing Practices (GMP); \n  Responsible for hiring, supervising and evaluating QC Technicians responsible for microbiological and/or chemical analyses; \n  Other duties will include performing internal audits, hosting outside auditors, and providing GMP guidance to research and development;\n \n  \n  \n Position Qualifications / Requirements: \n \n  Bachelor of Science degree in Chemistry or Microbiology; must have at least one university level course in microbiology; \n  Minimum of 5-7 years’ work experience in quality assurance and/or quality control, preferably from a pharmaceutical or medical device industry; \n  Possess excellent judgment and ability to maintain excellent working relationships with internal and external customers; \n  Excellent written and verbal communication skills; \n  Ability to effectively analyze and make decisions within tight timelines; \n  Excellent organizational and leadership skills;\n \n  \n  \n Other: \n \n  This position is Nuclear Energy Worker; \n  Ability to work shift work when needed;\n \n  \n  \n Why join BWXT Medical? \n \n  Work within the growing and exciting nuclear medicine industry as well as with highly skilled employees. \n  Competitive salaries. \n  Company match pension plan. \n  Comprehenstive health and dental benefits. \n  Education reimbursement program. \n  Life insurance. \n  Collaborative work environment... and so much more!\n \n  \n  \n \n BWXT Medical Ltd. embraces diversity of thought, values individuality, encourages new perspectives and provides equal opportunity in employment for all qualified employees and applicants without regard to race, national or ethnic origin, colour, religion, age, sex, sexual orientation, marital status, family status, disability, a conviction for which a pardon has been granted or a record suspended or any other category protected by federal law."
    },
    {
        "id": "ae547c2e2a15f796",
        "company": "Lafarge Canada Inc",
        "positionName": "QC Technician",
        "jobType": [],
        "location": "5121 Hawthorne Rd, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:50:39.951Z",
        "url": "https://www.indeed.ca/rc/clk?jk=ae547c2e2a15f796&from=jasx&tk=1hbl00v2ikedd801&vjs=3",
        "externalApplyLink": "https://cacareers-lafarge-na.icims.com/jobs/18437/job?utm_source=indeed_integration&iis=Job%20Board&iisn=Indeed&indeed-apply-token=73a2d2b2a8d6d5c0a62696875eaebd669103652d3f0c2cd5445d3e66b1592b0f",
        "companyDescription": "",
        "description": "Why work for Lafarge?:\n \n \n   As the global leader in innovative and sustainable building materials, we’re committed to shaping a \n  greener, \n  smarter and \n  healthier world. At Lafarge Canada Inc., \n  safety comes first, \n  collaboration matters and \n  diversity is celebrated with people who share our desire to continually \n  make our materials better.\n \n \n \n   Do you have the drive, the skills, and the passion to join us?\n \n  \n  Overview:\n \n \n   Reporting to the Quality Control Manager, the QC Technician - Aggregates is responsible for safely implement Quality Control for production and shipping of our products. He makes sure our Quality Plan is respected across our sites in the NCR.\n  Responsibilities:\n \n \n   Health & Safety \n \n \n  Work in a safe and effective manner following the Lafarge Safety Program and applicable legislation. Be directly involved in risk analysis necessary for lab activities, development and application of improvement plans in relation to Health & Safety and ergonomics. Work efficiently and in collaboration with the different teams.\n \n \n   Support to Operations \n \n \n  Insure the Quality Plan is applied across NCR sites. Analyze results and share them with the Production Staff to insure products compliance with relevant Code, Standard and Specifications. Make sure all testing results are entered in our QC software. Participate with Production Staff to conduct production adjustments needed to insure product conformance. Insure all technical documentation is updated according to our Quality Plan. \n \n \n  Technical Support and Quality Control \n \n \n  Maintain excellent relationships with Sales, Production and Distribution Staffs. Provide Customer support by supplying technical documents and datasheets and/or by visiting customer job sites for technical troubleshooting. Perform administrative activities and insure all documentation is updated in order to maintain our CCIL Certification. Support the Sales, Production or Administrative Staffs when necessary (report preparation, special projects or other special requests). Participate in corrective/preventive action plans preparation and achievement to improve quality. \n \n \n  Physical Attributes \n \n \n  While performing the duties of this job, the employee is regularly required to use hands to finger, grasp, handle, or feel. The employee frequently is required to stand; walk; climb stairs & ladders; reach with hands and arms; talk, hear and smell. Infrequently the employee is required to work in awkward situations; balance; stoop, kneel or crouch. The employee must frequently lift and/or move up to 25 pounds, occasionally lift and/or move up to 50+ pounds. Specific vision abilities required by this job include close vision, color vision, peripheral vision, depth perception, and the ability to adjust focus. Employee must perform work outdoors in all weather conditions, and will work around moving mechanical parts and equipment. Various PPE will include safety boots, reflective clothing, safety glasses, gloves and hard hat. Additional PPE may be required depending upon tasks. \n \n \n  Relationship with Others \n \n \n  Reports to the EON & GMA Quality Control Manager Collaboration and Team work with other QC Technician Works closely with Production, Distribution, and Sales Staffs \n \n \n  Specific Accountabilities: \n \n \n  Safety \n  Product quality control and performance \n  Customer service and support \n  Troubleshooting \n  Implementation of best practices and quality control process \n  Quality Policies and Training \n \n \n  Dimensions: \n \n \n  Volume: 7 Million tons (3.5M production and 3.5M shipping) \n  Direct reports: None\n  Qualifications:\n \n \n   Education & Work Experience:\n \n \n   Post-secondary education in Civil engineering or equivalent\n   Experience in materials quality control (an advantage)\n \n \n   Knowledge & Skills:\n \n \n   Sound knowledge of OPSS, CSA and City of Ottawa standards.\n   Excellent knowledge of quality control tests and best construction practices at the job sites.\n   Fully valid Driver’s License Class G\n   Must also be able to work well as part of a team and independently\n   Good computer skills for Windows based software\n   Should have excellent written and oral communication skills and capable of creating good relationships internally and externally with our customers.\n   Motivated\n   Job Language: English (French an advantage)\n   Must be able to work in outdoor and indoor work environments.\n   Able to perform a variety of tasks, including moderate to heavy lifting.\n   This role is will require the handling of cements, aggregates, concrete and lab equipment.\n \n \n   Lominger Competencies:\n \n \n   Customer focus\n   Drive for results\n   Integrity and trust\n   Intellectual horsepower\n   Interpersonal savvy\n   Managing and measuring work\n   Process management\n  LafargeHolcim:\n \n \n   As we are reinventing the way the world builds, we need world-class talent to join our Lafarge Canada team: people who are \n  passionate, driven by \n  curiosity and keen to \n  grow, \n  learn, develop and \n  thrive in our high-performance culture.\n \n \n \n   Whatever you do, you will make a difference here. Because we know that your passion and curiosity are the natural resources the world needs.\n \n \n \n   We thank you for your interest. Only candidates selected for an interview will be contacted. Lafarge is committed to the principles of employment equity and encourages the applications from women, visible minorities, and persons with disabilities.\n \n \n \n   Lafarge Canada Inc. welcomes and encourages applications from people with disabilities. In Ontario, our organization/business is committed to fulfilling our requirements under the Accessibility for Ontarians with Disabilities Act. Accommodations are available on request for candidates taking part in all aspects of the selection process."
    },
    {
        "id": "f1b09b83351a9731",
        "company": "GEMTEC Consulting Engineers and Scientists Limited.",
        "positionName": "Civil Laboratory Technician/ Technologist (23051)",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:50:43.180Z",
        "url": "https://www.indeed.ca/rc/clk?jk=f1b09b83351a9731&from=jasx&tk=1hbl00rvqkp1k800&vjs=3",
        "externalApplyLink": "https://gemtec.bamboohr.com/careers/109?source=indeed&src=indeed&postedDate=2023-07-06",
        "companyDescription": "",
        "description": "GEMTEC is a growing firm with offices throughout Atlantic Canada and Ontario, and we are looking for a motivated and skilled Lab Technician/Technologist to join our Team. GEMTEC management understands that creative, talented employees are assets, and that investing in employee development is an investment in our firm. We strive to have employees that are multi-faceted and versatile with a variety of skills.\n \n  We currently have an opening for a Laboratory Technician/Technologist in our Ottawa office.\n  \n  \n  The successful candidate will have the following:\n \n  Educational & Experience Requirements: \n  \n  College level diploma is considered an asset. \n  Experience with laboratory test procedures for soil, asphalt, concrete and aggregate considered an asset but not necessary as training will be provided. \n  Ability to work independently as well as part of a team. \n  Ability to meet tight deadlines and work well under pressure. \n  Strong multi-tasking, organization, and planning skills. \n  Proficient with Microsoft Office. \n  Maintain a clean working environment. \n  Possess ability to lift 30-50lbs on a daily basis.\n \n  \n  \n  Main Duties: \n  \n  Laboratory testing of aggregates, soil, concrete, and asphalt. \n  Various office, laboratory, and field tasks related to materials testing, geotechnical engineering, and environmental engineering. \n  Record test data and prepare factual reports, summaries, data sheets or graphs for interpretation of test results. \n  Performing other related duties as required. \n  Following all company Health, Safety and Environmental policies.\n \n  \n  \n  Other: \n  \n  Contract Position. \n  Providing proof of full vaccination against COVID-19 may be a condition of employment. Exceptions to this requirement will be considered on a case-by-case basis in relation to local health guidelines and/or client requirements/regulations.\n \n  \n  \n  Interested individuals, click here to apply: https://gemtec.bamboohr.com/careers/109\n \n  Thank you for taking the time to consider GEMTEC. Only candidates proceeding to the next phase of the application process will be contacted at this time. We encourage you to connect with us on LinkedIn, even if this opportunity isn’t for you, the next one might be!\n \n  Should you be selected for an interview and require accommodation of any kind, please kindly help us understand how we can help."
    },
    {
        "id": "5dcbbb7a54ccb851",
        "company": "Brunet",
        "positionName": "Laboratory Cashier",
        "jobType": [],
        "location": "795 Boul Wilfrid-Lavigne, Gatineau, QC",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:50:40.939Z",
        "url": "https://www.indeed.ca/rc/clk?jk=5dcbbb7a54ccb851&from=jasx&tk=1hbl00rvqkp1k800&vjs=3",
        "externalApplyLink": "https://www.brunet.ca/Carrieres/RechercheDetail.aspx?posteID=37530&utm_source=Indeed&utm_medium=organic&utm_campaign=Indeed",
        "companyDescription": "",
        "description": "Type de poste : \n     Temps plein\n      \n     Horaire : \n     Jour\n      \n     Nombre d'heures : \n     Plus de 35 heures\n      \n     Date prévue d'entrée en fonction : \n     2023-09-08\n      \n    \n    \n     Succursale - 5136\n      \n     795, boul. Wilfrid-Lavigne\n      \n     Gatineau, QC J9J 1V2\n      \n    \n   \n  \n  \n  \n   \n    \n     Description \n     \n      Sous la supervision du technicien-chef, le ou la caissier/ère au laboratoire effectue principalement l'opération de la caisse enregistreuse tout en offrant un service à la clientèle de grande qualité et en étant attentif aux besoins des clients et en répondant à leurs demandes.\n       Le ou la caissier/ère au laboratoire est, entre autre, responsable de : \n      \n       Offrir un service à la clientèle exemplaire \n       Répondre aux demandes des patients selon les limites légales applicables à son poste en respectant la confidentialité des informations divulguées \n       Transmettre, conserver ou détruire les renseignements confidentiels de façon sûre et appropriée \n       Effectuer des suivis téléphoniques \n       Réapprovisionner les étalages de marchandises \n       Balancer la caisse enregistreuse \n       \n      \n       Les tâches ci-haut mentionnées le sont à titre indicatif.\n       \n     \n     \n      Scolarité : \n      Diplôme d’études secondaires (DES) - Terminé\n       \n      Expérience : \n      1 à 6 mois d’expérience\n       \n      Langue française : \n      Très bonne connaissance\n       \n      \n       Langue anglaise : \n       \n        Connaissance de base\n         \n       \n      \n     \n     \n      À propos de Brunet Fondée en 1855, Brunet a pour mission d’offrir aux Québécois les conseils et les services reliés à la santé les plus personnalisés. Brunet, qui compte un réseau de quelque 180 établissements franchisés au Québec, poursuit son développement en bonifiant sans cesse son offre de produits et de services. \n      Travailler au sein du réseau de Brunet Le réseau des pharmacies affiliées à Brunet vous offre la possibilité d’évoluer dans un environnement stimulant, entouré de professionnels passionnés par leur métier. Vous souhaitez travailler au quotidien avec la clientèle? La conseiller, l'orienter? Rejoignez dès maintenant une équipe humaine, dédiée au bien-être de sa clientèle et toujours prête à offrir le meilleur à chacun de ses clients. \n       Brunet est dédié à la promotion d'un milieu de travail diversifié. Nous considérerons tous les candidats qualifiés pour l'emploi postulé. \n       Nous remercions tous les candidats de leur intérêt. Cependant, seuls ceux sélectionnés seront contactés. \n     \n    \n   \n  \n \n \n  \n   Contactez-nous \n   \n    \n     \n      Par téléphone : \n      (819) 684-8222, personne à contacter : \n       \n      En personne : \n      À l'adresse mentionnée ci-haut."
    },
    {
        "id": "ae547c2e2a15f796",
        "company": "Lafarge Canada Inc",
        "positionName": "QC Technician",
        "jobType": [],
        "location": "5121 Hawthorne Rd, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:50:49.904Z",
        "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0AUSj4sjqAJYFmZDhQwD4zQDbNVBOynbLDW0uqNq4bxKDITBsgaboh9LaUx1isBORKVO7DpoOVaAH2E--oiEVHy4VtRzi5n-0sTyXQ6pgyrEtujmH-DvG1UGhHxR3aKABNwIyBi6kab7y2LvAkU_XYTjOmuWEgw_KLRq3UC-lfEmfmYBnr6OY1m0UCyTDGvHf4-NgYp0-xTtzuJuxBiZq4TdcV1d-YxO4uO-pofe-w6sXmqfC4urmrizmC0CKwgVAy_hP_AAUWnlPP-mY5RnDpATBrijGegMl5RaEtA5FImKVAS1ufdQmPNixlGC_P634V2SK_Y5wNC1kJ-dBaH967SCWv5ANrL2v7acqAw5j7mSCf39BVw8KW39JqlBrqBF5__hPwIcpb3fw0WVWDuDh4RVqH8Hx1Xkdn7cKcAQCGxNtQC6ZiUligA6XZlhjv7HwJw3EQn6z1aACI0JqzIShsZKmkv_djM4_SVScwQVfbuLMSL6WzB8rCmbhnXvDciFf_Z0KSZsIzdRMcLd2tXk44ov__NH_kXDV7vc8Kn8KbHBbFyDxR-6xvoZTAXL8pi8A6Qu2BoUynzcAKLNSSUb02eK0dhIaqBx7Rg1kY30l3jEDox70StTaPMO_2i_LYCEIYxZZndINO97PYSrLswxUNvrHwWyTkKh15FpCjB8qQ0PRpd4eLuK_0GUXHaHyp_v5482e7GHk3Z5rOSTE22gbEUSaxoiT06UNbroxBIcOwV4l55vp-fWnOkX-Y8elVJa3ja5UMtc0QjUQrOtLbxXann8gYDSE7W6xWdQ4fmMbKGobOl_5zAt83GLrPoFFVEDyUbNVFqEBszfcaVbsgVUEaiZHNHfwcbvQ4odT09vuJ8T2zpnFoIEtRBW8jx96aOrCTy232nSQkKOXN0pB1ESe0RxaUvd4Ahr2JkPOYPz6ZtlAR2V03IvE5q&xkcb=SoA_-_M3K1IMWWw4iJ0BbzkdCdPP&p=10&fvj=0&vjs=3&jsa=1834&tk=1hbl00rvqkp1k800&from=jasx&wvign=1",
        "externalApplyLink": "https://cacareers-lafarge-na.icims.com/jobs/18437/job?utm_source=indeed_integration&iis=Job%20Board&iisn=Indeed&indeed-apply-token=73a2d2b2a8d6d5c0a62696875eaebd669103652d3f0c2cd5445d3e66b1592b0f&mode=job&iis=Indeed&iisn=Indeed.com",
        "companyDescription": "",
        "description": "Why work for Lafarge?:\n \n \n   As the global leader in innovative and sustainable building materials, we’re committed to shaping a \n  greener, \n  smarter and \n  healthier world. At Lafarge Canada Inc., \n  safety comes first, \n  collaboration matters and \n  diversity is celebrated with people who share our desire to continually \n  make our materials better.\n \n \n \n   Do you have the drive, the skills, and the passion to join us?\n \n  \n  Overview:\n \n \n   Reporting to the Quality Control Manager, the QC Technician - Aggregates is responsible for safely implement Quality Control for production and shipping of our products. He makes sure our Quality Plan is respected across our sites in the NCR.\n  Responsibilities:\n \n \n   Health & Safety \n \n \n  Work in a safe and effective manner following the Lafarge Safety Program and applicable legislation. Be directly involved in risk analysis necessary for lab activities, development and application of improvement plans in relation to Health & Safety and ergonomics. Work efficiently and in collaboration with the different teams.\n \n \n   Support to Operations \n \n \n  Insure the Quality Plan is applied across NCR sites. Analyze results and share them with the Production Staff to insure products compliance with relevant Code, Standard and Specifications. Make sure all testing results are entered in our QC software. Participate with Production Staff to conduct production adjustments needed to insure product conformance. Insure all technical documentation is updated according to our Quality Plan. \n \n \n  Technical Support and Quality Control \n \n \n  Maintain excellent relationships with Sales, Production and Distribution Staffs. Provide Customer support by supplying technical documents and datasheets and/or by visiting customer job sites for technical troubleshooting. Perform administrative activities and insure all documentation is updated in order to maintain our CCIL Certification. Support the Sales, Production or Administrative Staffs when necessary (report preparation, special projects or other special requests). Participate in corrective/preventive action plans preparation and achievement to improve quality. \n \n \n  Physical Attributes \n \n \n  While performing the duties of this job, the employee is regularly required to use hands to finger, grasp, handle, or feel. The employee frequently is required to stand; walk; climb stairs & ladders; reach with hands and arms; talk, hear and smell. Infrequently the employee is required to work in awkward situations; balance; stoop, kneel or crouch. The employee must frequently lift and/or move up to 25 pounds, occasionally lift and/or move up to 50+ pounds. Specific vision abilities required by this job include close vision, color vision, peripheral vision, depth perception, and the ability to adjust focus. Employee must perform work outdoors in all weather conditions, and will work around moving mechanical parts and equipment. Various PPE will include safety boots, reflective clothing, safety glasses, gloves and hard hat. Additional PPE may be required depending upon tasks. \n \n \n  Relationship with Others \n \n \n  Reports to the EON & GMA Quality Control Manager Collaboration and Team work with other QC Technician Works closely with Production, Distribution, and Sales Staffs \n \n \n  Specific Accountabilities: \n \n \n  Safety \n  Product quality control and performance \n  Customer service and support \n  Troubleshooting \n  Implementation of best practices and quality control process \n  Quality Policies and Training \n \n \n  Dimensions: \n \n \n  Volume: 7 Million tons (3.5M production and 3.5M shipping) \n  Direct reports: None\n  Qualifications:\n \n \n   Education & Work Experience:\n \n \n   Post-secondary education in Civil engineering or equivalent\n   Experience in materials quality control (an advantage)\n \n \n   Knowledge & Skills:\n \n \n   Sound knowledge of OPSS, CSA and City of Ottawa standards.\n   Excellent knowledge of quality control tests and best construction practices at the job sites.\n   Fully valid Driver’s License Class G\n   Must also be able to work well as part of a team and independently\n   Good computer skills for Windows based software\n   Should have excellent written and oral communication skills and capable of creating good relationships internally and externally with our customers.\n   Motivated\n   Job Language: English (French an advantage)\n   Must be able to work in outdoor and indoor work environments.\n   Able to perform a variety of tasks, including moderate to heavy lifting.\n   This role is will require the handling of cements, aggregates, concrete and lab equipment.\n \n \n   Lominger Competencies:\n \n \n   Customer focus\n   Drive for results\n   Integrity and trust\n   Intellectual horsepower\n   Interpersonal savvy\n   Managing and measuring work\n   Process management\n  LafargeHolcim:\n \n \n   As we are reinventing the way the world builds, we need world-class talent to join our Lafarge Canada team: people who are \n  passionate, driven by \n  curiosity and keen to \n  grow, \n  learn, develop and \n  thrive in our high-performance culture.\n \n \n \n   Whatever you do, you will make a difference here. Because we know that your passion and curiosity are the natural resources the world needs.\n \n \n \n   We thank you for your interest. Only candidates selected for an interview will be contacted. Lafarge is committed to the principles of employment equity and encourages the applications from women, visible minorities, and persons with disabilities.\n \n \n \n   Lafarge Canada Inc. welcomes and encourages applications from people with disabilities. In Ontario, our organization/business is committed to fulfilling our requirements under the Accessibility for Ontarians with Disabilities Act. Accommodations are available on request for candidates taking part in all aspects of the selection process."
    },
    {
        "id": "b8813e8a725f5043",
        "company": "Oxford Learning Centres, Inc.",
        "positionName": "High School Math & Science Teacher",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:50:49.738Z",
        "url": "https://www.indeed.ca/rc/clk?jk=b8813e8a725f5043&from=jasx&tk=1hbl00rvqkp1k800&vjs=3",
        "externalApplyLink": "https://oxfordlearning.talentnest.com/en/posting/141754/location/170589?source=indeed",
        "companyDescription": "",
        "description": "High School Math & Science Teacher/Tutor Wanted \n Motivated by mathematics? Sharp with science? Excited by equations in both fields? Eager to help students succeed in math and science? \n  Oxford Learning Rockcliffe is currently seeking part-time teacher-tutors for a role in our learning centre. This position is perfect for anyone who loves working with students, enjoys numbers and equations, and is passionate about helping others build their skills in these areas. \n  Tutor-teachers at Oxford Learning do not have to lesson plan before class, as all lessons are pre-planned. Applicants will be fully trained in our proprietary philosophy and methods. \n  Position Requirements \n  All Teacher-Tutors at Oxford Learning work during after-school and evening hours evening hours (3:00pm - 7:00pm) as well as some Saturdays (10:00am - 3:00pm). A commitment until the end of the term in June is preferred. Continuing through the summer is even better. Your students will love working with you, and being reliable is a must. \n  This role is in-person. You must be able to commute to this location. This is not an online position. Vulnerable sector screening is mandatory. \n  We encourage you to apply if you have the majority of the following requirements: \n  Education: \n  \n  Bachelor’s degree or similar certification in a relevant field \n  Fourth year university students with extensive tutoring experience will be considered \n  Teaching certification an asset \n  Good knowledge of the current Grades 9-12 math and science curriculum, particularly senior math and including, but not limited to, Advanced Functions, Algebra, Trigonometry and Calculus, and Vectors, Physics, Chemistry, and Biology. \n  \n Experience: \n  \n  Some experience teaching/tutoring math at a Grade 9 to 12 (or equivalent) level \n  Strong English written and oral communication skills \n  Strong math skills and ability to guide students’ understanding \n  Ability to multitask and balance working with up to three students at a time \n  \n Responsibilities (Position Details) \n  You will work directly with students as an Interactive Coach with the following responsibilities: \n  \n  Teaching up to 3 students at a time at different levels \n  Teaching online and in-person \n  Following the Oxford Learning methodologies and philosophies \n  Filling in post-lesson notes \n  Completing daily student communication updates \n  Maintaining a friendly and professional manner at all times \n  \n Smiles, High-Fives & Happy Students \n  In this position, you will play a key role in helping students develop their self-confidence and self-esteem. The rewards of helping children overcome academic hurdles and realize their inner potential can be very fulfilling. You will be rewarded with smiling faces and high-fives during every shift. Other rewards of the role include: \n  \n  fun staff events \n  ongoing training opportunities \n  frequent check-ins and feedback \n  company growth opportunities \n  hands-on development of your teaching skills \n  \n Job Type: Part-time \n  Salary Range: $16 - $18 / hour \n  Schedule: \n  \n  Evenings \n  Monday to Friday \n  Saturday availability \n  \n About Oxford Learning \n  Oxford Learning is a Canadian supplemental education provider helping students get better grades since 1984. Offering a full range of programs for students of all ages and abilities, Oxford Learning uses the science of cognitive learning to help all students develop stronger learning skills they can rely on for life! \n  Are you the superstar teacher-tutor we have been searching for? Apply now! \n  Oxford Learning Rockcliffe \n  359 St Laurent Blvd, Ottawa, ON \n  Tel: (613) 288-2138 \n  We thank all applicants for their interest in joining the team at Oxford Learning Rockcliffe. However, only those selected for the interview process will be contacted."
    },
    {
        "id": "bfa3a34e17f9593f",
        "company": "Blyth Academy",
        "positionName": "Senior Science Teacher",
        "jobType": [],
        "location": "983 Bank St, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:51:00.518Z",
        "url": "https://www.indeed.ca/rc/clk?jk=bfa3a34e17f9593f&from=jasx&tk=1hbl00rvqkp1k800&vjs=3",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "Job description\nBlyth Academy is a private high school looking for a qualified senior science teacher to join our school team. We are looking for someone who is familiar with the Ontario curriculum and is adept at engaging students in meaningful and creative ways. The ideal candidate will be passionate about teaching and inspiring students.\nResponsibilities:\n\n Design and implement lesson plans, including engaging and educational content\n Establish and maintain a positive classroom environment that encourages learning, creativity, and engagement\n Provide instruction in all areas of Biology and Chemistry\n Use a variety of teaching methods, including hands-on learning, media, interactive games, and extended writing/oral work\n Maintain a safe, clean lab environment and follow all school policies and procedures\n Attend class meetings and trainings, as required\n Attend teacher meetings and trainings, as required\n Run, participate in extracurricular activities, as required\n\nQualifications:\n\n Bachelor’s degree in Education, science (chemistry and/or biology) or related field preferred. Related field experience is acceptable.\n Previous experience teaching high school students preferred. A combination of classroom experience and training is required.\n\nJob Types: Part-time, Full-time, Fixed term contractPart-time hours: 35 per week\nSalary: $20.00-$45.00 per hour\nSchedule:\n\n Day shift\n Monday to Friday\n\nAbility to commute/relocate:\n\n Ottawa, ON K1S 3W7: reliably commute or plan to relocate before starting work (required)\n\nEducation:\n\n Bachelor's Degree (required)\n\nExperience:\n\n teaching: 1 year (preferred)\n\nWork Location: In person\nExpected start date: 2023-08-31"
    },
    {
        "id": "3cc74e420ea79be7",
        "company": "Dynacare",
        "positionName": "Lab Assistant",
        "jobType": [],
        "location": "Orleans, ON",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:50:51.085Z",
        "url": "https://www.indeed.ca/rc/clk?jk=3cc74e420ea79be7&from=jasx&tk=1hbl00rvqkp1k800&vjs=3",
        "externalApplyLink": "https://jobs.jobvite.com/careers/dynacare/job/o6GPnfwI?__jvst=Job+Board&__jvsd=Indeed",
        "companyDescription": "",
        "description": "Dynacare is currently looking to hire French bilingual Laboratory Assistants to work as floats in our Laboratory and Health Services Centre (LHSC) in Eastern and Southern Ottawa. . This a permanent full-time position.  Dynacare offers day shifts, full benefits, paid vacation, set work schedules and a great work life balance.  Job Summary\n  As Laboratory Assistant, you will be responsible for obtaining quality blood samples and other specimens from patients, as well as conducting other patient tests, all in keeping with Dynacare’s mission and values. Working as part of a team, you will assist in building a positive team environment, maintaining quality metrics and creating the ideal customer experience.\n  Key Qualifications\n \n   Completion of Secondary School and a Laboratory Assistant training program, with specialized training in phlebotomy\n   Customer focused with a genuine care for patient’s health\n   Demonstrated skill in phlebotomy, with the ability to manage anxious patients through the sample obtaining process in a pleasant, calming and reassuring manner\n   Demonstrated ability to prioritize and self-manage and work in a deadline oriented environment\n   Strong attention to detail\n   Proficiency in English, both written and verbal, at a level that enables you to communicate instructions, clearly and understandably, to patients\n \n  Responsibilities\n \n   Create an ideal customer experience that is best in class and engages with individuals around our products and services\n   Accurately data enter patient and test information for Ministry of Health requisitions\n   Obtain quality blood samples and other specimens from patients, using skillful venipuncture techniques, performed in keeping with Dynacare’s mission and values\n   Sort and steer specimens, perform ECG’s, Holter Hookups, paternity, urine, drug and breath alcohol collections\n   Ensure specimens and supporting documentation are completed as required in SOPs and ready for data entry and transportation to the laboratory, following established protocols for the handling of suitable and unsuitable samples\n   Ensure all confidential information is maintained in a secure fashion\n   Contribute to meeting the departmental/corporate quality metrics, regulatory compliance and quality indicators\n \n  Nice to have\n \n   Bilingual an asset\n \n  DNA of an Ideal Dynacare Employee\n  I make a difference in people’s lives. I am a caring, collaborative team-player who is passionate about quality and continuous improvement.\n \n   Caring - I demonstrate strong empathy and genuine concern for my colleagues, patients and customers.\n   Collaborative Team Player - I know I play a key role in helping the Dynacare team achieve success. I am comfortable in a changing environment, and I can easily manage multiple priorities.\n   Passion for Quality and Continuous Improvement - I am always looking to learn and solve problems. I am detailed oriented, adaptable and find ways to make things better.\n \n  In addition, I exhibit the following behaviors everyday: Respects and values others, focuses on customers and builds positive working relations.\n  Dynacare has been a “Top Employer” for many years and there is a reason why. We are a great place to work.\n  At Dynacare, we’re proud to hire the best people. If you are looking for a meaningful career where you can support healthy lives with commitment and care – we would like to meet you. To apply for this position, you will be asked to submit your resume and complete the application process.\n  If your qualifications and experience fit with this position, we will contact you to learn more. We hope you will join us in our journey to become Canada’s health and wellness solutions leader.\n  Dynacare is proud to be an equal opportunity employer committed to the attraction, selection, advancement and fair treatment of all individuals. We believe that our diversity is our strength so we employ a diverse workforce and respect the needs of all our employees.\n  In accordance with the Ontario Human Rights Code, Accessibility for Ontarians with Disabilities Act and the Dynacare Accommodation Policy a request for accommodation will be accepted as part of the Dynacare hiring process."
    },
    {
        "id": "e19e23f089fb553b",
        "company": "Isologic Innovative Radiopharmaceuticals",
        "positionName": "Night Shift Lab Technologist - Radiopharmacy - Lab Technician",
        "jobType": [],
        "location": "1053 Carling Ave, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:51:04.291Z",
        "url": "https://www.indeed.ca/rc/clk?jk=e19e23f089fb553b&from=jasx&tk=1hbl00rvqkp1k800&vjs=3",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "ISOLOGIC Innovative Radiopharmaceuticals is a nationwide radiopharmaceutical company, dedicated to nuclear medicine and the science of Radiopharmaceutical production. Our commitment to these fields extends to the communities we serve. We utilize our significant experience, expertise and networks in Nuclear Pharmacy to provide our customers and patients with reliable; safe and high quality radiopharmaceutical products and services. This position is for a full-time permanent role with rotating shifts (8am to 4pm, 2:45am to 11:15am, 4am to 12:20pm).\nKey Duties & Responsibilities\n\n Sets up, prepares and dispenses radiopharmaceuticals\n Handles and packages radiopharmaceuticals and hazardous materials in compliance with Company policies, corporate standards and Health and Safety rules\n Exemplifies compliance with all regulations, Company policies, Corporate standards and Health and Safety rules\n Processes returned medical waste and maintains returned reusable supplies in compliance with all regulations and Company policies\n Maintains cleanliness of the laboratory in accordance with the facility housekeeping schedules\n Manages bio-hazardous waste and prepares paperwork for its ultimate disposal\n Performs inventory control by reviewing and documenting/verbalizing stock needs to pharmacy personnel\n Completes radiation wipes and surveys on shipping containers, pharmacy supplies, incoming packages, work spaces and vehicles\n Actively participates in maintaining a safe work environment by completing required training, providing suggestions for improving the Quality and EHS program\n Performs quality control tests on equipment and prepared products\n Performs leukocyte labeling procedures\n Supports Facility Operations by performing data entry into computer system\n Follows aseptic garbing, personnel hygiene and aseptic control procedure at all times while working in the restricted area\n Complies with Quality Manual, Quality Management System, Quality Management Policy, applicable laws and regulation, as they apply to this role\n Completes all required Quality & Compliance training within the defined deadlines\n Identifies and reports any Quality & Compliance concerns to on-site Manager, Quality\n Receives and processes radiopharmaceutical Active Pharmaceutical Ingredients (API), when required\n\nExperience and Education Required\n\n College diploma in a related field\n Certified Nuclear Medicine Technologist (CNMT) or current enrollment in an accredited Nuclear Medicine Technologist Program, an asset\n Experience in handling radioactive materials\n Experience in the preparation, dispensing, shipping and receipt of radiopharmaceuticals, an asset\n Ability to accommodate shift changes based on business needs, variable hours starting from: 8am to 4pm, 2:45am to 11:15am, and 4am to 12:20pm\n Strong interpersonal skills with an emphasis on effective communications and ability to work with diverse personalities and skill levels.\n\nJoining the ISOLOGIC team means adhering to a friendly, productive and stimulating work environment while enjoying favorable conditions such as a dynamic and flexible environment for continuous improvement, where your new ideas and know-how will be encouraged; Challenges up to your talent that will make a real difference;\nJoin our talent team and send us your resume as soon as possible\nBenefits:\n- Location offers onsite cafeteria and coffee shops\n- Central location in Ottawa\nOnly those candidates selected for interviews will be contacted.\nWe are an equal opportunity employer.\nOUR VALUESDRIVE OUR DAILY ACTIONS AND DECISIONS\nETHICS AND INTEGRITY, CUSTOMER FOCUS, COLLABORATION, INNOVATION, PASSION, EXCELLENCE\nJob Types: Permanent, Full-time\nBenefits:\n\n Dental care\n Disability insurance\n Employee assistance program\n Extended health care\n Life insurance\n On-site gym\n On-site parking\n RRSP match\n Vision care\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n 8 hour shift\n Night shift\n\nSupplemental pay types:\n\n Overtime pay\n\nCOVID-19 considerations:Isologic maintains an aseptic environment in the laboratory and has measures in place to follow the recommended Public Health guidelines for Covid-19.\nWork Location: In person"
    },
    {
        "id": "7e0af9d9dca9e1ed",
        "company": "Eurofins Canada Environment Testing",
        "positionName": "Laboratory Technician _Organics _ Eurofins Environment Testing",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:50:59.220Z",
        "url": "https://www.indeed.ca/rc/clk?jk=7e0af9d9dca9e1ed&from=jasx&tk=1hbl00rvqkp1k800&vjs=3",
        "externalApplyLink": "https://jobs.smartrecruiters.com/Eurofins/743999921309491-laboratory-technician-organics-eurofins-environment-testing",
        "companyDescription": "",
        "description": "Company Description\n  Eurofins Scientific is an international life sciences company, providing a unique range of analytical testing services to clients across multiple industries, to make life and our environment safer, healthier and more sustainable. From the food you eat, to the water you drink, to the medicines you rely on, Eurofins works with the biggest companies in the world to ensure the products they supply are safe, their ingredients are authentic and labelling is accurate. Eurofins believes it is a global leader in food, environmental, pharmaceutical and cosmetics products testing and in agroscience CRO services. It is also one of the global independent market leaders in certain testing and laboratory services for genomics, discovery pharmacology, forensics, CDMO, advanced material sciences and in the support of clinical studies.\n  In over just 30 years, Eurofins has grown from one laboratory in Nantes, France to over 58,000 staff across a network of more than 1 000 independent companies in over 54 countries and operating more than 900 laboratories. Eurofins offers a portfolio of over 200,000 analytical methods to evaluate the safety, identity, composition, authenticity, origin, traceability and purity of biological substances and products, as well as providing innovative clinical diagnostic testing services, as one of the leading global emerging players in specialised clinical diagnostics testing.\n  In 2021, Eurofins generated total revenues of EUR € 6.7 billion, and has been among the best performing stocks in Europe over the past 20 years.\n \n \n\n Job Description\n  Primary Purpose: Under direct supervision of the Laboratory Supervisor, this position is responsible for conducting sample preparation and analysis using the appropriate analytical methods.\n \n   Perform sample extractions according to applicable SOPs and test methods;\n   Perform sample analysis, integration, and data entry into the LIMS system;\n   Perform method validation procedures for applicable test methods;\n   Maintain good laboratory housekeeping at all times;\n   Perform regular instrument maintenance, troubleshooting and calibration;\n   Keep track of consumables inventory and request supplies for ordering, as required;\n \n \n   Follow the Quality System as documented in the Quality Assurance Manual; and\n   Other related duties as assigned.\n \n \n \n\n Qualifications\n  \n \n   University degree or college diploma in a chemistry-related field;\n   Basic computer literacy;\n   Experience with GCs and organics testing an asset;\n   Laboratory safety and WHMIS training;\n   Troubleshooting skills required for instrument maintenance;\n   Technical knowledge of applicable test methods; and\n   Weekend and/or evening shifts may be required.\n \n  Additional Information\n  temporary position\n  37.5 hours per week"
    },
    {
        "id": "0dfb0cb6ca7d7821",
        "company": "Quadra",
        "positionName": "Regulatory Affairs Manager",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:50:58.393Z",
        "url": "https://www.indeed.ca/rc/clk?jk=0dfb0cb6ca7d7821&from=jasx&tk=1hbl00rvqkp1k800&vjs=3",
        "externalApplyLink": "https://can231.dayforcehcm.com/CandidatePortal/en-US/quadra/Posting/View/1100?source=Indeed",
        "companyDescription": "",
        "description": "Position: Regulatory Affairs Manager \n\nLocation: Based out of Burlington, Ontario or Vaudreuil-Dorion, Quebec (Hybrid / Flexibility Policy) \n\nProducts Portfolio: Industrial Chemicals, Mining, Oil & Gas, HI&I, Chemical Adhesives, Coatings, Food, Nutritional Ingredients and much more. \n\nStatus: Permanent, full-time \n\n We are seeking a Regulatory Affairs Manager to join our Regulatory Affairs Team that spans our Canadian and US portfolio. The ideal candidate will have experience industrial chemical industry. Reporting to the Director, Compliance, the Regulatory Affairs Manager plays a key role in expanding Quadra’s portfolio of products in Canada and in the United-States. This person will be responsible for managing the activities of his or her team while leading the new products screening procedures in order to meet our effective compliance program. \n\n As a strong regulatory manager, you will bring your comprehensive knowledge of regulatory compliance, meticulous attention to detail, and strong analytical skills to ensure our organization's adherence to regulatory requirements. In this role, you will have the opportunity to lead and inspire a talented team, fostering a culture of excellence and driving successful outcomes. By joining our team as a Regulatory Affairs Manager, you will be instrumental in shaping the future of our organization and making a positive difference for our valued clients. \n\n About your future team \nAt Quadra, we put people first so that together, we can reimagine the possibilities. \nBased in Burlington, Ontario or Vaudreuil-Dorion, Quebec, our modern head office is home to over a hundred fun-loving professionals. Of course, you can always take advantage of our hybrid telecommuting policy. Founded over 45 years ago, Quadra is dedicated to its 550+ employees located in Canada and the United States. Quadra Chemicals is one of the largest distributors of chemicals and ingredients in the Canadian marketplace. With multiple facilities across Canada, we are committed to delivering excellence in everything we do. We are a rapidly growing company with a long-term commitment to our employees. If you are committed to excellence, you belong at Quadra. At Quadra, we have created an environment where people are a priority and opportunities are growing. Our culture based on our core values of entrepreneurship, innovation and caring make us an employer of choice. \n\n We believe in fostering a work environment that challenges and empowers individuals, providing ample opportunities for personal growth and development. We recognize and celebrate outstanding performance, ensuring that your dedication and achievements are duly acknowledged. \n\n What will you bring to the team? \n\n \n A strong technical knowledge of pertinent government regulations and associated compliance requirements as well as insight in determining compliance pathways for new business areas developed by the company \n Being an active member with industry associations, including, but not limited to, participation on the Responsible Distribution Canada’s and NACD \n Excels in managing priorities, is resourceful and a relationship-builder \n Being known as a positive leader that works well with cross-functional teams (QA, Sales, Operations, etc.) \n Being acknowledged by peers as an expert in order to respond to external requests related to regulatory affairs \n Excellent communicator, focused on customer service, curious and eager to achieve excellence for his/her team \n Strong attention to detail, accuracy and precision \n A passion for the industry with a desire to share with your peers \n \nYou would be responsible for:\nTeam Management:\n \n \n Leading day-to-day Regulatory Affairs compliance activity regarding pertinent chemical, food and pharmaceutical regulations as they apply to the Canadian and US chemical distribution industry sector \n Leading department workflow to ensure a structured approach to compliance activity \n Ensuring that regulatory compliance activity meets all government requirements, and that department output is meeting Quadra’s commercial needs for efficient integration of compliance oversight in business operations \n Supervision of team members; establish departmental goals, action plans and strategies as well as mentoring/coaching, managing performance, hiring, onboarding, etc. \n Work in collaboration with the Director, Compliance Assurance to establish department goals and objectives \n New Product Regulatory Evaluation and Set-Up, Ongoing Regulation Compliance: \n\n \n Development and implementation of efficient Regulatory Affairs procedures to determine the CEPA/TSCA status of all new products and the identity of product ingredients \n Mentoring the Regulatory Affairs team regarding CEPA new substance screening activities \n Managing new product screening procedures that encompass compliance with many other product use regulations which reflect the wide diversity of industry sectors served: Food & Drugs Act and associated regulations, Transportation of Dangerous Goods Regulations, Drug Precursor Regulations, Explosive Regulations, WHMIS/GHS and additional Quadra internal requirements such as product High Risk classification \n Management of new product set-up workflow to facilitate a robust and efficient compliance program \n Product Registration Activity: Preparation and submission of pertinent product use approval submissions (i.e. NSN, fertilizers, animal feeds, pesticides, biocides, Food & Drug related use approvals, etc.) \n Management of regulation compliance (for existing regulations) to include procedure revisions when regulations are updated \n CEPA and TSCA Substances Management \n\n \n Monitoring of Canada Gazette and other industry association resources to identify government mandated reporting activities associated with chemical product importation and sales \n Supervising Quadra Significant New Activity Canada (SNAC) and Significant New Use (SNAN) submission activities \n Product Safety – WHMIS 2015 and US GHS Compliance \n\n \n Ensuring software resources are kept current and operating at full efficiency \n Management of product safety workflow to facilitate priority requirements \n Communicating with Quadra employees to ensure their awareness of system tools, including training requirements regarding the WHMIS 2015 and US GHS hazard communication system \n Assist in the preparation and presentation of ad hoc and routine department and management reports including compiling Chemical Data Reports (CDR) \n How will you be successful in this Regulatory Affairs Manager role? \n\n \n Possessing a master’s degree in strategic management, business administration or a Graduate certificate in Regulatory Affairs would be considered as an asset \n Bachelor's degree in Chemistry, Life Sciences, or any related field to science industry \n Minimum of 10-12 years of experience as a Regulatory Affairs Manager, Regulatory Affairs Supervisor, or other experience in the field of expertise with at least 8 years in the pharmaceutical, food ingredients or chemical industry (manufacturing or distribution) \n Thorough knowledge of regulatory affairs requirements for chemical industrial, energy and/or mining \n Proven experience in team management/leadership including performance management, recruitment, coaching and mentoring \n Strong knowledge of the Canadian Environmental Protection Act (CEPA) and the Toxic Substances Control Act (TSCA) \n Strong knowledge of Environment Canada’s new and existing substance programs and their various initiatives (Chemical Management Plan, Section 71 mandatory surveys, voluntary surveys, DSL updates, etc.) and required compliance requirements \n Knowledge of WHMIS 2015 regulations the associated classification criteria and system elements including WHMIS ingredient trade secret submissions \n Advanced knowledge of Canadian and US federal and provincial requirements \n Excellent oral and written communication skills, primarily in English. Bilingualism (French and English) will be mandatory to work from our Vaudreuil Office \n Advanced experience with the Office Suite as well as hands-on practical experience with Salesforce would be an asset \n Open to travel between Burlington and Vaudreuil if needed (Limited travel, less than 10%) \n At Quadra, we offer not only an engaging culture, a collaborative, family-oriented and supportive environment, but also plenty of autonomy and flexibility. We also offer you the opportunity to be part of a professional, fun, innovative and committed team in a growing, people-oriented, Great Place to Work® certified organization. In addition to being Great Place to Work® certified, Quadra has been recognized as one of the Best Managed Companies for over 20 years and as a Great Place to Work for Women®! You will work with dynamic colleagues who are eager to share their knowledge with you. \n\n Benefits for choosing Quadra? \n\n \n Enjoy a permanent full-time position with stability \n Benefit from a competitive salary and an enticing performance incentive program \n Receive excellent benefits coverage (dental, medical, and much more!) \n Programs offered to employees to improve their quality of life (Wellness Portfolio) \n Virtual care/telemedicine for you and your loved ones; 24/7 access to a physician \n Virtual wellness and mental health programs with a global healthcare leader \n Retirement plan with a match and several long-term investment programs \n Take advantage of personal, & flexible days as well as vacation time \n Telecommuting and flexibility within the organization \n Experience a great work environment every day where caring for each other and having fun are integral to our core values \n Be part of a company that promotes diversity, equity, and inclusion \n Digital environment \n Customized training built for you \n Opportunities for advancement and professional development; a growing company that focuses on its people! \n Participate in various internal and external trainings \n Possibility of joining various company committees \n Engage in social activities organized by the company \n Employee recognition program (years of service, merit awards, etc.) \n Private and family-owned company with a solid infrastructure \n Employee assistance program (EAP) \n Monthly cell phone & internet allowance \n And much more! \n If you are ready to unlock your potential, make a meaningful impact, and embark on a rewarding career in Regulatory Affairs, we warmly invite you to submit your resume, highlighting your experience and enthusiasm for this field. Let us join forces to redefine excellence in customer service, shaping a brighter future for Quadra and our esteemed clients. \n\n Quadra supports and values diversity and offer equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status and gender identity. Quadra also welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process. We recognize that some people do not identify themselves as either male or female. Therefore, whenever possible, we have opted for a gender-neutral (or gender-neutral) wording in a non-discriminatory spirit."
    },
    {
        "id": "a24b54eda16c3948",
        "company": "University of Ottawa",
        "positionName": "Assistant, Associate or Full Professor in Physical Chemistry",
        "jobType": [],
        "location": "40 Ruskin St, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:51:08.264Z",
        "url": "https://www.indeed.ca/rc/clk?jk=a24b54eda16c3948&from=jasx&tk=1hbl00rvqkp1k800&vjs=3",
        "externalApplyLink": "https://uottawa.wd3.myworkdayjobs.com/en-US/uOttawa_External_Career_Site/job/Ottawa-ON/Assistant--Associate-or-Full-Professor-in-Physical-Chemistry_JR4387",
        "companyDescription": "",
        "description": "Job Family:\n  Academic Leadership and Faculty\n \n   Union affiliation:\n \n  APUO\n \n \n   Faculty/Department:\n  Department of Chemistry and Biomolecular Sciences_FT\n \n \n   Campus:\n  STEM\n \n \n   Date Posted:\n  août 22, 2023\n \n \n   Closing Date:\n \n \n   Note: Applications will be accepted until 11:59 PM on the day prior to the Posting End Date above\n \n \n \n   Assistant, Associate or Full Professor in Physical Chemistry\n \n \n \n   The University of Ottawa invites applications for a professor in Physical Chemistry. Candidates are sought whose interests are at the interface of photonics and multidimensional spectroscopy, and who propose to develop (or are already actively engaged in) a research program in physical chemistry. The successful candidate will have access to the world-class Centre for Advanced Computing, and benefit from facilities part of the Centre for Catalysis Research and Innovation and world-class photonics research and facilities in the Advanced Research Complex. The Department of Chemistry and Biomolecular Sciences at the University of Ottawa is currently ranked #5 in Canada and is one of the top 125 departments worldwide (according to QS) and currently hosts two winners of the Herzberg Canada Gold Medal, five Canada Research Chairs, and five University Research Chairs.\n \n \n \n   Required qualifications and work experience: PhD or equivalent in Chemistry and postdoctoral experience is mandatory. Candidates should demonstrate an excellent research track record in physical chemistry with an emphasis on photonics and/or multidimensional spectroscopy. In addition, candidates must demonstrate an enthusiasm for teaching and graduate training, a strong track record and commitment to interdisciplinary collaboration, the ability to secure external research funding, and excellent communication skills in English and French are assets. An interest in teaching in French is essential. Tenure is conditional on active knowledge of Canada's other official language.\n \n \n \n   Title of the position: Assistant, Associate or Full Professor\n \n \n \n   Rank and salary: Regular tenure-track academic appointment in the Faculty of Science, with a salary consistent with the collective agreement of the Association of Professors of the University of Ottawa.\n \n \n \n   Application Package:\n \n \n   A cover letter;\n   A curriculum vitae (if applicable, explain any career interruptions that might have affected research productivity);\n   A research plan demonstrating a strong commitment to research excellence;\n   A statement of equity, diversity, and inclusion training and mentorship plan\n   A teaching philosophy statement; and\n   The names and contact information of three people who may be contacted by the University for letters of reference.\n \n \n \n   Deadline: August 31, 2023\n \n \n \n   The selection process will begin in early September and continue until the position is filled. Only candidates selected for an interview will be contacted.\n \n \n \n   The application package should be submitted electronically through the uOttawa Academic Careers website (\n  \n   Academic and Executive Careers\n  ) and address the cover letter to :\n \n \n \n   Prof. John Pezacki, Chair\n \n \n   Department of Chemistry and Biomolecular Sciences\n \n \n   University of Ottawa\n \n \n   10 Marie Curie (DRO108)\n \n \n   Ottawa, ON Canada K1N 6N5\n \n \n   Ph 1-613-562-3346\n \n \n   Fax 1-613-562-5193\n \n \n  \n    CHMChair@uottawa.ca\n  \n \n \n \n   Location of work: Department of Chemistry and Biomolecular Sciences, University of Ottawa, DRO Complex, 10 Marie Curie, Ottawa, ON K1N 6N5\n \n \n   The University of Ottawa is committed to ensuring equity, diversity and inclusion in the scholarly and leadership environments of our students, staff, and faculty. Accordingly, we strongly encourage applications from Indigenous Peoples in Canada, visible minorities members (racialized persons), persons with disabilities, women, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse and inclusive communities. Candidates who wish to be considered as a member of one or more designated groups are asked to complete the confidential Self-Identiﬁcation Questionnaire, to be completed at the time of application.\n \n \n   According to government policy, all qualified candidates are invited to apply; however, preference will be given to Canadians and permanent residents. When submitting your application, please indicate if you are legally entitled to work in Canada.\n \n \n \n   The University of Ottawa provides accommodations for applicants with disabilities throughout the recruitment process. If you are invited to proceed in the selection process, please notify us of any accommodations that you require by contacting the Office of the Vice-Provost, Faculty Relations by email at \n  \n   vra.affairesprofessorales@uottawa.ca\n  . Any information you send us will be handled respectfully and in complete confidence.\n \n \n \n   The University of Ottawa is justly proud of its 160-year tradition of bilingualism. Through its Official Languages and Bilingualism Institute, the University provides training to staff members and their spouses in their second official language. At the time of tenure, professors are expected to be able to function in a bilingual setting. In certain cases, professors must have the ability to teach in both official languages to be granted tenure.\n \n \n \n   The University of Ottawa is committed to ensuring equity, diversity, and inclusion in the scholarly and leadership environments of our students, staff, and faculty. Accordingly, we strongly encourage applications from Indigenous Peoples in Canada, visible minorities members (racialized persons), persons with disabilities, women, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse, and inclusive communities. Candidates who wish to be considered as a member of one or more designated groups are asked to complete the confidential Self-Identification Questionnaire, to be completed at the time of application.\n \n \n \n   All qualified candidates are invited to apply; however, preference will be given to Canadians and permanent residents. When submitting your application, please indicate if you are legally entitled to work in Canada\n \n \n \n   The University of Ottawa provides accommodations for applicants with disabilities throughout the recruitment process. If you are invited to proceed in the selection process, please notify us of any accommodations that you require by contacting the Office of the Vice-Provost, Faculty Relations by email at \n  \n   vra.affairesprofessorales@uottawa.ca\n  . Any information you send us will be handled respectfully and in complete confidence.\n \n \n \n   The University of Ottawa is proud of its 160-year tradition of bilingualism. Through its Official Languages and Bilingualism Institute, the University provides training to staff members and to their spouses in their second official language.\n \n \n \n   Prior to May 1, 2022, the University required all students, faculty, staff, and visitors (including contractors) to be fully vaccinated against Covid-19 as defined in Policy 129 – Covid-19 Vaccination. This policy was suspended effective May 1, 2022 but may be reinstated at any point in the future depending on public health guidelines and the recommendations of experts."
    },
    {
        "id": "46e34efc327d8d60",
        "company": "Alberta Precision Labs",
        "positionName": "Medical Laboratory Assistant (Alberta, Canada)",
        "jobType": [],
        "location": "Ontario",
        "salary": null,
        "postingDateParsed": "2023-09-14T06:51:13.342Z",
        "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0BKoA0KjMB2_2SITHdZiKR2tLJiDQwQdMraFBOtj0fmnfR-Td6qATq9e8Dii-TEZmttxkF29KoVMomicbEbdo8mnwcyGUotTIf0wV1DxZBe_nj4g0BDCJNzF8mAErJuZgMTvqMC80EL98DVTmi4C73Ox8ljLHP1ZqOO73jiLk8AUmeuGfbKASmGo4Fa23COn6dzYyUgSBiut0W3b7zHi1TGCMIfvyRBIO_DGzD8CFupeECXU85DcRyhEttbYXE4WoWrIS5f-bENwMxeKpHdp8aPK6F32--OLxrg3da5FjAYLdVQQRKDyLJaRhhJ1_kYnqFJU8nfQ24CBLALyls9HAPsdVlUnzHp0uhj0K0IzSbrIEBMSoNXY7qF8boOO7vsu31r48uNPFUn6XoEO1BMg10xL8PHPb8Zgxlz3f52E3DV60JcozUgaYbnV6N9v-tQLQXzTulOtdp1GdVG6zW3KZpyLBhGjB5vDEEWZjfJd2mT6zVryLm57B4xrWv5sktvu69wrU-an14ysMCMqJ3GOZXroxVYeLoiWGZYbaS9NjDspqJ1n_xUykogHofL1LjxB5g%3D&xkcb=SoCU-_M3K031mxALjb0IbzkdCdPP&p=3&fvj=1&vjs=3&jsa=5980&tk=1hbkvuhtbkf1t800&from=jasx&wvign=1",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "Your Opportunity:\nAlberta Precision Laboratories (APL) is hiring multiple Medical Laboratory Assistants throughout Alberta.\nAPL delivers high-quality, responsive diagnostic lab services to Albertans as a part of the provincial healthcare system. With competitive salaries, opportunities for professional development, and comprehensive benefits, you can truly thrive. Make a difference in your own community as you help healthcare professionals and patients get the information that they need to improve, optimize, or maintain health.\nAs a successful candidate, you will have the opportunity to work both independently and as a member of our team where you may be responsible for performing all aspects within the scope of practice of a MLA including blood collection, specimen procurement and handling procedures, data entry, as well as Electrocardiogram (ECG) and Holter monitors, and urinalysis. You will have the opportunity to work in the community or hospital setting.\nWith a customer service focused approach, you build productive and respectful customer relations and take responsibility for customer satisfaction. You have an ability to encourage others, building positive, respectful and collaborative working relationships.\nJoin our professional and engaging team that encourages promoting a positive and respectful work environment consistent with the APL Values: kindness, inclusion, innovation, agility & accuracy.\nJob Description:\nAs an MLA, you will provide high quality service to clients of the clinical laboratory in an effective, efficient and safe manner. You will be responsible for a variety of laboratory functions including procurement, handling, processing, dispatching and testing of specimens, performing procedures and reporting results.\nQualifications:\nCompletion of an accredited Medical Laboratory Assistant program or equivalent.\nJob Types: Casual, Permanent, Part-time, Full-time, Fixed term contract\nSalary: $23.25-$28.98 per hour\nBenefits:\n\n Company pension\n Dental care\n Disability insurance\n Extended health care\n Life insurance\n Paid time off\n Vision care\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n Day shift\n Evening shift\n Night shift\n Weekends as needed\n\nWork Location: In person"
    },
    {
        "id": "90bcf37fbddc9860",
        "company": "Alberta Precision Labs",
        "positionName": "Medical Laboratory Technologist (Alberta, Canada)",
        "jobType": [],
        "location": "Ontario",
        "salary": null,
        "postingDateParsed": "2023-09-14T06:51:14.186Z",
        "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0BKoA0KjMB2_2SITHdZiKR2tLJiDQwQdMraFBOtj0fmnfR-Td6qATq9uOZ1-TDWBDzwp6MAA8ZhePQnmA_4BK-jRHFdLentfbOKSaxw_jWzwNGt8tg98WkwNrLXBYhRjVOlT8oTR4k8vZQLaoFSbxwTowq64vZucQLk99AwoPUBuuk57mzX9N4tlbaHfYdAGiFyHrbTJWcfWcYSwvc2QzqvGtVvmZIanhWdybSXFyY92MkInqaaVe8eNJjj6ZW2_SdKNRw_eLO6O7rI2eDF7NKM2TZ2hutpm9LJH7zRE09DpUVEhTbMTNJTUg1qKm5vU9EEFZa1E2ogc_oFW1DoPBBEEyFU9ShpuIUzcINMMacLpnj6WcTxd7NWDfyZIuCDTrl84dn_fz0udaW0zhFJgxpIEsv2eNdE-Kd2dbQYbnFqt6OkMhHaLZToCIfBQaRpSTOsGYP3zLsO9D_rWbsD5dqS_aw7GijAWnlWCUJp1MRcFGfcszqZjeWUmLp5D0dRng_BPwUwOU_K0R--Dv0NTcezD0-OsCWEmTTvBpsYS26-wC5XmBaHfh9GqoHVLSr1npg%3D&xkcb=SoAX-_M3K0314pR54h0NbzkdCdPP&p=6&fvj=1&vjs=3&jsa=5790&tk=1hbkvuhndkf0v802&from=jasx&wvign=1",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "Your Opportunity:\nAlberta Precision Laboratories (APL) is hiring multiple Medical Laboratory Technologists throughout Alberta.\nAPL delivers high-quality, responsive diagnostic lab services to Albertans as a part of the provincial healthcare system. With competitive salaries, opportunities for professional development, and comprehensive benefits, you can truly thrive. Make a difference in your own community as you help healthcare professionals and patients get the information that they need to improve, optimize, or maintain health.\nCome and join our diverse team and get the opportunity to utilize all of the skills and experiences you have gained through school. This is a working level position utilizing technical skills and judgment performing a diverse range of diagnostic procedures in the Clinical Chemistry, Hematology, Transfusion Medicine, and Specimen Procurement departments, within the scope of practice of a Medical Laboratory Technologist.\nJoin our professional and engaging team that encourages promoting a positive and respectful work environment consistent with the APL Values: kindness, inclusion, innovation, agility & accuracy.\nJob Description:\nAs a Medical Laboratory Technologist (MLT) I, you will be responsible for the daily processing, testing, results analysis and reporting of diagnostic samples within the laboratory department. You will perform a variety of routine and specialized procedures in the processing of specimens used in diagnosis, treatment and research.\nQualifications:\nCompletion of an accredited Medical Laboratory Technology (MLT) program. Active or eligible for registration and practice permit with the College of Medical Laboratory Technologists of Alberta (CMLTA).\nJob Types: Casual, Permanent, Part-time, Full-time, Fixed term contract\nSalary: $34.75-$45.77 per hour\nBenefits:\n\n Company pension\n Dental care\n Disability insurance\n Extended health care\n Life insurance\n Paid time off\n Vision care\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n Day shift\n Evening shift\n Night shift\n\nWork Location: In person"
    },
    {
        "id": "46e34efc327d8d60",
        "company": "Alberta Precision Labs",
        "positionName": "Medical Laboratory Assistant (Alberta, Canada)",
        "jobType": [],
        "location": "Ontario",
        "salary": null,
        "postingDateParsed": "2023-09-14T06:51:16.012Z",
        "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0BKoA0KjMB2_2SITHdZiKR2tLJiDQwQdMraFBOtj0fmnfR-Td6qATq9e8Dii-TEZmttxkF29KoVMomicbEbdo8mnwcyGUotTIf0wV1DxZBe_nj4g0BDCJNzF8mAErJuZgMTvqMC80EL98DVTmi4C73Ox8ljLHP1ZqOO73jiLk8AUmeuGfbKASmG55AtB7Bb1E8e2S9VpkFH0xWCrZ0FrRAo3u9OCMsKM6kUOezB20MQXhq5ZxvRGvLzTxPRhFuLEMSmr31zrQHqCKmzpDtDc5tPuSqQhLNvELN1pcOecc8TLo136eb4zn4DcJ-3VzAifNzVsIDDO05skHh2LiyJE_lZs45I_BnK11-czzQSzINh0LRcTwqlKIemvudgTwjBFaGZO11Vt9Q1urf3kQ6LF__7R0P2y_yZXBhEYN4upqzi42IQYWEw2OYrqFJBeXx2XpqRSf8QFK1iOFSKgpQjU5EB1FaOPBUC5Z6dFt2HBlUAYaOOiXJB7pwfHSLONRQq9nITMWVOQqk84aF15qqmov6yMpKBp1zihrswWy7EKMkLChLV6Ir2FzH1OO1wMtARXpA%3D&xkcb=SoA--_M3K0314pR54h0PbzkdCdPP&p=4&fvj=1&vjs=3&jsa=5790&tk=1hbkvuhndkf0v802&from=jasx&wvign=1",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "Your Opportunity:\nAlberta Precision Laboratories (APL) is hiring multiple Medical Laboratory Assistants throughout Alberta.\nAPL delivers high-quality, responsive diagnostic lab services to Albertans as a part of the provincial healthcare system. With competitive salaries, opportunities for professional development, and comprehensive benefits, you can truly thrive. Make a difference in your own community as you help healthcare professionals and patients get the information that they need to improve, optimize, or maintain health.\nAs a successful candidate, you will have the opportunity to work both independently and as a member of our team where you may be responsible for performing all aspects within the scope of practice of a MLA including blood collection, specimen procurement and handling procedures, data entry, as well as Electrocardiogram (ECG) and Holter monitors, and urinalysis. You will have the opportunity to work in the community or hospital setting.\nWith a customer service focused approach, you build productive and respectful customer relations and take responsibility for customer satisfaction. You have an ability to encourage others, building positive, respectful and collaborative working relationships.\nJoin our professional and engaging team that encourages promoting a positive and respectful work environment consistent with the APL Values: kindness, inclusion, innovation, agility & accuracy.\nJob Description:\nAs an MLA, you will provide high quality service to clients of the clinical laboratory in an effective, efficient and safe manner. You will be responsible for a variety of laboratory functions including procurement, handling, processing, dispatching and testing of specimens, performing procedures and reporting results.\nQualifications:\nCompletion of an accredited Medical Laboratory Assistant program or equivalent.\nJob Types: Casual, Permanent, Part-time, Full-time, Fixed term contract\nSalary: $23.25-$28.98 per hour\nBenefits:\n\n Company pension\n Dental care\n Disability insurance\n Extended health care\n Life insurance\n Paid time off\n Vision care\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n Day shift\n Evening shift\n Night shift\n Weekends as needed\n\nWork Location: In person"
    },
    {
        "id": "ba41edaabc9f3f10",
        "company": "National Research Council Canada",
        "positionName": "Research Associate, Aerosol and Gas Metrology",
        "jobType": [],
        "location": "1200 Montreal Rd, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:51:18.997Z",
        "url": "https://www.indeed.ca/rc/clk?jk=ba41edaabc9f3f10&from=jasx&tk=1hbkvuh1oj32s803&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=ba41edaabc9f3f10&atk=&xpse=SoAk67I3K1ID2_w9WR0LbzkdCdPP",
        "companyDescription": "",
        "description": "Help bring research to life and drive your career forward with the National Research Council of Canada (NRC), Canada's largest research and technology organization.\n     \n     \n    We are looking for 2 Research Associates in early-career for the Aerosol and Gas Metrology Team to support our Metrology Research Centre. Each Research Associate (RA) would be someone who shares our core values of Integrity, Excellence, Respect and Creativity.\n     \n     \n    The selected candidates will work on research related to the optical characterization of aerosols or gases. The selected candidates will conduct research independently, while gaining hands-on experience in aerosol and gas characterization with the support of researchers in a larger team. The research team has a wide spectrum of expertise in the emerging fields of aerosol science, climate science, gas characterization, spectroscopy, and metrology. The project is expected to address emerging challenges on the climate, a priority topic at NRC. There is a focus on short lived climate forcers (including aerosols and methane, among other gases), which are significant contributors to uncertainties that limit our understanding of climate change. The incumbent will work collaboratively with NRC researchers, academics, and industry partners to develop reliable diagnostic measurements in two streams:\n     \n     \n    \n     Stream 1: A new optical instrument capable of simultaneously measuring aerosol light absorption and scattering; \n     Stream 2: An optical instrument capable of characterizing concentrations of multiple gaseous species, including carbon dioxide, carbon monoxide and methane, with high precision and accuracy.\n    \n     \n     \n    The selected candidates are expected to work closely with the research team and produce refereed publications, technical reports, and/or patents (if applicable) as the project progresses. \n   \n  \n  \n   \n     Screening Criteria \n   \n   \n     Applicants must demonstrate within the content of their application that they meet the following screening criteria in order to be given further consideration as candidates: \n   \n  \n  \n   \n     Education \n   \n   \n     As part of the RA Program you must have received your PhD in Physics, Chemistry, Engineering Physics, Mechanical Engineering, or Electrical Engineering within the last five years or you expect to receive the degree within the next six months. The candidate must have a focus on optical techniques for characterization of aerosols or gases and development of methods thereof, as demonstrated by thesis work and/or publications.\n     \n     \n    For information on certificates and diplomas issued abroad, please see Degree equivalency \n   \n  \n  \n   \n     Experience \n   \n   \n    \n     Experience in optical diagnostic methods for measurements of aerosols or gases; \n     Experience in optical instrument design, system integration, troubleshooting, testing, and performance evaluation; \n     Experience with safe operation of lasers, compressed gases, and handling of delicate optical components and electrostatic-sensitive devices; \n     Practical experience working independently and within a team on joint projects and achieving recognized and quantifiable results; \n     Experience in spectroscopy or interferometry is considered an asset; \n     Experience in modelling light-aerosol interactions is considered an asset. \n    \n   \n  \n  \n   \n    Condition of Employment \n   \n   \n     Reliability Status \n   \n  \n  \n   \n     Language Requirements \n   \n   \n     English\n     \n     \n    Information on language requirements and self-assessment tests \n   \n  \n  \n   \n     Assessment Criteria \n   \n   \n     Candidates will be assessed on the basis of the following criteria: \n   \n  \n  \n   \n     Technical Competencies \n   \n   \n     Stream 1 - Aerosol metrology \n    \n     Proven ability to conduct research in characterization of aerosol properties, involving novel methods development, as demonstrated by peer-reviewed publications; \n     Advanced knowledge of optical aerosol instrumentation and components; \n     Practical knowledge of light–aerosol interactions; \n     Some knowledge with collision-induced and radiative heat transfer in an aerosol-laden gaseous matrix; \n     Practical knowledge of techniques in interferometry, phase sensitive detection, and noise reduction in electronic systems; \n     Proven ability in programming software for hardware control, data acquisition, and real-time data analysis; \n     Demonstrated ability to write quality scientific reports and articles; and \n     Demonstrated ability to communicate clearly in discussions and through presentations to project partners, and at scientific conferences, workshops and seminars.\n    \n     \n     \n    Stream 2 - Gas metrology \n    \n     Practical knowledge of molecular absorption spectra and spectroscopic techniques, as demonstrated by peer-reviewed publications, prior research or thesis work; \n     Demonstrated ability to design, fabricate, integrate and implement free-space or integrated photonic-based systems; \n     Practical knowledge and ability with fiber optics and fiber components; \n     Demonstrated ability in instrument control via software (e.g. C/C++, FPGA, Python, etc.) on embedded systems; \n     Knowledge of sensor calibration, testing, validation, troubleshooting and identifying points for improvement; \n     Demonstrated ability to write quality scientific reports and articles; and \n     Demonstrated ability to communicate clearly in discussions and through presentations to project partners, and at scientific conferences, workshops and seminars. \n    \n   \n  \n  \n   \n    Behavioural Competencies \n   \n   \n    Research - Results orientation (Level 1) \n    Research - Communication (Level 1) \n    Research - Teamwork (Level 1) \n    Research - Creative thinking (Level 1) \n   \n  \n  \n   \n    Competency Profile(s) \n   \n   \n     For this position, the NRC will evaluate candidates using the following competency profile: Research\n     \n     \n   \n  \n  \n   \n     Relocation \n   \n   \n     Relocation assistance will be determined in accordance with the NRC's directives. \n   \n  \n  \n   \n     Compensation \n   \n   \n     The intent of this hiring action is to staff through the Research Associate (RA) Program at the AsRO level, which is an early-career level position with a salary range of $74,230 to $103,093.\n     \n     \n    NOTE: Salary determination will be based on a review of the candidate’s expertise, outcomes and impacts of their previous work experience relative to the requirements of the level. As a guide, the current annual PhD recruiting rate is $74,230.\n     \n     \n    NRC employees enjoy a wide-range of competitive benefits including comprehensive health and dental plans, pension and insurance plans, vacation and other leave entitlements. \n   \n  \n  \n   \n     Notes \n   \n   \n     Application Requirements:\n     \n     \n    In order to be considered for the Research Associate program please include the following in your application. Failure to do so will result in your application being excluded from searches. \n    \n     Resume \n     Transcript \n     Two letters of recommendation\n    \n     \n     \n    When submitting your application you can include the required documents in any attachment field such as «Second language evaluation results» or «Other attachments».\n     \n     \n    \n     The applicants must clearly indicate within their application the stream in which they would like their application to be considered (Stream 1 or Stream 2) \n     Preference will be given to Canadian Citizens and Permanent Residents of Canada. Please include citizenship information in your application. \n     On-site attendance and work in a laboratory environment are required \n     The incumbent must adhere to safe workplace practices at all times. \n     We thank all those who apply, however only those selected for further consideration will be contacted.\n    \n   \n  \n \n  \n  \n Please direct your questions, with the requisition number (19855) to: \n E-mail: NRC.NRCHiring-EmbaucheCNRC.CNRC@nrc-cnrc.gc.ca \n Telephone: 438-455-5335 \n Closing Date: 26 October 2023 - 23:59 Eastern Time"
    },
    {
        "id": "76b495f5bc29ddf4",
        "company": "Watersedge Dental Laboratory",
        "positionName": "Dental Laboratory Assistant",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:51:33.253Z",
        "url": "https://www.indeed.ca/rc/clk?jk=76b495f5bc29ddf4&from=jasx&tk=1hbl034bekf34800&vjs=3",
        "externalApplyLink": "https://www.watersedgedentallab.com/careers/dental-laboratory-assistant-opening/",
        "companyDescription": "",
        "description": "Ottawa, ON \n                   $17 and up based on experience, for 40 hours per week. \n                   Permanent, Full time \n                  \n                 \n                \n               \n              \n             \n             \n              \n               \n                \n                 \n                  \n                   Day \n                   As soon as possible \n                   2 Vacancies \n                  \n                 \n                \n               \n              \n             \n            \n           \n          \n          \n           \n            \n             Job Requirements\n              Languages English\n              Education No degree, certificate or diploma\n              Experience Will train\n              Area of Specialization / Required Experience\n              Partial dentures; Orthodontic appliances; Gold dies and goldwork; Full dentures; Crowns and bridges; Chrome castings; Ceramic or porcelain application. Waxing-up; Polishing; Plastering; Packing; Assembly; Casting\n              Additional Details\n              Dental Laboratory assistant will prepare wax bite-blocks and impression trays; Prepare plaster models and moulds; Polish and buff dentures; Make orthodontic bands from metal and alloys; Finish metal framework of dentures; Cast gold or metal alloys for bridges and denture bases; Mould wax over dentures set-up; Pack plastic material in moulds to form full or partial dentures"
    }
]