[
    {
        "id": "0052e5087671f5f3",
        "company": "Live Dental Studio",
        "positionName": "Dental laboratory assistant. CAD/CAM technician",
        "jobType": [],
        "location": "346 Moodie Dr, Nepean, ON",
        "salary": null,
        "postingDateParsed": "2023-09-19T06:48:31.283Z",
        "url": "https://www.indeed.ca/rc/clk?jk=0052e5087671f5f3&from=jasx&tk=1hb2v4hd2is3q800&vjs=3",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "Job description\nWe are looking for a dental laboratory assistant to join our CAD/CAM department.\nThis is a permanent, full time job with 40 hours/ week\n\n 1 to 3 year experience in CAD/CAM (computer assisted designing and manufacturing)\n Scan, design and mill crowns & implant abutments.\n Operate and maintain various dental milling machines and 3D printers\n Previous experience in plaster and model work is an asset\n computer skills and hardware troubleshooting.\n attention to details and good communication skills\n\nWe have a ton of on-site FREE parking\nPaid vacation/ sick days/ personal days\nDental/ health benefits/ wellness program\nFamily like atmosphere\nPlease send your resume to ahmad@livedentalstudio.com\nJob Type: Full-time\nSalary: $27.00-$33.00 per hour\nBenefits:\n\n Casual dress\n Dental care\n Extended health care\n On-site parking\n Paid time off\n Profit sharing\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n 8 hour shift\n\nSupplemental pay types:\n\n Bonus pay\n\nAbility to commute/relocate:\n\n Kanata, ON: reliably commute or plan to relocate before starting work (preferred)\n\nEducation:\n\n Secondary School (preferred)\n\nExperience:\n\n dental technician: 2 years (required)\n\nLanguage:\n\n English (required)\n\nWork Location: In person"
    },
    {
        "id": "83cab0578d8d2185",
        "company": "Ciena",
        "positionName": "Waveserver Lab Technician – New Grad",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-23T06:48:33.254Z",
        "url": "https://www.indeed.ca/rc/clk?jk=83cab0578d8d2185&from=jasx&tk=1hb2v4hd2is3q800&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=83cab0578d8d2185&atk=&xpse=SoCG67I3Ki2cfJyir50LbzkdCdPP",
        "companyDescription": "",
        "description": "Ciena is committed to our people-first philosophy. Our teams enjoy a culture focused on prioritizing a personalized and flexible work environment that empowers an individual’s passions, growth, wellbeing and belonging. We’re a technology company that leads with our humanity—driving our business priorities alongside meaningful social, community, and societal impact. \n \n How You Will Contribute:\n \n  Requirements for telecommunications networks are constantly evolving, and our products also need to advance and scale to meet the needs of our customers while also delivering uniform and consistent user experiences.\n \n  As a Waveserver Lab Technician you will be hands on with our next generation optical network solutions in a dynamic team environment. You will work alongside experienced professionals to ensure the reliability and performance of projects that play critical roles in our network solutions and help build upon our innovative technology. You will also challenge yourself and others by bringing enthusiasm and fresh ideas to new challenges and leading by example.\n \n \n   You will be responsible for the installation, maintenance, and troubleshooting of optical network solutions\n   You will use a detail-oriented approach to service user tickets, maintain records of equipment and track new hardware orders and requests\n   You will assist in maintaining hardware and setups including cable management, labeling, and organization\n   You will be accountable for managing individual project priorities, assignments, and timelines.\n   You will participate in the full software development lifecycle, collaborating with multi-functional teams of developers, UX designers, quality assurance teams & release managers.\n \n \n  What Does Ciena Expect of You?\n \n   Initiative – You are a self-starter who works with limited direction and is committed to delivering against aggressive deadlines.\n   Agility – you are readily able to make key decisions and manage competing and ever-changing account priorities.\n \n \n   Communication expertise – the ability to influence and tailor your message and ideas to the audience to ensure understanding and buy in.\n   An ability to go ‘up and down the ladder’ – capable of seeing the big picture, but also understanding the importance of the details and analysis.\n   The flexibility to work independently and as part of a broader team – you thrive in a multi-disciplinary team environment, but are comfortable working independently as required.\n   Relationship builder – with an innate ability to influence, you can quickly develop trusted connections and get work done across multi sites.\n   A commitment to innovation – you keep abreast of the market and competitive developments and are always keen to formulate new ideas and problem solve.\n \n \n  The Must Haves:\n \n   College diploma in physical technology, electronics, or equivalent\n   Experience working with optical networking equipment\n   Knowledge of networking protocols such as TCP/IP, DNS, and DHCP\n   Strong organization skills and attention to detail\n   Must be in Ottawa or willing to relocate as this position is in person five days a week\n \n \n  Why Ciena:\n \n   We believe an inclusive, diverse, and barrier-free work environment makes for empowered and committed employees.\n   We recognize the importance of well-being and offer programs and benefits to support and sustain the mental and physical health of our employees and their families and provide a variety of paid family leave programs.\n   We are committed to employee development, offering tuition reimbursement, in-house learning, and mentorship opportunities.\n   We know that financial security is important. We offer competitive salaries and incentive programs, RSU’s (job level specific) and an employee share option purchase program.\n   We realize time away to recharge is non-negotiable. We offer unlimited paid time off!\n   Great work deserves recognition. We have a robust recognition program, with ongoing and enhanced awards for exemplary performance.\n \n \n  At Ciena, we are committed to building and fostering an environment in which our employees feel respected, valued, and heard. Ciena values the diversity of its workforce and respects its employees as individuals. We do not tolerate any form of discrimination.\n \n  If contacted in relation to a job opportunity, please advise Ciena of any accommodation measures you may require."
    },
    {
        "id": "9497a71a8d606679",
        "company": "University of Ottawa Heart Institute",
        "positionName": "Chemistry Technologist I",
        "jobType": [],
        "location": "40 Ruskin St, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-23T06:48:34.228Z",
        "url": "https://www.indeed.ca/rc/clk?jk=9497a71a8d606679&from=jasx&tk=1hb2v4hd2is3q800&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=9497a71a8d606679&atk=&xpse=SoAJ67I3Ki2cc4RysR0LbzkdCdPP",
        "companyDescription": "",
        "description": "Start date \n    As soon as possible. \n    Purpose of position \n    Provide laboratory assistance in the daily operations of the Cardiac P.E.T. Radiochemistry laboratory by : \n    \n    Assisting with the daily production of radiopharmaceuticals using specialized radio-chemistry laboratory equipment. \n    Analysing all radiopharmaceuticals and maintain results (documentation) produced by the radio-chemistry laboratory. \n   \n   Responsibilities \n   \n    Daily production of radiopharmaceuticals. \n    Carry out the functions in the production of radiopharmaceuticals by preparing solutions, properly identifying, labeling, packaging for transportation. \n    Monitor production of radiopharmaceuticals, recognize problems and initiate established corrective protocols. \n    Run the cyclotron for producing radiopharmaceutical. \n    Work with the radio-chemists in developing technical protocols. \n    Quality control procedures, analysis, report all deficiencies, create and maintain current database per isotope and detector for the cyclotron. \n    Participate in research projects as directed. \n    Assist in the implementation of new techniques and protocols. \n   \n   Requirements \n   \n    BSc Chemistry or equivalent \n    2 years experience in a progressive chemical laboratory \n    Working experience with radioactive materials is considered an asset \n   \n   Preferred qualifications \n    Knowledge of: \n    \n    General laboratory equipment (HPLC, thin-layer chromatography, osmometer, gas chromatograph, radioactivity detectors) and their applications along with standard procedures. \n    Procedure instrumentation. \n    Legislated requirements related to practice and equipment operation relevant to job function. \n    Ability to troubleshoot to component level. \n   \n   To apply \n    To apply, please send your cover letter and CV to jobpostings@ottawaheart.ca. \n    Applications from Indigenous persons, members of racialized minorities, persons with disabilities, women, members of the LGBTQ+ community, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse and inclusive communities are strongly encouraged. \n    According to government policy, all qualified candidates are invited to apply; however, preference will be given to Canadians and permanent residents. When submitting your application, please indicate if you are legally entitled to work in Canada. \n    The University of Ottawa Heart Institute is committed to ensuring barrier-free selection processes and work environments. Accommodations will be provided in all parts of the hiring process relating to any specialty requirements. Please notify us of any accommodations that you require – any information you provide will be handled respectfully and in complete confidence. \n    The successful candidate will be required, prior to the start of employment, to complete mandatory organizational training available online, and provide the following: an official piece of photo identification and a satisfactory Criminal Record Check and proof of two doses of COVID-19 vaccine."
    },
    {
        "id": "10070190b2b77984",
        "company": "Smile Innovations Group",
        "positionName": "Dental Technician - Case Consultant & Quality Control",
        "jobType": [],
        "location": "Gatineau, QC",
        "salary": null,
        "postingDateParsed": "2023-09-19T06:48:42.867Z",
        "url": "https://www.indeed.ca/rc/clk?jk=10070190b2b77984&from=jasx&tk=1hb2v4hd2is3q800&vjs=3",
        "externalApplyLink": "https://smileinnovationsgroup.bamboohr.com/careers/44?source=indeed&src=indeed&postedDate=2023-09-18",
        "companyDescription": "",
        "description": "Dental Technician - Case Consultant & Quality Control \n  (Français version suit)\n \n  ABOUT MILIDENT \n  Opened in June 1995, Milident Inc specializes in the creation of complex cases, implant-supported crown and bridge, fixed and removable dentures as well as orthodontic appliances. Always at the forefront of technology, Milident Inc. continues to offer its products and services tailored to the specific needs of its clientele. Through its internal research and development program, Milident Inc. is continually exploring new technological advances in manufacturing its high-precision dental prosthesis.\n  \n  \n Description: \n  The Case Consultant is responsible for client communication with regards to case support and treatment planning, while maintaining a high level of customer satisfaction. This position will also be responsible for managing final quality control and providing internal team training around technical aspects of all cases.\n  \n  \n If you have at least 5 years’ experience in the dental lab industry, together with strong supervisory skills, we want to hear from you! A relocation package will be available.\n  \n  \n  General Responsibilities:\n \n  Case Consultant \n  \n  Assess, identify, and offer solutions for problem restorative cases \n  Discuss restorative options with doctors via phone/email \n  Ensure proper instructions are given to the technicians regarding problem cases \n  \n \n Final Quality Control \n  \n  Ensure final restoration and appliances meet the company quality control standards\n \n  \n  \n  Qualifications:\n  \n  \n  \n  Technical School – Certification as a Registered Dental Technician or equivalent education and experience \n  5 years of experience in dental lab industry \n  Must be able to manage people, processes, and technology \n  Must possess effective English and French communication skills (both oral and written,) while offering strong interpersonal skills \n  Excellent time management skills; acts skillfully with a sense of urgency \n  High attention to detail and accuracy \n  Ability to think strategically and to lead \n  Advanced troubleshooting and multi-tasking experience \n  Awareness of relevant industry technology trends and applications\n \n  \n  \n Technicien dentaire - Consultant cas et contrôle de la qualité\n \n  À PROPOS DE NOUS \n  Fondée en juin 1995, nous nous spécialisons dans la création de cas complexes, de prothèses dentaires fixes et amovibles ainsi que d’appareils orthodontiques. Toujours à l’avant-garde de la technologie, nous continuons d’offrir des produits et services adaptés aux besoins particuliers de notre clientèle. Par l’entremise de nos programmes interne de recherche et développement, nous explorons continuellement les nouvelles avancées technologiques dans la fabrication de prothèse dentaire de haute précision. \n  Description: \n  Le consultant en cas est responsable de la communication avec les clients en ce qui concerne le soutien aux cas et la planification du traitement, tout en maintenant un niveau élevé de satisfaction de la clientèle. Ce poste sera également responsable de la gestion du contrôle final de la qualité et de la formation interne de l’équipe sur les aspects techniques de tous les cas.\n  \n  \n Si vous avez au moins 5 ans d’expérience dans l’industrie des laboratoires dentaires, ainsi que de solides compétences en supervision, nous voulons avoir de vos nouvelles!\n  \n  Responsabilités Principales:\n \n  Consultante en cas \n \n  Évaluer, identifier et proposer des solutions aux cas de restauration problématique \n  Discuter des options réparatrices avec les médecins par téléphone / courriel \n  S’assurer que des instructions appropriées sont données aux techniciens concernant les cas problématiques \n  \n \n Contrôle final de la qualité \n  \n  S’assurer que la restauration finale et les appareils répondent aux normes de contrôle de la qualité de l’entreprise\n \n  \n  \n  Qualifications:\n  \n  \n  \n  École technique – Certification en tant que technicien dentaire agréé ou formation et expérience équivalentes \n  5 ans d’expérience dans l’industrie des laboratoires dentaires \n  Doit être capable de gérer les personnes, les processus et la technologie \n  Doit posséder des compétences efficaces en anglais et en communication Français (à l’oral et à l’écrit) tout en offrant de solides compétences interpersonnelles \n  Excellentes compétences en gestion du temps; agit habilement avec un sentiment d’urgence \n  Grande attention aux détails et à la précision \n  Capacité à penser stratégiquement et à diriger \n  Dépannage avancé et expérience multitâche \n  Connaissance des tendances et des applications technologiques pertinentes de l’industrie"
    },
    {
        "id": "812e5aba08fd1e14",
        "company": "Live Dental Studio",
        "positionName": "Dental Laboratory Office Assistant",
        "jobType": [],
        "location": "346 Moodie Dr, Nepean, ON",
        "salary": null,
        "postingDateParsed": "2023-09-19T06:48:53.270Z",
        "url": "https://www.indeed.ca/rc/clk?jk=812e5aba08fd1e14&from=jasx&tk=1hb2v4hd2is3q800&vjs=3",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "We are a Quality Fast growing dental lab looking for an office assistant. No experience necessary!\nIt is a very fast paced environment with tight deadlines!\nDuties will include but are not limited to:\n\n Answering phones\n Unpacking/disinfecting dental cases as they arrive\n Packing cases for delivery\n Organizing deliveries\n Data entry\n Keeping lab organized with cases coming out\n Attention to detail is an absolute must!\n Computer skills a must\n Ability to multitask efficiently\n Punctual\n Pleasant phone mannerism\n Work well as a part of our team or individually\n No experience necessary, we are willing to train the right person\n\nHours are Monday to Friday, no weekends!\nBenefits, bonuses, plenty of on site-parking! If this sounds like it could be a good fit for you, please forward your resume.\nHours are Monday to Friday, no weekends!\nJob Types: Full-time, Permanent\nBenefits:\n\n Casual dress\n Dental care\n Extended health care\n On-site parking\n Wellness program\n\nSchedule:\n\n Monday to Friday\n\nEducation:\n\n Secondary School (preferred)\n\nWork Location: In person"
    },
    {
        "id": "f82020fc1c47e655",
        "company": "Lumentum Operations LLC",
        "positionName": "Precision High Speed 3D Camera Lab and Data Analyst (Co-Op)",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-19T06:48:48.544Z",
        "url": "https://www.indeed.ca/rc/clk?jk=f82020fc1c47e655&from=jasx&tk=1hb2v4hd2is3q800&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=f82020fc1c47e655&atk=&xpse=SoCJ67I3Ki2aoGSsCJ0LbzkdCdPP",
        "companyDescription": "",
        "description": "It's fun to work in a company where people truly BELIEVE in what they're doing!\n   \n  We're committed to bringing passion and customer focus to the business.\n \n \n   If you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us!\n \n \n   Lumentum Canada was awarded the 2022 National Capital Region’s Top Employers \n  for the 6th consecutive year and the 2022 Career Directory Canada’s Best Employers for Recent Graduates \n  for the 5th consecutive year.\n \n \n   Precision High Speed 3D Camera Lab and Data Analyst\n \n \n   It’s an exciting time to join Lumentum! Lumentum (NASDAQ: LITE) is a market-leading manufacturer of innovative optical and photonic products enabling optical networking and commercial laser customers worldwide. Lumentum’s optical components and subsystems are part of virtually every type of telecom, enterprise, and data center network. Lumentum’s commercial lasers enable advanced manufacturing techniques and diverse applications including next-generation 3D sensing capabilities. Lumentum is headquartered in San Jose, California with R&D, manufacturing, and sales offices worldwide. For more information, visit www.lumentum.com.\n \n \n   We believe Lumentum is a great place to work, and we support a diverse and inclusive culture where employees bring their whole and authentic selves to work. We strive to build meaningful connections that fuel innovation to produce products that impact the world. We are committed to creating a diverse and welcoming workplace that includes employees with diverse backgrounds and experiences. We believe that enables us to better meet our mission and values while serving customers throughout our global communities. People of color, women, LGBTQIA+, veterans and persons with disabilities are encouraged to apply.\n \n \n   Overview\n \n \n   Located in Ottawa, Canada, Lumentum’s R&D Team is developing a high speed, high precision 3D camera using state-of-the-art optical technology. You will part of a nimble fast-moving team that is developing this camera from the ground up. In addition to getting exposed to the technical aspect of the camera, all team members get exposed to the end-solution which involve many of the world’s top automotive manufacturers.\n \n \n   The Opportunity\n \n \n   We welcome candidates with work term lengths of 8 to 16 months in duration. Due to the hardware and hands-on nature of this project we require employees to be onsite.\n \n \n   Responsibilities\n \n \n   The 3D Camera Lab and Data Analyst responsibilities would include but not be limited to the following:\n \n \n   Work in the lab measuring various automotive parts with our camera\n   Analyze 3D point cloud data with PolyWorks commercial software and custom written Python code\n   Develop and/or modify Python tools to improve data analysis\n   Research new data analysis techniques to improve point cloud accuracy\n   Conduct measurement studies - execute specific measurement plans, analyze results and produce reports\n   Develop 2D/3D vision algorithms and software for 3D reconstruction and object identification\n   Set up tests with instrumentation, and manage testing/tool area.\n   Evidence collection, handling, and storage.\n \n \n \n   Education Qualifications\n \n \n   Third or fourth year students enrolled in Electrical Engineering, Computer Engineering or similar technical degree granting program\n \n \n   Desired Skills & Qualifications\n \n \n   Knowledgeable with Python and its various numerical libraries\n   Understanding of 3D Point Cloud Objects and their manipulation with open 3D libraries\n   Enjoy working in a lab environment & with various types of high-end test equipment\n \n \n   To be considered for this opportunity…\n \n \n   You must be registered full-time or part time, in a recognized Canadian post-secondary institution\n \n \n   What sets Lumentum's student program apart? We're awesome because…\n   Our student program offers opportunities to work on real projects that have meaningful impact in an environment that supports diverse perspectives, inclusivity and fosters a sense of belonging. We offer flexible working schedules, continuous learning, mentorship programs, employee resource groups and perks and benefits to all students - including health, dental & vision coverage, and employee wellness programs.\n \n \n \n   In its seventh consecutive year, the Ottawa site is honored to be named one of the Canada Region Top Employers and one of the best employers for recent university graduates under the Career Directory for the sixth year by Canada’s Top 100 Employers!\n \n \n   Lumentum awards scholarships of $5,000.00 to ten of our Canada based students from underrepresented groups. To be considered for the scholarship, the first thing you need to do is apply for a Lumentum intern/co-op opportunity so you can be reviewed for a job with us. To receive the DIB scholarship, you must complete an intern/co-op with Lumentum.\n \n \n \n   You might be interested to know:\n \n \n   We are a humble but passionate team who loves our work and is improving with each day;\n   Our team has a long history (15 years and counting) of employing co-ops/interns and we truly value the contributions our students make to our team. In fact, several students have been hired upon graduation;\n   Our building offers many perks including a small gym with showers; a cafeteria with subsidized meals and free coffee & tea; a prayer room; a games room; and plenty of free parking, or a conveniently located public transit stop in front of the building."
    },
    {
        "id": "1f43c6643e5bfc42",
        "company": "GeneBio Systems, Inc.",
        "positionName": "Sales Marketing Associate, Lab Research in Life Sci.-Ottawa/Montreal Metro",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-20T06:48:55.453Z",
        "url": "https://www.indeed.ca/rc/clk?jk=1f43c6643e5bfc42&from=jasx&tk=1hb2v4hd2is3q800&vjs=3",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "GeneBio Systems is a biotech company dedicated to help our customers by providing solutions to research and clinical laboratories. GeneBio Systems was founded on the strong scientific foundation stemming from our founding team's extensive biotechnological and life science research experience. Our professionals have many years of research and development experience in pharmaceutical, medical device and life science and laboratory products.\nAs a result of rapid growth of our business, we are hiring additional talents to expand our team.\nGeneBio is seeking outstanding applicants for a Sales/Marketing Associate I, Molecular Biology Life Science Lab Research to support ongoing sales initiatives. This position is located in\nOttawa and Montreal\nCandidates currently located in a nearby community are strongly preferred.\nThe ideal candidate has experience in molecular biology, with BSc degree in a life science discipline, and has an ability to build relationships with clients, working with colleagues, increasing sales and providing solutions that benefit both the employer and the client. With a knowledge and passion for the life science research, and development, the successful candidate will bring energy and drive to our existing team, opening up opportunities and expanding our current business portfolio.\nResponsibilities and Duties\n· Represent the company in a professional, respectful manner\n· Build, maintain and expand a network of (new) external relations, detect and realize new business opportunities\n· Create sales and marketing presentations for a broad range of researchers in clients' laboratories or otherwise sites.\n· Comfortable communicating with people at all levels, field to principal scientists\n· Effectively manage timely customer and product information, forecast accuracy and provides custom solutions\n· Partner with product managers managers, technical support services and sales management to strategize on new business development activities and set sales and revenue targets\n· Excellent communication skills;\n· Provide consistent follow up on customer communications to maintain strong professional relationships and explore ongoing and new opportunities\nQualifications and Skills\n· A minimum of BSc in a life science discipline preferably with 1 or more years of experience in a laboratory; though those who graduated in the last year are also encouraged to apply\n· A understanding of the sales process or willingness to acquire new skills and knowledge, and a strong passion to be successful.\n· Self-motivated with the ability to develop within a dynamic, fast-paced environment\n· Strong interpersonal and communication skills\n· Results driven with a high sense of urgency\n· Has a desire to learn and develop within the sales and marketing industry\n· Working towards career progression and growth within a company\n· Prior experience in sales or a customer-focused environment is an asset\nAbove all, driven, a go-getter who is independent, hungry for successes. Must be a great communicator.\n· Must be over the age of 18 with no criminal conviction or penal offence related to the tasks and responsibilities of the role. Recent graduates are encouraged to apply.\nThis position is compensated in salary with a performance based bonus, with an opportunity to participate in Company's employee stock option plan and conversion to a salary based position after 12-month.\nJob Type: Full-time\nSalary: Up to $49,000.00 per year\nBenefits:\n\n On-site parking\n Paid time off\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n 8 hour shift\n\nSupplemental pay types:\n\n Bonus pay\n\nApplication question(s):\n\n Must have a BSc in Biological discipline.\n\nEducation:\n\n Bachelor's Degree (required)\n\nWork Location: On the road\nExpected start date: 2023-10-01"
    },
    {
        "id": "dc521d5b76d59328",
        "company": "The Ottawa Hospital",
        "positionName": "Registered Nurse, Cardiac Catheterization Lab",
        "jobType": [],
        "location": "501 Smyth Rd, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-22T06:49:04.526Z",
        "url": "https://www.indeed.ca/rc/clk?jk=dc521d5b76d59328&from=jasx&tk=1hb2v4hd2is3q800&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=dc521d5b76d59328&atk=&xpse=SoDM67I3Ki2YUTwXxp0LbzkdCdPP",
        "companyDescription": "",
        "description": "About The Ottawa Hospital \n    \n    \n    \n     \n      Inspired by research and driven by compassion!\n     \n      \n     \n     \n       The Ottawa Hospital (TOH) is one of Canada’s largest learning and research multi-campus hospitals. With more than 1,100 beds and approximately 12,000 staff members, we deliver specialized care to the Eastern Ontario region. \n     \n      \n     \n     \n      From the compassion of our people to the relentless pursuit of new discoveries, The Ottawa Hospital never stops seeking solutions to the most complex health-care challenges while continually engaging with the community to support our vision for better patient care.\n     \n      \n     \n     \n       Working together with its research institute, the University of Ottawa, and other partners, the hospital is continually gaining national and international recognition for high-quality patient care, teaching and research, while striving to meet the needs of the culturally diverse community we serve.\n      \n    \n   \n  \n \n \n  \n   Position Information \n    \n    \n    \n     \n      Electrophysiology Lab/Cardiac Catheterization Lab\n     \n     \n       \n       Temporary until approximately March 30, 2024.\n      \n    \n   \n  \n \n \n  \n   Rotation/Shifts \n    \n    \n    \n     \n      Days, evenings and night, including weekends, 8 hour shifts. Must be available for standby and call back (nights) - 30 minutes return time to work.\n     \n     \n      For information purposes only - The Hospital reserves the right to change.\n      \n    \n   \n  \n \n \n  \n   Basic Requirements \n    \n    \n    \n     \n      \n       \n        Current Certificate of Competence in the Province of Ontario;\n        \n      \n       \n        Current Cardiac catheterization laboratory experience;\n        \n      \n       \n        Two (2) years Critical Care experience;\n        \n      \n       \n        Completion of Critical Care course;\n        \n      \n       \n        E.C.G. interpretation;\n        \n      \n       \n        Current certification for B.C.L.S.;\n        \n      \n       \n        Must be eligible to work in Canada;\n        \n      \n       \n        Proficiency in English and French – oral expression (advanced level) and comprehension (advanced level).\n        \n     \n     \n     \n      Language proficiency requirements are based on the nature of the position and the level of interaction with French- and English-speaking clients.\n      \n    \n   \n  \n \n \n  \n   Preferred Qualifications \n    \n    \n    \n     \n      \n       \n        O.R. certification;\n        \n      \n       \n        Current O.R. and C.O.R. experience.\n        \n     \n    \n   \n  \n \n \n  \n   What you can expect from us \n    \n    \n    \n     \n      The Ottawa Hospital is committed to providing a healthy, safe, and inclusive work environment for everyone. We are driven by our purpose to provide each patient with the world-class care, exceptional service and compassion we would want for our loved ones.\n     \n      \n     \n     \n       We offer an attractive and equitable compensation package including a comprehensive benefits package, a Defined Benefit Pension (DBP) plan, and insurance protection. We also offer discounts from choice providers on a variety of products and services. \n     \n      \n     \n     \n      The Ottawa Hospital provides various Health and Wellness resources as well as opportunities for personal and professional development opportunities from our in-house Learning and Leadership Development team to help align your goals with your career objectives.\n      \n    \n   \n  \n \n \n  \n   Interested? Apply today! \n    \n    \n    \n     \n      If you are passionate about what you do, motivated by improving the health of the community, excited by leading-edge medical technology, and as committed to excellence, quality and patient safety as we are, we would like to hear from you. Please submit an on-line application for the position you are interested in. We thank all those who apply but only those selected for further consideration will be contacted.\n     \n     \n       The Ottawa Hospital is an equal opportunity employer. Upon request, accommodations due to a disability are available throughout the recruitment process."
    },
    {
        "id": "7012da08fb969750",
        "company": "Calian",
        "positionName": "Intermediate Technician (Fuel Lab Support)",
        "jobType": [],
        "location": "Gatineau, QC",
        "salary": null,
        "postingDateParsed": "2023-09-21T06:49:03.789Z",
        "url": "https://www.indeed.ca/rc/clk?jk=7012da08fb969750&from=jasx&tk=1hb2v4hd2is3q800&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=7012da08fb969750&atk=&xpse=SoAO67I3Ki2Y5nx1B50LbzkdCdPP",
        "companyDescription": "",
        "description": "Position Overview \n  Calian is looking for Intermediate Technician for a Fuel Laboratory in Gatineau. \n \n  \n   \n     Location\n    \n      Gatineau, QC\n    \n   \n   \n     Job Type\n    \n      Full Time\n    \n   \n  \n  \n Responsibilities \n \n  Provide technical support to the section or the development of other ISO 17025, training and/or information management; proposing suitable procedures and appropriate recommendations in order to improve work quality \n  Plan and organize work to meet deadlines. Analyze, evaluate and resolve technical problems in a logical manner \n  Draft and maintain SOPs associated with ISO 17025 certification \n  Draft general correspondence and provide briefings in order to communicate issues, resolve problems, update work status, and disseminate information \n  Coordinate quality system audits and assist in the performance of quality system audits \n \n Qualifications \n \n  Must currently hold or be eligible for Secret – Level II Clearance with the Government of Canada \n  College certificate in analytical chemistry or 9 years of experience in the past 15 as a technician performing chemical analysis \n  Four years of experience in providing advice and direction on regulations, acquisition and control of petroleum, oil, fuels, and lubricants related to but not limited to aviation \n  One year of experience in coordinating the field audits and assisting in the performance of field audits at fueling facilities"
    },
    {
        "id": "29ecb2221aa63ad5",
        "company": "Evik Diagnostic Innovations",
        "positionName": "Research Associate (Freeze-drying and analytical testing)",
        "jobType": [],
        "location": "Kanata, ON",
        "salary": null,
        "postingDateParsed": "2023-09-06T06:49:14.836Z",
        "url": "https://www.indeed.ca/rc/clk?jk=29ecb2221aa63ad5&from=jasx&tk=1hb2v5rcfk7vv800&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=29ecb2221aa63ad5&atk=&xpse=SoAv67I3Ki2XVHQgUR0LbzkdCdPP",
        "companyDescription": "",
        "description": "WHO WE ARE: \n  As part of the team at EVIK Diagnostics Innovations you’ll discover meaningful work within the medical device industry. You’ll join a rapidly growing company where each day is different, and opportunities are approached with a team effort.\n  \n  \n  Evik was established in 2011 and is based in Kanata (in the same building as a brewery!) Our team are experts in the field of creating rapid, single-assay lyophilized beads for immunological and molecular diagnostics. Our DxSpheres are used for a wide variety of different testing applications including rapid PCR Covid test kits, and in environmental water testing laboratories. Our clients are located around the world and appreciate our transparency, communication, and ability to go the extra mile.\n  \n  \n  If you’d like to learn more about us and what we do, feel free to check out our website and watch our company video.\n  \n  \n  Evik Diagnostic Innovations is an Ottawa based ISO 13485:2016 certified manufacturer of rapid, single-assay, lyophilized beads for immunological and molecular diagnostics using dry reagent components. We provide exceptional customer service to our clients, and we are looking for a new team member to help us continue to exceed their expectations. You are an ideal candidate if you are looking to become part of a dynamic team.\n \n  JOB DESCRIPTION \n  The Research Associate is responsible for working directly with the Director of Technology to provide support for lyophilizing process development, optimization and scaling up. \n \n  \n KEY RESPONSIBILITIES \n  \n  Adhere to current good laboratory and manufacturing practices and maintain a safe and clean work environment. \n  Perform thermal analysis of complex reagent mixtures and dry reagents, using DSC, FDM and other analytical methods. \n  Setup automated stations dispense parameters assuring uniformity of the dispensed mixes and suspensions. \n  Collect client custom product characterization and packaging requirements and verify client instructions were followed. \n  Perform DSC and FDM methods, other material testing methods according to the standard protocols. \n  Measure, observe and document freeze-dry products morphology and physical properties. \n  Summarize thermal properties testing and analytical testing data and results of the experiments. \n  Understand freeze-dry cycles settings based on thermal and physical properties of lyophilized products. \n  Communicate results and collaborate with other professionals in the lab and clients. \n  Provide technical presentation and technical support for client’s projects. \n  Write and edit work instructions. \n  Maintain product development database and logbooks. \n  Process, organize and summarize data using a variety of word processing and spreadsheet software applications. \n  Perform related laboratory maintenance such as maintaining and cleaning equipment, ordering supplies, calibrating R&D equipment, and maintaining inventories of incoming materials and laboratory supplies. \n  Manage multiple tasks and changing priorities in a fast-paced environment. \n  Other tasks as required to support the smooth operation of the laboratory. \n  Participate in Process Improvement projects assigned by manager.\n \n  \n  \n  SKILLS AND QUALIFICATIONS \n  \n  Ability to work without direct supervision, paying close attention to detail and bearing independent responsibility for data accuracy. \n  Sound organizational and data management skills. \n  Ability to handle several responsibilities and work under tight time constraints. \n  Dedication to production quality and deadlines with a strong work ethic. \n  Proficiency in MS Word and MS Excel, including basic functions and formulas. \n  Ability to work well as part of a team. \n  A positive attitude and professional appearance and manner. \n  Good English language communication skills both written and oral.\n \n  \n  \n  EDUCATION, EXPERIENCE \n  \n  Master’s or Bachelor's degree in physics, physical chemistry, or material sciences. \n  Two to five years of industrial laboratory work experience. \n  Hands on experience with Differential Scanning Calorimetry and materials thermal analysis methods and techniques is an asset. \n  Deep understanding of underlying scientific principles. \n  Experience in freeze-dry protocols development considered as a big asset. \n  Experience with freeze-dry microscopy is an asset.\n \n  \n  \n  OTHER \n  \n  Applicants should be available for an on-site interview. \n  Applicants must include a resume and a cover letter in which they describe how they meet each of the requirements listed above."
    },
    {
        "id": "cd83ab8fee21d003",
        "company": "LifeLabs",
        "positionName": "Lab Patient Technician",
        "jobType": [],
        "location": "139 Greenbank Road, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-16T06:49:15.529Z",
        "url": "https://www.indeed.ca/rc/clk?jk=cd83ab8fee21d003&from=jasx&tk=1hb2v5rcfk7vv800&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=cd83ab8fee21d003&atk=&xpse=SoD367I3Ki2XaSw33J0LbzkdCdPP",
        "companyDescription": "",
        "description": "LifeLabs is the largest community diagnostics laboratory in Canada, serving the healthcare needs of Canadians for over 50 years. Our team members are truly centred around our customers, and we know that behind every lab requisition, sample being tested, or investment in technology is an individual and their family counting on us. \n Consistently named one of Canada's Best Employers by Forbes, LifeLabs has also been recognized for having an award-winning Mental Health Program from Benefits Canada. The passion and commitment of over 6,000 diverse and innovative team members unites and motivates us to ensure our customers receive high quality tests and results that they can trust. Agile, customer-centred, caring and teamwork: we live these values every day in what we do to support our customers and healthcare providers, driving forward our vision of empowering a healthier you.\n  Make a difference – join the LifeLabs team today!\n \n  As a Lab Patient Technician, you will be responsible for the specimen collection process, from greeting patients through to preparation of specimens for transportation. This is an important role in patient care and our business and will let you see the difference that you make in patients’ lives.\n \n  This is a Part-Time position at 139 Greenbank Road, Ottawa, ON.\n \n  The successful candidate will support at the Greenbank site and the Centre point site weekdays and may occasionally be scheduled on Saturday mornings at the Carling site.\n  In this role you will:\n  \n \n   Greet and request required information from patients, explain the specimen collection process, and ensure patients have followed necessary test protocol prior to specimen collection.\n   Perform phlebotomies, connect/disconnect Holter monitors, and perform ECG tracings.\n   Perform special test collections, such as medical/legal drug screens, paternity tests, and clinical trials, and complete related documentation.\n   Maintain client relationships, including responding to inquiries and following up on requests.\n   Complete data entry of required patient demographics, requisition information, and other information related to processing test results.\n   Prepare specimens for transportation and testing.\n \n \n  The right person for this role will be focused on great customer/patient service and be able to relate to patients and clients even in stressful situations. Some key qualities include empathy, flexibility, adaptability to change, and problem-solving skills. Other requirements include\n  \n \n   Graduate of an approved Laboratory Assistant program or equivalent.\n   Phlebotomy experience.\n   Excellent communication skills.\n   Good computer skills with a minimum typing speed of 40 wpm.\n   Ability to maintain the strictest standards of patient privacy and confidentiality.\n \n  We are looking for passionate individuals who share in the importance of our values: Caring, Customer Driven, Agile and One Team and can live these values with us every day.\n \n  Ready to make a difference? Apply today.\n \n  At LifeLabs, we strive to create an inclusive and equitable workplace where our team members and the communities we serve feel accepted, valued, and respected.\n  In accordance with LifeLabs’ Accessibility Policy, the Accessibility for Ontarians with Disabilities Act, and the Ontario Human Rights Code, accommodations are available by request for candidates taking part in all aspects of the recruitment and selection process. For a confidential inquiry or to request an accommodation, please contact your recruiter or email careers@lifelabs.com. \n LifeLabs is committed to providing a safe environment for our employees, customers, and the communities we serve. We have been a leader throughout the COVID-19 pandemic regarding health and safety measures and have always put our employees and customers at the center of every decision that we make. As an organization in the health care sector, we believe the COVID vaccination adds a layer of protection that complements the extensive and necessary health and safety protocols that we have taken to date. With this in mind, we currently require all LifeLabs employees, contractors, students and volunteers to be fully vaccinated. \n LifeLabs operates under a distributed workforce model, where employee flexibility is a key priority. Further information will be provided during the interview process on what this means for employees."
    },
    {
        "id": "b3aa354188da1fd5",
        "company": "Merrick & Company",
        "positionName": "Electrical Engineer III – Life Science",
        "jobType": [],
        "location": "580 Terry Fox Drive, Kanata, ON",
        "salary": null,
        "postingDateParsed": "2023-09-07T06:49:18.836Z",
        "url": "https://www.indeed.ca/rc/clk?jk=b3aa354188da1fd5&from=jasx&tk=1hb2v5rcfk7vv800&vjs=3",
        "externalApplyLink": "https://careers.merrick.com/careers-home/jobs/5628/job?utm_source=indeed_integration&iis=Job%20Board&iisn=Indeed&indeed-apply-token=73a2d2b2a8d6d5c0a62696875eaebd669103652d3f0c2cd5445d3e66b1592b0f&mode=job",
        "companyDescription": "",
        "description": "Overview: \n \n   Merrick and Company is a nationally known multi-office and multi-discipline firm consisting of a diverse, dedicated and talented staff which has achieved design excellence throughout its 60+ years of existence. With offices worldwide, Merrick and Company has been ranked as one of the top 100 design firms by Engineering News Record. Merrick provides personalized services to various clients throughout the world. We are seeking an experienced Laboratory / Facility Electrical Engineer for our Life Sciences business unit in our Kanata office.\n \n \n   Candidates that have a desire for personal and professional growth, a well-defined understanding of design and construction document processes, and adaptability for short term and long-term projects in an environment that requires a blend of creativity and high technical skills. Successful candidates must be self-starting, motivated, innovative, articulate, self-disciplined, and confident in a demanding, exciting and fast-paced environment. This position requires a competent professional engineer who will be responsible for all phases of engineering production and BIM for a variety of work ranging from programming through construction administration. This includes interpreting, organizing, executing and coordinating the design and production effort for one or more large or complex projects.\n \n \n \n   Job Description\n \n \n   Design of electrical systems for facilities / laboratories for Government, University, and private clients.\n   Provide conceptual / detailed design and analysis for facility power distribution (600V), site power distribution (15kV), emergency power generation, grounding and lightning protection, lighting design, telecommunications (voice/data), fire alarm / mass notification, security, access control, and special systems.\n   Provide supporting documentation such as calculations, reports, and specifications.\n   This individual is expected to possess extensive knowledge on electrical regulatory codes.\n   Meet with clients to prepare and/or validate proposed scope of work.\n   Prepare fee proposals for engineering design work.\n   Work with other disciplines to ensure accuracy of the package, meet schedule, and budget commitments and meet expectations for attendance and punctuality.\n   Ability to communicate clearly and concisely; both verbally and in writing\n   Ability to work effectively within a collaborative team environment\n   Ability to complete tasks with accuracy and with strong attention to detail\n   Ability to consistently meet deadlines, completing tasks as previously defined\n   Ability to travel as needed.\n   Ability to write and edit specifications\n   Work in a design team environment, including directing and mentoring the work of junior engineers and designers, and delegating work as required as well as provide management of the local team.\n   Capable of performing all of the above with minimal direction\n   An agreed upon hybrid schedule, working from both home and office, is available to employees in good standing.\n \n \n   Required Experience\n \n \n   Eight (8) years of experience in facility Electrical Engineering design\n   Professional Engineer (P.E.) license is required\n   Minimum four (4) years of experience using REVIT/AutoCAD or other design software-based drawing generation\n   Experience using electrical calculation tools is desired, including lighting and power software such as AGi32, Elum Tools, SKM Power Tools, ETAP, and EasyPower.\n   Proficient using Microsoft Office Excel & Word\n   Experience with technical codes such as NEC, NESC, NFPA, IEEE is required\n   Experience with USDA, ARS, CDC and other laboratory clients is highly desired\n   Client projects for this position require Canadian Citizenship.\n   Local candidates are preferred.\n \n \n   Physical Requirements\n \n \n   Requires the ability to sit for extended periods at a computer workstation.\n   Be able to work in an environment with open discussions and visitors without getting distracted.\n   May be required to lift up to 20 lbs.\n   Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n   Meets expectations for attendance and punctuality.\n   The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.\n \n  Additional information:\n \n   Apply online only. No e-mail, hard copy or third-party resumes accepted.\n   Merrick & Company offers a competitive compensation and benefits package which includes RRSP, and unique work-life benefits.\n   We recognize the importance of developing top talent from within, our employees have access to a wide range of internal and external training and coaching programs and are rewarded for their achievements through excellent benefits and competitive salaries.\n   Merrick & Company is an Equal Opportunity Employer, including disability/vets."
    },
    {
        "id": "396c1a4303f522e5",
        "company": "MicroDental Laboratories",
        "positionName": "Dental Lab Technician-Metal Finisher",
        "jobType": [],
        "location": "1956 Robertson Rd, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-13T06:49:33.278Z",
        "url": "https://www.indeed.ca/rc/clk?jk=396c1a4303f522e5&from=jasx&tk=1hb2v5rcfk7vv800&vjs=3",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "MicroDental Laboratories is a world-class, rapidly growing, global company with strong benefit packages and great long-term stability. We operate in over 25 locations in North America as both MicroDental Laboratories and Modern Dental Laboratory USA. With our focus on Quality, Value, and Legendary Customer Care, our Centers are devoted to building strong and lasting relationships with our dentists and their team members. We are looking for a determined, high energy, well organized Metal Finisher to join our team in Ottawa, ON Canada.\n*Qualified candidates with 5+ years of relevant experience are eligible for a sign on bonus of $1000 CAD, after 120 days of continuous employment.*\nOur Company has the following to offer:\n\n Excellent compensation plan with benefits including medical, dental, vacation and holidays\n Flexible working hours\n Career advancement opportunities\n Investments in the latest technology\n Exclusively focused in cosmetic, implant and digital design for fixed prosthodontics\n\nPrimary Responsibilities & Skills:\n\n Prepare metal surfaces for bonding with porcelain to create artificial teeth, using small hand tools.\n Remove excess metal or porcelain, and polish surfaces of prostheses or frameworks, using polishing machines.\n Have the ability to wax, contour, and finish gold crowns\n Can sit and comfortably work on large bridge frame to ensuring proper seating and no rocking\n Wax, spew and invest metal frameworks\n Divest metal from cast rings\n All other duties as assigned or as otherwise required\n\nQualifications:\n\n Knowledge of dental lab products, materials, terminology, and techniques preferred\n Previous experience in relevant field with a good productive mindset and skillset\n Background or foreknowledge of dental implants\n High level of attention to detail with exceptional quality standards\n Strong communication skills\n Excellent hand/eye coordination\n Ability to utilize magnification goggles for extended periods of time\n Team player is a must with a willingness to learn new responsibilities\n High School diploma or equivalent required\n\nMicroDental Laboratories and Modern Dental Laboratory USA are proud to be an Equal Opportunity/Affirmative Action employer. We recruit qualified applicants without regard to race, color, religion, gender, age, ethnic or national origin, veteran status, physical or mental disability, genetic information, sexual orientation or preference, gender identity, marital status, or citizenship status.\nJob Type: Full-time\nBenefits:\n\n Dental care\n Extended health care\n Paid time off\n Vision care\n\nSchedule:\n\n 8 hour shift\n Monday to Friday\n\nSupplemental pay types:\n\n Signing bonus\n\nAbility to commute/relocate:\n\n Ottawa, ON K2H 5B9: reliably commute or plan to relocate before starting work (preferred)\n\nApplication question(s):\n\n What are your salary expectations?\n\nExperience:\n\n dental laboratory: 1 year (preferred)\n\nWork Location: In person"
    },
    {
        "id": "0f6e4a9c1d21929b",
        "company": "Caduceon Environmental Labs",
        "positionName": "Sample Reception/Driver",
        "jobType": [],
        "location": "2378 Holly Lane, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-13T06:49:33.832Z",
        "url": "https://www.indeed.ca/rc/clk?jk=0f6e4a9c1d21929b&from=jasx&tk=1hb2v5rcfk7vv800&vjs=3",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "Team Caduceon in Ottawa is looking for a reliable and friendly individual to help us out with Sample Reception, Shipping and Receiving and Sample Pickup. The successful candidate will work in our Sample Reception Department with a small team of individuals.\nPosition: Customer Service/Sample Reception – Full-time\nLocation: 2378 Holly Lane, Ottawa, ON. K1V 7P1\nRequirements: Valid Driver’s license required, good attitude, punctual and ability to pick up/move up to 50lbs boxes/crates/coolers. Telephone Skills, Experience with MS Access or similar Database and Bilingual (i.e. English & French) will be considered and asset.\nDuties will entail the following:\n· Receiving of Environmental Samples either by Direct Client Drop off or via Courier.\n· Ensure all samples are received in good condition and meet appropriate QA/QC Requirements\n· Log samples into the Laboratory Information System (LIMS)\n· Label samples with unique ID’s generated from the LIMS.\n· Transfer samples to the appropriate storage areas of the Laboratory.\n· Preparation of bottle orders and supplies to be shipped or picked-up for customers.\n· Shipping/handling of bottle orders and supplies\n· Back-up receptionist when primary Receptionist is on break or holiday.\n· As you gain experience with the day to day operations of the Lab, provide consultation, recommendations, and technical assistance to clients.\n· Stay current on the application and interpretation of environmental regulations\n· Document and get closure on all client complaints\n· Preparation and shipping of subcontracted analyses\n· Coordinate and schedule on time pick-up of samples – including dropping off/picking up of samples\n· Coordinate on time and accurate delivery of all bottle orders\n· Adhere to all Health and Safety Regulations\n· Ensure Quality Standards are maintained\n· Provide client feedback to the management\n· Adhere to and participate with all QA\\QC policies of the organization\nOTHER RELATED DUTIES AS REQUIRED\nJob Type: Full-time\nSalary: From $18.00 per hour\nBenefits:\n\n Dental care\n Extended health care\n\nSchedule:\n\n 8 hour shift\n\nSupplemental pay types:\n\n Overtime pay\n\nAbility to commute/relocate:\n\n Ottawa, ON: reliably commute or plan to relocate before starting work (required)\n\nApplication question(s):\n\n Must be eligible to work in Canada\n\nWork Location: In person"
    },
    {
        "id": "fc3eb154c0b96009",
        "company": "Ciena",
        "positionName": "QA Automation Developer Co-op (Winter 2024)",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-07T06:49:30.142Z",
        "url": "https://www.indeed.ca/rc/clk?jk=fc3eb154c0b96009&from=jasx&tk=1hb2v5rcfk7vv800&vjs=3",
        "externalApplyLink": "https://careers.ciena.com/us/en/job/CIENUSR023271ENUS/QA-Automation-Developer-Co-op-Winter-2024?utm_source=indeed&utm_medium=phenom-feeds",
        "companyDescription": "",
        "description": "Ciena is committed to our people-first philosophy. Our teams enjoy a culture focused on prioritizing a personalized and flexible work environment that empowers an individual’s passions, growth, wellbeing and belonging. We’re a technology company that leads with our humanity—driving our business priorities alongside meaningful social, community, and societal impact. \n \n Why Ciena?\n \n   We’re a company rooted in people—seeking to create a vibrant and inclusive environment, where everyone feels they can belong.\n   Accelerate your career path by gaining hands-on experience and exposure to the latest technology. Our interns and graduates work on real projects in real time in world class labs. Be a part of tomorrow’s future – today.\n \n \n   Mentoring. Networking. Leadership Opportunities. We recognize that the learning doesn’t stop when you leave school - we champion a team environment for development and provide the tools to achieve success.\n   We are big proponents of life-work integration. Our people make a big difference at Ciena, but we want to shine light on their differences outside of working hours too. CienaCares supports non-profit causes important to employees by matching employee financial contributions and dedicating time for volunteering.\n \n \n  The Opportunity:\n  8 month work term: January – August 2024\n \n  How You Will Contribute:\n \n  Ciena’s Management, Control and Plan (MCP) Applications is a next generation Network Management solution for IP, Packet, and Optical networks. Based on microservices architecture, MCP Applications helps Network operators plan, provision, and troubleshoot multi-layer networks quickly using a highly intuitive user interface in addition to available open REST APIs. As a QA Automation developer, you will:\n \n   Create REST API automation using postman/JavaScript and\n   Maintain automation builds on CI/CD platform (TeamCity).\n   Work closely with our team of developers QA Engineers to design, develop, execute, and maintain automated test scripts\n \n  What Does Ciena Expect of You? \n \n  A sense of urgency – what’s important to the customer is equally important to you. You make getting things done a priority.\n   Integrity – you hold yourself to the highest level of personal and professional standards of conduct.\n   A commitment to innovation – you continually seek to learn, understand new technologies and ever-changing market conditions, and endeavor to apply that knowledge to Ciena’s advantage. \n  You embrace change – thriving in a diverse environment of ever-changing priorities and sometimes stressful situations.\n   The flexibility to work independently with minimal supervision as well as part of a broader team.\n \n \n  The Must Haves:\n \n   Software programming experience in JavaScript\n   Experience with Postman\n   Understanding of REST APIs, JSON, and XML\n   Understanding of Windows, UNIX Operating systems\n   Knowledge of basic Linux commands\n   Enthusiasm for Automation development and willingness to learn\n   Ability to estimate, prioritize, plan, and coordinate testing activities within the Development Team\n \n  Assets:\n \n   Familiarity with Agile Scrum, Agile JIRA, Bitbucket and TeamCity\n \n  Experience with web services and API testing; experience testing microservices is a plus\n \n  At Ciena, we are committed to building and fostering an environment in which our employees feel respected, valued, and heard. Ciena values the diversity of its workforce and respects its employees as individuals. We do not tolerate any form of discrimination.\n \n  If contacted in relation to a job opportunity, please advise Ciena of any accommodation measures you may require."
    },
    {
        "id": "1d450b36a6b71099",
        "company": "Cisco Systems",
        "positionName": "Lab Engineer",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-15T06:49:34.392Z",
        "url": "https://www.indeed.ca/rc/clk?jk=1d450b36a6b71099&from=jasx&tk=1hb2v5rcfk7vv800&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=1d450b36a6b71099&atk=&xpse=SoDm67I3Ki2VPKRTrZ0LbzkdCdPP",
        "companyDescription": "",
        "description": "What You'll Do\n \n \n   You will be part of the Global Lab Solutions (GLS) team, which is responsible for day-to-day lab operations for more than one (1) million square feet of Engineering lab space world-wide as well as designing, delivering, and managing programs for the governance of Cisco Engineering Labs.\n \n \n   Your role will involve providing general operational network and system administration support for GLS-managed, Engineering Labs in Ottawa, Canada.\n \n \n \n   Who You'll Work With\n \n \n   Are you excited to be part of the next wave of Internet? Our team works alongside outstanding Cisco engineers who are at the leading edge of defining and creating compelling next generation technology and solutions. You will be making a significant contribution on the Cisco products as part of a passionate team that is redefining this industry.\n \n \n   GLS is a centralized team of approximately 80 talented professionals who focus on driving standard methodologies and encouraging innovation across Engineering Labs through collaboration, data, teamwork, and technology.\n \n \n \n   What You’ll Do:\n \n \n   The Lab Engineer will provide network, system administration and general operational support for Engineering labs located on the Ottawa campus, Cisco Systems Canada. This position will be lead for the GLS Ottawa team and will advise the members of the team in providing logistical support to lab clients, including equipment installation, network connectivity, shipping & receiving, inventory control, RMA support, e-waste disposal, EHS/safety inspections, ISO audits, etc.\n \n \n   Ottawa GLS team leadership\n   Installation, monitoring, debug, and maintenance of GLS Ottawa Lab network infrastructure.\n   Installation of servers and related operating systems (OS)\n   Installation, configuration and troubleshooting of Ottawa Lab Users’ testbeds and supporting equipment.\n   Provision and support of virtual solutions such as vCenter/ESXi, including troubleshooting and configuration.\n   Installing / supporting the installation of security patches for: Linux, Windows and ESXi systems as directed by Cisco Information Security.\n   Maintaining excellent client relationships with local Business Unit (BU) leaders and GLS clients.\n \n \n \n   Basic Qualifications:\n \n \n   Cisco Certifications: CCNA or CCNP required; CCIE recommended.\n   Proven understanding of Cisco router and switch product lines with a detailed understanding of Cisco Internet Operating Systems. (IOS, IOS XE, IOS XR, NX-OS)\n   Proficiency in server-based operating systems. PC / Windows, Linux OS types and desktop and server applications: WINS, DHCP, NT domain structure, domain controllers, group policies, etc.\n \n \n \n   Preferred Qualifications:\n \n \n   Knowledge of auto-mounters and communication protocols: NFS, TFTP, FTP, SSH, SCP, DNS, LISP, NIS+. TCP/IP, subnetting, routing protocols, Ethernet media.\n   Understanding of LAN switching and configuration of VLAN’s and Spanning Tree Protocol.\n   Solid grasp of active directory (AD) and the ability to troubleshoot Linux AD connections via Vintela.\n   Knowledge of KVM, Openstack, Docker and ESXi.\n   Knowledge of scripting and web services: Python, Bash Shell, Apache, NGINX\n   Knowledge on networking monitoring tools: Nagios, Zabbix, Wireshark\n   Self-starter who is able to work independently.\n   Good communication and collaboration skills to work across multiple GLS teams, with local clients and leaders, and with partner organizations (Cisco IT, WPR, Security & Trust Org (STO), etc.)\n   Highly organized, with the ability to structure/manage projects.\n \n \n \n   Why Cisco?\n \n \n   #WeAreCisco. We are all unique, but collectively we bring our talents to work as a team, to develop innovative technology and power a more inclusive, digital future for everyone. How do we do it? Well, for starters – with people like you!\n \n \n   Nearly every internet connection around the world touches Cisco. We’re the Internet’s optimists. Our technology makes sure the data traveling at light speed across connections does so securely, yet it’s not what we make but what we make happen which marks us out. We’re helping those who work in the health service to connect with patients and each other; schools, colleges, and universities to teach in even the most challenging of times. We’re helping businesses of all shapes and sizes to connect with their employees and customers in new ways, providing people with access to the digital skills they need and connecting the most remote parts of the world – whether through 5G, or otherwise.\n \n \n   We tackle whatever challenges come our way. We have each other’s backs, we recognize our accomplishments, and we grow together. We celebrate and support one another – from big and small things in life to big career moments. And giving back is in our DNA (we get 10 days off each year to do just that).\n \n \n   We know that powering an inclusive future starts with us. Because without diversity and a dedication to equality, there is no moving forward. Our 30 Inclusive Communities, that bring people together around commonalities or passions, are leading the way. Together we’re committed to learning, listening, caring for our communities, whilst supporting the most vulnerable with a collective effort to make this world a better place either with technology, or through our actions.\n \n \n   So, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us! #WeAreCisco\n \n \n\n\n Message to applicants applying to work in the U.S.:\n  \n  \n \n  When available, the salary range posted for this position reflects the projected hiring range for new hire, full-time salaries in U.S. locations, not including equity or benefits. For non-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\n  \n \n  U.S. employees have \n  access to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long-term disability coverage, basic life insurance and numerous wellbeing offerings. Employees receive up to twelve paid holidays per calendar year, which includes one floating holiday, plus a day off for their birthday. Employees accrue up to 20 days of Paid Time Off (PTO) each year and have access to paid time away to deal with critical or emergency issues without tapping into their PTO. We offer additional paid time to volunteer and give back to the community. Employees are also able to purchase company stock through our Employee Stock Purchase Program.\n  \n \n  Employees on sales plans earn performance-based incentive pay on top of their base salary, which is split between quota and non-quota components. For quota-based incentive pay, Cisco pays at the standard rate of 1% of incentive target for each 1% revenue attainment against the quota up to 100%. Once performance exceeds 100% quota attainment, incentive rates may increase up to five times the standard rate with no cap on incentive compensation. For non-quota-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid."
    },
    {
        "id": "d2550197ced40f5c",
        "company": "BWX Technologies",
        "positionName": "Quality Control Technician",
        "jobType": [],
        "location": "447 March Road, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-06T06:49:32.848Z",
        "url": "https://www.indeed.ca/rc/clk?jk=d2550197ced40f5c&from=jasx&tk=1hb2v5rcfk7vv800&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=d2550197ced40f5c&atk=&xpse=SoCP67I3Ki2VOEQ22x0LbzkdCdPP",
        "companyDescription": "",
        "description": "BWXT Medical Ltd. provides its customers, who conduct life-saving medical procedures for patients around the world, the benefit of decades of experience in the development, manufacturing, packaging and delivery of medical isotopes and radiopharmaceuticals. Headquartered in Kanata, Ontario, BWXT Medical Ltd. employs over 300 highly-skilled people in Kanata and Vancouver, British Columbia. BWXT Medical Ltd. is part of the BWXT nuclear power segment (NPG) of BWX Technologies, Inc.\n  \n  \n \n \n  BWXT Medical Ltd., is hiring an \n  Quality Control Technician who has at least 2-years experience in chemistry and microbiology. This position is located at our production facility in Kanata, ON.\n  \n \n \n  Job Summary:\n  \n \n  Reporting to the Manager, Quality Assurance, the Quality Control Technician will perform quality control analyses of raw materials to finished product. \n  \n \n \n  Responsibilities:\n  \n \n  \n   \n    Perform quality control analysis of raw materials and final product.\n    \n  \n   \n    Perform routine monitoring of controlled systems and facilities.\n    \n  \n   \n    Perform specific administrative duties such as maintaining accurate records of observations, results and data evaluations. \n   \n  \n   \n    Follow ongoing production processes for conformance to operating procedures, product specification, GMP regulations and ISO standards.\n    \n \n \n \n  Qualifications:\n  \n \n  \n   \n    Technologist Diploma (3 yrs) or B.Sc. in a science discipline plus 2-5 years of relevant experience in chemistry or microbiology.\n    \n  \n   \n    Must possess excellent communication skills - both oral and written.\n    \n  \n   \n    Must possess excellent interpersonal skills.\n    \n  \n   \n    Must be able to perform in a team environment and be a dedicated team player. \n   \n  \n   \n    Must be able to work a variety of shifts as per the collective agreement, which includes regular scheduled weekend shifts.\n    \n \n \n \n  Other:\n  \n \n  This position is classified as a Nuclear Energy Worker. \n \n \n Why join BWXT Medical? \n \n  \n   \n    Work within the growing and exciting nuclear medicine industry as well as with highly skilled employees.\n    \n  \n   \n    Competitive salaries.\n    \n  \n   \n    Company match pension plan.\n    \n  \n   \n    Comprehensive health and dental benefits.\n    \n  \n   \n    Education Reimbursement Program.\n    \n  \n   \n    Life insurance.\n    \n  \n   \n    Collaborative work environment... and so much more!\n    \n \n \n BWXT Medical Ltd. embraces diversity of thought, values individuality, encourages new perspectives and provides equal opportunity in employment for all qualified employees and applicants without regard to race, national or ethnic origin, colour, religion, age, sex, sexual orientation, marital status, family status, disability, a conviction for which a pardon has been granted or a record suspended or any other category protected by federal law."
    },
    {
        "id": "bf639d4cac5782ec",
        "company": "NOKIA",
        "positionName": "Jr Technical Expertise Centre - Lab Tech",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-22T06:49:04.153Z",
        "url": "https://www.indeed.ca/rc/clk?jk=bf639d4cac5782ec&from=jasx&tk=1hb2v4hd2is3q800&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=bf639d4cac5782ec&atk=&xpse=SoDX67I3Ki2Yk-QYp50LbzkdCdPP",
        "companyDescription": "",
        "description": "Come create the technology that helps the world act together \n Nokia is committed to innovation and technology leadership across mobile, fixed and cloud networks. Your career here will have a positive impact on people’s lives and will help us build the capabilities needed for a more productive, sustainable, and inclusive world. \n We challenge ourselves to create an inclusive way of working where we are open to new ideas, empowered to take risks and fearless to bring our authentic selves to work. \n The team you'll be part of \n The pandemic has highlighted how important telecoms networks are to society. Nokia’s Network Infrastructure group is at the heart of a revolution to bring more and faster network capacity to people worldwide through our ambition, innovation, and technical expertise. \n This is a Tier 3 Support role where Regional TAC Engineer (Tier 2) will escalate to the person in this role i.e., Technical Expertise Engineer. In this role, you will provide remote Technical Support for the IP TEC 7250 IXR, 7250 SONIC & 7705 SAR solutions and associated network elements. As a product expert you will work closely with the H/W and S/W design teams, customer teams and sales teams to support our external customers. \n What you will learn and contribute to \n \n  Interface, develop and maintain strong relationships with external and internal customers, remotely to troubleshoot/answer questions. This will involve accessing the remote sites, reviewing log files, coordinating the duplication or testing of the issue, building lab setups, gathering traces, logs, files, etc., for critical support, and so on. \n  Assist with debugging complex product installations, resolves complicated product problems by applying both established procedures and creative alternatives. \n  Interface, develop and maintain strong relationships with select members of the design team, Solution Teams, customer teams, PLM and Product Business Units. \n  Ensure transfer of knowledge amongst the support organization and provide New Product Introduction training to other support organization \n  \n As part of our team, you will: \n \n  Use your analytical skills to isolate issues \n  Discover network design techniques \n  Develop an intense knowledge of IP protocols \n  Learn to lean on your team-mates for help \n  \n Your skills and experience \n You have: \n \n  Bachelor's Degree/College Diploma in Computer/Software/Electrical Engineering, Information Technology, Computer Science, or Equivalent education or experience. \n  Experience with IP Networking is a must have \n  Experience in Routing / Switching \n  \n It would be nice if you also had: \n \n  Experience in Hardware industry \n  Experience troubleshooting software or network problems \n  Experience and understanding of Virtual Private Network L2 and L3 solutions and OSPF, BGP, Routing/Switching protocols \n  Knowledge of IP/MPLS, routing and switching techniques \n  Knowledge of developing scripts for automated testing \n  \n What we offer \n Nokia offers flexible and hybrid working schemes, continuous learning opportunities, well-being programs to support you mentally and physically, opportunities to join and get supported by employee resource groups, mentoring programs and highly diverse teams with an inclusive culture where people thrive and are empowered. \n Nokia is committed to inclusion and is an equal opportunity employer \n Nokia has received the following recognitions for its commitment to inclusion & equality: \n \n  One of the World’s Most Ethical Companies by Ethisphere \n  Gender-Equality Index by Bloomberg \n  Workplace Pride Global Benchmark \n  LGBT+ equality & best place to work by HRC Foundation \n  \n At Nokia, we act inclusively and respect the uniqueness of people. \n Nokia’s employment selections are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law. \n We are committed to a culture of inclusion built upon our core value of respect. \n Join us and be part of a company where you will feel included and empowered to succeed."
    },
    {
        "id": "090e69d232f9f7db",
        "company": "IBM",
        "positionName": "Directeur de projet Expert Labs",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-13T06:49:43.569Z",
        "url": "https://www.indeed.ca/rc/clk?jk=090e69d232f9f7db&from=jasx&tk=1hb2v5rcfk7vv800&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=090e69d232f9f7db&atk=&xpse=SoD267I3Ki2TyRR1I50LbzkdCdPP",
        "companyDescription": "",
        "description": "Introduction\n   Chez IBM, nos directeurs de projet excellent en dirigeant et en coordonnant le rendement global, la portée, le coût et les produits livrables d'une équipe de projet. Nos clients s'appuient sur des rapports d'état opportuns et efficaces, et en tant que directeurs de projets, vous serez responsable de l'orientation du projet, de la définition des paramètres et de la gestion du rendement. Si vous êtes prêts à aider nos clients et nos équipes de projets à réussir, nous aimerions vous rencontrer!\n   \n   \n  Votre rôle et vos responsabilités\n   La responsabilité principale du directeur de projet consiste à gérer les efforts des ressources IBM, des employés du client et des fournisseurs tiers pour s'assurer qu'une solution intégrée répond aux besoins du client. À titre de directeur principal de projet au sein du Bureau de gestion des projets (PMO), vous dirigerez des équipes interfonctionnelles pour réaliser des projets qui s'étendent sur plusieurs unités commerciales. En utilisant les meilleures pratiques de gestion de projet, vous serez responsable de la livraison d'un portefeuille de projets. Le directeur de projet travaille de façon autonome, mais informe rapidement la direction de l'état d'avancement des travaux, soulève les questions et les risques au niveau approprié et au moment opportun, travaille de façon efficace et efficiente avec un minimum de supervision, conseille et guide les autres professionnels, cherche à obtenir des conseils sur les questions critiques, s'il y a lieu, et possède un solide niveau d'expertise en gestion de projet. Le directeur de projet est responsable de l'exécution du plan de projet global, du budget, de la structure, de l'échéancier et des exigences en matière de dotation en personnel de l'organisation.\n   \n   Principales responsabilités du poste\n   \n  \n   Assurer une discipline de gestion de projet et un cadre pour les équipes de projet Expert Labs.\n    Fournir une orientation et un contrôle techniques pour coordonner et gérer les activités du personnel de projet Expert Labs.\n    Identifier, suivre et gérer les dépendances des projets afin d'assurer une utilisation optimale des ressources, l'identification continue des risques et la réalisation rapide des avantages du projet.\n    Identifier les parties prenantes et les gérer à différents niveaux au sein de l'organisation, en adaptant votre style et votre approche à leurs besoins, en personne et à distance.\n    Tenir des réunions régulières avec les clients et les parties prenantes du projet.\n    Organiser et présenter l'information sur le projet de façon complète et appropriée en fonction de l'auditoire et de la situation, y compris produire des rapports à l'intention de la direction.\n    Fournir des prévisions financières aux chefs de la prestation.\n    Maintenir la cadence de gestion avec les chefs de la prestation afin de fournir des informations sur l'état du projet.\n    Administrer la procédure de contrôle des modifications au contrat avec le client.\n    Maintenir la communication sur le projet avec le client et gérer les attentes du client.\n    Utilisation du processus de recours hiérarchique et gestion des situations critiques. Capacité de clarifier clairement l'énoncé du problème. Avoir recours à la méthode de résolution des problèmes, la pensée critique et l'analyse des causes fondamentales pour disséquer les questions complexes. Générer, évaluer et mettre en œuvre des solutions possibles et surveiller les résultats.\n    Aider à estimer et à évaluer les nouveaux projets.\n    Créer des livrables de gestion de projet (rapports d'état, suivi financier, plan de projet, risques, problèmes, actions, journaux de décisions, etc.)\n    Développer une connaissance des offres d'Integration Expert Labs avec une sensibilisation aux nouvelles technologies et solutions.\n  \n   \n   Expertise professionnelle et technique requise\n   \n  \n    Baccalauréat ou diplôme avec 4 années d'expérience au sein d'une organisation de services consultatifs aux clients.\n    Maîtrise de l'anglais et du français: Posséinez d'excellentes compétences en communication écrite et verbale en français et en anglais et doivent être basées au Canada.\n    Certification de gestion de projet (PMP, Scrum Master, PMI-ACP, ou autres certifications)\n    Expérience et compétence dans l'utilisation de MS Project et d'autres outils de gestion de projet.\n    Expérience de travail avec plusieurs méthodologies de projet (cascade, Agile, Scrum)\n    Solides compétences en communication verbale et écrite.\n    Expérience de la communication avec les chefs opérationnels.\n    Expérience de travail dans un environnement de bureau virtuel et maintien d'une présence active et dynamique par téléphone, Slack et courriel.\n    Excellentes compétences en gestion des relations et en facilitation.\n    Leadership personnel solide et compétences en gestion avec un style de collaboration.\n    Capacité de voyager jusqu'à 50 % du temps au besoin.\n  \n   \n   Expertise professionnelle et technique privilégié\n   \n  \n    MBA de préférence.\n  \n \n \n  \n    \n    A propos de l'unité commerciale\n   Alimentée par les technologies cognitives, plus de 150 offres SaaS, et des aperçus en temps réel, l'équipe des marchés mondiaux offre une expertise intégrée afin d'aider nos clients à prendre de meilleures décisions et à innover tout en collaborant avec leurs clients, partenaires et fournisseurs. Rejoignez-nous afin de continuer à stimuler l'innovation avec le portefeuille le plus complet pour les entreprises de tous les secteurs d'activité.\n \n \n  \n    \n    Votre vie chez IBM\n   Dans un monde où la technologie ne s'arrête jamais, nous comprenons que, le dévouement au succès de nos clients, les innovations importantes, et la confiance et la responsabilité personnelle dans toutes nos relations, se reflètent dans ce que nous faisons en tant qu'IBMistes alors que nous nous efforçons d'être le catalyseur dans un monde qui fonctionne mieux.\n   Être un IBMiste signifie que vous serez en mesure d'apprendre et d'évoluer personnellement et professionnellement. Vous serez encourager à expérimenter au quotidien, tout en ayant une confiance et un soutien constant dans un environnement où chacun peut s'épanouir quelle que soit leur expérience personnelle ou professionnelle.\n   Nos IBMistes sont soucieux de la croissance de notre entreprise et toujours curieux d'en savoir plus. Ils sont ouverts aux commentaires et à l'apprentissage de nouvelles informations et compétences pour évoluer constamment. On leur fait confiance pour fournir des commentaires continus pour aider les autres, ainsi que pour collaborer avec leurs collègues en gardant un esprit d'équipe qui est ouvert à différentes perspectives afin d'obtenir des résultats exceptionnels pour nos clients. Le courage dont nos IBMistes ont besoin pour prendre des décisions critiques tous les jours est essentiel pour qu'IBM devienne le catalyseur du progrès. Ils doivent toujours relever les défis avec les ressources dont ils disposent, posséder une attitude positive et s’efforcer toujours d'adopter une approche axée sur les résultats dans tout ce qu'ils font.\n   Êtes-vous prêt à devenir IBMiste ?\n \n \n  \n    À propos d'IBM\n   La plus grande invention d'IBM, c'est l'IBMiste. Nous sommes convaincus que la mise en application de l'intelligence, de la raison et de la science nous permet d'améliorer l'activité économique, la société et la condition humaine, en donnant vie à la puissance d'un nuage hybride ouvert et d'une stratégie d'IA pour nos clients et nos partenaires du monde entier.\n   \n   Ayant réinventé sans relâche depuis 1911, nous ne sommes pas seulement l'une des plus grandes entreprises au monde, nous sommes aussi l'un des plus grands employeurs en TI et en services-conseils, avec de nombreuses entreprises du classement Fortune 50 s'appuyant sur IBM Cloud pour gérer leur entreprise.\n   \n   Chez IBM, nous sommes fiers d'avoir été parmi les premiers à adopter l'intelligence artificielle, l'informatique quantique et la chaîne de blocs. C'est le moment de vous joindre à nous et de devenir un innovateur technologique responsable et une force au service du bien dans le monde.\n \n \n  \n    \n    Énoncé du lieu de travail\n   Doit avoir la capacité de travailler au Canada sans parrainage.\n   \n   Ce poste comporte des tâches qui mettent en jeu des technologies visées par des sanctions en vertu de la réglementation sur les exportations. Si vous êtes un ressortissant étranger de l'un des pays sanctionnés par les États-Unis (Cuba, Iran, Corée du Nord, Syrie et les régions ukrainiennes de Crimée, Luhansk, Donetsk, Kherson et Zaporizhia) titulaire d'un permis de travail, vous n'êtes pas admissible à ce poste.\n \n \n  \n    \n    Vous et IBM\n   IBM s'engage à créer un milieu diversifié et est fière de souscrire au principe de l'égalité d'accès à l'emploi. Tous les candidats qualifiés seront pris en considération pour un emploi sans égard à la race, à la couleur, à la religion, ausexe, à l'identité ou à l'expression de genre, à l'orientation sexuelle, à l'origine nationale, à la génétique, à la grossesse, aux handicaps, à l'âge, au statut de vétéran ou à d'autres caractéristiques. IBM s'engage également à se conformer à toutes lespratiques équitables en matière d'emploi à l'égard du statut de citoyen et d'immigrant."
    },
    {
        "id": "43afb68db10ab985",
        "company": "NOKIA",
        "positionName": "IP R&D Lab Technologist Co-op/Intern",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-15T06:49:49.276Z",
        "url": "https://www.indeed.ca/rc/clk?jk=43afb68db10ab985&from=jasx&tk=1hb2v5rcfk7vv800&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=43afb68db10ab985&atk=&xpse=SoAQ67I3Ki2TA8QYyB0LbzkdCdPP",
        "companyDescription": "",
        "description": "Position: IP R&D Lab Technologist Co-op/Intern Duration: 3 months+ Date: January 8th to April 26th, 2024 Location: Onsite\n \n \n   \n   \n \n \n  Come create the technology that helps the world act together\n   \n  \n \n  We are a B2B technology innovation leader pioneering the future where networks meet cloud. At Nokia, you will have a positive impact on people’s lives and help build the capabilities needed for a more productive, sustainable, and accessible world. \n   Be part of a culture built on an inclusive way of working where we are open to your ideas, you are empowered to take risks, and are encouraged to be fearless in bringing your authentic self to work.\n \n \n   \n    The team you'll be part of \n  \n \n  Network Infrastructure \n  \n \n  The pandemic has highlighted how important telecoms networks are to society. Nokia’s Network Infrastructure group is at the heart of a revolution to bring more and faster network capacity to people worldwide through our ambition, innovation, and technical expertise.\n \n \n   \n   \n \n \n  Education Recommendations\n \n  \n  \n   Currently a 2nd-year candidate for a bachelor’s degree or diploma in Computer Networking or a related field with an accredited school in Canada.\n \n \n   \n   \n \n \n  What you will learn and contribute to \n  \n \n  As part of our team, you will: \n   \n   A central tool for inventory tracking OTS (serial numbers, loaned equipment, repairs, etc.) \n   Manage upgrades, and repairs (do some simple repairs; tracking what's out for repairs) \n   Proper storage and ESD \n   Deal with new equipment \n   Build custom PCs, install CentOS, and create Linux servers \n   Cabling and building basic topologies \n   Troubleshoot various issues with network and equipment \n   Configuring terminal servers, APCs, and cabling topologies for testbeds/infrastructure \n   Sniff the network to keep it running well. Find inefficiencies/problems and fix them. \n   Keep benches, cabling, etc. neat and clean. \n   Maintain a web page with troubleshooting tips, procedures \n   Find/implement ways to improve the lab \n   Monitor the performance of these nodes during long-duration tests, and report anomalies to the supervising engineers.\n  \n \n  \n  \n \n \n \n  What is Nokia looking for from me  You have: \n  \n \n  \n   Strong interpersonal and communication (both written and verbal) skills are required \n   Demonstrated ability to learn quickly and to work in a fast-paced, innovative environment \n   Strong troubleshooting skills \n   Strong sense of ownership and accountability \n   Linux/Unix operating systems, installing servers, creating users, groups, and permissions \n   Windows Servers, installing DNS and Active Directory, and creating Group Policies \n   Familiar with networking tools, ie. TFTP, FTP, and Wireshark \n   Basic training in cable architecture and repair \n   The candidate must be able to successfully work in a team-oriented environment\n  \n \n  \n  \n \n \n \n  Why we're awesome \n  \n \n  Nokia offers flexible and hybrid working schemes, continuous learning opportunities, well-being programs to support you mentally and physically, opportunities to join and get supported by employee resource groups, mentoring programs and highly diverse teams with an inclusive culture where people thrive and are empowered.  Company Culture: We believe our people are our greatest asset and we aim to foster a fun, challenging, positive, and inclusive work environment. We offer 1-on-1 mentorship, learning and development opportunities, global impact and interaction, and flexible work/life balance.  Meaningful Co-op Term: During your co-op term, you will have the opportunity to test out the latest technologies and work on innovative projects that could leave a global impact. You get to use skills learned in the classroom and apply it to real work situations while gaining professional hands-on experience.\n \n \n   \n   \n \n \n  Nokia is committed to inclusion and is an equal opportunity employer \n  \n \n  Nokia has received the following recognitions for its commitment to inclusion & equality: \n  \n \n  One of the World’s Most Ethical Companies by Ethisphere \n  Gender-Equality Index by Bloomberg \n  Workplace Pride Global Benchmark \n  \n \n  At Nokia, we act inclusively and respect the uniqueness of people.\n \n  \n  \n   Nokia’s employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law. We are committed to a culture of inclusion built upon our core value of respect. \n  \n \n  Join us and be part of a company where you will feel included and empowered to succeed.\n \n \n   \n   \n \n \n  See you this Winter 2024!!!"
    },
    {
        "id": "59d9eb1b9eb1326d",
        "company": "CHEO RESEARCH INSTITUTE",
        "positionName": "RI-23-048 Research Assistant",
        "jobType": [],
        "location": "401 Smyth Road, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-14T06:50:04.405Z",
        "url": "https://www.indeed.ca/rc/clk?jk=59d9eb1b9eb1326d&from=jasx&tk=1hb2v5rcfk7vv800&vjs=3",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "JOB DESCRIPTION Posting # RI-23-048\nPosting Period – September 13, 2023 to September 27, 2023\nPOSITION: Research Assistant\nChronic Pain Program, Development and Rehabilitation\nTERM: Part-time Contract (0.4 FTE); until September 30, 2024 with possibility of extension\nSALARY: Will be commensurate with skills and experience\nREPORTS TO: Manager, Development and Rehabilitation\nChildren’s Hospital of Eastern Ontario Research Institute (“CHEO RI”) is the research arm of the Children’s Hospital of Eastern Ontario – Ottawa Children’s Treatment Centre (“CHEO”) and an affiliated institute of the University of Ottawa. CHEO is a beloved institution and workplace that is widely recognized for being an anchor in our community. CHEO RI works to create new knowledge and evidence to support CHEO in its provision of world-class care to our children. Our mission at CHEORI is to connect exceptional talent and technology in pursuit of life-changing research for every child, youth and family in our community and beyond.\nCHEO RI has an immediate requirement for a Research Assistant.\nThe Clinical Research Assistant will assist the research team in the day-to-day activities involved in the conduct of research including, but not limited to, the creation and maintenance of research files according to study guidelines, the collection, scoring and coding of research information, patient recruitment including screening and obtaining informed consents, processing of lab samples.\nMAIN RESPONSIBILITIES\nUnder the general supervision of the Manager, Development and Rehabilitation, the Research Assistant will:\n\n Assist with REB and/or grant submissions and updates to those submissions as needed\n Assist with creation and/or modification of slides for presentations\n Be responsible for patient recruitment including screening and obtaining informed consents\n Be responsible for the creation and maintenance of research files according to study guidelines (Good Clinical Practice Guidelines)\n Be responsible for keeping an inventory of research measures and relaying information to the ordering agent\n Be responsible for the collection, scoring, and coding of research information.\n Will assist in the database design and be responsible for the maintenance of the databases and the data dictionary\n Be responsible for data entry and data integrity\n Identifying children and their families eligible to be recruited to the study\n Conduct baseline interviews\n Collect follow up data\n Create and maintain research and project files\n Be responsible for the collection, scoring, and coding of research information\n Assist as needed with other administrative duties related to ongoing research\n Perform work in accordance with the provisions of the Occupational Health and Safety Act and Regulations and all CHEO corporate/departmental policies and procedures related to OccupationalHealth and Safety\n Perform other related duties as assigned by supervisor\n\nQUALIFICATIONS, SKILL AND ABILITIES\n\n University undergraduate degree in a health-related field such as Bachelor of Science or Social Science Degree, preferably in psychology, neuroscience , or related field (Essential)\n Minimum 1 year of clinical research experience (Preferred)\n Understanding of research design, procedures, guidelines and standards governing clinical research including Personal Health Information Protection Act (Essential)\n Data management experience (REDCap) (Preferred)\n Proficiency in computer skills (Microsoft Office) (Essential)\n Excellent communication (verbal and written), interpersonal and organizational skills (Essential)\n Demonstrated collegiality, professionalism and team skills (Essential)\n Demonstrated initiative, flexibility, and ability to work independently (Essential)\n GCP, TPCS-2, certifications (Preferred)\n Bilingualism (English/French) is an asset (Preferred)\n\nWORKING CONDITIONS\n\n Clinic setting work within hospital; exposure to children and parents and/or caregivers.\n Flexibility to work remotely in a hybrid work model that would include both remote work and on-site work.\n\nOTHER REQUIREMENTS\n\n Eligible to work in Canada;\n Compliance with CHEO RI’s Universal COVID-19 Vaccination Policy; and\n Police Record Check.\n\nTO APPLY\nPlease send a complete CV and cover letter to Sarah Bigford, by email to: sbigford@cheo.on.ca.\nThe CHEO Research Institute values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants. Should an applicant require any accommodations during the application process, as per the Accessibility for Ontarians with Disabilities Act, please notify Human Resources at researchhr@cheo.on.ca.\nThe CHEO Research Institute seeks to increase equity, diversity and inclusion in all of its activities, including research, education and career development, patient, family and donor partnerships. We value diverse and non-traditional career paths and perspectives, and value skills such as resilience, collaboration, and relationship-building. We welcome applications from members of racialized minorities, Indigenous peoples, persons with disabilities, persons of minority sexual orientations and gender identities, and others with the skills and knowledge to productively engage with diverse communities.\nApplications will only be considered from those that are eligible to work in Canada. We thank all applicants for their interest, however, only those invited for an interview will be contacted.\nDESCRIPTION DE POSTE No d’affichage RI-23-048\nPériode d’affichage – du 13 au 27 septembre 2023\nPOSTE : Assistant ou assistante de recherche\nProgramme de la douleur chronique, Développement et réadaptation\nDURÉE : Contrat à temps partiel (0,4 ETP); jusqu’au 30 septembre 2024 avec possibilité de prolongement\nSALAIRE : Le salaire sera proportionnel aux compétences et à l’expérience\nRELÈVE DE : Gestionnaire, Développement et réadaptation\nL’Institut de recherche du Centre hospitalier pour enfants de l’est de l’Ontario (« IR de CHEO ») est l’organisme de recherche du Centre de traitement pour enfants du Centre hospitalier pour enfants de l’est de l’Ontario situé à Ottawa (« CHEO ») et un institut affilié de l’Université d’Ottawa. CHEO est une institution et un milieu de travail que nous chérissons et qui est largement reconnu pour être une source de soutien dans notre collectivité. L’IR de CHEO travaille pour créer de nouvelles connaissances et de nouvelles preuves pour soutenir CHEO dans sa prestation de soins de classe mondiale à nos enfants. Notre mission, à l’Institut de recherche de CHEO, est de réunir des technologies et des talents exceptionnels dans la poursuite de recherches qui ont une incidence sur la vie de chaque enfant, jeune et famille de notre collectivité et ailleurs.\nL’IR de CHEO a immédiatement besoin d’un assistant ou d’une assistante de recherche.\nL’assistant ou l’assistante de recherche clinique aidera l’équipe de recherche dans les activités quotidiennes liées au déroulement de la recherche, y compris sans s’y limiter, la création et le maintien des dossiers de recherche conformément aux directives de l’étude, la collecte, la notation et le codage des données de recherche et le recrutement des patients, y compris la vérification et l’obtention de consentements éclairés ainsi que le traitement des échantillons de laboratoire\nPRINCIPALES RESPONSABILITÉS\nSous la supervision générale du gestionnaire, Développement et réadaptation, le ou la titulaire sera responsable des activités suivantes :\n\n Aider dans le cas des présentations au Comité d’éthique de la recherche (CER) ou des présentations en vue de l’obtention de subventions ainsi que des mises à jour de ces présentations, le cas échéant\n Aider à la création ou à la modification des diapositives pour les présentations\n Recrutement des patients, y compris de la vérification et de l’obtention des consentements éclairés\n Création et tenue à jour des dossiers de recherche conformément aux lignes directrices de l’étude (lignes directrices des bonnes pratiques cliniques)\n Tenue d’un inventaire des mesures de recherche et de la transmission de l’information au préparateur de commandes\n Collecte, notation et codage des données de recherche\n Participation à la conception de bases de données et tenue des bases de données et du dictionnaire de données\n Saisie et intégrité des données\n Identification des enfants et de leurs familles qui sont admissibles au recrutement pour l’étude\n Mener des entrevues de base\n Recueillir les données de suivi\n Créer et tenir à jour les dossiers de recherche et de projet\n Collecte, notation et codage des données de recherche\n Aider, le cas échéant, dans d’autres tâches administratives liées à la recherche en cours\n Effectuer le travail conformément aux dispositions de la Loi sur la santé et la sécurité au travail et de son règlement d’application, ainsi qu’à toutes les politiques et procédures de l’entreprise et des services de CHEO relatives à la santé et à la sécurité au travail.\n Effectuer d’autres tâches connexes attribuées par le superviseur.\n\nQUALIFICATIONS, COMPÉTENCES ET CAPACITÉS\n\n Diplôme universitaire de premier cycle dans un domaine lié à la santé, tel qu’un baccalauréat en sciences ou en sciences sociales, de préférence en psychologie, en neurosciences ou dans un domaine connexe (Essentiel)\n Minimum de 1 an d’expérience en recherche clinique (Préférable)\n Compréhension de la conception de la recherche, des procédures, des lignes directrices et des normes régissant la recherche clinique, y compris la Loi sur la protection des renseignements personnels sur la santé (Essentiel)\n Expérience en gestion de données (REDCap) (Préférable)\n Maîtrise des compétences informatiques (Microsoft Office) (Essentiel)\n Excellentes aptitudes à la communication (verbale et écrite), aux relations interpersonnelles et à l’organisation (Essentiel)\n Collégialité, professionnalisme et esprit d’équipe avérés (Essentiel)\n Esprit d’initiative, flexibilité et capacité à travailler de manière indépendante (Essentiel)\n Certifications BPC, EPTC-2 (Préférable)\n Le bilinguisme (anglais et français) est un atout (Préférable)\n\nCONDITIONS DE TRAVAIL\n\n Travail en milieu clinique à l’hôpital; en contact avec les enfants et leurs parents et/ou avec les aidants.\n Flexibilité pour travailler à distance dans un modèle de travail hybride qui inclut à la fois le travail à distance et le travail sur place.\n\nAUTRES EXIGENCES\n\n Être autorisé à travailler au Canada;\n Respect de la politique de vaccination universelle contre la COVID-19 de l’IR de CHEO;\n Vérification du casier judiciaire.\n\nPOUR POSTULER\nVeuillez envoyer par courriel un CV complet et une lettre d’accompagnement à Sarah Bigford à l’adresse suivante : sbigford@cheo.on.ca.\nL’Institut de recherche du CHEO valorise la diversité et est un employeur qui souscrit au principe d’égalité d’accès. Nous sommes résolus à fournir un environnement de travail inclusif et sans obstacle, en commençant par le processus d’embauche et nous sommes heureux de recevoir des demandes provenant de tous les candidats compétents. Les candidats ou les candidates qui auront besoin de mesures d’adaptation durant le processus de demande d’emploi sont priés d’envoyer un courriel aux Ressources humaines, conformément à la Loi sur l’accessibilité pour les personnes handicapées de l’Ontario à l’adresse suivante : researchhr@cheo.on.ca.\nL’Institut de recherche de CHEO cherche à accroître l’équité, la diversité et l’inclusion dans toutes ses activités, y compris la recherche, l’éducation et l’avancement professionnel, les partenariats avec les patients, les familles et les donateurs. Nous valorisons les parcours et les perspectives de carrière diversifiés et non traditionnels, ainsi que les compétences telles que la résilience, la collaboration et l’établissement de relations.Nous invitons les membres de minorités racisées ou de peuples autochtones, les personnes handicapées, les personnes ayant une orientation sexuelle ou une identité de genre minoritaire, et toute autre personne ayant les compétences et connaissances nécessaires à présenter leur demande, afin de s’engager de manière productive auprès de diverses communautés.\nSeules les candidatures des personnes autorisées à travailler au Canada seront prises en considération. Nous remercions tous les candidats de leur intérêt, cependant, nous ne communiquerons qu’avec ceux qui seront convoqués à une entrevue.\nJob Type: Part-time\nSalary: From $17.50 per hour\nEducation:\n\n Bachelor's Degree (required)\n\nWork Location: Hybrid remote in Ottawa, ON K1H 8L1"
    },
    {
        "id": "90bcf37fbddc9860",
        "company": "Alberta Precision Labs",
        "positionName": "Medical Laboratory Technologist (Alberta, Canada)",
        "jobType": [],
        "location": "Ontario",
        "salary": null,
        "postingDateParsed": "2023-09-14T06:50:05.714Z",
        "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0BKoA0KjMB2_2SITHdZiKR2tLJiDQwQdMraFBOtj0fmnfR-Td6qATq9uOZ1-TDWBDzwp6MAA8ZhePQnmA_4BK-jRHFdLentfbOKSaxw_jWzwNGt8tg98WkwNrLXBYhRjVOlT8oTR4k8vZQLaoFSbxwTowq64vZucQLk99AwoPUBulLKxMSVfJWs3V7X1YYhhINfAjfTOF_qytEuTp3-oEdqPgPY2ojkjDPG2m7HjulB59jMuk0rygtsb81gBsA-LU3u6utIiXp6VGNIgtTmHRRv6tnD0YG9hYEVlPGm6-g0Uv7Gb07BuPAG6knkg7Wn9OX6My96WGbTbgCTKIa6z7oDDumRpZYTf10hiJlqg5xVlaGu5wHaOp3HxyRZgwGj6P_CATAEbWh6bH0YDi1gVMxZkYmG60Aeb-WoKVPK-TTdNYCJ7rXoWrNmirFWmGovCxC3nShnFwsUvR593jWrfnnpt9Org3Ptvjp0Xu_7ipFH4DouSyIW2PLvLbk_M5OZF9Sz2MT99UKyvQqbHlv58CGUIkyG-0mGxNDX37w678WjtQmMnKIWqqh79VyrfipnfJQ%3D&xkcb=SoAK-_M3Ki2Sg5xiMx0ObzkdCdPP&p=5&fvj=1&vjs=3&jsa=5150&tk=1hb2v7amek25r800&from=jasx&wvign=1",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "Your Opportunity:\nAlberta Precision Laboratories (APL) is hiring multiple Medical Laboratory Technologists throughout Alberta.\nAPL delivers high-quality, responsive diagnostic lab services to Albertans as a part of the provincial healthcare system. With competitive salaries, opportunities for professional development, and comprehensive benefits, you can truly thrive. Make a difference in your own community as you help healthcare professionals and patients get the information that they need to improve, optimize, or maintain health.\nCome and join our diverse team and get the opportunity to utilize all of the skills and experiences you have gained through school. This is a working level position utilizing technical skills and judgment performing a diverse range of diagnostic procedures in the Clinical Chemistry, Hematology, Transfusion Medicine, and Specimen Procurement departments, within the scope of practice of a Medical Laboratory Technologist.\nJoin our professional and engaging team that encourages promoting a positive and respectful work environment consistent with the APL Values: kindness, inclusion, innovation, agility & accuracy.\nJob Description:\nAs a Medical Laboratory Technologist (MLT) I, you will be responsible for the daily processing, testing, results analysis and reporting of diagnostic samples within the laboratory department. You will perform a variety of routine and specialized procedures in the processing of specimens used in diagnosis, treatment and research.\nQualifications:\nCompletion of an accredited Medical Laboratory Technology (MLT) program. Active or eligible for registration and practice permit with the College of Medical Laboratory Technologists of Alberta (CMLTA).\nJob Types: Casual, Permanent, Part-time, Full-time, Fixed term contract\nSalary: $34.75-$45.77 per hour\nBenefits:\n\n Company pension\n Dental care\n Disability insurance\n Extended health care\n Life insurance\n Paid time off\n Vision care\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n Day shift\n Evening shift\n Night shift\n\nWork Location: In person"
    },
    {
        "id": "46e34efc327d8d60",
        "company": "Alberta Precision Labs",
        "positionName": "Medical Laboratory Assistant (Alberta, Canada)",
        "jobType": [],
        "location": "Ontario",
        "salary": null,
        "postingDateParsed": "2023-09-14T06:50:07.715Z",
        "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0BKoA0KjMB2_2SITHdZiKR2tLJiDQwQdMraFBOtj0fmnfR-Td6qATq9e8Dii-TEZmttxkF29KoVMomicbEbdo8mnwcyGUotTIf0wV1DxZBe_nj4g0BDCJNzF8mAErJuZgMTvqMC80EL98DVTmi4C73Ox8ljLHP1ZqOO73jiLk8AUszpEsR9vAr_dHs7yTk847kp-baLwIQF7OT6M1hVkygWY8JLdC_ivBH8NHb6B700bwx9Gy3KuGkOneedyR0X5HcL_RY2rHvRQ6HvmG9xGSoejduNMJDnsrmRChENftKxQMhDIOBRNfS1H_bQnDXXuDrQP0NTxO0D3cuTptm4bmPdn7g8MwFnTqWK0awYGvwOLuxIf7AbPDQHhDNmgXoDbZIdcv24n18y7_pa43bsRwgHU0m6jNMCYlu1tJn9QwKh1QBLBfiSaA1k63QKyy_oBqYXYRrEvtD58PUgvnHr53LvmPn_0mmWBZCVDzuEH4UMPoYB9AycQ29ExijdZGqnPycdUjTbsj5njHQJK0Fzinj2tZp0jtUzVFv0SuplekIgaRVH9bcpHXOXrSYTln4PrEE%3D&xkcb=SoC--_M3Ki2Sg5xiMx0PbzkdCdPP&p=4&fvj=1&vjs=3&jsa=5150&tk=1hb2v7amek25r800&from=jasx&wvign=1",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "Your Opportunity:\nAlberta Precision Laboratories (APL) is hiring multiple Medical Laboratory Assistants throughout Alberta.\nAPL delivers high-quality, responsive diagnostic lab services to Albertans as a part of the provincial healthcare system. With competitive salaries, opportunities for professional development, and comprehensive benefits, you can truly thrive. Make a difference in your own community as you help healthcare professionals and patients get the information that they need to improve, optimize, or maintain health.\nAs a successful candidate, you will have the opportunity to work both independently and as a member of our team where you may be responsible for performing all aspects within the scope of practice of a MLA including blood collection, specimen procurement and handling procedures, data entry, as well as Electrocardiogram (ECG) and Holter monitors, and urinalysis. You will have the opportunity to work in the community or hospital setting.\nWith a customer service focused approach, you build productive and respectful customer relations and take responsibility for customer satisfaction. You have an ability to encourage others, building positive, respectful and collaborative working relationships.\nJoin our professional and engaging team that encourages promoting a positive and respectful work environment consistent with the APL Values: kindness, inclusion, innovation, agility & accuracy.\nJob Description:\nAs an MLA, you will provide high quality service to clients of the clinical laboratory in an effective, efficient and safe manner. You will be responsible for a variety of laboratory functions including procurement, handling, processing, dispatching and testing of specimens, performing procedures and reporting results.\nQualifications:\nCompletion of an accredited Medical Laboratory Assistant program or equivalent.\nJob Types: Casual, Permanent, Part-time, Full-time, Fixed term contract\nSalary: $23.25-$28.98 per hour\nBenefits:\n\n Company pension\n Dental care\n Disability insurance\n Extended health care\n Life insurance\n Paid time off\n Vision care\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n Day shift\n Evening shift\n Night shift\n Weekends as needed\n\nWork Location: In person"
    },
    {
        "id": "224a96241aa8d177",
        "company": "Bruyère Continuing Care",
        "positionName": "Research Associate I",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-13T06:50:11.862Z",
        "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0Az2iNjeEfHXNwE0SzwhSkmDNQI8i9Vjon05RnpHnjhnTRb7LUcI3252DSCathDV_mYJh-z1DkuVxKYYx2qaWvNijvvD4BTtGg7Hv9QV1VNrTJt92ntVYzSfRcFQpILgn74CRlRgGyTSgFjKph2_XbxRDcowM2ohFbr7SRswTyJc0jF_89YG4BJVkH853vrnKJkcF_dyfTQm3kHCzwmgGoLfJZ8kT1k8tXcSvgksekh3U8cJiUuGTTeZInGlGCkXr7xDtFMLwivvD11QQOriKLjPcW7RM7iC3E7dohcZNmzK6L4mfqOilt9XKJvlAPVNe4_udjIG-Ont8nZhz6OgdGN9Jl_t1764wRmKVHORSVSxx-HpIFb_X3q1ChqPD8QRQztAeiYdzhlM9KMrPwx1YeLJ69fyFUb-qqk7iOaVBXaYE63m5sz9xzWjwfBAkt-BR_E6q5BnDOfgr5H0I9EvbFhaOYkecDC26FI5g8j-X4Fxq3Dmn-5FqoGYlix2Kn6dzm_MVPN6GXbKaoq2J2pUuZ7fGEfpAWy_60GBqDsWLUcttcc_z3-j72I&xkcb=SoBR-_M3Ki2SK7zAJZ0LbzkdCdPP&p=0&fvj=0&vjs=3&jsa=15&tk=1hb2v7fefi3br800&from=jasx&wvign=1",
        "externalApplyLink": "https://www.bruyere.org/en/hr?job=17997",
        "companyDescription": "",
        "description": "The Bruyère Research Institute partners with Bruyère Continuing Care, the University of Ottawa and other stakeholders to conduct relevant and practical health sciences research related to medical education and improving the quality of life for the aging population and people requiring continuing care.\n  \n  \n  \n  \n Function Summary We are a research team led by Dr. Daniel Kobewka, who is an investigator at the Bruyère Research Institute (BRI) and is a clinical scientist at The Ottawa Hospital Research Institute (OHRI). Our team focuses on building evidence that informs care planning and shared decision-making, for older patients and those at the end of life.\n  \n  Our research team is focused on improving communication and decision making for people with serious illness and for those nearing the end of their lives. During serious illness treatments to prolong life may not work in some cases cause harm by increasing discomfort or prolonging suffering. For people with serious illness open communication about their goals and wishes is critical. Unfortunately, when communication does not happen, treatments that are inconsistent with their goals may be administered. Serious illness care needs to be informed by what matters most to the person and by realistic prognoses for the outcomes that matter most to people. Our lab works to create values clarification tools and prognostic models to inform serious illness decision making. Join us in this important work.\n  \n  We are looking for an experienced and motivated Research Associate to join our research team. This role participates in the conceptualization and development of the ongoing and future programs of research and team growth by contributing to all aspects of the research design, analysis and dissemination. These activities include coaching and mentorship of team members and collaborators, the development of research objectives, grant development, maintaining data integrity, and strong methodological contributions to planning and executing both qualitative/quantitative analyses.\n  \n  \n  \n  \n Main duties and responsibilities\n \n   Undertake and contribute to health research projects of varying complexity applying appropriate quantitative and/or qualitative research methods (e.g., literature reviews, interviews, surveys, and statistical models)\n   Produce high quality, well written research reports, data analysis plans, executive summaries, blogs, data visualizations, and proposals\n   Interpret data results with ease and clarity into key messages and visualizations for a range of audiences\n   Plan and write grant proposals – this includes but is not limited to budget planning, literature review, administrative grant tasks, collaborator meetings, updates, or requests for specific feedback\n   Plan budget for individual projects and programs of research – reviewing current budgets and estimating the required funds overtime\n   Maintain up-to-date administrative records of institutional research ethics and ICES privacy documentation for each ongoing and completed project\n   Support team cohesion and growth, which includes providing mentorship to team members to improve their skills, knowledge, independence, confidence, and/or provide experience in a new area\n   Manage the project – this may include both leading projects and coaching other project leads (e.g., collaborating clinical expert, junior team member, student, etc.) in planning a project (typically a manuscript within a series of projects) and helping ensure each step is executed according to timelines, budget, and research standards\n   Communicate effectively with team members, clinical collaborators, colleagues, research advisors, patient partners, and external stakeholders\n   Provide logistical support for research-related tasks – this may include scheduling, hosting, attending regular meetings, as well as ongoing administrative and collaborator correspondence\n   Communicate and coordinate with Research Institutes’ Finance and HR teams as it pertains to team management (namely for budgeting, staff hiring, and onboarding)\n   Develop and maintain systems to track progress of research projects and stakeholder outreach\n   Additional duties may be added as projects progress\n \n  Required Qualifications and competencies\n \n   Graduate degree (MSc or PhD) in biostatistics, epidemiology, or equivalent\n   Minimum four (4) years’ experience in clinical or health services research, including leading or managing multi-year studies\n   Demonstrated training and experience in quantitative study design and methodology \n  Experience in study or project management in an academic research environment \n  Experience with peer-mentorship or mentorship of research students and/or staff \n  Exceptional writing skills and ability to communicate effectively across a variety of audiences\n   Proven expertise leading research studies (e.g., peer-reviewed publications or other research products)\n   Demonstrated expertise with advanced data analysis techniques\n   Knowledge of computer software packages including Microsoft Word, Excel, PowerPoint\n   Ability to work independently and collaboratively\n   Strong organizational and interpersonal skills\n   Ability to set priorities, deliver high quality products and meet deadlines\n   Excellent communication skills, written and oral, in English\n   Fluent in French and English, an asset\n \n  Preferred Competencies\n \n   Experience with ICES data, either internally (analyst or student) or as collaborating researcher or research staff\n   Experience writing grants and peer-reviewed publications\n   Experience in designing studies, conducting statistical analyses (i.e., R-Programming, SAS, STATA, etc.) and interpreting the results\n   Proactive approach to study planning, with an understanding of the research lifecycle for both health services and clinical research projects\n   Experience in the following areas is an asset: predictive modelling, systematic reviews, clinical decision-making, older adult populations, end-of-life or long-term care research\n \n \n   If you are interested in this opportunity, please submit your cover letter and resume to\n \n \n   BRI-HR@bruyere.org\n \n \n   Attention Human Resources with subject line “Research Associate I – Dr. Kobewka”,\n \n \n   no later than October 6, 2023.\n \n \n   Please note that incomplete applications may not be reviewed.\n \n  Bruyère Research Institute is an equal opportunity employer and values diversity in its workplace. All qualified applicants will receive consideration for employment based on skills and experience as outlined in your CV and cover letter.\n  \n  Bruyère Research Institute is committed to developing inclusive, barrier-free selection processes and work environments. If contacted regarding this competition, please advise of the accommodation measures which may be required to enable you to be assessed in a fair and equitable manner.\n  \n  All researchers, employees and students of the Bruyère Research Institute who will work with long-term care homes, colleges, universities and other partners are required to comply with the vaccination policies of those external organizations to complete their work. Of note, vaccination policies are subject to change. The requirement to comply with those evolving policies does not change.\n  \n  We thank you for your interest in this position, however; only those chosen for an interview will be contacted.\n  \n  All Bruyère employees are required to provide proof of full vaccination as per our Enhanced COVID-19 Immunization policy. Extra Information:\n  \n  \n  \n \n \n  \n   \n    We are processing your submission.\n     \n    Please do not press back or refresh."
    },
    {
        "id": "224a96241aa8d177",
        "company": "Bruyère Continuing Care",
        "positionName": "Research Associate I",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-13T06:50:20.033Z",
        "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0Az2iNjeEfHXNwE0SzwhSkmDNQI8i9Vjon05RnpHnjhnTRb7LUcI3252DSCathDV_mYJh-z1DkuVxKYYx2qaWvNijvvD4BTtGg7Hv9QV1VNrTJt92ntVYzSfRcFQpILgn74CRlRgGyTSgFjKph2_XbxRDcowM2ohFbih0avYY__qPfE_BrLC3bi1zrsKVGvB0SmnpkCx5vWxQafhEDf7Om7dhRlyBMabx2MXKamLTGGQmttqCeeNMxYt6Z3-Fn3Um_hY6RnQqnBBN75l1RYmlYKWTCNDB9iyMLrjBOw-A7xzxAvFhq8EWxSWKxQyuGUCXg1MrhTcMDxjemABCxLgTboBS5R-m-Tb5GwQOmChH6WTk86MlXiRh3uATK0bpR8fC1HU2Boiq1NvofczWIyW9FzGI_Rko0ntHQYbiOJZS5D_MIkYF3mnK3Kwgz-rf3OTSMQvVFq6sppEujeW2Iw3pgwBzutQV7JJIW23eebgCie130TVrPfILpE2cvt8n8y5xbeq0_whQhjG0w92pr1-acVUluQcBHMJDH6vvoMsjSr3DcGyuRaZgJe&xkcb=SoCt-_M3Ki2Sg5xiMx0LbzkdCdPP&p=0&fvj=0&vjs=3&jsa=5150&tk=1hb2v7amek25r800&from=jasx&wvign=1",
        "externalApplyLink": "https://www.bruyere.org/en/hr?job=17997",
        "companyDescription": "",
        "description": "The Bruyère Research Institute partners with Bruyère Continuing Care, the University of Ottawa and other stakeholders to conduct relevant and practical health sciences research related to medical education and improving the quality of life for the aging population and people requiring continuing care.\n  \n  \n  \n  \n Function Summary We are a research team led by Dr. Daniel Kobewka, who is an investigator at the Bruyère Research Institute (BRI) and is a clinical scientist at The Ottawa Hospital Research Institute (OHRI). Our team focuses on building evidence that informs care planning and shared decision-making, for older patients and those at the end of life.\n  \n  Our research team is focused on improving communication and decision making for people with serious illness and for those nearing the end of their lives. During serious illness treatments to prolong life may not work in some cases cause harm by increasing discomfort or prolonging suffering. For people with serious illness open communication about their goals and wishes is critical. Unfortunately, when communication does not happen, treatments that are inconsistent with their goals may be administered. Serious illness care needs to be informed by what matters most to the person and by realistic prognoses for the outcomes that matter most to people. Our lab works to create values clarification tools and prognostic models to inform serious illness decision making. Join us in this important work.\n  \n  We are looking for an experienced and motivated Research Associate to join our research team. This role participates in the conceptualization and development of the ongoing and future programs of research and team growth by contributing to all aspects of the research design, analysis and dissemination. These activities include coaching and mentorship of team members and collaborators, the development of research objectives, grant development, maintaining data integrity, and strong methodological contributions to planning and executing both qualitative/quantitative analyses.\n  \n  \n  \n  \n Main duties and responsibilities\n \n   Undertake and contribute to health research projects of varying complexity applying appropriate quantitative and/or qualitative research methods (e.g., literature reviews, interviews, surveys, and statistical models)\n   Produce high quality, well written research reports, data analysis plans, executive summaries, blogs, data visualizations, and proposals\n   Interpret data results with ease and clarity into key messages and visualizations for a range of audiences\n   Plan and write grant proposals – this includes but is not limited to budget planning, literature review, administrative grant tasks, collaborator meetings, updates, or requests for specific feedback\n   Plan budget for individual projects and programs of research – reviewing current budgets and estimating the required funds overtime\n   Maintain up-to-date administrative records of institutional research ethics and ICES privacy documentation for each ongoing and completed project\n   Support team cohesion and growth, which includes providing mentorship to team members to improve their skills, knowledge, independence, confidence, and/or provide experience in a new area\n   Manage the project – this may include both leading projects and coaching other project leads (e.g., collaborating clinical expert, junior team member, student, etc.) in planning a project (typically a manuscript within a series of projects) and helping ensure each step is executed according to timelines, budget, and research standards\n   Communicate effectively with team members, clinical collaborators, colleagues, research advisors, patient partners, and external stakeholders\n   Provide logistical support for research-related tasks – this may include scheduling, hosting, attending regular meetings, as well as ongoing administrative and collaborator correspondence\n   Communicate and coordinate with Research Institutes’ Finance and HR teams as it pertains to team management (namely for budgeting, staff hiring, and onboarding)\n   Develop and maintain systems to track progress of research projects and stakeholder outreach\n   Additional duties may be added as projects progress\n \n  Required Qualifications and competencies\n \n   Graduate degree (MSc or PhD) in biostatistics, epidemiology, or equivalent\n   Minimum four (4) years’ experience in clinical or health services research, including leading or managing multi-year studies\n   Demonstrated training and experience in quantitative study design and methodology \n  Experience in study or project management in an academic research environment \n  Experience with peer-mentorship or mentorship of research students and/or staff \n  Exceptional writing skills and ability to communicate effectively across a variety of audiences\n   Proven expertise leading research studies (e.g., peer-reviewed publications or other research products)\n   Demonstrated expertise with advanced data analysis techniques\n   Knowledge of computer software packages including Microsoft Word, Excel, PowerPoint\n   Ability to work independently and collaboratively\n   Strong organizational and interpersonal skills\n   Ability to set priorities, deliver high quality products and meet deadlines\n   Excellent communication skills, written and oral, in English\n   Fluent in French and English, an asset\n \n  Preferred Competencies\n \n   Experience with ICES data, either internally (analyst or student) or as collaborating researcher or research staff\n   Experience writing grants and peer-reviewed publications\n   Experience in designing studies, conducting statistical analyses (i.e., R-Programming, SAS, STATA, etc.) and interpreting the results\n   Proactive approach to study planning, with an understanding of the research lifecycle for both health services and clinical research projects\n   Experience in the following areas is an asset: predictive modelling, systematic reviews, clinical decision-making, older adult populations, end-of-life or long-term care research\n \n \n   If you are interested in this opportunity, please submit your cover letter and resume to\n \n \n   BRI-HR@bruyere.org\n \n \n   Attention Human Resources with subject line “Research Associate I – Dr. Kobewka”,\n \n \n   no later than October 6, 2023.\n \n \n   Please note that incomplete applications may not be reviewed.\n \n  Bruyère Research Institute is an equal opportunity employer and values diversity in its workplace. All qualified applicants will receive consideration for employment based on skills and experience as outlined in your CV and cover letter.\n  \n  Bruyère Research Institute is committed to developing inclusive, barrier-free selection processes and work environments. If contacted regarding this competition, please advise of the accommodation measures which may be required to enable you to be assessed in a fair and equitable manner.\n  \n  All researchers, employees and students of the Bruyère Research Institute who will work with long-term care homes, colleges, universities and other partners are required to comply with the vaccination policies of those external organizations to complete their work. Of note, vaccination policies are subject to change. The requirement to comply with those evolving policies does not change.\n  \n  We thank you for your interest in this position, however; only those chosen for an interview will be contacted.\n  \n  All Bruyère employees are required to provide proof of full vaccination as per our Enhanced COVID-19 Immunization policy. Extra Information:\n  \n  \n  \n \n \n  \n   \n    We are processing your submission.\n     \n    Please do not press back or refresh."
    },
    {
        "id": "224a96241aa8d177",
        "company": "Bruyère Continuing Care",
        "positionName": "Research Associate I",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-13T06:50:20.885Z",
        "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0Az2iNjeEfHXNwE0SzwhSkmDNQI8i9Vjon05RnpHnjhnTRb7LUcI3252DSCathDV_mYJh-z1DkuVxKYYx2qaWvNijvvD4BTtGg7Hv9QV1VNrTJt92ntVYzSfRcFQpILgn74CRlRgGyTSgFjKph2_XbxRDcowM2ohFYS6-sZcx_qPZzpg6UNKhtD_jIXEv0mU30YzVJyWWwCLh3FgVB4NST_pOZNnks_FASn_RZWhefB5BHIFVqpDZg-KqHRAwBY7BdKZyHueqINyhUZkO3dNE1rSYFzvuLLxDe7CSXbW5YPVloi6YaDrbqWN_CroLL4Ptp0o3VbZvBbWgshcDNIswY7udEebwRpYznx1v90M5oMeFQjMRi40b9O8MNHG2AVPzKQFZ8ftOWAAUr_qmOikw-Oo5eFapMq7Qvzov4-3g5S2UmVqqJV-wLNXnDiml92UpwN5kmBscEoRTUtfCFTFA0ld9k5t4hsZfGtSVZa1a-8V_VfStroruAK6Zqngtg0mTFNvb9CeIOBo_mK4iFXg4YLzwZwp0ZjRQb18xpRyeSgBr9nv8mb9vM3&xkcb=SoB3-_M3Ki2RxaS2IJ0LbzkdCdPP&p=0&fvj=0&vjs=3&jsa=1500&tk=1hb2v7gsrk60m800&from=jasx&wvign=1",
        "externalApplyLink": "https://www.bruyere.org/en/hr?job=17997",
        "companyDescription": "",
        "description": "The Bruyère Research Institute partners with Bruyère Continuing Care, the University of Ottawa and other stakeholders to conduct relevant and practical health sciences research related to medical education and improving the quality of life for the aging population and people requiring continuing care.\n  \n  \n  \n  \n Function Summary We are a research team led by Dr. Daniel Kobewka, who is an investigator at the Bruyère Research Institute (BRI) and is a clinical scientist at The Ottawa Hospital Research Institute (OHRI). Our team focuses on building evidence that informs care planning and shared decision-making, for older patients and those at the end of life.\n  \n  Our research team is focused on improving communication and decision making for people with serious illness and for those nearing the end of their lives. During serious illness treatments to prolong life may not work in some cases cause harm by increasing discomfort or prolonging suffering. For people with serious illness open communication about their goals and wishes is critical. Unfortunately, when communication does not happen, treatments that are inconsistent with their goals may be administered. Serious illness care needs to be informed by what matters most to the person and by realistic prognoses for the outcomes that matter most to people. Our lab works to create values clarification tools and prognostic models to inform serious illness decision making. Join us in this important work.\n  \n  We are looking for an experienced and motivated Research Associate to join our research team. This role participates in the conceptualization and development of the ongoing and future programs of research and team growth by contributing to all aspects of the research design, analysis and dissemination. These activities include coaching and mentorship of team members and collaborators, the development of research objectives, grant development, maintaining data integrity, and strong methodological contributions to planning and executing both qualitative/quantitative analyses.\n  \n  \n  \n  \n Main duties and responsibilities\n \n   Undertake and contribute to health research projects of varying complexity applying appropriate quantitative and/or qualitative research methods (e.g., literature reviews, interviews, surveys, and statistical models)\n   Produce high quality, well written research reports, data analysis plans, executive summaries, blogs, data visualizations, and proposals\n   Interpret data results with ease and clarity into key messages and visualizations for a range of audiences\n   Plan and write grant proposals – this includes but is not limited to budget planning, literature review, administrative grant tasks, collaborator meetings, updates, or requests for specific feedback\n   Plan budget for individual projects and programs of research – reviewing current budgets and estimating the required funds overtime\n   Maintain up-to-date administrative records of institutional research ethics and ICES privacy documentation for each ongoing and completed project\n   Support team cohesion and growth, which includes providing mentorship to team members to improve their skills, knowledge, independence, confidence, and/or provide experience in a new area\n   Manage the project – this may include both leading projects and coaching other project leads (e.g., collaborating clinical expert, junior team member, student, etc.) in planning a project (typically a manuscript within a series of projects) and helping ensure each step is executed according to timelines, budget, and research standards\n   Communicate effectively with team members, clinical collaborators, colleagues, research advisors, patient partners, and external stakeholders\n   Provide logistical support for research-related tasks – this may include scheduling, hosting, attending regular meetings, as well as ongoing administrative and collaborator correspondence\n   Communicate and coordinate with Research Institutes’ Finance and HR teams as it pertains to team management (namely for budgeting, staff hiring, and onboarding)\n   Develop and maintain systems to track progress of research projects and stakeholder outreach\n   Additional duties may be added as projects progress\n \n  Required Qualifications and competencies\n \n   Graduate degree (MSc or PhD) in biostatistics, epidemiology, or equivalent\n   Minimum four (4) years’ experience in clinical or health services research, including leading or managing multi-year studies\n   Demonstrated training and experience in quantitative study design and methodology \n  Experience in study or project management in an academic research environment \n  Experience with peer-mentorship or mentorship of research students and/or staff \n  Exceptional writing skills and ability to communicate effectively across a variety of audiences\n   Proven expertise leading research studies (e.g., peer-reviewed publications or other research products)\n   Demonstrated expertise with advanced data analysis techniques\n   Knowledge of computer software packages including Microsoft Word, Excel, PowerPoint\n   Ability to work independently and collaboratively\n   Strong organizational and interpersonal skills\n   Ability to set priorities, deliver high quality products and meet deadlines\n   Excellent communication skills, written and oral, in English\n   Fluent in French and English, an asset\n \n  Preferred Competencies\n \n   Experience with ICES data, either internally (analyst or student) or as collaborating researcher or research staff\n   Experience writing grants and peer-reviewed publications\n   Experience in designing studies, conducting statistical analyses (i.e., R-Programming, SAS, STATA, etc.) and interpreting the results\n   Proactive approach to study planning, with an understanding of the research lifecycle for both health services and clinical research projects\n   Experience in the following areas is an asset: predictive modelling, systematic reviews, clinical decision-making, older adult populations, end-of-life or long-term care research\n \n \n   If you are interested in this opportunity, please submit your cover letter and resume to\n \n \n   BRI-HR@bruyere.org\n \n \n   Attention Human Resources with subject line “Research Associate I – Dr. Kobewka”,\n \n \n   no later than October 6, 2023.\n \n \n   Please note that incomplete applications may not be reviewed.\n \n  Bruyère Research Institute is an equal opportunity employer and values diversity in its workplace. All qualified applicants will receive consideration for employment based on skills and experience as outlined in your CV and cover letter.\n  \n  Bruyère Research Institute is committed to developing inclusive, barrier-free selection processes and work environments. If contacted regarding this competition, please advise of the accommodation measures which may be required to enable you to be assessed in a fair and equitable manner.\n  \n  All researchers, employees and students of the Bruyère Research Institute who will work with long-term care homes, colleges, universities and other partners are required to comply with the vaccination policies of those external organizations to complete their work. Of note, vaccination policies are subject to change. The requirement to comply with those evolving policies does not change.\n  \n  We thank you for your interest in this position, however; only those chosen for an interview will be contacted.\n  \n  All Bruyère employees are required to provide proof of full vaccination as per our Enhanced COVID-19 Immunization policy. Extra Information:\n  \n  \n  \n \n \n  \n   \n    We are processing your submission.\n     \n    Please do not press back or refresh."
    },
    {
        "id": "c3cfea6171664649",
        "company": "Confidential",
        "positionName": "Dental Lab Technician",
        "jobType": [],
        "location": "Ontario",
        "salary": null,
        "postingDateParsed": "2023-09-22T06:50:35.399Z",
        "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0BqBwC9zhQ4wj-eEYdIklIKK0RDQH8s-cuwx56NAi5Jmivx-8G4AnHoDC8FDkGhZ1hlS2hwVp2O-r1U-5eL5vY1rMAyzyC8ndTDC6Ibk_CkWG5SYLfUh5kA7l_k26h5CjjglGoJf3BWmZ2DxSdximEOW0DQ11IsljDlLurx1X3kcsTwCM7X7KhByZZu48RJXSX95VhgcAL7Dh4YJg2kuiK8vy9PB4QdRZH9dXvqze1O3tW4k1cjmfFwy-kBxZwSrej9xQ_5HuloNYSitTHFrD_CKYif1gQk9SN1S6aFzSB3aj3XifwWwYPnPkmG6V73Dragv_SYImWMHP6e3opJuXAsH92t09uYKqiTeb3s8cDU8OOGChmE8uOJtX37h3qUbyHBMumC3AI8J3M3m9w8dAcVEptZg9c-eQhoFEkWzGnFORkYd6Sw2LEH7epqnZAPJ7Q34krmOC0iNY0K_LYmO56Eo7E2migGSOiuf4dSSkXXcjLgiF9LWtYUR-yo13yXOOw_m555WQeIZb3LOfWS_NP1uUnHticp1Ccg6dwTFQzjhmPIF9ZVdRNfEBy01RTTWPc%3D&xkcb=SoBy-_M3Ki2d9GAJGj0PbzkdCdPP&p=4&fvj=1&vjs=3&jsa=3714&tk=1hb2v4hd2is3q800&from=jasx&wvign=1",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "Are you detail oriented and have a passion for crafting a high-quality dental prosthetics. Our renowned practice, with over 20 years in the community is looking for a talented Dental Lab Technician, who can work closely with our team of highly trained doctors. The ideal candidate will have 2-3 years experience in a dental laboratory, have expertise in dentures, implants and implant denture, and digital design.\nDuties & Responsibilities:\n\n Scan, design, and mill crowns & implant abutments.\n Operate and maintain various dental milling machines and 3D printers.\n Previous experience in plaster and model work is an asset.\n Computer skills and hardware troubleshooting.\n Design, fabricate or repair dental devices.\n Attention to details and good communication skills.\n Quality control\n Education: College, CEGEP or other non-university certificate or diploma from a program of 1 year to 2 years\n Experience: 3-5 years or more\n\nRequirements:\n· Certified Dental Lab Technician\n· Strong communication skills, time management, and case planning\n· Proficient in fabricating implant dentures from start to finish\n· A vast knowledge of dental anatomy, occlusion and the materials utilized in fabrication\nWe Offer:\n· 30-40 hr work week\n· Extended Health Benefits\n· Competitive salary\n· A collaborative work environment\nJob Types: Full-time, Part-time, PermanentPart-time hours: 30-40 per week\nBenefits:\n\n Dental care\n Paid time off\n\nSchedule:\n\n Monday to Friday\n\nAbility to commute/relocate:\n\n Ontario: reliably commute or plan to relocate before starting work (required)\n\nExperience:\n\n dental technician: 3 years (required)\n\nWork Location: In person"
    },
    {
        "id": "1c12d1cc372a8a07",
        "company": "NOKIA",
        "positionName": "Verizon Lab Support Co-op/Intern",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-08-25T06:50:34.132Z",
        "url": "https://www.indeed.ca/rc/clk?jk=1c12d1cc372a8a07&from=jasx&tk=1hb2v8b7g2ap3005&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=1c12d1cc372a8a07&atk=&xpse=SoAF67I3Ki2t7i2bVh0LbzkdCdPP",
        "companyDescription": "",
        "description": "Come create the technology that helps the world act together \n   \n     We are a B2B technology innovation leader pioneering the future where networks meet cloud.\n     \n     At Nokia you will have a positive impact on people’s lives and help build the capabilities needed for a more productive, sustainable, and accessible world.\n     \n     Be part of a culture built on an inclusive way of working where we are open to your ideas, you are empowered to take risks and are encouraged to be fearless in bringing your authentic self to work.\n    \n  \n  \n   Network Infrastructure \n    \n   \n    The pandemic has highlighted how important telecoms networks are to society. Nokia’s Network Infrastructure group is at the heart of a revolution to bring more and faster network capacity to people worldwide through our ambition, innovation, and technical expertise.\n    \n  \n  \n   The team you will be a part of \n   \n     The IP Networks Business Division provides a co-op student with the opportunity to learn and gain hands-on experience on the most advanced technologies that build the world's most critical networks. The Mobile Solutions Lab is a highly specialized group working directly with Nokia's Tier 1 customers to help them design and test their IP backhaul networks.\n     \n     Position: Verizon Lab Support Co-op/Intern\n     Duration: 4 Months\n     Date: January 8th to April 26th, 2024\n     Location: Hybrid in Ottawa, Canada\n    \n  \n  \n   What you will learn and contribute to \n   \n     As part of the team, you will: \n    \n     Write Python code to automate network testing \n     Build new servers and Virtual Machines using EXSi and Linux KVM hypervisors \n     Collaborate on network design projects \n    \n   \n  \n  \n   Your skills and experience\n   \n     \n     \n    Education Recommendations:\n     \n     Currently a candidate for a bachelor’s degree or diploma in Computer Science, Computer Systems Engineering or a related field with an accredited school in Canada.\n     \n     You have : \n    \n     Python / scripting knowledge \n     Knowledge of IP networking \n     Experience with server setup \n    \n   \n  \n  \n   What we offer \n   \n     Nokia offers flexible and hybrid working schemes, continuous learning opportunities, well-being programs to support you mentally and physically, opportunities to join and get supported by employee resource groups, mentoring programs and highly diverse teams with an inclusive culture where people thrive and are empowered.\n    \n  \n  \n   \n    \n     Company Culture: We believe our people are our greatest asset, and we aim to foster a fun, challenging, positive, and inclusive work environment. We offer 1-on-1 mentorship, learning and development opportunities, global impact and interaction, and flexible work/life balance. \n     Meaningful Co-op Term: During your co-op term, you will have the opportunity to test the latest technologies and work on innovative projects that could leave a global impact. You get to use skills learned in the classroom and apply them to real-world situations while gaining professional hands-on experience. \n    \n   \n  \n  \n   Nokia is committed to inclusion and is an equal opportunity employer\n   \n     \n     Nokia has received the following recognitions for its commitment to inclusion & equality: \n    \n     One of the World’s Most Ethical Companies by Ethisphere \n     Gender-Equality Index by Bloomberg \n     Workplace Pride Global Benchmark\n    \n     \n     \n     At Nokia, we act inclusively and respect the uniqueness of people.\n     \n     Nokia’s employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law.\n     \n     We are committed to a culture of inclusion built upon our core value of respect.\n     \n     Join us and be part of a company where you will feel included and empowered to succeed."
    },
    {
        "id": "0dfb0cb6ca7d7821",
        "company": "Quadra",
        "positionName": "Regulatory Affairs Manager",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-08-25T06:50:38.546Z",
        "url": "https://www.indeed.ca/rc/clk?jk=0dfb0cb6ca7d7821&from=jasx&tk=1hb2v8b7g2ap3005&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=0dfb0cb6ca7d7821&atk=&xpse=SoBt67I3Ki2tAKWR3p0LbzkdCdPP",
        "companyDescription": "",
        "description": "Position: Regulatory Affairs Manager \n\nLocation: Based out of Burlington, Ontario or Vaudreuil-Dorion, Quebec (Hybrid / Flexibility Policy) \n\nStatus: Permanent, full-time \n\n We are seeking a Regulatory Affairs Manager to join our Regulatory Affairs Team that spans our Canadian and US portfolio. The ideal candidate will have experience industrial chemical industry. Reporting to the Director, Compliance Assurance, the Regulatory Affairs Manager plays a key role in expanding Quadra’s portfolio of products in Canada and in the United-States. This person will be responsible for managing the activities of his or her team while leading the new products screening procedures in order to meet our effective compliance program. \n\n As a strong regulatory manager, you will bring your comprehensive knowledge of regulatory compliance, meticulous attention to detail, and strong analytical skills to ensure our organization's adherence to regulatory requirements. In this role, you will have the opportunity to lead and inspire a talented team, fostering a culture of excellence and driving successful outcomes. By joining our team as a Regulatory Affairs Manager, you will be instrumental in shaping the future of our organization and making a positive difference for our valued clients. \n\n About your future team \nAt Quadra, we put people first so that together, we can reimagine the possibilities. \nBased in Burlington, Ontario or Vaudreuil-Dorion, Quebec, our modern head office is home to over a hundred fun-loving professionals. Of course, you can always take advantage of our hybrid telecommuting policy. Founded over 45 years ago, Quadra is dedicated to its 550+ employees located in Canada and the United States. Quadra Chemicals is one of the largest distributors of chemicals and ingredients in the Canadian marketplace. With multiple facilities across Canada, we are committed to delivering excellence in everything we do. We are a rapidly growing company with a long-term commitment to our employees. If you are committed to excellence, you belong at Quadra. At Quadra, we have created an environment where people are a priority and opportunities are growing. Our culture based on our core values of entrepreneurship, innovation and caring make us an employer of choice. \n\n We believe in fostering a work environment that challenges and empowers individuals, providing ample opportunities for personal growth and development. We recognize and celebrate outstanding performance, ensuring that your dedication and achievements are duly acknowledged. \n\n What will you bring to the team? \n\n \n A strong technical knowledge of pertinent government regulations and associated compliance requirements as well as insight in determining compliance pathways for new business areas developed by the company \n Being an active member with industry associations, including, but not limited to, participation on the Responsible Distribution Canada’s and NACD \n Excels in managing priorities, is resourceful and a relationship-builder \n Being known as a positive leader that works well with cross-functional teams (QA, Sales, Operations, etc.) \n Being acknowledged by peers as an expert in order to respond to external requests related to regulatory affairs \n Excellent communicator, focused on customer service, curious and eager to achieve excellence for his/her team \n Strong attention to detail, accuracy and precision \n A passion for the industry with a desire to share with your peers \n \nYou would be responsible for:\nTeam Management:\n \n \n Leading day-to-day Regulatory Affairs compliance activity regarding pertinent chemical, food and pharmaceutical regulations as they apply to the Canadian and US chemical distribution industry sector \n Leading department workflow to ensure a structured approach to compliance activity \n Ensuring that regulatory compliance activity meets all government requirements, and that department output is meeting Quadra’s commercial needs for efficient integration of compliance oversight in business operations \n Supervision of team members; establish departmental goals, action plans and strategies as well as mentoring/coaching, managing performance, hiring, onboarding, etc. \n Work in collaboration with the Director, Compliance Assurance to establish department goals and objectives \n New Product Regulatory Evaluation and Set-Up, Ongoing Regulation Compliance: \n\n \n Development and implementation of efficient Regulatory Affairs procedures to determine the CEPA/TSCA status of all new products and the identity of product ingredients \n Mentoring the Regulatory Affairs team regarding CEPA new substance screening activities \n Managing new product screening procedures that encompass compliance with many other product use regulations which reflect the wide diversity of industry sectors served: Food & Drugs Act and associated regulations, Transportation of Dangerous Goods Regulations, Drug Precursor Regulations, Explosive Regulations, WHMIS/GHS and additional Quadra internal requirements such as product High Risk classification \n Management of new product set-up workflow to facilitate a robust and efficient compliance program \n Product Registration Activity: Preparation and submission of pertinent product use approval submissions (i.e. NSN, fertilizers, animal feeds, pesticides, biocides, Food & Drug related use approvals, etc.) \n Management of regulation compliance (for existing regulations) to include procedure revisions when regulations are updated \n CEPA and TSCA Substances Management \n\n \n Monitoring of Canada Gazette and other industry association resources to identify government mandated reporting activities associated with chemical product importation and sales \n Supervising Quadra Significant New Activity Canada (SNAC) and Significant New Use (SNAN) submission activities \n Product Safety – WHMIS 2015 and US GHS Compliance \n\n \n Ensuring software resources are kept current and operating at full efficiency \n Management of product safety workflow to facilitate priority requirements \n Communicating with Quadra employees to ensure their awareness of system tools, including training requirements regarding the WHMIS 2015 and US GHS hazard communication system \n Assist in the preparation and presentation of ad hoc and routine department and management reports including compiling Chemical Data Reports (CDR) \n How will you be successful in this Regulatory Affairs Manager role? \n\n \n Possessing a master’s degree in strategic management, business administration or a Graduate certificate in Regulatory Affairs would be considered as an asset \n Bachelor's degree in Chemistry, Life Sciences, or any related field to science industry \n Minimum of 10-12 years of experience as a Regulatory Affairs Manager, Regulatory Affairs Supervisor, or other experience in the field of expertise with at least 8 years in the pharmaceutical, food ingredients or chemical industry (manufacturing or distribution) \n Thorough knowledge of regulatory affairs requirements for chemical industrial, energy and/or mining \n Proven experience in team management/leadership including performance management, recruitment, coaching and mentoring \n Strong knowledge of the Canadian Environmental Protection Act (CEPA) and the Toxic Substances Control Act (TSCA) \n Strong knowledge of Environment Canada’s new and existing substance programs and their various initiatives (Chemical Management Plan, Section 71 mandatory surveys, voluntary surveys, DSL updates, etc.) and required compliance requirements \n Knowledge of WHMIS 2015 regulations the associated classification criteria and system elements including WHMIS ingredient trade secret submissions \n Advanced knowledge of Canadian and US federal and provincial requirements \n Excellent oral and written communication skills, primarily in English. Bilingualism (French and English) will be mandatory to work from our Vaudreuil Office \n Advanced experience with the Office Suite as well as hands-on practical experience with Salesforce would be an asset \n Open to travel between Burlington and Vaudreuil if needed (Limited travel, less than 10%) \n At Quadra, we offer not only an engaging culture, a collaborative, family-oriented and supportive environment, but also plenty of autonomy and flexibility. We also offer you the opportunity to be part of a professional, fun, innovative and committed team in a growing, people-oriented, Great Place to Work® certified organization. In addition to being Great Place to Work® certified, Quadra has been recognized as one of the Best Managed Companies for over 20 years and as a Great Place to Work for Women®! You will work with dynamic colleagues who are eager to share their knowledge with you. \n\n Benefits for choosing Quadra? \n\n \n Enjoy a permanent full-time position with stability \n Benefit from a competitive salary and an enticing performance incentive program \n Receive excellent benefits coverage (dental, medical, and much more!) \n Programs offered to employees to improve their quality of life (Wellness Portfolio) \n Virtual care/telemedicine for you and your loved ones; 24/7 access to a physician \n Virtual wellness and mental health programs with a global healthcare leader \n Retirement plan with a match and several long-term investment programs \n Take advantage of personal, & flexible days as well as vacation time \n Telecommuting and flexibility within the organization \n Experience a great work environment every day where caring for each other and having fun are integral to our core values \n Be part of a company that promotes diversity, equity, and inclusion \n Digital environment \n Customized training built for you \n Opportunities for advancement and professional development; a growing company that focuses on its people! \n Participate in various internal and external trainings \n Possibility of joining various company committees \n Engage in social activities organized by the company \n Employee recognition program (years of service, merit awards, etc.) \n Private and family-owned company with a solid infrastructure \n Employee assistance program (EAP) \n Monthly cell phone & internet allowance \n And much more! \n If you are ready to unlock your potential, make a meaningful impact, and embark on a rewarding career in Regulatory Affairs, we warmly invite you to submit your resume, highlighting your experience and enthusiasm for this field. Let us join forces to redefine excellence in customer service, shaping a brighter future for Quadra and our esteemed clients. \n\n Quadra supports and values diversity and offer equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status and gender identity. Quadra also welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process. We recognize that some people do not identify themselves as either male or female. Therefore, whenever possible, we have opted for a gender-neutral (or gender-neutral) wording in a non-discriminatory spirit."
    },
    {
        "id": "64d415217bee2073",
        "company": "NOKIA",
        "positionName": "Lab Tech Co-op/Intern",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-08-25T06:50:38.406Z",
        "url": "https://www.indeed.ca/rc/clk?jk=64d415217bee2073&from=jasx&tk=1hb2v8d3bk7pl800&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=64d415217bee2073&atk=&xpse=SoD667I3Ki2tArSdVh0LbzkdCdPP",
        "companyDescription": "",
        "description": "Lab Tech Co-op/Intern\n  \n  \n  Come create the technology that helps the world act together\n  \n  \n  We are a B2B technology innovation leader pioneering the future where networks meet cloud. \n  At Nokia you will have a positive impact on people's lives and help build the capabilities needed for a more productive, sustainable, and accessible world. \n  Be part of a culture built on an inclusive way of working where we are open to your ideas, you are empowered to take risks and are encouraged to be fearless in bringing your authentic self to work.\n  \n  \n  Network Infrastructure\n  \n  \n  The pandemic has highlighted how important telecoms networks are to society. Nokia's Network Infrastructure group is at the heart of a revolution to bring more and faster network capacity to people worldwide through our ambition, innovation, and technical expertise.\n  \n  \n  The team you will be a part of\n  \n  \n  You will work in a large Research and Development lab as part of a lab tech team. You will work closely with Hardware, Software and Test team members to maintain the equipment in the lab.\n  \n  \n  Position: Lab Tech Co-op / Intern Duration: 4 months Date: January 8th, 2024 to April 26th, 2024 Location: Onsite (Ottawa, Canada)\n  \n  \n  What you will learn and contribute to\n  \n  \n  As part of the team, you will: \n  \n  General Lab Support Searching for cards, test equipment setups, cables, etc. Required by HW, SW, Test and Customer Support team members \n  Moves, Adds and Changes \n  Setting up PCs, workstations or new equipment that is moving from one area to another \n  Equipment support, repair, and set up third-party test and measurement equipment \n  Calibration support\n \n  \n  \n  Your skills and experience\n  \n  \n  Education Recommendations \n  Currently a candidate for Bachelor's degree or diploma in Computer Systems, Computer Engineering, Electrical Engineering, or a related field with an accredited school in Canada.\n  \n  \n  You have : \n  \n  Computer skills \n  Interpersonal and Communication skills \n  General understanding of Telecom products\n \n  \n  \n  What we offer\n  \n  \n  Nokia offers flexible and hybrid working schemes, continuous learning opportunities, well-being programs to support you mentally and physically, opportunities to join and get supported by employee resource groups, mentoring programs and highly diverse teams with an inclusive culture where people thrive and are empowered. \n  \n  Company Culture: We believe our people are our greatest asset, and we aim to foster a fun, challenging, positive, and inclusive work environment. We offer 1-on-1 mentorship, learning and development opportunities, global impact and interaction, and flexible work/life balance. \n  Meaningful Co-op Term: During your work term, you will have the opportunity to test the latest technologies and work on innovative projects that could leave a global impact. You get to use skills learned in the classroom and apply them to real-world situations while gaining professional hands-on experience.\n \n  \n  \n  Nokia is committed to inclusion and is an equal opportunity employer\n  \n  \n  Nokia has received the following recognitions for its commitment to inclusion & equality: \n  One of the World's Most Ethical Companies by Ethisphere \n  Gender-Equality Index by Bloomberg \n  Workplace Pride Global Benchmark \n  At Nokia, we act inclusively and respect the uniqueness of people. \n  Nokia's employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law. \n  We are committed to a culture of inclusion built upon our core value of respect. \n  Join us and be part of a company where you will feel included and empowered to succeed."
    },
    {
        "id": "201e0d7fd70573d5",
        "company": "LifeLabs",
        "positionName": "Lab Patient Technician - Temporary Part-Time",
        "jobType": [],
        "location": "Nepean, ON",
        "salary": null,
        "postingDateParsed": "2023-08-25T06:50:41.133Z",
        "url": "https://www.indeed.ca/rc/clk?jk=201e0d7fd70573d5&from=jasx&tk=1hb2v8d3bk7pl800&vjs=3",
        "externalApplyLink": "https://jobs.lifelabs.com/job/Nepean-Lab-Patient-Technician-Temporary-Part-Time-Ottawa%2C-ON-ON/1068397700/?feedId=281500&utm_source=Indeed&utm_campaign=LifeLabs_Indeed&jobPipeline=Indeed",
        "companyDescription": "",
        "description": "Improve lives. Love your job. Grow your career.\n \n  Do you want to help improve patients’ healthcare outcomes? Now you can. LifeLabs Medical Laboratory Services is a proud Canadian company with over 50 years’ experience. We provide laboratory testing services that help healthcare providers diagnose, treat, monitor, and prevent disease in patients.\n \n  LifeLabs is currently looking for a Lab Patient Technician to join our team in Ottawa, ON.\n \n  As a Lab Patient Technician, you will be responsible for the specimen collection process, from greeting patients through to preparation of specimens for transportation. This is an important role in patient care and our business and will let you see the difference that you make in patients’ lives.\n \n  This is a Temporary Part-Time role till March 1, 2025.\n \n  In this role you will:\n \n   Greet and request required information from patients, explain the specimen collection process, and ensure patients have followed necessary test protocol prior to specimen collection.\n   Perform phlebotomies, connect/disconnect Holter monitors, and perform ECG tracings.\n   Perform special test collections, such as medical/legal drug screens, paternity tests, and clinical trials, and complete related documentation.\n   Maintain client relationships, including responding to inquiries and following up on requests.\n   Complete data entry of required patient demographics, requisition information, and other information related to processing test results.\n   Prepare specimens for transportation and testing.\n \n \n  The right person for this role will be focused on great customer/patient service and be able to relate to patients and clients even in stressful situations. Some key qualities include empathy, flexibility, adaptability to change, and problem-solving skills. Other requirements include:\n \n   Graduate of an approved Laboratory Assistant program or equivalent.\n   Phlebotomy experience.\n   Excellent communication skills.\n   Good computer skills with a minimum typing speed of 40 wpm.\n   Ability to maintain the strictest standards of patient privacy and confidentiality.\n \n \n  We are looking for passionate individuals who share in the importance of our values: Caring, Customer Driven, Agile and One Team and can live these values with us every day.\n \n  Ready to make a difference? Apply today.\n \n  At LifeLabs, we strive to create an inclusive and equitable workplace where our team members and the communities we serve feel accepted, valued, and respected.\n  In accordance with LifeLabs’ Accessibility Policy, the Accessibility for Ontarians with Disabilities Act, and the Ontario Human Rights Code, accommodations are available by request for candidates taking part in all aspects of the recruitment and selection process. For a confidential inquiry or to request an accommodation, please contact your recruiter or email careers@lifelabs.com.\n  \n LifeLabs is committed to providing a safe environment for our employees, customers, and the communities we serve. We have been a leader throughout the COVID-19 pandemic regarding health and safety measures and have always put our employees and customers at the center of every decision that we make. As an organization in the health care sector, we believe the COVID vaccination adds a layer of protection that complements the extensive and necessary health and safety protocols that we have taken to date. With this in mind, we currently require all LifeLabs employees, contractors, students and volunteers to be fully vaccinated. \n LifeLabs operates under a distributed workforce model, where employee flexibility is a key priority. Further information will be provided during the interview process on what this means for employees."
    },
    {
        "id": "7e0af9d9dca9e1ed",
        "company": "Eurofins Canada Environment Testing",
        "positionName": "Laboratory Technician _Organics _ Eurofins Environment Testing",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-08-25T06:50:40.837Z",
        "url": "https://www.indeed.ca/rc/clk?jk=7e0af9d9dca9e1ed&from=jasx&tk=1hb2v8b7g2ap3005&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=7e0af9d9dca9e1ed&atk=&xpse=SoBf67I3Ki2syqQSJJ0LbzkdCdPP",
        "companyDescription": "",
        "description": "Company Description\n  Eurofins Scientific is an international life sciences company, providing a unique range of analytical testing services to clients across multiple industries, to make life and our environment safer, healthier and more sustainable. From the food you eat, to the water you drink, to the medicines you rely on, Eurofins works with the biggest companies in the world to ensure the products they supply are safe, their ingredients are authentic and labelling is accurate. Eurofins believes it is a global leader in food, environmental, pharmaceutical and cosmetics products testing and in agroscience CRO services. It is also one of the global independent market leaders in certain testing and laboratory services for genomics, discovery pharmacology, forensics, CDMO, advanced material sciences and in the support of clinical studies.\n  In over just 30 years, Eurofins has grown from one laboratory in Nantes, France to over 58,000 staff across a network of more than 1 000 independent companies in over 54 countries and operating more than 900 laboratories. Eurofins offers a portfolio of over 200,000 analytical methods to evaluate the safety, identity, composition, authenticity, origin, traceability and purity of biological substances and products, as well as providing innovative clinical diagnostic testing services, as one of the leading global emerging players in specialised clinical diagnostics testing.\n  In 2021, Eurofins generated total revenues of EUR € 6.7 billion, and has been among the best performing stocks in Europe over the past 20 years.\n \n \n\n Job Description\n  Primary Purpose: Under direct supervision of the Laboratory Supervisor, this position is responsible for conducting sample preparation and analysis using the appropriate analytical methods.\n \n   Perform sample extractions according to applicable SOPs and test methods;\n   Perform sample analysis, integration, and data entry into the LIMS system;\n   Perform method validation procedures for applicable test methods;\n   Maintain good laboratory housekeeping at all times;\n   Perform regular instrument maintenance, troubleshooting and calibration;\n   Keep track of consumables inventory and request supplies for ordering, as required;\n \n \n   Follow the Quality System as documented in the Quality Assurance Manual; and\n   Other related duties as assigned.\n \n \n \n\n Qualifications\n  \n \n   University degree or college diploma in a chemistry-related field;\n   Basic computer literacy;\n   Experience with GCs and organics testing an asset;\n   Laboratory safety and WHMIS training;\n   Troubleshooting skills required for instrument maintenance;\n   Technical knowledge of applicable test methods; and\n   Weekend and/or evening shifts may be required.\n \n  Additional Information\n  temporary position\n  37.5 hours per week"
    },
    {
        "id": "d7293eac7eca6664",
        "company": "Paracel Laboratories",
        "positionName": "Junior Laboratory Analyst",
        "jobType": [],
        "location": "2319 St. Laurent Blvd Suite 300, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-08-25T06:50:40.240Z",
        "url": "https://www.indeed.ca/rc/clk?jk=d7293eac7eca6664&from=jasx&tk=1hb2v8b7g2ap3005&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=d7293eac7eca6664&atk=&xpse=SoB567I3Ki2tIEWatp0LbzkdCdPP",
        "companyDescription": "",
        "description": "Who We Are:\n  Paracel Laboratories Ltd. is a full-service environmental and Indoor Air Quality laboratory. Our main laboratory facilities are located in Ottawa and are supported by an environmental lab in Hamilton and microbiology and asbestos laboratories in Mississauga and Calgary. Additional service depots are located in Kingston, London, Niagara, Windsor, and Richmond Hill. We support a broad spectrum of projects for professional clients from across Canada and around the world. Our client base primarily consists of major environmental consultants, all levels of government and industrial manufacturers located predominantly in Ottawa, Toronto, Niagara, Eastern and Southwestern Ontario.\n \n  The Opportunity:\n  Paracel Laboratories is looking for a Junior Analyst to join our team at our St. Laurent lab in Ottawa. The ideal candidate for this role is detail-oriented, dexterous and driven to meet deadlines in a fast-paced environment.\n \n  The Junior Analyst is responsible for performing analyses within a discrete section of the Laboratory (i.e. Organic, Inorganic). This involves sample preparations and manipulations, standards/reagent preparation according to established methods and QC protocols, and assistance on research projects as required under the direct supervision of the Senior Analyst. This is a full-time, permanent position.\n \n  Key Responsibilities:\n \n   Ensuring that all tests are performed according to the established in-house protocols.\n   Responsible for performing analyses, and the preparation of lab standards and reagent, for both routine and research related analyses.\n   Responsible for performing analysis QC.\n   Maintaining and cleaning workspace in the laboratory.\n   Assists in collating and tabulating data.\n   Monitoring and requisitioning supplies as required.\n   Comply with company QA/QC and Health & Safety policies and procedures.\n \n \n  Qualifications:\n \n   B.Sc. or Chemical/Biology/Biochemistry Technology Diploma or equivalent with less than 1 year related experience.\n   Superb attention to detail and accuracy.\n   Ability to effectively follow/interpret work instructions, methods and procedures.\n   High degree of manual dexterity.\n   Highly reliable and deadline-driven.\n   Strong communication skills.\n   Thrives in a fast-paced environment.\n   Good understanding of Quality Assurance (QA) and Quality Control (QC).\n   Good Laboratory Practices (GLPs).\n   Ability to work independently and with a team.\n   Proven computer skills including MS office (Word and Excel).\n \n \n  To Apply:\n  In addition to your resume, please include a cover letter in your application. We thank all applicants for their interest; however, only those selected for an interview will be contacted.\n \n  Paracel Laboratories is an equal-opportunity employer. If you require accommodation during the recruitment process, please let us know, and all efforts to provide the appropriate accommodation will be put into place.\n  \n bg5RXA2j3N"
    },
    {
        "id": "e19e23f089fb553b",
        "company": "Isologic Innovative Radiopharmaceuticals",
        "positionName": "Night Shift Lab Technologist - Radiopharmacy - Lab Technician",
        "jobType": [],
        "location": "1053 Carling Ave, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-08-25T06:50:52.262Z",
        "url": "https://www.indeed.ca/rc/clk?jk=e19e23f089fb553b&from=jasx&tk=1hb2v8b7g2ap3005&vjs=3",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "ISOLOGIC Innovative Radiopharmaceuticals is a nationwide radiopharmaceutical company, dedicated to nuclear medicine and the science of Radiopharmaceutical production. Our commitment to these fields extends to the communities we serve. We utilize our significant experience, expertise and networks in Nuclear Pharmacy to provide our customers and patients with reliable; safe and high quality radiopharmaceutical products and services. This position is for a full-time permanent role with rotating shifts (8am to 4pm, 2:45am to 11:15am, 4am to 12:20pm).\nKey Duties & Responsibilities\n\n Sets up, prepares and dispenses radiopharmaceuticals\n Handles and packages radiopharmaceuticals and hazardous materials in compliance with Company policies, corporate standards and Health and Safety rules\n Exemplifies compliance with all regulations, Company policies, Corporate standards and Health and Safety rules\n Processes returned medical waste and maintains returned reusable supplies in compliance with all regulations and Company policies\n Maintains cleanliness of the laboratory in accordance with the facility housekeeping schedules\n Manages bio-hazardous waste and prepares paperwork for its ultimate disposal\n Performs inventory control by reviewing and documenting/verbalizing stock needs to pharmacy personnel\n Completes radiation wipes and surveys on shipping containers, pharmacy supplies, incoming packages, work spaces and vehicles\n Actively participates in maintaining a safe work environment by completing required training, providing suggestions for improving the Quality and EHS program\n Performs quality control tests on equipment and prepared products\n Performs leukocyte labeling procedures\n Supports Facility Operations by performing data entry into computer system\n Follows aseptic garbing, personnel hygiene and aseptic control procedure at all times while working in the restricted area\n Complies with Quality Manual, Quality Management System, Quality Management Policy, applicable laws and regulation, as they apply to this role\n Completes all required Quality & Compliance training within the defined deadlines\n Identifies and reports any Quality & Compliance concerns to on-site Manager, Quality\n Receives and processes radiopharmaceutical Active Pharmaceutical Ingredients (API), when required\n\nExperience and Education Required\n\n College diploma in a related field\n Certified Nuclear Medicine Technologist (CNMT) or current enrollment in an accredited Nuclear Medicine Technologist Program, an asset\n Experience in handling radioactive materials\n Experience in the preparation, dispensing, shipping and receipt of radiopharmaceuticals, an asset\n Ability to accommodate shift changes based on business needs, variable hours starting from: 8am to 4pm, 2:45am to 11:15am, and 4am to 12:20pm\n Strong interpersonal skills with an emphasis on effective communications and ability to work with diverse personalities and skill levels.\n\nJoining the ISOLOGIC team means adhering to a friendly, productive and stimulating work environment while enjoying favorable conditions such as a dynamic and flexible environment for continuous improvement, where your new ideas and know-how will be encouraged; Challenges up to your talent that will make a real difference;\nJoin our talent team and send us your resume as soon as possible\nBenefits:\n- Location offers onsite cafeteria and coffee shops\n- Central location in Ottawa\nOnly those candidates selected for interviews will be contacted.\nWe are an equal opportunity employer.\nOUR VALUESDRIVE OUR DAILY ACTIONS AND DECISIONS\nETHICS AND INTEGRITY, CUSTOMER FOCUS, COLLABORATION, INNOVATION, PASSION, EXCELLENCE\nJob Types: Permanent, Full-time\nBenefits:\n\n Dental care\n Disability insurance\n Employee assistance program\n Extended health care\n Life insurance\n On-site gym\n On-site parking\n RRSP match\n Vision care\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n 8 hour shift\n Night shift\n\nSupplemental pay types:\n\n Overtime pay\n\nCOVID-19 considerations:Isologic maintains an aseptic environment in the laboratory and has measures in place to follow the recommended Public Health guidelines for Covid-19.\nWork Location: In person"
    },
    {
        "id": "f29542e223c2a6d7",
        "company": "NOKIA",
        "positionName": "Engineering Lab Support Co-op/Intern",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-08-26T06:50:55.363Z",
        "url": "https://www.indeed.ca/rc/clk?jk=f29542e223c2a6d7&from=jasx&tk=1hb2v8b7g2ap3005&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=f29542e223c2a6d7&atk=&xpse=SoBt67I3Ki2rCJwdxB0LbzkdCdPP",
        "companyDescription": "",
        "description": "Position: Engineering Lab Support Co-op/Intern Duration: 3 + months Date: Winter 2024 (Jan 8 - April 26) Location: Onsite\n \n \n   \n   \n  Come create the technology that helps the world act together\n   We are a B2B technology innovation leader pioneering the future where networks meet cloud. At Nokia, you will have a positive impact on people’s lives and help build the capabilities needed for a more productive, sustainable, and accessible world.  Be part of a culture built on an inclusive way of working where we are open to your ideas, you are empowered to take risks, and are encouraged to be fearless in bringing your authentic self to work. \n  The team you'll be part of  Network Infrastructure \n   The pandemic has highlighted how important telecoms networks are to society. Nokia’s Network Infrastructure group is at the heart of a revolution to bring more and faster network capacity to people worldwide through our ambition, innovation, and technical expertise.\n   \n   \n   Education Recommendations\n   Currently a candidate for a bachelor’s degree or diploma in Computer Science, Computer Engineering, or related field with an accredited school in Canada.\n    The team you will be a part of\n   The Network Automation Product Group at Nokia is seeking a highly motivated Engineering Lab Software Developer to join its lab team. This team is responsible for supporting all the NA R&D labs in Kanata  Candidates can expect a hands-on programming design role with a focus on providing lab support to the R&D and Customer Support Teams.\n    What you will learn and contribute to\n   As part of the team, you will: \n   \n   Work with new products and technologies. \n   Software installs, system configurations restoring and backing up databases. \n   Programming in PHP, HTML and CSS using a MYSQL database. \n   Update and create new features in Web Lab tools.\n  \n   \n   What is Nokia looking for from me  You have: \n   \n   Enrolled in Post-Secondary for Computer Networking \n   Strong interpersonal and communication (both written and verbal) skills are required. \n   The candidate must be able to successfully work in a team-oriented environment. \n   Demonstrated ability to learn quickly and to work in a fast paced, innovative environment.\n  \n   \n   \n   It would be nice if you also had: \n  \n   Knowledge in IP networking, familiar with networking concepts. \n   Familiar or proficient with different LINUX operating systems (i.e Centos) \n   Scripting languages – bash, php and css Familiar with debugging programs such as eclipse  \n  \n  Why we're awesome\n   Nokia offers flexible and hybrid working schemes, continuous learning opportunities, well-being programs to support you mentally and physically, opportunities to join and get supported by employee resource groups, mentoring programs and highly diverse teams with an inclusive culture where people thrive and are empowered.\n   \n   Company Culture: We believe our people are our greatest asset and we aim to foster a fun, challenging, positive, and inclusive work environment. We offer 1-on-1 mentorship, learning and development opportunities, global impact and interaction, and flexible work/life balance. \n   Meaningful Co-op Term: During your co-op term, you will have the opportunity to test out the latest technologies and work on innovative projects that could leave a global impact. You get to use skills learned in the classroom and apply it to real work situations while gaining professional hands-on experience.\n    Nokia is committed to inclusion and is an equal opportunity employer\n   Nokia has received the following recognitions for its commitment to inclusion & equality: \n  \n   One of the World’s Most Ethical Companies by Ethisphere \n   Gender-Equality Index by Bloomberg \n   Workplace Pride Global Benchmark\n  \n   \n   \n   At Nokia, we act inclusively and respect the uniqueness of people.\n   \n   Nokia’s employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law.\n   \n   We are committed to a culture of inclusion built upon our core value of respect.\n   \n   Join us and be part of a company where you will feel included and empowered to succeed. \n   \n  \n   See you this Winter 2024!"
    },
    {
        "id": "ab156e0a301a0f3f",
        "company": "Live Dental Studio Inc.",
        "positionName": "dental laboratory technician assistant",
        "jobType": [],
        "location": "Kanata, ON",
        "salary": null,
        "postingDateParsed": "2023-08-25T06:50:55.100Z",
        "url": "https://www.indeed.ca/rc/clk?jk=ab156e0a301a0f3f&from=jasx&tk=1hb2v8b7g2ap3005&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=ab156e0a301a0f3f&atk=&xpse=SoA567I3Ki2rBVTenR0LbzkdCdPP",
        "companyDescription": "",
        "description": "Work Term: Permanent \n  Work Language: English \n  Hours: 40 hours per week \n  Education: Secondary (high) school graduation certificate \n  Experience: 2 years to less than 3 years \n  or equivalent experience\n   Work setting\n   Commercial dental laboratory\n   Computers and associated equipment manufacturing\n   Tasks\n   Prepare plaster models and moulds\n   Design, fabricate or repair dental devices\n   Supervision\n   3-4 people\n   Technical expertise (dental)\n   Plastering\n   Waxing-up\n   Polishing\n   Computer and technology knowledge\n   MS Excel\n   MS PowerPoint\n   MS Windows\n   MS Word\n   Computer numerical control (CNC) machines\n   MS Outlook\n   Computer-aided design (CAD)\n   Equipment and machinery experience\n   Milling machines\n   Area of specialization\n   Crowns and bridges\n   Work conditions and physical capabilities\n   Fast-paced environment\n   Work under pressure\n   Manual dexterity\n   Attention to detail\n   Hand-eye co-ordination\n   Personal suitability\n   Efficient interpersonal skills\n   Flexibility\n   Team player\n   Initiative\n   Reliability\n   Screening questions\n   Are you available for the advertised start date?\n   Are you willing to relocate for this position?\n   Do you have previous experience in this field of employment?\n   What is your current field of study?\n   Health benefits\n   Dental plan\n   Disability benefits\n   Health care plan\n   Paramedical services coverage\n   Vision care benefits\n   Financial benefits\n   Bonus\n   Long term benefits\n   Group insurance benefits\n   Life insurance\n   Other benefits\n   Other benefits\n   Free parking available\n   Learning/training paid by employer\n   Team building opportunities\n   Travel insurance"
    },
    {
        "id": "e9b56301c10bbbc4",
        "company": "University of Ottawa Heart Institute",
        "positionName": "POSTDOCTORAL RESEARCH FELLOW - Cardiac Rehabilitation",
        "jobType": [],
        "location": "40 Ruskin St, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-08-29T06:50:58.526Z",
        "url": "https://www.indeed.ca/rc/clk?jk=e9b56301c10bbbc4&from=jasx&tk=1hb2v8b7g2ap3005&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=e9b56301c10bbbc4&atk=&xpse=SoAZ67I3Ki2qnbxTkR0LbzkdCdPP",
        "companyDescription": "",
        "description": "Details\n    \n   Posted: 28-Aug-23 \n   Location: ottawa, Ontario, Canada \n   Type: Fellowship \n   \n   Sector: \n   \n    Hospital, Public and Private\n    \n   \n   Salary Details: \n   \n    $50,000 - $60,000\n    \n   \n   Additional Information: \n   \n    2 openings available.\n    \n  \n \n \n \n  Internal Number: 1 \n \n POSTDOCTORAL FELLOW \n Division of Cardiac Prevention & Rehabilitation \n Cardiac Rehabilitation \n Exercise Physiology and Cardiovascular Health Lab \n University of Ottawa Heart Institute\n  \n The University of Ottawa Heart Institute is Canada's largest and foremost cardiovascular health centre dedicated to understanding, treating, and preventing heart disease. The Division of Cardiac Prevention & Rehabilitation has a unique array of initiatives and programs, with a particular emphasis on innovative approaches to preventing (primary and secondary) and managing cardiovascular disease. The Division is home to our Cardiac Rehabilitation program, one of the largest in Canada, and the Exercise Physiology and Cardiovascular Health Lab. \n This fellowship affords the opportunity to acquire and contribute knowledge to the areas of cardiovascular rehabilitation, clinical exercise physiology, big data, and clinical trial conduct and management. Some of the current research projects include: (1) OPPORTUNITY – an RCT investigating the impact of different forms of exercise training in patients with atrial fibrillation; (2) CANSURVEY-AF – a multi-site observational cohort study examining the physical activity levels of patients with atrial fibrillation; (3) EXCEED – an RCT examining the effects of exercise programs delivered virtually in women with cardiovascular disease; and, (4) various projects examining practical approaches to prescribing physical activity and monitoring exercise intensity in patients with cardiovascular disease, with a focus on sex and gender differences. \n The selected candidate will be expected to lead a large-scale / big-data evaluation of cardiac rehabilitation programming to advance quality of care, closely collaborating with scientists and healthcare professionals to develop and apply advanced data science methodologies. Access to several large integrated clinical and research databases spanning 15+ years is available and will serve as the foundation for publication and presentation opportunities. The fellowship also offers the opportunity to enhance and develop clinical exercise physiology / kinesiology skills (e.g., leading exercise training sessions, cardiopulmonary exercise testing, functional capacity testing) in patients with a range of cardiovascular conditions including, but not limited to, atrial fibrillation, coronary artery disease, heart failure (if the candidate possesses the minimum required education and qualifications, see below). \n It is expected that the successful candidate will assume responsibility for the preparation and publication of manuscripts and assist with the submission of research grant applications. The fellow will also participate in training and educational activities (e.g., Grand Rounds, Cardiac Rehabilitation Rounds, Work-in-Progress Rounds, conferences), and may obtain additional support from our Research Services Department, medical librarian, and Cardiovascular Methods Centre. \n The successful candidate will possess: \n \n  D. degree in a data science (statistics/computer science/engineering) or health-related (exercise physiology/kinesiology preferred, epidemiology) field, or M.D. degree. \n  Kin, ACSM RCEP, CSEP CEP, or equivalent (preferred if contributing to clinical exercise physiology / kinesiology activities). \n  A strong understanding of clinical research design, research methodology, and data analysis. \n  Advanced statistical training and knowledge of statistical software packages. \n  Demonstrated experience programming in statistical software (e.g., SPSS, SAS, R, Python). \n  Evidence of experience in the preparation and publication of manuscripts. \n  Excellent oral communication and technical writing skills in English. \n  The ability to take guided initiatives and to work in an organized fashion within a fast-paced research environment, including flexibility in shifting between independent and collaborative work. \n  The ability to work collegially in an exciting and dynamic research environment.\n \n  \n \n The position is a two-year fellowship with the possibility of a 1-year renewal contingent on performance and funding. Up to two positions may be available. While funding for this position(s) has been secured through the University of Ottawa Heart Institute Foundation (Jan & Ian Craig Fellowship), the Canadian Institutes of Health Research, and the Heart and Stroke Foundation of Canada, successful applicants will be encouraged to apply for independent postdoctoral fellowships. Please send a letter of application including a 1-2 page description of research experience and interests, updated curriculum vitae, and names & contact information of three referees to Dr. Jennifer Reed, jreed@ottawaheart.ca (video and audio recordings of the application package are also acceptable). Applicants are encouraged to prepare their application materials following DORA guidelines to define their research contributions. A description of any barriers that may have limited their research contributions to date are encouraged. Applications are encouraged to reach out should they have questions regarding the application requirements. Applications will be reviewed as received.\n  \n We are committed to a continued focus on equitable hiring, training, operations, and policies. We don’t just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our research and clinical programs. \n \n The successful candidate will possess: \n \n  D. degree in a data science (statistics/computer science/engineering) or health-related (exercise physiology/kinesiology preferred, epidemiology) field, or M.D. degree. \n  Kin, ACSM RCEP, CSEP CEP, or equivalent (preferred if contributing to clinical exercise physiology / kinesiology activities). \n  A strong understanding of clinical research design, research methodology, and data analysis. \n  Advanced statistical training and knowledge of statistical software packages. \n  Demonstrated experience programming in statistical software (e.g., SPSS, SAS, R, Python). \n  Evidence of experience in the preparation and publication of manuscripts. \n  Excellent oral communication and technical writing skills in English. \n  The ability to take guided initiatives and to work in an organized fashion within a fast-paced research environment, including flexibility in shifting between independent and collaborative work. \n  The ability to work collegially in an exciting and dynamic research environment."
    },
    {
        "id": "a24b54eda16c3948",
        "company": "University of Ottawa",
        "positionName": "Assistant, Associate or Full Professor in Physical Chemistry",
        "jobType": [],
        "location": "40 Ruskin St, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-08-25T06:50:55.294Z",
        "url": "https://www.indeed.ca/rc/clk?jk=a24b54eda16c3948&from=jasx&tk=1hb2v8b7g2ap3005&vjs=3",
        "externalApplyLink": "https://uottawa.wd3.myworkdayjobs.com/en-US/uOttawa_External_Career_Site/job/Ottawa-ON/Assistant--Associate-or-Full-Professor-in-Physical-Chemistry_JR4387",
        "companyDescription": "",
        "description": "Job Family:\n  Academic Leadership and Faculty\n \n   Union affiliation:\n \n  APUO\n \n \n   Faculty/Department:\n  Department of Chemistry and Biomolecular Sciences_FT\n \n \n   Campus:\n  STEM\n \n \n   Date Posted:\n  août 22, 2023\n \n \n   Closing Date:\n \n \n   Note: Applications will be accepted until 11:59 PM on the day prior to the Posting End Date above\n \n \n \n   Assistant, Associate or Full Professor in Physical Chemistry\n \n \n \n   The University of Ottawa invites applications for a professor in Physical Chemistry. Candidates are sought whose interests are at the interface of photonics and multidimensional spectroscopy, and who propose to develop (or are already actively engaged in) a research program in physical chemistry. The successful candidate will have access to the world-class Centre for Advanced Computing, and benefit from facilities part of the Centre for Catalysis Research and Innovation and world-class photonics research and facilities in the Advanced Research Complex. The Department of Chemistry and Biomolecular Sciences at the University of Ottawa is currently ranked #5 in Canada and is one of the top 125 departments worldwide (according to QS) and currently hosts two winners of the Herzberg Canada Gold Medal, five Canada Research Chairs, and five University Research Chairs.\n \n \n \n   Required qualifications and work experience: PhD or equivalent in Chemistry and postdoctoral experience is mandatory. Candidates should demonstrate an excellent research track record in physical chemistry with an emphasis on photonics and/or multidimensional spectroscopy. In addition, candidates must demonstrate an enthusiasm for teaching and graduate training, a strong track record and commitment to interdisciplinary collaboration, the ability to secure external research funding, and excellent communication skills in English and French are assets. An interest in teaching in French is essential. Tenure is conditional on active knowledge of Canada's other official language.\n \n \n \n   Title of the position: Assistant, Associate or Full Professor\n \n \n \n   Rank and salary: Regular tenure-track academic appointment in the Faculty of Science, with a salary consistent with the collective agreement of the Association of Professors of the University of Ottawa.\n \n \n \n   Application Package:\n \n \n   A cover letter;\n   A curriculum vitae (if applicable, explain any career interruptions that might have affected research productivity);\n   A research plan demonstrating a strong commitment to research excellence;\n   A statement of equity, diversity, and inclusion training and mentorship plan\n   A teaching philosophy statement; and\n   The names and contact information of three people who may be contacted by the University for letters of reference.\n \n \n \n   Deadline: August 31, 2023\n \n \n \n   The selection process will begin in early September and continue until the position is filled. Only candidates selected for an interview will be contacted.\n \n \n \n   The application package should be submitted electronically through the uOttawa Academic Careers website (\n  \n   Academic and Executive Careers\n  ) and address the cover letter to :\n \n \n \n   Prof. John Pezacki, Chair\n \n \n   Department of Chemistry and Biomolecular Sciences\n \n \n   University of Ottawa\n \n \n   10 Marie Curie (DRO108)\n \n \n   Ottawa, ON Canada K1N 6N5\n \n \n   Ph 1-613-562-3346\n \n \n   Fax 1-613-562-5193\n \n \n  \n    CHMChair@uottawa.ca\n  \n \n \n \n   Location of work: Department of Chemistry and Biomolecular Sciences, University of Ottawa, DRO Complex, 10 Marie Curie, Ottawa, ON K1N 6N5\n \n \n   The University of Ottawa is committed to ensuring equity, diversity and inclusion in the scholarly and leadership environments of our students, staff, and faculty. Accordingly, we strongly encourage applications from Indigenous Peoples in Canada, visible minorities members (racialized persons), persons with disabilities, women, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse and inclusive communities. Candidates who wish to be considered as a member of one or more designated groups are asked to complete the confidential Self-Identiﬁcation Questionnaire, to be completed at the time of application.\n \n \n   According to government policy, all qualified candidates are invited to apply; however, preference will be given to Canadians and permanent residents. When submitting your application, please indicate if you are legally entitled to work in Canada.\n \n \n \n   The University of Ottawa provides accommodations for applicants with disabilities throughout the recruitment process. If you are invited to proceed in the selection process, please notify us of any accommodations that you require by contacting the Office of the Vice-Provost, Faculty Relations by email at \n  \n   vra.affairesprofessorales@uottawa.ca\n  . Any information you send us will be handled respectfully and in complete confidence.\n \n \n \n   The University of Ottawa is justly proud of its 160-year tradition of bilingualism. Through its Official Languages and Bilingualism Institute, the University provides training to staff members and their spouses in their second official language. At the time of tenure, professors are expected to be able to function in a bilingual setting. In certain cases, professors must have the ability to teach in both official languages to be granted tenure.\n \n \n \n   The University of Ottawa is committed to ensuring equity, diversity, and inclusion in the scholarly and leadership environments of our students, staff, and faculty. Accordingly, we strongly encourage applications from Indigenous Peoples in Canada, visible minorities members (racialized persons), persons with disabilities, women, as well as from all qualified candidates with the skills and knowledge to productively engage with equitable, diverse, and inclusive communities. Candidates who wish to be considered as a member of one or more designated groups are asked to complete the confidential Self-Identification Questionnaire, to be completed at the time of application.\n \n \n \n   All qualified candidates are invited to apply; however, preference will be given to Canadians and permanent residents. When submitting your application, please indicate if you are legally entitled to work in Canada\n \n \n \n   The University of Ottawa provides accommodations for applicants with disabilities throughout the recruitment process. If you are invited to proceed in the selection process, please notify us of any accommodations that you require by contacting the Office of the Vice-Provost, Faculty Relations by email at \n  \n   vra.affairesprofessorales@uottawa.ca\n  . Any information you send us will be handled respectfully and in complete confidence.\n \n \n \n   The University of Ottawa is proud of its 160-year tradition of bilingualism. Through its Official Languages and Bilingualism Institute, the University provides training to staff members and to their spouses in their second official language.\n \n \n \n   Prior to May 1, 2022, the University required all students, faculty, staff, and visitors (including contractors) to be fully vaccinated against Covid-19 as defined in Policy 129 – Covid-19 Vaccination. This policy was suspended effective May 1, 2022 but may be reinstated at any point in the future depending on public health guidelines and the recommendations of experts."
    },
    {
        "id": "ba41edaabc9f3f10",
        "company": "National Research Council Canada",
        "positionName": "Research Associate, Aerosol and Gas Metrology",
        "jobType": [],
        "location": "1200 Montreal Rd, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-08-30T06:51:01.185Z",
        "url": "https://www.indeed.ca/rc/clk?jk=ba41edaabc9f3f10&from=jasx&tk=1hb2v8b7g2ap3005&vjs=3",
        "externalApplyLink": "https://recruitment-recrutement.nrc-cnrc.gc.ca/job/Ottawa-Research-Associate%2C-Aerosol-and-Gas-Metrology-ON/573517717/",
        "companyDescription": "",
        "description": "Help bring research to life and drive your career forward with the National Research Council of Canada (NRC), Canada's largest research and technology organization.\n     \n     \n    We are looking for 2 Research Associates in early-career for the Aerosol and Gas Metrology Team to support our Metrology Research Centre. Each Research Associate (RA) would be someone who shares our core values of Integrity, Excellence, Respect and Creativity.\n     \n     \n    The selected candidates will work on research related to the optical characterization of aerosols or gases. The selected candidates will conduct research independently, while gaining hands-on experience in aerosol and gas characterization with the support of researchers in a larger team. The research team has a wide spectrum of expertise in the emerging fields of aerosol science, climate science, gas characterization, spectroscopy, and metrology. The project is expected to address emerging challenges on the climate, a priority topic at NRC. There is a focus on short lived climate forcers (including aerosols and methane, among other gases), which are significant contributors to uncertainties that limit our understanding of climate change. The incumbent will work collaboratively with NRC researchers, academics, and industry partners to develop reliable diagnostic measurements in two streams:\n     \n     \n    \n     Stream 1: A new optical instrument capable of simultaneously measuring aerosol light absorption and scattering; \n     Stream 2: An optical instrument capable of characterizing concentrations of multiple gaseous species, including carbon dioxide, carbon monoxide and methane, with high precision and accuracy.\n    \n     \n     \n    The selected candidates are expected to work closely with the research team and produce refereed publications, technical reports, and/or patents (if applicable) as the project progresses. \n   \n  \n  \n   \n     Screening Criteria \n   \n   \n     Applicants must demonstrate within the content of their application that they meet the following screening criteria in order to be given further consideration as candidates: \n   \n  \n  \n   \n     Education \n   \n   \n     As part of the RA Program you must have received your PhD in Physics, Chemistry, Engineering Physics, Mechanical Engineering, or Electrical Engineering within the last five years or you expect to receive the degree within the next six months. The candidate must have a focus on optical techniques for characterization of aerosols or gases and development of methods thereof, as demonstrated by thesis work and/or publications.\n     \n     \n    For information on certificates and diplomas issued abroad, please see Degree equivalency \n   \n  \n  \n   \n     Experience \n   \n   \n    \n     Experience in optical diagnostic methods for measurements of aerosols or gases; \n     Experience in optical instrument design, system integration, troubleshooting, testing, and performance evaluation; \n     Experience with safe operation of lasers, compressed gases, and handling of delicate optical components and electrostatic-sensitive devices; \n     Practical experience working independently and within a team on joint projects and achieving recognized and quantifiable results; \n     Experience in spectroscopy or interferometry is considered an asset; \n     Experience in modelling light-aerosol interactions is considered an asset. \n    \n   \n  \n  \n   \n    Condition of Employment \n   \n   \n     Reliability Status \n   \n  \n  \n   \n     Language Requirements \n   \n   \n     English\n     \n     \n    Information on language requirements and self-assessment tests \n   \n  \n  \n   \n     Assessment Criteria \n   \n   \n     Candidates will be assessed on the basis of the following criteria: \n   \n  \n  \n   \n     Technical Competencies \n   \n   \n     Stream 1 - Aerosol metrology \n    \n     Proven ability to conduct research in characterization of aerosol properties, involving novel methods development, as demonstrated by peer-reviewed publications; \n     Advanced knowledge of optical aerosol instrumentation and components; \n     Practical knowledge of light–aerosol interactions; \n     Some knowledge with collision-induced and radiative heat transfer in an aerosol-laden gaseous matrix; \n     Practical knowledge of techniques in interferometry, phase sensitive detection, and noise reduction in electronic systems; \n     Proven ability in programming software for hardware control, data acquisition, and real-time data analysis; \n     Demonstrated ability to write quality scientific reports and articles; and \n     Demonstrated ability to communicate clearly in discussions and through presentations to project partners, and at scientific conferences, workshops and seminars.\n    \n     \n     \n    Stream 2 - Gas metrology \n    \n     Practical knowledge of molecular absorption spectra and spectroscopic techniques, as demonstrated by peer-reviewed publications, prior research or thesis work; \n     Demonstrated ability to design, fabricate, integrate and implement free-space or integrated photonic-based systems; \n     Practical knowledge and ability with fiber optics and fiber components; \n     Demonstrated ability in instrument control via software (e.g. C/C++, FPGA, Python, etc.) on embedded systems; \n     Knowledge of sensor calibration, testing, validation, troubleshooting and identifying points for improvement; \n     Demonstrated ability to write quality scientific reports and articles; and \n     Demonstrated ability to communicate clearly in discussions and through presentations to project partners, and at scientific conferences, workshops and seminars. \n    \n   \n  \n  \n   \n    Behavioural Competencies \n   \n   \n    Research - Results orientation (Level 1) \n    Research - Communication (Level 1) \n    Research - Teamwork (Level 1) \n    Research - Creative thinking (Level 1) \n   \n  \n  \n   \n    Competency Profile(s) \n   \n   \n     For this position, the NRC will evaluate candidates using the following competency profile: Research\n     \n     \n   \n  \n  \n   \n     Relocation \n   \n   \n     Relocation assistance will be determined in accordance with the NRC's directives. \n   \n  \n  \n   \n     Compensation \n   \n   \n     The intent of this hiring action is to staff through the Research Associate (RA) Program at the AsRO level, which is an early-career level position with a salary range of $74,230 to $103,093.\n     \n     \n    NOTE: Salary determination will be based on a review of the candidate’s expertise, outcomes and impacts of their previous work experience relative to the requirements of the level. As a guide, the current annual PhD recruiting rate is $74,230.\n     \n     \n    NRC employees enjoy a wide-range of competitive benefits including comprehensive health and dental plans, pension and insurance plans, vacation and other leave entitlements. \n   \n  \n  \n   \n     Notes \n   \n   \n     Application Requirements:\n     \n     \n    In order to be considered for the Research Associate program please include the following in your application. Failure to do so will result in your application being excluded from searches. \n    \n     Resume \n     Transcript \n     Two letters of recommendation\n    \n     \n     \n    When submitting your application you can include the required documents in any attachment field such as «Second language evaluation results» or «Other attachments».\n     \n     \n    \n     The applicants must clearly indicate within their application the stream in which they would like their application to be considered (Stream 1 or Stream 2) \n     Preference will be given to Canadian Citizens and Permanent Residents of Canada. Please include citizenship information in your application. \n     On-site attendance and work in a laboratory environment are required \n     The incumbent must adhere to safe workplace practices at all times. \n     We thank all those who apply, however only those selected for further consideration will be contacted.\n    \n   \n  \n \n  \n  \n Please direct your questions, with the requisition number (19855) to: \n E-mail: NRC.NRCHiring-EmbaucheCNRC.CNRC@nrc-cnrc.gc.ca \n Telephone: 438-455-5335 \n Closing Date: 26 October 2023 - 23:59 Eastern Time"
    },
    {
        "id": "562c5d58ae5e2534",
        "company": "NOKIA",
        "positionName": "Engineering Lab Technician Co-op/Intern",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-01T06:51:07.950Z",
        "url": "https://www.indeed.ca/rc/clk?jk=562c5d58ae5e2534&from=jasx&tk=1hb2v8b7g2ap3005&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=562c5d58ae5e2534&atk=&xpse=SoDt67I3Ki2pcyzetx0LbzkdCdPP",
        "companyDescription": "",
        "description": "Engineering Lab Technician Co-op/Intern\n  \n  Duration: 4 months \n  Date: January – April, 2024 \n  Location: Hybrid\n  \n  Come create the technology that helps the world act together Nokia is committed to innovation and technology leadership across mobile, fixed and cloud networks. Your career here will have a positive impact on people’s lives and will help us build the capabilities needed for a more productive, sustainable, and inclusive world. We challenge ourselves to create an inclusive way of working where we are open to new ideas, empowered to take risks and fearless to bring our authentic selves to work. \n  The team you’ll be part of \n  Network Infrastructure The pandemic has highlighted how important telecoms networks are to society. Nokia’s Network Infrastructure group is at the heart of a revolution to bring more and faster network capacity to people worldwide through our ambition, innovation, and technical expertise. The NI Service group in Nokia is seeking a highly motivated Engineering Lab Support Technician to join its lab team. This team is responsible for supporting all the IP Platforms labs in Kanata. Candidates can expect a hands-on technical role with a focus on providing lab support to the R&D and Customer Support Teams. \n  Education Recommendations Currently enrolled in Computer Technician program a Bachelor’s/ Master's degree or diploma program with an accredited school in Canada. \n  What you will learn and contribute to: \n \n   As part of our team, you will:\n   \n  \n   Work with new products and technologies.\n   Troubleshoot and debug node configurations.\n   Install system configurations restoring and backing up databases.\n   Troubleshoot and upgrade cards.\n   Installation and configuration of new equipment into existing networks\n  \n \n   What is Nokia looking for from me: \n \n   You have:\n   \n  \n   Strong interpersonal and communication (both written and verbal) skills\n   Ability to successfully work in a team-oriented environment\n   Demonstrated ability to learn quickly and to work in a fast-paced, innovative environment\n  \n  \n \n   It would be nice if you also had:\n   \n  \n   Knowledge in IP networking, familiar with networking concepts.\n   Familiar or proficient with UNIX and LINUX\n   Scripting languages (i.e., PERL)\n  \n  \n  Why we’re awesome Nokia offers flexible and hybrid working schemes, continuous learning opportunities, well-being programs to support you mentally and physically, opportunities to join and get supported by employee resource groups, mentoring programs and highly diverse teams with an inclusive culture where people thrive and are empowered. Company Culture: We believe our people are our greatest asset and we aim to foster a fun, challenging, positive, and inclusive work environment. We offer 1-on-1 mentorship, learning and development opportunities, global impact and interaction, and flexible work/life balance. Meaningful Co-op Term: During your co-op term, you will have the opportunity to test out the latest technologies and work on innovative projects that could leave a global impact. You get to use skills learned in the classroom and apply it to real work situations while gaining professional hands-on experience. \n \n   Nokia is committed to inclusion and is an equal opportunity employer\n   Nokia has received the following recognitions for its commitment to inclusion & equality:\n   \n  \n   One of the World’s Most Ethical Companies by Ethisphere\n   Gender-Equality Index by Bloomberg\n   Workplace Pride Global Benchmark\n   LGBT+ equality & best place to work by HRC Foundation\n  \n  \n  At Nokia, we act inclusively and respect the uniqueness of people. Nokia’s employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law. We are committed to a culture of inclusion built upon our core value of respect. Join us and be part of a company where you will feel included and empowered to succeed.\n  \n  \n  Follow and engage with us on social media: \n LinkedIn | Facebook | Instagram | Twitter @NokiaCareers \n  Chat with our Nokia insiders to ask questions and learn more about us!"
    },
    {
        "id": "7dc2a2353052d14a",
        "company": "University of Ottawa Heart Institute",
        "positionName": "Postdoctoral Researcher",
        "jobType": [],
        "location": "40 Ruskin St, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-08-29T06:51:15.669Z",
        "url": "https://www.indeed.ca/rc/clk?jk=7dc2a2353052d14a&from=jasx&tk=1hb2v8b7g2ap3005&vjs=3",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "POSTDOCTORAL FELLOW Division of Cardiac Prevention & Rehabilitation Cardiac Rehabilitation Exercise Physiology and Cardiovascular Health Lab \nUniversity of Ottawa Heart Institute \nThe University of Ottawa Heart Institute is Canada's largest and foremost cardiovascular health centre dedicated to understanding, treating, and preventing heart disease. The Division of Cardiac Prevention & Rehabilitation has a unique array of initiatives and programs, with a particular emphasis on innovative approaches to preventing(primary and secondary) and managing cardiovascular disease. The Division is home to our Cardiac Rehabilitation program, one of the largest in Canada, and the Exercise Physiology and Cardiovascular Health Lab.\nThis fellowship affords the opportunity to acquire and contribute knowledge to the areas of cardiovascular rehabilitation, clinical exercise physiology, big data, and clinical trial conduct and management. Some of the current research projects include: (1) OPPORTUNITY – an RCT investigating the impact of different forms of exercise training in patients with atrial fibrillation; (2) CANSURVEY-AF – a multi-site observational cohort study examining the physical activity levels of patients with atrial fibrillation; (3) EXCEED – an RCT examining the effects of exercise programs delivered virtually in women with cardiovascular disease; and, (4) various projects examining practical approaches to prescribing physical activity and monitoring exercise intensity in patients with cardiovascular disease, with a focus on sex and gender differences.\nThe selected candidate will be expected to lead a large-scale / big-data evaluation of cardiac rehabilitation programming to advance quality of care, closely collaborating with scientists and healthcare professionals to develop and apply advanced data science methodologies. Access to several large integrated clinical and research databases spanning 15+ years is available and will serve as the foundation for publication and presentation opportunities. The fellowship also offers the opportunity to enhance and develop clinical exercise physiology / kinesiology skills (e.g., leading exercise training sessions, cardiopulmonary exercise testing, functional capacity testing) in patients with a range of cardiovascular conditions including, but not limited to, atrial fibrillation, coronary artery disease, heart failure (if the candidate possesses the minimum required education and qualifications, see below).\nIt is expected that the successful candidate will assume responsibility for the preparation and publication of manuscripts and assist with the submission of research grant applications. The fellow will also participate in training and educational activities (e.g., Grand Rounds, Cardiac Rehabilitation Rounds, Work-in-Progress Rounds, conferences), and may obtain additional support from our Research Services Department, medical librarian, andCardiovascular Methods Centre.\nThe successful candidate will possess: \n\n Ph.D. degree in a data science (statistics/computer science/engineering) or health-related (exercise physiology/kinesiology preferred, epidemiology) field, or M.D. degree.\n R. Kin, ACSM RCEP, CSEP CEP, or equivalent (preferred if contributing to clinical exercise physiology / kinesiology activities).\n A strong understanding of clinical research design, research methodology, and data analysis.\n Advanced statistical training and knowledge of statistical software packages.\n Demonstrated experience programming in statistical software (e.g., SPSS, SAS, R, Python).\n Evidence of experience in the preparation and publication of manuscripts.\n Excellent oral communication and technical writing skills in English.\n The ability to take guided initiatives and to work in an organized fashion within a fast-paced research environment, including flexibility in shifting between independent and collaborative work.\n The ability to work collegially in an exciting and dynamic research environment.\n\nThe position is a two-year fellowship with the possibility of a 1-year renewal contingent on performance and funding. Up to two positions may be available. While funding for this position(s) has been secured through theUniversity of Ottawa Heart Institute Foundation (Jan & Ian Craig Fellowship), the Canadian Institutes of HealthResearch, and the Heart and Stroke Foundation of Canada, successful applicants will be encouraged to apply for independent postdoctoral fellowships. Please send a letter of application including a 1-2 page description of research experience and interests, updated curriculum vitae, and names & contact information of three referees to Dr. Jennifer Reed, jreed@ottawaheart.ca (video and audio recordings of the application package are also acceptable). Applicants are encouraged to prepare their application materials following DORA guidelines to define their research contributions. A description of any barriers that may have limited their research contributions to date are encouraged. Applications are encouraged to reach out should they have questions regarding the application requirements. Applications will be reviewed as received.\n\n We are committed to a continued focus on equitable hiring, training, operations, and policies. We don’t just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our research and clinical programs. \n\nJob Type: Full-time\nSalary: $50,000.00-$60,000.00 per year\nBenefits:\n\n Flexible schedule\n\nSchedule:\n\n Monday to Friday\n Weekends as needed\n\nEducation:\n\n Doctoral Degree (preferred)\n\nWork Location: In person"
    },
    {
        "id": "e67a244eea6465e0",
        "company": "NOKIA",
        "positionName": "NPI Lab Support Co-op/Intern",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-08-31T06:51:09.197Z",
        "url": "https://www.indeed.ca/rc/clk?jk=e67a244eea6465e0&from=jasx&tk=1hb2v8b7g2ap3005&vjs=3",
        "externalApplyLink": "https://careers.nokia.com/jobs/npi-lab-support-co-op-intern-101720?src=JB-10760",
        "companyDescription": "",
        "description": "Come create the technology that helps the world act together \n  \n \n We are a B2B technology innovation leader pioneering the future where networks meet cloud. \n  \n At Nokia you will have a positive impact on people’s lives and help build the capabilities needed for a more productive, sustainable, and accessible world. \n  \n Be part of a culture built on an inclusive way of working where we are open to your ideas, you are empowered to take risks and are encouraged to be fearless in bringing your authentic self to work. \n  \n Department \n  The pandemic has highlighted how important telecoms networks are to society. Nokia’s Network Infrastructure group is at the heart of a revolution to bring more and faster network capacity to people worldwide through our ambition, innovation, and technical expertise. \n  The team you will be a part of \n  \n \n The IP Networks Business Division provides a co-op student with the opportunity to learn and gain hands-on experience on the most advanced technologies that build the world's most critical networks. The SR TEC team (Technical Expertise Centre) is a highly specialized group providing worldwide support to customers and internal Nokia teams \n  \n Position: NPI Lab Support Co-op/Intern Duration: 4 Months Date: January 8th to April 26th, 2024 Location: Hybrid in Ottawa, Canada \n  \n What you will learn and contribute to \n  \n \n As part of the team, you will: \n  \n  Setup and maintain network topologies \n  Build new servers and Virtual Machines using EXSi and Linux KVM hypervisors \n  Maintain and support Windows and Linux Operating systems \n  Support the lab network infrastructure \n \n Your skills and experience \n  \n \n Education Recommendations: \n  \n Currently a candidate for a Bachelor’s degree or diploma in Computer Science, Computer Systems Engineering, or a related field with an accredited school in Canada. \n  \n You have : \n  \n  Knowledge of IP networking \n  Experience with cabling techniques \n  Experience with server setup \n  \n \n It would be nice if you also had: \n  \n  Familiarity with Scripting/Automation \n \n What we offer \n  \n \n Nokia offers flexible and hybrid working schemes, continuous learning opportunities, well-being programs to support you mentally and physically, opportunities to join and get supported by employee resource groups, mentoring programs and highly diverse teams with an inclusive culture where people thrive and are empowered. \n  \n \n  Company Culture: We believe our people are our greatest asset, and we aim to foster a fun, challenging, positive, and inclusive work environment. We offer 1-on-1 mentorship, learning and development opportunities, global impact and interaction, and flexible work/life balance. \n  Meaningful Co-op Term: During your co-op term, you will have the opportunity to test the latest technologies and work on innovative projects that could leave a global impact. You get to use skills learned in the classroom and apply them to real-world situations while gaining professional hands-on experience. \n \n Nokia is committed to inclusion and is an equal opportunity employer \n  \n \n Nokia has received the following recognitions for its commitment to inclusion & equality: \n  \n  One of the World’s Most Ethical Companies by Ethisphere \n  Gender-Equality Index by Bloomberg \n  Workplace Pride Global Benchmark \n  \n \n At Nokia, we act inclusively and respect the uniqueness of people. \n  \n Nokia’s employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law. \n  \n We are committed to a culture of inclusion built upon our core value of respect. \n  \n Join us and be part of a company where you will feel included and empowered to succeed."
    },
    {
        "id": "7be67a486b9a85c4",
        "company": "GFL Environmental Inc.",
        "positionName": "Chemical Technician (Day Shift)",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-21T06:51:21.133Z",
        "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0Dj8Z-FFh6d0UoqZZ5him_ZpKRS-YayAgX2lMubnI_lOXNBbhAgAvFVLRGzy2TjoCgrRtOXuvJH9XS2JLaciBC6Tfl90HsuSEza3BUnj_NSIhibLm1unYgrt8UZeedVbqUkTnehUZmNat7PVIOjsZUeea47-4Ir0MpwTejUUMRDMq-BWVv9p_r4T8_QxPIy4pWBxHgLc35K85QKvZesqeUkeV-x-JwMGGUjnfyAtaZFLH2AtSLkrY_SybC-xzqz2TJDyNqd_CCkOfYH2OFVPqo4IzT20H1z4UD8FWCXJsW6NwM2lCB6yLRDJlyfXI5oaiHLiLO1i6ZANAxa9SeHbqGu102vZgWf66fFSRNXcoudv8Q5WfeTLEMGi3Js0J93GhJMH5EjnTc8VFSycwklebdZ8Dqkf56dJ8c3rAe8KYqDKHc8ylxP8Dp3UtEwM_XCXPcxbmJy9udtlFbJYkTcq3NjrXdhy50YrfWoNm3Y4_OUgFaIVCtSokdd4GqKKjRD1xxuD2JybR1dTPSm4dTWSrppfFnNOZad8xvii7h3r5hSPlUP5JaUTSqpHC4IcXMGB6GLE4jcbnvPvOz1AunUrozIO1TJHemxFifvHyBnL1Mo1M9caAESVHlSx_ef2ADr-Kum0myQ0KrSz1c9wZ6N7uMYf3sWA0RkWtQ%3D&xkcb=SoDv-_M3Ki2d9GAJGj0MbzkdCdPP&p=7&fvj=0&vjs=3&jsa=3714&tk=1hb2v4hd2is3q800&from=jasx&wvign=1",
        "externalApplyLink": "https://wd3.myworkdaysite.com/recruiting/gflenv/Careers/job/Ottawa-Ontario/Chemical-Technician--Day-Shift-_R10318",
        "companyDescription": "",
        "description": "The Chemical Technician (job title: Chemical Operator) is responsible for day-to-day operations with respect to waste receiving, sampling, handling, processing, and disposal. Client site visits to complete lab packing of waste, classification and sampling of waste products and preparing materials for transportation and disposal. Assisting Industrial Operations, Customer Service Representatives with projects as needed.\n \n \n   Who we are:\n \n \n  \n   \n    \n      GFL Environmental is the only major diversified environmental services company in North America; operating across Canada and the United States; offering services in solid waste management, liquid waste management, and infrastructure development.\n     \n      Recognized by our signature fleet of bright green trucks and equipment, we offer a wide range of environmental and industrial services to businesses, communities, and households, providing a consolidated and sophisticated approach to meeting our customers’ needs.\n     \n      GFL Benefits:\n     \n       Our industry leading benefits package (100% employer paid)\n       RRSP Matching: We support your future goals by matching your RRSP contributions\n       An environment to encourage professional growth and development\n       Be a part of the Full-Cycle Project initiative – a way to give back to the community\n     \n    \n   \n  \n \n  Key Responsibilities:\n \n   Receive all client waste – both bulk liquids/solids and containerized.\n   Take samples from waste vehicles and containers for lab analysis.\n   Load and unload waste vehicles including vacuum trucks, tankers, straight trucks, and van trailers.\n   Operate plant machinery and assist with general maintenance as needed.\n   Perform wastewater treatment and discharge according to our site-specific Environmental Certificate of Approvals (ECAs) and associated compliance requirements pertaining to treatment and discharge issued by the Region of Peel.\n   Perform acid/base neutralizations efficiently, safely, and effectively.\n   Assist with preparing shipments of hazardous and non-hazardous waste for transport.\n   Notify the Shift Supervisor/General Manager of any defects, damages, mistakes, errors, contamination, spills, other incidents, or accidents that are identified.\n \n \n  Knowledge, Skills & Competencies: \n \n  Post-Secondary education in Chemistry/Chemical Engineering/Technology or Internship in a related field.\n   Familiarity with waste management regulations, Ontario regulation 347, Transportation of Dangerous Goods is an asset.\n   Previous hazardous and non-hazardous waste management experience is an asset.\n   Must be comfortable working in a mostly outdoor environment.\n   Ability to lift upwards of 50 lbs.\n   Emergency response availability including evenings and weekends.\n \n \n  #GFLTalent\n \n  We thank you for your interest. Only those selected for an interview will be contacted. \n \n GFL Environmental is an equal opportunity employer and encourages women, Aboriginal people, persons with disabilities and members of visible minorities to apply. We seek to hire individuals with diverse characteristics, backgrounds and perspectives. We strongly believe that world-class talent makes no distinctions based on gender, ethnic or national origin, sexual identity and orientation, age, religion or disability, but enriches itself through these differences. GFL will provide accommodations to job applicants with disabilities throughout the recruitment process. If you require an accommodation, please notify us and we will work with you to meet your needs."
    },
    {
        "id": "1250c3fcdc4f54f9",
        "company": "Kinaxis",
        "positionName": "UX Research Intern",
        "jobType": [],
        "location": "3199 Palladium Dr, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-15T06:51:27.244Z",
        "url": "https://www.indeed.ca/rc/clk?jk=1250c3fcdc4f54f9&from=jasx&tk=1hb2v5rcfk7vv800&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=1250c3fcdc4f54f9&atk=&xpse=SoCu67I3Ki2nGnSdVh0LbzkdCdPP",
        "companyDescription": "",
        "description": "At Kinaxis, who we are is grounded in our common belief that people matter. Each one of us plays an important part in accomplishing our work, building our culture and making a global impact. \n   Every day, we're empowered to work together to help our customers make fast, confident planning decisions. This is how we create a better planet – for each other, for our customers and for generations to come. Our cloud-based platform RapidResponse ensures that the products we need – everything from medicine and cars, to day-to-day items like toothpaste – make it to market and into our hands when we need them with minimal ecological footprint. \n   We make the world better, and you can too.\n \n  UX Research Intern \n  Job location: our office in Ottawa, Canada (preferred) or Remote; Canada (EST Time Zone) \n  Term length: 12 months starting January 2024 \n  About the Team \n  The UX team at Kinaxis is transforming the user experience of our product, RapidResponse. You'll be integrated right into the UX team and treated like a permanent employee. You'll work closely with developers, product managers, designers and other researchers on exciting and challenging research projects. You'll have the opportunity to experiment, learn new skills and gain valuable real-world experience. \n  What you will do \n  Help broaden and accelerate UX research & testing at Kinaxis: \n  \n  Create and execute usability tests \n  \n   Work with UX designers to identify what to test (e.g. areas of risk or uncertainty). \n   Write study protocols. \n   Schedule and conduct moderated usability tests AND/OR prepare and execute unmoderated tests. \n   Analyze results. \n   Summarize and present findings. \n  \n  Support research activities \n  \n   Schedule and conduct interviews with users. \n   Create surveys. \n   Analyze results. \n   Summarize and present findings. \n  \n  Use Alchemer to create surveys. \n  Use Condens to analyze data and write reports. \n  Use Miro for collaborative story-mapping, brainstorming, and early concept generation. \n  Use Figma to collaborate on hi-fidelity visual designs and prototypes. \n  May perform additional projects as assigned. \n \n What we are looking for \n \n  An education in user experience research, psychology (experimental, social, cognitive), sociology, anthropology, human computer interaction, human factors, or a related field. \n  Demonstrable research expertise \n  Strong communication skills, team-orientation and are responsive to feedback. \n  Curiosity, empathy and attention to detail \n  A strong desire to create great products, and a motivation to keep learning and improving. \n \n \n  What we have to offer \n  \n   Challenging Work - We love solving highly complex problems. And as the global leaders in our industry, we never stop innovating—our work is never \"done. That's because across our teams and in all roles, every employee is empowered to bring their best ideas forward and to jump in and solve the problems they're passionate about. \n   Great People - We take our work seriously, but we don't take ourselves too seriously! It's in our DNA to celebrate, laugh, and have fun. We are stronger, together, when we are open, honest, and above all, real. Every person is valued here and plays an important role in our shared success. \n   Global Impact - As a global team spanning continents, boundaries, and cultures, every day we are inspired by the impact our work has on our colleagues, our customers, our communities, and the world at large. \n   Diversity, Equity and Inclusion - Diversity, equity and inclusion are more than words to us. They are the guiding principles for building a culture where we celebrate each others' differences, continuously strive for equality and recognize that inclusion makes us stronger as individuals, a company and a global citizen. \n   \n  For more information, visit the Kinaxis web site at www.kinaxis.com or the company's blog at http://blog.kinaxis.com/. \n   Kinaxis strongly encourages diverse candidates to apply to our welcoming community. We strive to make our website and application process accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact us at recruitmentprograms@kinaxis.com. This contact information is for accessibility requests only and cannot be used to inquire about the status of applications."
    },
    {
        "id": "46e34efc327d8d60",
        "company": "Alberta Precision Labs",
        "positionName": "Medical Laboratory Assistant (Alberta, Canada)",
        "jobType": [],
        "location": "Ontario",
        "salary": null,
        "postingDateParsed": "2023-09-14T06:51:34.239Z",
        "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0BKoA0KjMB2_2SITHdZiKR2tLJiDQwQdMraFBOtj0fmnfR-Td6qATq9e8Dii-TEZmttxkF29KoVMomicbEbdo8mnwcyGUotTIf0wV1DxZBe_nj4g0BDCJNzF8mAErJuZgMTvqMC80EL98DVTmi4C73Ox8ljLHP1ZqOO73jiLk8AUszpEsR9vAr_0sRAhZnnvZXBNdk2-p38Zo8YnDpWh6WzNAX4jcnLqXfDX4RkZBmkKtw9XqmhPeLNEaypMWQu3uhNDEOjFKax7MrJDgWWnKGFMro_7BEkUsjQFIJW8dU8fxYHKfV2ujI3S0Od-XcXqJmSTdgnBFgGMXDC6fQaFhvTk4F2uR04shABDOarcs9dVKraozIeUrcucvbVgd_bIhOzdhhJWuIak2bNijOMaWKWE2K6vfpcP7PKv89_rFNQNB_Hit59iDlZkCPOU5JZkK0JHeKCxXudjmaKIYaSu1KAMxFqCOddmtC8jbe1r5mu_-LkzjfvMeRwer9Uktktf3dwFy3VZAv08orqaQAoWdUGLcj_34NPOYLrKldN0fVjoNGgi5NCIl8X69R4LCARlUU%3D&xkcb=SoBC-_M3Ki2SK7zAJZ0PbzkdCdPP&p=4&fvj=1&vjs=3&jsa=15&tk=1hb2v7fefi3br800&from=jasx&wvign=1",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "Your Opportunity:\nAlberta Precision Laboratories (APL) is hiring multiple Medical Laboratory Assistants throughout Alberta.\nAPL delivers high-quality, responsive diagnostic lab services to Albertans as a part of the provincial healthcare system. With competitive salaries, opportunities for professional development, and comprehensive benefits, you can truly thrive. Make a difference in your own community as you help healthcare professionals and patients get the information that they need to improve, optimize, or maintain health.\nAs a successful candidate, you will have the opportunity to work both independently and as a member of our team where you may be responsible for performing all aspects within the scope of practice of a MLA including blood collection, specimen procurement and handling procedures, data entry, as well as Electrocardiogram (ECG) and Holter monitors, and urinalysis. You will have the opportunity to work in the community or hospital setting.\nWith a customer service focused approach, you build productive and respectful customer relations and take responsibility for customer satisfaction. You have an ability to encourage others, building positive, respectful and collaborative working relationships.\nJoin our professional and engaging team that encourages promoting a positive and respectful work environment consistent with the APL Values: kindness, inclusion, innovation, agility & accuracy.\nJob Description:\nAs an MLA, you will provide high quality service to clients of the clinical laboratory in an effective, efficient and safe manner. You will be responsible for a variety of laboratory functions including procurement, handling, processing, dispatching and testing of specimens, performing procedures and reporting results.\nQualifications:\nCompletion of an accredited Medical Laboratory Assistant program or equivalent.\nJob Types: Casual, Permanent, Part-time, Full-time, Fixed term contract\nSalary: $23.25-$28.98 per hour\nBenefits:\n\n Company pension\n Dental care\n Disability insurance\n Extended health care\n Life insurance\n Paid time off\n Vision care\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n Day shift\n Evening shift\n Night shift\n Weekends as needed\n\nWork Location: In person"
    },
    {
        "id": "f777eb65db7af033",
        "company": "Oxford Learning Centres, Inc.",
        "positionName": "Math & Science Tutor/Teacher",
        "jobType": [],
        "location": "3619 Innes Road, Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-09T06:51:25.818Z",
        "url": "https://www.indeed.ca/rc/clk?jk=f777eb65db7af033&from=jasx&tk=1hb2v5rcfk7vv800&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=f777eb65db7af033&atk=&xpse=SoAI67I3Ki2nfiyRQx0LbzkdCdPP",
        "companyDescription": "",
        "description": "High School Math/Science Teacher/Tutor Wanted \n  Motivated by mathematics? Sharp with science? Excited by equations in both fields? Eager to help students succeed in math and science? \n  Our hours count! Gain valuable teaching experience! Oxford Learning Orleans is currently seeking part-time teacher-tutors for a role in our learning centre. This position is perfect for anyone who loves working with students, enjoys numbers and equations, and is passionate about helping others build their skills in these areas. \n  Teacher-Tutors at Oxford Learning do not have to lesson plan before class, as all lessons are pre-planned. Applicants will be fully trained in our proprietary philosophy and methods. \n  Position Requirements \n  All Teacher-Tutors at Oxford Learning work during after-school and evening hours (4:00pm - 8:00pm) as well as some Saturdays (9:00am - 3:00pm). A commitment until the end of the school year is preferred. Continuing through the summer is even better. Your students will love working with you, and being reliable is a must. \n  This role is in-person. You must be able to commute to this location. This is not an online position. Relocation packages are not offered. Vulnerable sector screening is mandatory. \n  We encourage you to apply if you have the majority of the following requirements: \n  Education: \n  \n  Bachelor’s degree or similar certification in a relevant field \n  University students with extensive tutoring experience will be considered \n  Teaching certification an asset \n  Good knowledge of the current Grades 9-12 math and science curriculum, particularly senior math and including, but not limited to, Advanced Functions, Algebra, Trigonometry and Calculus, and Vectors, Physics, Chemistry, and Biology. \n  French is an asset but not required \n  \n Experience: \n  \n  Some experience teaching/tutoring math and science at a Grade 9 to 12 (or equivalent) level \n  Strong English written and oral communication skills \n  Strong math skills and ability to guide students’ understanding \n  Ability to multitask and balance working with up to three students at a time \n  \n Responsibilities (Position Details) \n  You will work directly with students as an Interactive Coach with the following responsibilities: \n  \n  Teaching up to 3 students at a time at different levels \n  Teaching online and in-person \n  Following the Oxford Learning methodologies and philosophies \n  Filling in post-lesson notes \n  Completing daily student communication updates \n  Maintaining a friendly and professional manner at all times \n  \n Smiles, High-Fives & Happy Students \n  In this position, you will play a key role in helping students develop their self-confidence and self-esteem. The rewards of helping children overcome academic hurdles and realize their inner potential can be very fulfilling. You will be rewarded with smiling faces and high-fives during every shift. Other rewards of the role include: \n  \n  fun staff events \n  ongoing training opportunities \n  frequent check-ins and feedback \n  company growth opportunities \n  hands-on development of your teaching skills \n  \n Job Type: Part-time \n  Hourly Rate: $17 - $19 / hour \n  Schedule: \n  \n  Evenings \n  Monday to Thursday \n  Saturday availability \n  \n About Oxford Learning \n  Oxford Learning is a Canadian supplemental education provider helping students get better grades since 1984. Offering a full range of programs for students of all ages and abilities, Oxford Learning uses the science of cognitive learning to help all students develop stronger learning skills they can rely on for life! \n  Are you the superstar teacher-tutor we have been searching for? Apply now! \n  Oxford Learning Orleans \n  3619 Innes Rd., Ottawa, ON \n  Tel: (613) 841-7321 \n  We thank all applicants for their interest in joining the team at Oxford Learning Orleans. However, only those selected for the interview process will be contacted."
    },
    {
        "id": "c7a4762b555baf4b",
        "company": "exp",
        "positionName": "Lab Technician",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-09-15T06:51:24.936Z",
        "url": "https://www.indeed.ca/rc/clk?jk=c7a4762b555baf4b&from=jasx&tk=1hb2v5rcfk7vv800&vjs=3",
        "externalApplyLink": "https://elcn.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX/job/106961",
        "companyDescription": "",
        "description": "Lab Technician (Contract until 2023) \n Ottawa, ON \n \n At EXP, we’re driven to provide innovative solutions for the world’s built and natural environments. As a team of engineers, architects, designers, scientists, creators and a community of professionals, we bring diverse and talented people together to solve the world’s most complex challenges. Here, you join a team that leverages differences, harnesses their entrepreneurial spirit in an employee-owned company, that believes diversity is what gives us strength, seeks sustainable results and shares ambitions for each other, our clients and the communities we are part of and serve. To be a part of EXP means to have your own experience, while staying connected to a global network of professionals, who believe we are a part of something bigger. Together, we are EXP. \n Are you ready to design your future? \n Be our next Lab Technician ! \n \n Your work environment at EXP \n EXP is currently searching for a Lab Technician to join our Earth and Environment group. This is a contract position until the end of 2023 with a possibility of extension. \n \n What a day at EXP has in store for you \n The successful candidate will spend their time in the material laboratory completing construction materials tests. \n \n  Lab based position – process concrete cylinders, conduct aggregate and soil testing Interact with other lab & field staff, engineers, etc. \n \n \n The Skills, Knowledge and Abilities We Seek \n \n  Must have strong people skills, and ability to work with wide variety of staff and clients \n  Must be able to communicate (verbally/writing) in English for field and formal reports \n  Ideally concrete/soils/asphalt testing experience would be advantageous \n  Strong general math skills \n  Diploma from an accredited Civil Technology program or equivalent would be an asset \n  Must have a valid Canadian driver’s license (Having access to a vehicle is an asset) Able to lift a minimum of 25kg \n \n \n #LI-AH1\n \n\n\n Our story   With a mission to understand, innovate, partner and deliver, EXP provides engineering, architecture, design and consulting services to the world’s built and natural environments. \n Our heritage dates back to 1906, when the earliest of EXP’s predecessor companies started its engineering infrastructure practice. Today, thousands of creative professionals across EXP work together to deliver extraordinary experiences year after year. \n What makes us different \n The passion, enthusiasm, diversity and industry-leading capabilities of our employees make us who we are. We’re committed to providing a challenging work environment that cultivates career growth, encourages creativity and rewards excellence. \n Find out more about life at EXP by visiting www.exp.com ."
    },
    {
        "id": "46e34efc327d8d60",
        "company": "Alberta Precision Labs",
        "positionName": "Medical Laboratory Assistant (Alberta, Canada)",
        "jobType": [],
        "location": "Ontario",
        "salary": null,
        "postingDateParsed": "2023-09-14T06:51:46.622Z",
        "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0BKoA0KjMB2_2SITHdZiKR2tLJiDQwQdMraFBOtj0fmnfR-Td6qATq9e8Dii-TEZmttxkF29KoVMomicbEbdo8mnwcyGUotTIf0wV1DxZBe_nj4g0BDCJNzF8mAErJuZgMTvqMC80EL98DVTmi4C73Ox8ljLHP1ZqOO73jiLk8AUszpEsR9vAr_WqiWa5VpmDM5zHwbL-GBtm0M6DbhtCfwpY4XdkzN1vRqKoPaAskPOTRx_lG1DKy8i2R5U9F5EmFc14y1yVWSCO0ELMOiysYIptQH6uLf6dbO3-FETXMaFjdOn0YcZ-HQW46wU81cdzkNa-ueyZRZpx-WKC8-cs-OZpNopMFwmSFC8Y5F3X4jwouRjKNcXHWzPPWO7JldauNg7wO7KHWJxNPX5K85MmYeUcVjjxRXGVbZyRq95cw-c35mt5kEFjE1gzhlh_rHT1Xyvw8HxxkHLX4pITuDdjtjnLVM_O9rnIfz3pksaxzfapydEmI41k4uboZ_lzif7Nro-sUyHJDM0m--m5hsJ-GLrjhs3lF8v2NQwF_aBTp_sOlarPk5NK7SdviOB4ys7-w%3D&xkcb=SoBk-_M3Ki2RxaS2IJ0PbzkdCdPP&p=4&fvj=1&vjs=3&jsa=1500&tk=1hb2v7gsrk60m800&from=jasx&wvign=1",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "Your Opportunity:\nAlberta Precision Laboratories (APL) is hiring multiple Medical Laboratory Assistants throughout Alberta.\nAPL delivers high-quality, responsive diagnostic lab services to Albertans as a part of the provincial healthcare system. With competitive salaries, opportunities for professional development, and comprehensive benefits, you can truly thrive. Make a difference in your own community as you help healthcare professionals and patients get the information that they need to improve, optimize, or maintain health.\nAs a successful candidate, you will have the opportunity to work both independently and as a member of our team where you may be responsible for performing all aspects within the scope of practice of a MLA including blood collection, specimen procurement and handling procedures, data entry, as well as Electrocardiogram (ECG) and Holter monitors, and urinalysis. You will have the opportunity to work in the community or hospital setting.\nWith a customer service focused approach, you build productive and respectful customer relations and take responsibility for customer satisfaction. You have an ability to encourage others, building positive, respectful and collaborative working relationships.\nJoin our professional and engaging team that encourages promoting a positive and respectful work environment consistent with the APL Values: kindness, inclusion, innovation, agility & accuracy.\nJob Description:\nAs an MLA, you will provide high quality service to clients of the clinical laboratory in an effective, efficient and safe manner. You will be responsible for a variety of laboratory functions including procurement, handling, processing, dispatching and testing of specimens, performing procedures and reporting results.\nQualifications:\nCompletion of an accredited Medical Laboratory Assistant program or equivalent.\nJob Types: Casual, Permanent, Part-time, Full-time, Fixed term contract\nSalary: $23.25-$28.98 per hour\nBenefits:\n\n Company pension\n Dental care\n Disability insurance\n Extended health care\n Life insurance\n Paid time off\n Vision care\n\nFlexible Language Requirement:\n\n French not required\n\nSchedule:\n\n Day shift\n Evening shift\n Night shift\n Weekends as needed\n\nWork Location: In person"
    },
    {
        "id": "d88455d3a999456e",
        "company": "CBCL Limited",
        "positionName": "Intermediate Environmental Biologist/Scientist",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-08-25T06:51:47.034Z",
        "url": "https://www.indeed.ca/rc/clk?jk=d88455d3a999456e&from=jasx&tk=1hb2vai09joqv800&vjs=3",
        "externalApplyLink": "https://ca.indeed.com/rc/clk?jk=d88455d3a999456e&atk=&xpse=SoB767I3Ki2k_2w8Kx0LbzkdCdPP",
        "companyDescription": "",
        "description": "We have an exciting opportunity in our Ottawa office for an Intermediate Biologist / Environmental Scientist specializing in Natural Science and Impact Assessment with expertise and experience in one or more of the following specialized areas: species at risk, wetlands, terrestrial, avian and aquatic biology, or climate change adaption. We are looking for someone to be part of our diverse and multi-disciplinary Environmental Sciences Team. At CBCL, we work as a collaborative team, and foster development of new skills and growing together. \n At CBCL Limited, we are a successful, dynamic, and multi-disciplined engineering and environmental firm, looking to grow our Ottawa team. Our employee-owned organization is driven by the values and passion of our employees. CBCL’s culture is shaped by our Atlantic Canadian roots, and our experience extends throughout Canada and the world. We are looking for someone with an entrepreneurial spirit that shares our corporate values of diversity, inclusion and improving the communities where we live and work. \n \n  \n Your Key Responsibilities: \n  \n  Provide consulting services in the capacity of an Intermediate Biologist related to the areas of expertise provided above including conducting field surveys and report preparation. \n \n \n  Support our clients with their Federal, Provincial and Municipal environmental legislation and policy requirements. \n  Provide technical direction and leadership to environmental project teams to achieve compliance with quality standards and relevant regulations. \n  Collaboration with other environmental team members and project managers from our various other engineering departments. \n \n \n  Mentor and direct some junior staff and collaborate with other environmental professionals on our Team. \n \n \n  Provide input related to growth opportunities, business development and planning. \n  Build and/or support client relationships. \n \n \n  Lead preparation of proposal submissions, including development of project scope, schedule, and budget, as appropriate. \n \n \n  Potential for travel throughout Ontario, Canada, and international locations. \n  Uphold CBCL’s safety culture and adhere to company safety protocols and programs and applicable health and safety regulations. Maintain compliance with specific client, and site-specific health and safety protocols and programs, as required.\n \n  \n \n Your Capabilities & Credentials \n  \n  A Bachelor’s or Master’s degree in Biology, Ecology, Zoology, Botany, or other Environmental/Applied Science. \n  Minimum of 5 years’ experience in environmental consulting or relevant environmental industry, including prior field experience such as wetland delineation and functional assessments, stream and culvert assessments, vegetation surveys, aquatic invertebrate collection and identification. \n \n \n  Biological Training and certifications relevant to one’s areas of practice, such as: \n   \n    Ontario Wetland Evaluation System (OWES) \n    Ecological Land Classification (ELC) \n    Butternut Health Assessment Expert and/or Experience \n    Ontario Stream Assessment Protocol (OSAP) \n    Ontario Benthos Biomonitoring Network (OBBN) \n    Electro-fishing certification \n   \n \n \n  Experience with Ontario Class Environmental Assessments. \n \n \n  Experience with the Natural Heritage Assessment under the Provincial Policy statements. \n \n \n  Strong team player with excellent interpersonal skills and strong oral and written communication skills \n  Strong analytical skills, attention to detail, problem solving, and decision-making capabilities. \n  Strong interpersonal, organization, and time management skills. \n  Highly professional demeanor with emphasis on client service and client profile management. \n  Eligible to obtain security requirements for contracting with the Government of Canada. \n  Applicant must have a valid Class G driver’s license. \n \n \n  Experience working on Canadian Federal Impact Assessments is considered a strong asset.\n \n  \n  \n  What we can offer you: A competitive compensation package effective on your first day of employment: \n  \n  \n   \n    Comprehensive health and dental benefits \n    Defined Contribution Pension Plan with employer contributions \n    Generous vacation allowance commensurate with experience \n   \n  Respect for work-life balance with flexible environment and remote work options \n  Employee ownership potential \n  Employer contributions towards maternity leave top up \n  Health and wellness incentive \n  Membership dues reimbursement \n  Education and lifelong learning subsidization \n  Community volunteering incentive \n  Employee Family Assistance Program\n \n  \n  \n  In addition to the above benefits, we offer: \n  \n  Flexible hours and locations to support work/life balance, including hybrid or remote options; \n  Diverse team with a wide range of experience and expertise; \n  Exposure to a variety of projects; \n  Support to develop skills and pursue projects related to your own interests; \n  Collaboration between multiple disciplines and levels of expertise; \n  Mentoring opportunities to foster your personal and professional development; \n  Accessible and central offices in Ottawa and Atlantic Canada; \n  Access to training opportunities in areas ranging from technical development to leadership skills.\n \n  \n  \n  About Us \n  As an employee-owned firm, at CBCL, our people are everything. We are committed to promoting inclusivity and diversity for a workplace where everyone can thrive, and we build long-term relationships with our clients while providing them with innovative solutions. \n \n  \n We have earned recognition as one of Canada’s Top 100 Employers and one of Canada’s Best Managed Companies. Our multitalented group of professionals offer consulting in the Infrastructure, Water and Wastewater, Buildings, Industrial, and Earth and Environment sectors. We value our people, our communities, and our history and look forward to continuing our steady growth.\n \n  Along with our commitment to reducing our carbon footprint corporately, CBCL develops and implements sustainable engineering solutions that respect the current social and environmental impacts, as well as future implications of our designs.\n  \n  \n  CBCL operates from its twelve offices in Ottawa, ON, Halifax and Sydney, NS; Charlottetown, PE; Saint John, Fredericton and Moncton, NB; and St. John's, NL,\n  \n  \n  CBCL Limited strives to provide a diverse workplace that is inclusive, accessible and celebrates individuals and what makes us unique. \n Accommodations are available upon request for candidates taking part in all aspects of the recruitment process. Please contact hr@cbcl.ca.\n  \n  \n We thank all applicants for their interest, but only those applicants who are selected to interview will be contacted."
    },
    {
        "id": "70fdccc205499084",
        "company": "Dynacare",
        "positionName": "Manager, Laboratory Operations",
        "jobType": [],
        "location": "Ottawa, ON",
        "salary": null,
        "postingDateParsed": "2023-08-25T06:51:50.571Z",
        "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0CteEWC8UOe8di1Viq7t7vWxBuOVoI1Zb0qscJbkr2nDym63zINr21D-iF5CQigsrilgzdtvCl3AkttgZMEn7ac6fwDJjzWJHdXTTtxEOq6K8JWk-Hyf_LP-z8d7yaVTrkLxPIqa7UJp9t2PehhcqJEfZi5fYbrTuG3RA7bnfIhM_088zBMI5B5-ntChOgYcCpPPyb1EDEmsjWcZpQ_tTNpVXAeJDdShN2gKwlOfJznrmhZZj9MgzZqWmJDQor_DxX2ezGDhNznj-IQD2xIekjVQdZlVyAdiVC2d3EhaQtQnfOPrKvT__akr5wvOPHyPwpp_qbEahRRimBgczfui8DnGo8d6Nis3NZBXjyocZXlDVbzhrDYIFNFxAkdF14L_IYS08oM0Z_YxXas6tmLAJ_-eMjmh98G1Crod_TZ_YhPZuGobJ0ap6LVYB5S90eIzdXGVe91mkX9J5scgvakERq6lMoCRFKA1TJ0FpDuyultT7Dl9QyauKEHjQ90tiaCHF02w3Laclv7NXBqiKgta6iCe9GMG2pB-nF68_egdf1-r6gMDueGNz3-0-ZaO4fBOWkrSSpCamFm2KPQVCKQpfobtjikfYfCmpM80KHpADRqMA%3D%3D&xkcb=SoD1-_M3Ki2lsGR8Zx0CbzkdCdPP&p=9&fvj=1&vjs=3&jsa=2229&tk=1hb2vaj8lk7up801&from=jasx&wvign=1",
        "externalApplyLink": null,
        "companyDescription": "",
        "description": "Dynacare is currently looking for a Manager, Laboratory Operations to join our team in Ottawa, Ontario.This is a permanent full-time role.The successful candidate will be accountable for the efficient and effective operation and management of the department at both administrative and technical levels. Primary functions include overall service and/or technical excellence, utilization of resources, budget implementation and controls, and on-going performance and development of staff.KEY RESPONSIBILITIES/ACCOUNTABILITIES\n\n Responsible for the scientific and technical functioning of the laboratory\n Ensure that appropriate methodology and equipment are in place\n Review quality control and proficiency test, recommending corrective action where appropriate\n Ensure review with Medical Director and QC Manager where applicable\n Review incomplete work and interprets difficult cases\n Responsible for ensuring all abnormal and STAT reports are handled as outlined in department guidelines\n Develop, modify, implement and communicate department related policies, procedures and manuals\n Provide assistance and counseling to employees, as required, on the interpretation and administration of department related policies and procedures\n Ensure updates are distributed, filed and appropriately posted for notification\n Identify, prioritize and develop annual department budget needs\n Responsible for financial accountability for departmental budget formulation and controls\n Monitor supplies and orders routine stock as required from stockroom and E-req.\n Oversee inventory activity and assisting in resolution of issues\n Responsible for the recruitment, selection, placement, performance management, counseling and selection for department positions\n To ensure each employee receives proper instruction and safety training for each job assigned\n Responsible for the operational functions of the department including scheduling, training and orientation of staff\n Develop, recommend and/or deliver training and development initiatives for all department staff\n Record and submit attendance sheets and submit timesheets to payroll, ensuring accuracy and timely submission\n Monitor compliance, collection, preparation, and analysis of shift or unit reports and statistics\n Delegate and monitor duties of staff and maintain facilities and equipment\n\nINTERNAL AND EXTERNAL RELATIONSHIPSDirect Reports\n\n Lab Assistant\n Clinical Laboratory Assistant\n Lab Assistant Specimen Processing\n Medical Laboratory Technologist\n Senior Medical Laboratory Technologist\n Technician\n\nInternal\n\n Interact, liaise and coordinate activities with Dynacare managers and staff\n Supervise and oversee the function of all staff on site and at off-site locations\n\nExternal\n\n On-going contact with patients, physicians, nursing homes, couriers and the general public\n Liaise with government officials on compliance and licensing issues, as required\n\n***KNOWLEDGE, EDUCATION AND EXPERIENCE*\n\n BSc- Bio Chemistry or certified MLT\n 7 to 10 years of previous managerial experience and demonstrated increased responsibility in a clinical environment demonstrating readiness for a management role\n\n***SKILLS AND ABILITIES*Technical Skills\n\n Ability to perform under pressure, manage multiple projects, respond to changing priorities and deadlines\n Strong problem-solving skills\n\nSocial Process Skills\n\n Ability to respond to employees and management needs often in stressful situations\n\n***DNA of an Ideal Dynacare Employee*I make a difference in people’s lives. I am a caring, collaborative team-player who is passionate about quality and continuous improvement.\n\n Caring - I demonstrate strong empathy and genuine concern for my colleagues, patients and customers.\n Collaborative Team Player - I know I play a key role in helping the Dynacare team achieve success. I am comfortable in a changing environment, and I can easily manage multiple priorities.\n Passion for Quality and Continuous Improvement - I am always looking to learn and solve problems. I am detailed oriented, adaptable and find ways to make things better.\n\nDynacare has been a “Top Employer” for many years and there is a reason why. We are a great place to work.At Dynacare, we’re proud to hire the best people. If you are looking for a meaningful career where you can support healthy lives with commitment and care – we would like to meet you. To apply for this position, you will be asked to submit your resume and complete the application process.If your qualifications and experience fit with this position, we will contact you to learn more. We offer competitive pay and great benefits, along with the opportunity to grow and thrive with a dynamic, successful company. We hope you will join us in our journey to become Canada’s health and wellness solutions leader.Dynacare is proud to be an equal opportunity employer committed to the attraction, selection, advancement and fair treatment of all individuals. We believe that our diversity is our strength so we employ a diverse workforce and respect the needs of all our employees.In accordance with the Ontario Human Rights Code, Accessibility for Ontarians with Disabilities Act and the Dynacare Accommodation Policy a request for accommodation will be accepted as part of the Dynacare hiring process.\nJob Type: Full-time"
    }
]