{
    "id": "090e69d232f9f7db",
    "companyDescription": "",
    "description": "Introduction\n   At IBM, our Project Managers excel by leading and coordinating a project team’s overall performance, scope, cost, and deliverables. Our clients rely on timely and efficient status reports, and as Project Manager, you will drive the charge with project direction, metric definition, and performance management. If you are ready to help our clients and project teams succeed, we would love to meet you!\n   \n   \n  Your Role and Responsibilities\n   The project manager's primary responsibility is to manage the efforts of IBM resources, client employees, and third-party vendors to ensure that an integrated solution provided meets the client's needs. As a Senior Project Manager within the Project Management Office (PMO), you will lead cross-functional teams to deliver projects that span multiple business units. Using project management best practices, you will be responsible for delivering a portfolio of projects. The Project Manager works independently but keeps leadership promptly apprised of work status, raising issues and risks to the appropriate level and at the appropriate time; works effectively and efficiently with minimal oversight; advises and guides other professionals; seeks guidance on critical issues as appropriate; and has a solid level of expertise in project management. The Project Manager is responsible for delivering the organization's overall project plan, budget, structure, schedule, and staffing requirements. \n   \n   Primary Job Responsibilities\n   \n  \n   Provide project management discipline and a framework for Expert Labs project teams.\n    Provide technical direction and control to coordinate and manage the activities of Expert Labs project personnel.\n    Identify, track, and manage project dependencies to ensure optimal utilization of resources, ongoing risk identification and timely benefits realization on the project.\n    Identify stakeholders and manage at varying levels within the organization, tailoring your style and approach to meet their needs, both in-person and remotely.\n    Conduct regular status meetings with clients and project stakeholders.\n    Organize and present project information comprehensively that is appropriate for the audience and the situation, including Executive-level reporting.\n    Provide financial forecasts to Delivery Leaders.\n    Keep management cadence with the Delivery Leaders to provide insight on project status. \n   Administer the contract change control procedure with the client.\n    Maintain project communications with the client and manage client expectations. \n   Escalation and critical situation management. Ability to clearly clarify the problem statement. Apply methodical problem-solving, critical thinking and root cause analysis to dissect complex issues. Generate, evaluate, and implement possible solutions and monitor outcomes.\n    Assist with estimating and sizing new projects.\n    Create Project Management deliverables (status reports, financial tracking, project plan, risks, issues, actions, decisions logs, etc.) \n   Develop knowledge of Integration Expert Labs offerings with awareness of emerging technologies and solutions.\n  \n   \n   Required Technical and Professional Expertise\n   \n  \n    Bachelor's degree or Diploma with 4+ years of experience working in a client-facing consultative services organization.\n    Fluent in English and French: Possess excellent written and verbal communication skills in both English and French and must be based in Canada\n    Project Management Certification (PMP, Scrum Master, PMI-ACP, or other certifications)\n    Experience and proficiency using MS Project and other project management tools.\n    Experience working with multiple project methodologies (waterfall, Agile, Scrum)\n    Strong verbal and written communication. \n   Experience communicating with C-suite executives.\n    Experience working in a virtual office setting and maintaining an active and dynamic presence via phone, Slack and email.\n    Possess excellent relationship management and facilitation skills.\n    Solid personal leadership and management skills with a collaborative style.\n    Ability to travel up 50% when required.\n  \n   \n   Preferred Technical and Professional Expertise\n   \n  \n    MBA preferred\n  \n \n \n  \n    \n    About Business Unit\n   IBM has a global presence, operating in more than 175 countries with a broad-based geographic distribution of revenue. The company’s Global Markets organization is a strategic sales business unit that manages IBM’s global footprint, working closely with dedicated country-based operating units to serve clients locally. These country teams have client relationship managers who lead integrated teams of consultants, solution specialists and delivery professionals to enable clients’ growth and innovation. By complementing local expertise with global experience and digital capabilities, IBM builds deep and broad-based client relationships. This local management focus fosters speed in supporting clients, addressing new markets and making investments in emerging opportunities. Additionally, the Global Markets organization serves clients with expertise in their industry as well as through the products and services that IBM and partners supply. IBM is also expanding its reach to new and existing clients through digital marketplaces.\n \n \n  \n    \n    Your Life @ IBM\n   In a world where technology never stands still, we understand that, dedication to our clients success, innovation that matters, and trust and personal responsibility in all our relationships, lives in what we do as IBMers as we strive to be the catalyst that makes the world work better.\n   Being an IBMer means you’ll be able to learn and develop yourself and your career, you’ll be encouraged to be courageous and experiment everyday, all whilst having continuous trust and support in an environment where everyone can thrive whatever their personal or professional background.\n   Our IBMers are growth minded, always staying curious, open to feedback and learning new information and skills to constantly transform themselves and our company. They are trusted to provide on-going feedback to help other IBMers grow, as well as collaborate with colleagues keeping in mind a team focused approach to include different perspectives to drive exceptional outcomes for our customers. The courage our IBMers have to make critical decisions everyday is essential to IBM becoming the catalyst for progress, always embracing challenges with resources they have to hand, a can-do attitude and always striving for an outcome focused approach within everything that they do.\n   Are you ready to be an IBMer?\n \n \n  \n    About IBM\n   IBM’s greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.\n   \n   Restlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we’re also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business. \n   \n   At IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it’s time for you to join us on our journey to being a responsible technology innovator and a force for good in the world.\n \n \n  \n    \n    Location Statement\n   Must have the ability to work in Canada without sponsorship.\n   \n   This role will involve working with technology that is covered by Export Regulations sanctions. If you are a Foreign National from any of the following US sanctioned countries (Cuba, Iran, North Korea, Syria, and the Crimea, Luhansk, Donetsk, Kherson, and Zaporizhia regions of Ukraine) on a work permit, you are not eligible for employment in this position.\n \n \n  \n    \n    Being You @ IBM\n   IBM is committed to creating a diverse environment and is proud to be an equal-opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender, gender identity or expression, sexual orientation, national origin, caste, genetics, pregnancy, disability, neurodivergence, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.",
    "preprocessed_description": "Introduction At International Business Machines, our Project Managers excel by leading and coordinating a project team's overall performance, scope, cost, and deliverables. Our clients rely on timely and efficient status reports, and as Project Manager, you will drive the charge with project direction, metric definition, and performance management. If you are ready to help our clients and project teams succeed, we would love to meet you! Your Role and Responsibilities The project manager's primary responsibility is to manage the efforts of International Business Machines resources, client employees, and third-party vendors to ensure that an integrated solution provided meets the client's needs. As a Senior Project Manager within the Project Management Office (PMO), you will lead cross-functional teams to deliver projects that span multiple business units. Using project management best practices, you will be responsible for delivering a portfolio of projects. The Project Manager works independently but keeps leadership promptly apprised of work status, raising issues and risks to the appropriate level and at the appropriate time; works effectively and efficiently with minimal oversight; advises and guides other professionals; seeks guidance on critical issues as appropriate; and has a solid level of expertise in project management. The Project Manager is responsible for delivering the organization's overall project plan, budget, structure, schedule, and staffing requirements. Primary Job Responsibilities Provide project management discipline and a framework for Expert Labs project teams. Provide technical direction and control to coordinate and manage the activities of Expert Labs project personnel. Identify, track, and manage project dependencies to ensure optimal utilization of resources, ongoing risk identification and timely benefits realization on the project. Identify stakeholders and manage at varying levels within the organization, tailoring your style and approach to meet their needs, both in-person and remotely. Conduct regular status meetings with clients and project stakeholders. Organize and present project information comprehensively that is appropriate for the audience and the situation, including Executive-level reporting. Provide financial forecasts to Delivery Leaders. Keep management cadence with the Delivery Leaders to provide insight on project status. Administer the contract change control procedure with the client. Maintain project communications with the client and manage client expectations. Escalation and critical situation management. Ability to clearly clarify the problem statement. Apply methodical problem-solving, critical thinking and root cause analysis to dissect complex issues. Generate, evaluate, and implement possible solutions and monitor outcomes. Assist with estimating and sizing new projects. Create Project Management deliverables (status reports, financial tracking, project plan, risks, issues, actions, decisions logs, etc.) Develop knowledge of Integration Expert Labs offerings with awareness of emerging technologies and solutions. Required Technical and Professional Expertise Bachelor's degree or Diploma with 4+ years of experience working in a client-facing consultative services organization. Fluent in English and French: Possess excellent written and verbal communication skills in both English and French and must be based in Canada Project Management Certification (PMP, Scrum Master, PMI-ACP, or other certifications) Experience and proficiency using MS Project and other project management tools. Experience working with multiple project methodologies (waterfall, Agile, Scrum) Strong verbal and written communication. Experience communicating with C-suite executives. Experience working in a virtual office setting and maintaining an active and dynamic presence via phone, Slack and email. Possess excellent relationship management and facilitation skills. Solid personal leadership and management skills with a collaborative style. Ability to travel up 50% when required. Preferred Technical and Professional Expertise MBA preferred About Business Unit International Business Machines has a global presence, operating in more than 175 countries with a broad-based geographic distribution of revenue. The company's Global Markets organization is a strategic sales business unit that manages International Business Machines's global footprint, working closely with dedicated country-based operating units to serve clients locally. These country teams have client relationship managers who lead integrated teams of consultants, solution specialists and delivery professionals to enable clients' growth and innovation. By complementing local expertise with global experience and digital capabilities, International Business Machines builds deep and broad-based client relationships. This local management focus fosters speed in supporting clients, addressing new markets and making investments in emerging opportunities. Additionally, the Global Markets organization serves clients with expertise in their industry as well as through the products and services that International Business Machines and partners supply. International Business Machines is also expanding its reach to new and existing clients through digital marketplaces. Your Life @ International Business Machines In a world where technology never stands still, we understand that, dedication to our clients success, innovation that matters, and trust and personal responsibility in all our relationships, lives in what we do as IBMers as we strive to be the catalyst that makes the world work better. Being an IBMer means you will be able to learn and develop yourself and your career, you will be encouraged to be courageous and experiment everyday, all whilst having continuous trust and support in an environment where everyone can thrive whatever their personal or professional background. Our IBMers are growth minded, always staying curious, open to feedback and learning new information and skills to constantly transform themselves and our company. They are trusted to provide on-going feedback to help other IBMers grow, as well as collaborate with colleagues keeping in mind a team focused approach to include different perspectives to drive exceptional outcomes for our customers. The courage our IBMers have to make critical decisions everyday is essential to International Business Machines becoming the catalyst for progress, always embracing challenges with resources they have to hand, a can-do attitude and always striving for an outcome focused approach within everything that they do. Are you ready to be an IBMer? About International Business Machines International Business Machines's greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and Artificial Intelligence strategy to life for our clients and partners around the world. Restlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we are also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the International Business Machines Cloud to run their business. At International Business Machines, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it is time for you to join us on our journey to being a responsible technology innovator and a force for good in the world. Location Statement Must have the ability to work in Canada without sponsorship. This role will involve working with technology that is covered by Export Regulations sanctions. If you are a Foreign National from any of the following US sanctioned countries (Cuba, Iran, North Korea, Syria, and the Crimea, Luhansk, Donetsk, Kherson, and Zaporizhia regions of Ukraine) on a work permit, you are not eligible for employment in this position. Being You @ International Business Machines International Business Machines is committed to creating a diverse environment and is proud to be an equal-opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender, gender identity or expression, sexual orientation, national origin, caste, genetics, pregnancy, disability, neurodivergence, age, veteran status, or other characteristics. International Business Machines is also committed to compliance with all fair employment practices regarding citizenship and immigration status.",
    "processed_description": "introduction excel lead coordinate project team's performance scope cost deliverable . client rely timely efficient status report Project Manager drive charge project direction metric definition performance management . ready help client project team succeed love meet role Responsibilities project manager's primary responsibility manage effort International Business Machines resource client employee party vendor ensure integrate solution provide meet client's . Senior Project Manager lead cross functional team deliver project span multiple business unit . project management good practice responsible deliver portfolio project . Project Manager independently leadership apprise status raise issue risk appropriate level appropriate effectively efficiently minimal oversight advise guide professional seek guidance critical issue appropriate solid level expertise project management . Project Manager responsible deliver organization's project plan budget structure schedule staffing requirement . Primary Responsibilities provide project management discipline framework Expert Labs project team . provide technical direction control coordinate manage activity Expert Labs project personnel . identify track manage project dependency ensure optimal utilization resource ongoing risk identification timely benefit realization project . identify stakeholder manage vary level organization tailor style approach meet person remotely . conduct regular status meeting client project stakeholder . organize project information comprehensively appropriate audience situation include Executive level reporting . provide financial forecast Delivery leader . management cadence Delivery Leaders provide insight project status . administer contract change control procedure client . maintain project communication client manage client expectation . escalation critical situation management . clarify problem statement . apply methodical problem solve critical thinking root analysis dissect complex issue . generate evaluate implement solution monitor outcome . assist estimate size project . deliverable status report financial tracking project plan risk issue action decision log . develop knowledge Integration Expert Labs offering awareness emerge technology solution . Required Technical Professional Expertise Bachelor's degree Diploma client face consultative service organization . fluent possess excellent write verbal communication skill base PMP PMI ACP certification proficiency project management tool . multiple project methodology waterfall Agile Scrum strong verbal write communication . communicate suite executive . virtual office set maintain active dynamic presence phone email . possess excellent relationship management facilitation skill . solid personal leadership management skill collaborative style . travel require . prefer global presence operate country broad base geographic distribution revenue . company's Global Markets organization strategic sale business unit manage International Business Machines's global footprint closely dedicated country base operating unit serve client locally . country team client relationship manager lead integrated team consultant solution specialist delivery professional enable client' growth innovation . complement local expertise global digital capability build deep broad base client relationship . local management focus foster speed support client address market investment emerge . additionally Global Markets organization serve client expertise industry product service partner supply . expand reach exist client digital marketplace . technology stand understand dedication client success innovation matter trust personal responsibility relationship live strive catalyst . ibmer learn develop career encourage courageous experiment everyday whilst continuous trust support environment thrive personal professional background . growth minded stay curious open feedback learn information skill constantly transform company . trust provide feedback help grow collaborate colleague mind team focus approach include perspective drive exceptional outcome customer . courage critical decision everyday essential catalyst progress embrace challenge resource hand attitude strive outcome focus approach . ready ibmer International Business Machines International Business Machines's great invention IBMer . application intelligence reason science improve business society human condition bring power open hybrid cloud Artificial Intelligence strategy life client partner . restlessly reinvent large corporate organization big technology consult employer Fortune company rely business . pride early adopter artificial intelligence blockchain . join journey responsible technology innovator force good . location Statement sponsorship . role involve technology cover Export Regulations sanction . Foreign National follow sanction country Zaporizhia region permit eligible employment position . International Business Machines International Business Machines commit create diverse environment equal employer . qualified applicant receive consideration employment regard race color religion sex gender gender identity expression sexual orientation national origin caste genetic pregnancy age veteran status characteristic . committed compliance fair employment practice regard citizenship immigration status .",
    "results_group": {
        "extracted_noun_chunks": [
            "effort",
            "power",
            "technical direction control coordinate",
            "courage critical decision",
            "IBMer",
            "local expertise global digital capability",
            "qualified applicant",
            "methodical problem",
            "Project Manager",
            "appropriate level appropriate effectively efficiently minimal oversight",
            "excellent relationship management facilitation skill",
            "project communication client",
            "sanction country Zaporizhia region",
            "critical thinking root analysis",
            "timely efficient status report Project Manager drive charge project direction metric definition performance management",
            "feedback help",
            "human condition",
            "ibmer",
            "Export Regulations sanction",
            "implement solution monitor outcome",
            "role Responsibilities project manager's primary responsibility",
            "business society",
            "foster speed support client address market investment",
            "perspective drive exceptional outcome customer",
            "courageous experiment",
            "estimate size project",
            "country broad base geographic distribution revenue",
            "role",
            "Agile Scrum strong verbal write communication",
            "travel",
            "meet client",
            "application intelligence reason science",
            "lead coordinate project team",
            "deliverable status",
            "client expertise industry product service partner supply",
            "consultative service organization",
            "insight project status",
            "International Business Machines International Business Machines",
            "diverse environment equal employer",
            "manage activity Expert Labs project personnel",
            "International Business Machines resource client employee party vendor",
            "management cadence Delivery Leaders",
            "client digital marketplace",
            "challenge resource hand attitude",
            "personal professional background",
            "technology solution",
            "vary level organization tailor style approach",
            "reach",
            "International Business Machines's global footprint closely dedicated country base operating unit",
            "client project team",
            "stakeholder",
            "active dynamic presence phone email",
            "virtual office set",
            "introduction",
            "project management good practice",
            "country team client relationship manager",
            "continuous trust support environment",
            "outcome focus approach",
            "strive catalyst",
            "ready ibmer International Business Machines International Business Machines's great invention",
            "organization's project plan budget structure schedule staffing requirement",
            "integrated team consultant solution specialist delivery professional enable client' growth innovation",
            "local management",
            "financial forecast Delivery leader",
            "professional seek guidance critical issue appropriate solid level expertise project management",
            "company",
            "eligible employment position",
            "global presence",
            "critical situation management",
            "integrate solution",
            "project span multiple business unit",
            "solid personal leadership management skill collaborative style",
            "Foreign National",
            "complex issue",
            "administer contract change control procedure client",
            "company's Global Markets organization strategic sale business unit",
            "verbal communication skill base",
            "large corporate organization big technology",
            "sexual orientation national origin",
            "trust",
            "awareness",
            "PMP PMI ACP certification proficiency project management tool",
            "track",
            "curious open feedback",
            "compliance fair employment practice",
            "collaborate colleague mind team focus approach",
            "cross functional team",
            "client",
            "consideration employment regard race color religion sex gender gender identity expression",
            "escalation",
            "client expectation",
            "person",
            "comprehensively appropriate audience situation",
            "multiple project methodology waterfall",
            "Primary Responsibilities",
            "open hybrid cloud Artificial Intelligence strategy life client partner",
            "regular status meeting client project stakeholder",
            "citizenship immigration status",
            "everyday essential catalyst progress",
            "knowledge Integration Expert Labs",
            "Global Markets organization",
            "portfolio project",
            "optimal utilization resource ongoing risk identification timely benefit realization project",
            "deep broad base client relationship",
            "employer Fortune company",
            "project information",
            "project management discipline framework Expert Labs project team",
            "project dependency",
            "pride early adopter artificial intelligence blockchain",
            "financial tracking project plan risk issue action decision log",
            "career",
            "information skill",
            "Executive level reporting",
            "fluent possess",
            "journey",
            "Required Technical Professional Expertise Bachelor's degree Diploma client",
            "dedication client success innovation matter trust personal responsibility relationship",
            "problem statement",
            "apprise status",
            "business",
            "location Statement sponsorship",
            "technology",
            "suite executive",
            "Senior Project Manager"
        ],
        "combined_lemmatized_tokens": "introduction excel lead coordinate project team's performance scope cost deliverable . client rely timely efficient status report Project Manager drive charge project direction metric definition performance management . ready help client project team succeed love meet role Responsibilities project manager's primary responsibility manage effort International Business Machines resource client employee party vendor ensure integrate solution provide meet client's . Senior Project Manager lead cross functional team deliver project span multiple business unit . project management good practice responsible deliver portfolio project . Project Manager independently leadership apprise status raise issue risk appropriate level appropriate effectively efficiently minimal oversight advise guide professional seek guidance critical issue appropriate solid level expertise project management . Project Manager responsible deliver organization's project plan budget structure schedule staffing requirement . Primary Responsibilities provide project management discipline framework Expert Labs project team . provide technical direction control coordinate manage activity Expert Labs project personnel . identify track manage project dependency ensure optimal utilization resource ongoing risk identification timely benefit realization project . identify stakeholder manage vary level organization tailor style approach meet person remotely . conduct regular status meeting client project stakeholder . organize project information comprehensively appropriate audience situation include Executive level reporting . provide financial forecast Delivery leader . management cadence Delivery Leaders provide insight project status . administer contract change control procedure client . maintain project communication client manage client expectation . escalation critical situation management . clarify problem statement . apply methodical problem solve critical thinking root analysis dissect complex issue . generate evaluate implement solution monitor outcome . assist estimate size project . deliverable status report financial tracking project plan risk issue action decision log . develop knowledge Integration Expert Labs offering awareness emerge technology solution . Required Technical Professional Expertise Bachelor's degree Diploma client face consultative service organization . fluent possess excellent write verbal communication skill base PMP PMI ACP certification proficiency project management tool . multiple project methodology waterfall Agile Scrum strong verbal write communication . communicate suite executive . virtual office set maintain active dynamic presence phone email . possess excellent relationship management facilitation skill . solid personal leadership management skill collaborative style . travel require . prefer global presence operate country broad base geographic distribution revenue . company's Global Markets organization strategic sale business unit manage International Business Machines's global footprint closely dedicated country base operating unit serve client locally . country team client relationship manager lead integrated team consultant solution specialist delivery professional enable client' growth innovation . complement local expertise global digital capability build deep broad base client relationship . local management focus foster speed support client address market investment emerge . additionally Global Markets organization serve client expertise industry product service partner supply . expand reach exist client digital marketplace . technology stand understand dedication client success innovation matter trust personal responsibility relationship live strive catalyst . ibmer learn develop career encourage courageous experiment everyday whilst continuous trust support environment thrive personal professional background . growth minded stay curious open feedback learn information skill constantly transform company . trust provide feedback help grow collaborate colleague mind team focus approach include perspective drive exceptional outcome customer . courage critical decision everyday essential catalyst progress embrace challenge resource hand attitude strive outcome focus approach . ready ibmer International Business Machines International Business Machines's great invention IBMer . application intelligence reason science improve business society human condition bring power open hybrid cloud Artificial Intelligence strategy life client partner . restlessly reinvent large corporate organization big technology consult employer Fortune company rely business . pride early adopter artificial intelligence blockchain . join journey responsible technology innovator force good . location Statement sponsorship . role involve technology cover Export Regulations sanction . Foreign National follow sanction country Zaporizhia region permit eligible employment position . International Business Machines International Business Machines commit create diverse environment equal employer . qualified applicant receive consideration employment regard race color religion sex gender gender identity expression sexual orientation national origin caste genetic pregnancy age veteran status characteristic . committed compliance fair employment practice regard citizenship immigration status ."
    }
}