{
    "id": "6fa639a0b44bba90",
    "companyDescription": "",
    "description": "Job Posting: \n  Manager, Operations\n \n \n   Location: Ottawa, ON (hybrid)\n \n  \n \n \n   Where YOU work, makes a difference.\n \n \n   Life is precious and every moment matters. Dynacare is helping Canadians achieve a healthy future with care and wellness solutions that are convenient, understandable, and accessible. When you join our team, every day is an opportunity to get better and be inspired. It’s an environment where you can grow your career in any direction you choose. We’re evolving our technology and optimizing our processes, so you can do your best work, make a meaningful impact, and \n  thrive.\n \n \n   Are YOU our next Manager, Operations?\n \n \n   As a \n  Manager, Operations, you will be accountable for ensuring efficient operation of the transportation department, through effective supervision of employees assigned and develop performance standards for all supervised staff. You will also ensure employees deliver prompt and courteous service promoting a professional patient environment and maintain and develop professional relationships with existing and potential clients. Lastly, you will ensure that standards for technical efficiency, quality control and government regulations are met.\n \n \n   Why Dynacare is an amazing place for YOU:\n \n \n   Join an award-winning \"Top Employer\" with meaningful and impactful career opportunities\n   Access a health and wellness benefits program that supports you and your loved ones\n   Grow and thrive with a dynamic, successful company through internal mobility opportunities \n  Invest in your future through RRSP match benefits and an employee stock purchase program \n  Experience a collaborative, diverse workforce that prioritizes dignity and respect for all \n \n  \n \n \n  How YOU will make a difference:\n \n \n   Manage Dynacare’s logistics and transportation including onboarding new clients and customers\n   Provide information into Director’s operational plans and strategies\n   Provide managerial leadership on the ground to a team of direct reports including drivers, shipper/receivers and mailroom/distribution clerks\n   Build direct reports’ capabilities by providing training in a variety of areas including customer service and \n \n \n  provide effective change leadership to direct report team\n \n \n   Build synergies, methodologies and business solutions that will enhance business growth with support to \n  clinical and business support departments\n   Develop and execute a 3 to 12 month business plan that is in line with the organization’s objectives for \n \n \n  Dynacare’s growth and operational excellence\n \n \n   Interact with customers and clients regarding re-issues resolution\n   Build and sustain effective cross-functional relationships with Dynacare \n  Ensure business plans and deliverables of direct report positions, Couriers, Mail Distribution, Customer Service Orders and Warehouse are aligned and integrated, stratum appropriate and cascade throughout Logistics to achieve performance expectations and decided metrics\n   Strategically plan and identify for Transportation, Distribution, Warehouse and Customer Service the necessary budget requirements, the provision of Route design with GPS Technology and cycle inventory checks to position Logistics for the 21st century and the acquisition and talent pool development of optimal human resources\n   Develop and nurture a culture of safety, quality, service, performance, innovation, adaptability and fair treatment of direct reports\n   Establish and enhance the Dynacare Customer Services Orders (CSO) profile in the industry and community\n   Recommend customer service and logistics policies, standards and practices to immediate manager\n \n \n   What YOU bring to the role:\n \n \n   You understand transportation routes and how they can be manipulated for greater efficiency\n   Understand the application of WHMIS and the Transportation of Dangerous Goods Act and how it relates to daily operations\n   Advanced understanding of Warehouse and Distribution processes (including GPS and related technologies) and methodologies to drive and improve the business cycle\n   Understand Syndicated Driver and Syndicated Distribution processes and best practices (include merchandising concepts and practices)\n   Possess proven customer service/customer interaction skills and selling aptitude\n   Understand how to manage, mentor, train and coach personnel\n   Understand issues that drive the business and how to effectively support the business to enhance growth\n   Knowledge about Highway Traffic and Safety Act and how it affects a national logistics network\n   Understand logistics process systems and its benchmarking trends\n   General knowledge of medical laboratory operations\n   Valid Driver license with clean abstract\n   Experience with critical delivery systems\n   Experience in providing on-going leadership to ensure full implementation and follow through of strategic plan.\n   Proficiency in MS Office suite (Word, Excel) and other computer programs like Arc Logistics\n   Ability to schedule personnel for daily operations as well as scheduling for vacations\n   Capacity to complete and implement 3 to 12 month business plan\n   Ability to conduct saving/cost opportunity analysis and budget monitoring\n   Ability to manage multiple ongoing projects from initial solution design through implementation \n  Proficient in applying effective performance management and managerial leadership skills\n   Ability to support and collaborate with cross-functional teams within the organization for continuous improvement \n  Communicate effectively at all levels of the organization \n  Lead by example with the highest standards of ethics \n  Critical problem solver with strong negotiation skills\n \n \n \n   \n \n \n   Passionate about supporting healthy lives with commitment and care? Please apply today and let us open the door to your extended career journey.\n \n  \n \n \n   Dynacare has been a “Top Employer” for many years and there is a reason why. We are a great place to work. At Dynacare, we’re proud to hire the best people. If you are looking for a meaningful career where you can support healthy lives with commitment and care – we would like to meet you. We hope you will join us in our journey to become Canada’s health and wellness solutions leader.\n \n  Dynacare is proud to be an equal opportunity employer committed to the attraction, selection, advancement, and fair treatment of all individuals. We believe that our diversity is our strength, so we employ a diverse workforce and respect the needs of all our employees.\n  In accordance with provincial legislation and our Accommodation Policy a request for accommodation will be accepted as part of the Dynacare hiring process.",
    "preprocessed_description": "Job Posting: Manager, Operations Location: Ottawa, ON (hybrid) Where YOU work, makes a difference. Life is precious and every moment matters. Dynacare is helping Canadians achieve a healthy future with care and wellness solutions that are convenient, understandable, and accessible. When you join our team, every day is an opportunity to get better and be inspired. It's an environment where you can grow your career in any direction you choose. We're evolving our technology and optimizing our processes, so you can do your best work, make a meaningful impact, and thrive. Are YOU our next Manager, Operations? As a Manager, Operations, you will be accountable for ensuring efficient operation of the transportation department, through effective supervision of employees assigned and develop performance standards for all supervised staff. You will also ensure employees deliver prompt and courteous service promoting a professional patient environment and maintain and develop professional relationships with existing and potential clients. Lastly, you will ensure that standards for technical efficiency, quality control and government regulations are met. Why Dynacare is an amazing place for YOU: Join an award-winning \"Top Employer\" with meaningful and impactful career opportunities Access a health and wellness benefits program that supports you and your loved ones Grow and thrive with a dynamic, successful company through internal mobility opportunities Invest in your future through RRSP match benefits and an employee stock purchase program Experience a collaborative, diverse workforce that prioritizes dignity and respect for all How YOU will make a difference: Manage Dynacare's logistics and transportation including onboarding new clients and customers Provide information into Director's operational plans and strategies Provide managerial leadership on the ground to a team of direct reports including drivers, shipper/receivers and mailroom/distribution clerks Build direct reports' capabilities by providing training in a variety of areas including customer service and provide effective change leadership to direct report team Build synergies, methodologies and business solutions that will enhance business growth with support to clinical and business support departments Develop and execute a 3 to 12 month business plan that is in line with the organization's objectives for Dynacare's growth and operational excellence Interact with customers and clients regarding re-issues resolution Build and sustain effective cross-functional relationships with Dynacare Ensure business plans and deliverables of direct report positions, Couriers, Mail Distribution, Customer Service Orders and Warehouse are aligned and integrated, stratum appropriate and cascade throughout Logistics to achieve performance expectations and decided metrics Strategically plan and identify for Transportation, Distribution, Warehouse and Customer Service the necessary budget requirements, the provision of Route design with GPS Technology and cycle inventory checks to position Logistics for the 21st century and the acquisition and talent pool development of optimal human resources Develop and nurture a culture of safety, quality, service, performance, innovation, adaptability and fair treatment of direct reports Establish and enhance the Dynacare Customer Services Orders (CSO) profile in the industry and community Recommend customer service and logistics policies, standards and practices to immediate manager What YOU bring to the role: You understand transportation routes and how they can be manipulated for greater efficiency Understand the application of WHMIS and the Transportation of Dangerous Goods Act and how it relates to daily operations Advanced understanding of Warehouse and Distribution processes (including GPS and related technologies) and methodologies to drive and improve the business cycle Understand Syndicated Driver and Syndicated Distribution processes and best practices (include merchandising concepts and practices) Possess proven customer service/customer interaction skills and selling aptitude Understand how to manage, mentor, train and coach personnel Understand issues that drive the business and how to effectively support the business to enhance growth Knowledge about Highway Traffic and Safety Act and how it affects a national logistics network Understand logistics process systems and its benchmarking trends General knowledge of medical laboratory operations Valid Driver license with clean abstract Experience with critical delivery systems Experience in providing on-going leadership to ensure full implementation and follow through of strategic plan. Proficiency in MS Office suite (Word, Excel) and other computer programs like Arc Logistics Ability to schedule personnel for daily operations as well as scheduling for vacations Capacity to complete and implement 3 to 12 month business plan Ability to conduct saving/cost opportunity analysis and budget monitoring Ability to manage multiple ongoing projects from initial solution design through implementation Proficient in applying effective performance management and managerial leadership skills Ability to support and collaborate with cross-functional teams within the organization for continuous improvement Communicate effectively at all levels of the organization Lead by example with the highest standards of ethics Critical problem solver with strong negotiation skills Passionate about supporting healthy lives with commitment and care? Please apply today and let us open the door to your extended career journey. Dynacare has been a \"Top Employer\" for many years and there is a reason why. We are a great place to work. At Dynacare, we are proud to hire the best people. If you are looking for a meaningful career where you can support healthy lives with commitment and care – we would like to meet you. We hope you will join us in our journey to become Canada's health and wellness solutions leader. Dynacare is proud to be an equal opportunity employer committed to the attraction, selection, advancement, and fair treatment of all individuals. We believe that our diversity is our strength, so we employ a diverse workforce and respect the needs of all our employees. In accordance with provincial legislation and our Accommodation Policy a request for accommodation will be accepted as part of the Dynacare hiring process.",
    "processed_description": "posting Manager Operations Location hybrid difference . life precious moment matter . help achieve healthy future care wellness solution convenient understandable accessible . join team inspire . environment grow career direction choose . evolve technology optimize process good meaningful impact thrive . Manager Manager accountable ensure efficient operation effective supervision employee assign develop performance standard supervised staff . ensure employee deliver prompt courteous service promote professional patient environment maintain develop professional relationship exist potential client . lastly ensure standard technical efficiency quality control government regulation meet . amazing place join meaningful impactful career access health wellness benefit program support loved grow thrive dynamic successful company internal mobility Invest future RRSP match benefit employee stock purchase program collaborative diverse workforce prioritize dignity respect difference manage Dynacare's logistic transportation include onboarde client customer provide information Director's operational plan strategy provide managerial leadership ground team direct report include driver shipper receiver mailroom distribution clerk build direct report' capability provide training variety area include customer service provide effective change leadership direct report team build synergy methodology business solution enhance business growth support clinical business support department execute month business plan organization's objective Dynacare's growth operational excellence Interact customer client regard issues resolution build sustain effective cross functional relationship ensure business plan deliverable direct report position align integrate stratum appropriate cascade Logistics achieve performance expectation decide metric strategically plan identify budget requirement provision Route design cycle inventory check position Logistics acquisition talent pool development optimal human resource nurture culture safety quality service performance innovation adaptability fair treatment direct report enhance profile industry community recommend customer service logistic policy standard practice manager bring role understand transportation route manipulate great efficiency understand application relate daily operation advanced understanding warehouse distribution process include gps technology methodology drive improve business cycle understand Syndicated Driver syndicated distribution process good practice include merchandising concept practice possess prove customer service customer interaction skill selling aptitude understand manage mentor train coach personnel understand issue drive business effectively support business enhance growth knowledge Highway Traffic Safety affect national logistic network understand logistic process system benchmarke trend general knowledge medical laboratory operation Valid Driver license clean abstract critical delivery system provide going leadership ensure implementation follow strategic plan . proficiency MS Office suite computer program schedule personnel daily operation scheduling vacation Capacity complete implement month business plan conduct save cost analysis budget monitoring manage multiple ongoing project initial solution design implementation proficient apply effective performance management managerial leadership skill support collaborate cross functional team organization continuous improvement effectively level organization lead example high standard ethic critical problem solver strong negotiation skill passionate support healthy life commitment care apply open door extended career journey . Employer reason . great place . hire good people . meaningful career support healthy life commitment care – meet . join journey Canada's health wellness solution leader . equal employer commit attraction selection advancement fair treatment individual . diversity strength employ diverse workforce respect employee . provincial legislation Accommodation Policy request accommodation accept Dynacare hiring process .",
    "results_group": {
        "extracted_noun_chunks": [
            "national logistic network",
            "direct report' capability",
            "implementation",
            "Manager Operations Location hybrid difference",
            "cost analysis budget monitoring",
            "logistic process system benchmarke",
            "example",
            "gps technology methodology drive",
            "great efficiency",
            "standard technical efficiency quality control government regulation",
            "healthy life commitment care",
            "effective performance management managerial leadership skill support",
            "performance expectation",
            "Dynacare's logistic transportation",
            "aptitude",
            "role",
            "onboarde client customer",
            "meaningful impactful career access health wellness benefit program support",
            "professional patient environment",
            "team inspire",
            "Logistics",
            "healthy future care wellness solution",
            "budget requirement provision Route design cycle inventory check position Logistics acquisition talent pool development",
            "leadership",
            "provincial legislation Accommodation Policy request accommodation",
            "information Director's operational plan strategy",
            "prompt courteous service",
            "business cycle",
            "managerial leadership ground team direct report",
            "environment",
            "amazing place",
            "strategic plan",
            "Syndicated Driver syndicated distribution process good practice",
            "Employer reason",
            "growth knowledge Highway Traffic Safety",
            "driver shipper receiver mailroom distribution clerk",
            "merchandising concept practice possess",
            "diversity strength",
            "career direction",
            "good people",
            "effective cross functional relationship",
            "meaningful career",
            "potential client",
            "mentor train coach personnel",
            "issue drive business",
            "Dynacare hiring process",
            "technology optimize process",
            "proficiency MS Office suite computer program schedule personnel daily operation scheduling vacation Capacity complete implement month business plan conduct",
            "life precious moment matter",
            "training variety area",
            "efficient operation effective supervision employee",
            "diverse workforce respect employee",
            "dynamic successful company internal mobility Invest future RRSP match benefit employee stock purchase program collaborative diverse workforce",
            "multiple ongoing project initial solution design implementation",
            "fair treatment individual",
            "daily operation advanced understanding warehouse distribution process",
            "open door extended career journey",
            "metric strategically plan",
            "application",
            "employee",
            "Canada's health wellness solution leader",
            "strong negotiation skill passionate support healthy life commitment care",
            "effective change leadership direct report team",
            "synergy methodology business solution",
            "transportation route",
            "customer service",
            "general knowledge medical laboratory operation Valid Driver license clean abstract critical delivery system",
            "cross functional team organization continuous improvement effectively level organization",
            "performance standard supervised staff",
            "customer service logistic policy standard practice manager",
            "join journey",
            "clinical business support department",
            "good meaningful impact",
            "equal employer",
            "professional relationship",
            "attraction selection advancement",
            "great place",
            "business plan",
            "business",
            "dignity respect difference"
        ],
        "combined_lemmatized_tokens": "posting Manager Operations Location hybrid difference . life precious moment matter . help achieve healthy future care wellness solution convenient understandable accessible . join team inspire . environment grow career direction choose . evolve technology optimize process good meaningful impact thrive . Manager Manager accountable ensure efficient operation effective supervision employee assign develop performance standard supervised staff . ensure employee deliver prompt courteous service promote professional patient environment maintain develop professional relationship exist potential client . lastly ensure standard technical efficiency quality control government regulation meet . amazing place join meaningful impactful career access health wellness benefit program support loved grow thrive dynamic successful company internal mobility Invest future RRSP match benefit employee stock purchase program collaborative diverse workforce prioritize dignity respect difference manage Dynacare's logistic transportation include onboarde client customer provide information Director's operational plan strategy provide managerial leadership ground team direct report include driver shipper receiver mailroom distribution clerk build direct report' capability provide training variety area include customer service provide effective change leadership direct report team build synergy methodology business solution enhance business growth support clinical business support department execute month business plan organization's objective Dynacare's growth operational excellence Interact customer client regard issues resolution build sustain effective cross functional relationship ensure business plan deliverable direct report position align integrate stratum appropriate cascade Logistics achieve performance expectation decide metric strategically plan identify budget requirement provision Route design cycle inventory check position Logistics acquisition talent pool development optimal human resource nurture culture safety quality service performance innovation adaptability fair treatment direct report enhance profile industry community recommend customer service logistic policy standard practice manager bring role understand transportation route manipulate great efficiency understand application relate daily operation advanced understanding warehouse distribution process include gps technology methodology drive improve business cycle understand Syndicated Driver syndicated distribution process good practice include merchandising concept practice possess prove customer service customer interaction skill selling aptitude understand manage mentor train coach personnel understand issue drive business effectively support business enhance growth knowledge Highway Traffic Safety affect national logistic network understand logistic process system benchmarke trend general knowledge medical laboratory operation Valid Driver license clean abstract critical delivery system provide going leadership ensure implementation follow strategic plan . proficiency MS Office suite computer program schedule personnel daily operation scheduling vacation Capacity complete implement month business plan conduct save cost analysis budget monitoring manage multiple ongoing project initial solution design implementation proficient apply effective performance management managerial leadership skill support collaborate cross functional team organization continuous improvement effectively level organization lead example high standard ethic critical problem solver strong negotiation skill passionate support healthy life commitment care apply open door extended career journey . Employer reason . great place . hire good people . meaningful career support healthy life commitment care – meet . join journey Canada's health wellness solution leader . equal employer commit attraction selection advancement fair treatment individual . diversity strength employ diverse workforce respect employee . provincial legislation Accommodation Policy request accommodation accept Dynacare hiring process ."
    }
}