{
    "id": "5b3270a7ef3fefc8",
    "companyDescription": "",
    "description": "JOB DESCRIPTION Posting #RI-23-057\nPosting Period – 21 November to December 15, 2023\nPOSITION: Part-time Research (Student) Analyst,\nClinical Research Unit, CHEO RI\nTERM: Part-time (0.3 FTE), 1 year contract\nSALARY: $18.00-$20.00/per hour\nREPORTS TO: Director of Operations, Clinical Research Unit (CRU), CHEO ResearchInstitute (CHEO RI)\nChildren’s Hospital of Eastern Ontario Research Institute (“CHEO RI”) is the research arm of the Children’s Hospital of Eastern Ontario – Ottawa Children’s Treatment Centre (“CHEO”) and an affiliated institute of the University of Ottawa. CHEO is a beloved institution and workplace that is widely recognized for being an anchor in our community. CHEO RI works to create new knowledge and evidence to support CHEO in its provision of world-class care to our children. Our mission at CHEORI is to connect exceptional talent and technology in pursuit of life-changing research for every child, youth, and family in our community and beyond.\nCHEO RI has an immediate requirement for a Part-Time Research (Student) Analyst.\nWe are looking for a highly motivated graduate student to join our research team for an exciting contract position. The Research (Student) Analyst is responsible for providing support to our biostatisticians, epidemiologists, and methodologists to support CHEO clinicians and scientists. Insights from data will aid discoveries to inspire the best life for children and youth across a range of pediatrics research subspecialities(e.g., emergency medicine, inpatient care, neonatology, critical care, infectious disease, genetics…). Methods are equally as diverse (e.g., evidence synthesis, RCTs, observational data, health administrative data & surveys).\nRESPONSIBILITIES\nUnder the general supervision of the Director of Operations, the Research (Student) Analyst will:\n\n Collaborate with statisticians and investigators to run descriptive analyses and prepare reports.\n Meet with team members to review data completeness/accuracy, and to discuss results.\n Assist or develop systems for organizing data to analyse, identify, and report trends.\n Execute data validation programs and resolve data discrepancies.\n Write R scripts to perform data processing tasks.\n Perform other related duties as assigned by supervisor.\n\nQUALIFICATIONS, SKILL AND ABILITIES\n\n Current enrolment in a graduate program (MSc) in epidemiology, biostatistics or data science program (Essential)\n Knowledge of biostatistical methods (Essential)\n Proficient at the R programing language (Essential)\n Able to run, evaluate, and interpret statistical models (Essential)\n Ability to work independently, as work is remote (Essential)\n Excellent communication skills in English (Essential)\n Familiar with tidyverse R coding and data cleaning ninja (Preferred)\n Familiar with R markdown for reproducible research (Preferred)\n Experience with clinical or health research (e.g., GCP, ethics and privacy of patient level data, etc.) (Preferred)\n Ability to spot bias in datasets (Preferred)\n\nWORKING CONDITIONS\n\n Flexibility to work in a hybrid work model that would include both remote work and occasional on-site work.\n\nOTHER REQUIREMENTS\n\n Eligible to work in Canada;\n Compliance with CHEO RI’s Universal COVID-19 Vaccination Policy; and\n Police Record Check.\n\nTO APPLY\nPlease send a complete CV and cover letter to Angelique Blackmore via e-mail at: ClinicalResearchUnit @cheo.on.ca\nThe CHEO Research Institute values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants. Should an applicant require any accommodations during the application process, as per the Accessibility for Ontarians with Disabilities Act, please notify Human Resources at researchhr@cheo.on.ca.\nThe CHEO Research Institute seeks to increase equity, diversity and inclusion in all of its activities, including research, education and career development, patient, family and donor partnerships. We value diverse and non-traditional career paths and perspectives, and value skills such as resilience, collaboration, and relationship-building. We welcome applications from members of racialized minorities, Indigenous peoples, persons with disabilities, persons of minority sexual orientations and gender identities, and others with the skills and knowledge to productively engage with diverse communities.\nApplications will only be considered from those that are eligible to work in Canada. We thank all applicants for their interest, however, only those invited for an interview will be contacted.\nDESCRIPTION DE POSTE Publication no. IR-23-057\nPériode d’affichage – du 21 novembre au 15 décembre 2023\nPOSTE : Analyste de recherche à temps partiel (étudiant),\nUnité de recherche clinique, IR de CHEO\nDURÉE : Temps partiel (0,3 ETP), contrat de 1 an\nSALAIRE : 18,00 $ à 20,00 $/heure\nRELÈVE DE : La Directeur des opérations, Unité de recherche clinique (URC),Institut de recherche de CHEO (IR de CHEO)\nL’Institut de recherche du Centre hospitalier pour enfants de l’est de l’Ontario (« IR de CHEO ») est l’organisme de recherche du Centre de traitement pour enfants du Centre hospitalier pour enfants de l’est de l’Ontario situé à Ottawa (« CHEO ») et un institut affilié de l’Université d’Ottawa. CHEO est une institution et un milieu de travail que nous chérissons et qui est largement reconnu pour être une source de soutien dans notre collectivité. L’IR de CHEO travaille pour créer de nouvelles connaissances et trouver de nouvelles preuves pour soutenir CHEO dans sa prestation de soins de classe mondiale à nos enfants. Notre mission à l’IR de CHEO est de bâtir des ponts qui relient les talents et les technologies exceptionnels au service de la recherche qui change la vie de chaque enfant, de chaque jeune et de chaque famille de notre collectivité et au-delà.\nL’IR de CHEO a une exigence immédiate pour un analyste de recherche à temps partiel (étudiant).\nNous sommes à la recherche d’un étudiant diplômé et hautement motivé pour se joindre à notre équipe de recherche pour un poste contractuel passionnant. L’analyste de recherche (étudiant) est chargé de fournir un soutien à nos biostatisticiens, épidémiologistes et méthodologistes pour appuyer les cliniciens et les scientifiques de CHEO. Les idées provenant de données permettront de faire des découvertes qui seront des inspirations pour la meilleure vie des enfants et des jeunes dans une gamme de sous-spécialités de la recherche en pédiatrie (p. ex., médecine d’urgence, soins hospitaliers, néonatologie, soins critiques, maladies infectieuses, génétique...). Les méthodes sont tout aussi variées (p. ex. synthèse des données probantes, essais cliniques randomisés (ECR), données d’observation, données administratives sur la santé et enquêtes).\nRESPONSABILITÉS\nSous la supervision générale du directeur des opérations, l’analyste de la recherche (étudiant) :\n\n Collaborera avec des statisticiens et des chercheurs pour effectuer des analyses descriptives et préparer des rapports.\n Rencontrera les membres de l’équipe pour examiner l’exhaustivité et l’exactitude des données et discuter des résultats.\n Aidera le développement ou développera de systèmes d’organisation des données pour analyser, identifier et signaler les tendances.\n Exécutera des programmes de validation des données et résoudra les écarts de données.\n Écrira des textes de recherche pour effectuer des tâches de traitement de données.\n Effectuera d’autres tâches connexes attribuées par le superviseur.\n\nQUALIFICATIONS, COMPÉTENCES ET CAPACITÉS\n\n Une inscription actuelle à un programme d’études supérieures (MSc) en épidémiologie, en biostatistique ou en sciences des données (essentiel)\n Une connaissance des méthodes biostatistiques (essentiel)\n Une compétence dans le langage de programmation de recherche (Essentiel)\n Une capacité d’exécuter, d’évaluer et d’interpréter des modèles statistiques (Essentiel)\n Une capacité de travailler indépendamment, car le travail est à distance (essentiel)\n D’excellentes compétences en communication en anglais (essentiel)\n Une connaissance du code R et du nettoyage des données ninja (Préféré)\n Une connaissance du marquage R pour la recherche reproductible (préféré)\n Une expérience de la recherche clinique ou de la recherche en santé (p. ex. Bonnes pratiques cliniques (BPC), éthique et confidentialité des données sur le niveau de patient, etc.) (Préféré)\n Une capacité de repérer les partis pris dans les jeux de données (Préféré)\n\nCONDITIONS DE TRAVAIL\n\n La souplesse de travailler dans un modèle de travail hybride qui pourrait à la fois inclure le travail à distance et, occasionnellement, le travail sur place.\n\nAUTRES EXIGENCES\n\n L’autorisation de travailler au Canada;\n Le respect de la politique universelle de vaccination contre la COVID-19 de l’IR de CHEO ;\n La vérification du casier judiciaire.\n\nPOUR POSTULER\nVeuillez envoyer un CV complet et une lettre de motivation à Angélique Blackmore par courriel à l’adresse suivante : ClinicalResearchUnit @cheo.on.ca\nL’Institut de recherche de CHEO valorise la diversité et est un employeur qui souscrit au principe de l’égalité d’accès. Nous nous sommes engagés à fournir un environnement de travail inclusif et sans obstacle, en commençant par le processus d’embauche et nous sommes heureux de recevoir des demandes provenant de tous les candidats qualifiés. Les candidats ou les candidates qui auront besoin de mesures d’adaptation durant le processus de demande d’emploi sont priés d’envoyer un courriel aux Ressources humaines, conformément à la Loi sur l’accessibilité pour les personnes handicapées de l’Ontario, à l’adresse suivante : researchhr@cheo.on.ca.\nL’Institut de recherche de CHEO cherche à accroître l’équité, la diversité et l’inclusion dans toutes ses activités, y compris la recherche, l’éducation et l’avancement de carrière, les partenariats avec les patients, les familles\net les donateurs. Nous valorisons les parcours et les perspectives de carrière diversifiés et non traditionnels, ainsi que les compétences telles que la résilience, la collaboration et l’établissement de relations. Nous invitons les membres de minorités racisées ou de peuples autochtones, les personnes handicapées, les personnes ayant une orientation sexuelle ou une identité de genre minoritaire, et toute autre personne ayant les compétences et connaissances nécessaires à présenter leur demande, afin de s’engager de manière productive auprès de diverses communautés.\nSeules les candidatures des personnes autorisées à travailler au Canada seront prises en considération. Nous remercions tous les candidats de leur intérêt, cependant, nous ne communiquerons qu’avec ceux qui seront convoqués à une entrevue.\nJob Types: Full-time, Part-time\nSalary: $18.00-$20.00 per hour\nWork Location: Hybrid remote in Ottawa, ON K1H 8L1",
    "preprocessed_description": "JOB DESCRIPTION Posting #RI-23-057 Posting Period – 21 November to December 15, 2023 POSITION: Part-time Research (Student) Analyst, Clinical Research Unit, CHEO RI TERM: Part-time (0.3 FTE), 1 year contract SALARY: $18.00-$20.00/per hour REPORTS TO: Director of Operations, Clinical Research Unit (CRU), CHEO ResearchInstitute (CHEO RI) Children's Hospital of Eastern Ontario Research Institute (\"CHEO RI\") is the research arm of the Children's Hospital of Eastern Ontario – Ottawa Children's Treatment Centre (\"CHEO\") and an affiliated institute of the University of Ottawa. CHEO is a beloved institution and workplace that is widely recognized for being an anchor in our community. CHEO RI works to create new knowledge and evidence to support CHEO in its provision of world-class care to our children. Our mission at CHEORI is to connect exceptional talent and technology in pursuit of life-changing research for every child, youth, and family in our community and beyond. CHEO RI has an immediate requirement for a Part-Time Research (Student) Analyst. We are looking for a highly motivated graduate student to join our research team for an exciting contract position. The Research (Student) Analyst is responsible for providing support to our biostatisticians, epidemiologists, and methodologists to support CHEO clinicians and scientists. Insights from data will aid discoveries to inspire the best life for children and youth across a range of pediatrics research subspecialities(e.g., emergency medicine, inpatient care, neonatology, critical care, infectious disease, genetics…). Methods are equally as diverse (e.g., evidence synthesis, RCTs, observational data, health administrative data & surveys). RESPONSIBILITIES Under the general supervision of the Director of Operations, the Research (Student) Analyst will: Collaborate with statisticians and investigators to run descriptive analyses and prepare reports. Meet with team members to review data completeness/accuracy, and to discuss results. Assist or develop systems for organizing data to analyse, identify, and report trends. Execute data validation programs and resolve data discrepancies. Write R scripts to perform data processing tasks. Perform other related duties as assigned by supervisor. QUALIFICATIONS, SKILL AND ABILITIES Current enrolment in a graduate program (MSc) in epidemiology, biostatistics or data science program (Essential) Knowledge of biostatistical methods (Essential) Proficient at the R programing language (Essential) Able to run, evaluate, and interpret statistical models (Essential) Ability to work independently, as work is remote (Essential) Excellent communication skills in English (Essential) Familiar with tidyverse R coding and data cleaning ninja (Preferred) Familiar with R markdown for reproducible research (Preferred) Experience with clinical or health research (e.g., Good Clinical Practice, ethics and privacy of patient level data, etc.) (Preferred) Ability to spot bias in datasets (Preferred) WORKING CONDITIONS Flexibility to work in a hybrid work model that would include both remote work and occasional on-site work. OTHER REQUIREMENTS Eligible to work in Canada; Compliance with CHEO RI's Universal COVID-19 Vaccination Policy; and Police Record Check. TO APPLY Please send a complete Curriculum Vitae and cover letter to Angelique Blackmore via e-mail at: ClinicalResearchUnit @cheo.on.ca The CHEO Research Institute values diversity and is an equal opportunity employer. We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process and welcome interest from all qualified applicants. Should an applicant require any accommodations during the application process, as per the Accessibility for Ontarians with Disabilities Act, please notify Human Resources at researchhr@cheo.on.ca. The CHEO Research Institute seeks to increase equity, diversity and inclusion in all of its activities, including research, education and career development, patient, family and donor partnerships. We value diverse and non-traditional career paths and perspectives, and value skills such as resilience, collaboration, and relationship-building. We welcome applications from members of racialized minorities, Indigenous peoples, persons with disabilities, persons of minority sexual orientations and gender identities, and others with the skills and knowledge to productively engage with diverse communities. Applications will only be considered from those that are eligible to work in Canada. We thank all applicants for their interest, however, only those invited for an interview will be contacted. DESCRIPTION DE POSTE Publication no. IR-23-057 Période d'affichage – du 21 novembre au 15 décembre 2023 POSTE : Analyste de recherche à temps partiel (étudiant), Unité de recherche clinique, IR de CHEO DURÉE : Temps partiel (0,3 ETP), contrat de 1 an SALAIRE : 18,00 $ à 20,00 $/heure RELÈVE DE : La Directeur des opérations, Unité de recherche clinique (URC),Institut de recherche de CHEO (IR de CHEO) L'Institut de recherche du Centre hospitalier pour enfants de l'est de l'Ontario (« IR de CHEO ») est l'organisme de recherche du Centre de traitement pour enfants du Centre hospitalier pour enfants de l'est de l'Ontario situé à Ottawa (« CHEO ») et un institut affilié de l'Université d'Ottawa. CHEO est une institution et un milieu de travail que nous chérissons et qui est largement reconnu pour être une source de soutien dans notre collectivité. L'IR de CHEO travaille pour créer de nouvelles connaissances et trouver de nouvelles preuves pour soutenir CHEO dans sa prestation de soins de classe mondiale à nos enfants. Notre mission à l'IR de CHEO est de bâtir des ponts qui relient les talents et les technologies exceptionnels au service de la recherche qui change la vie de chaque enfant, de chaque jeune et de chaque famille de notre collectivité et au-delà. L'IR de CHEO a une exigence immédiate pour un analyste de recherche à temps partiel (étudiant). Nous sommes à la recherche d'un étudiant diplômé et hautement motivé pour se joindre à notre équipe de recherche pour un poste contractuel passionnant. L'analyste de recherche (étudiant) est chargé de fournir un soutien à nos biostatisticiens, épidémiologistes et méthodologistes pour appuyer les cliniciens et les scientifiques de CHEO. Les idées provenant de données permettront de faire des découvertes qui seront des inspirations pour la meilleure vie des enfants et des jeunes dans une gamme de sous-spécialités de la recherche en pédiatrie (p. ex., médecine d'urgence, soins hospitaliers, néonatologie, soins critiques, maladies infectieuses, génétique...). Les méthodes sont tout aussi variées (p. ex. synthèse des données probantes, essais cliniques randomisés (ECR), données d'observation, données administratives sur la santé et enquêtes). RESPONSABILITÉS Sous la supervision générale du directeur des opérations, l'analyste de la recherche (étudiant) : Collaborera avec des statisticiens et des chercheurs pour effectuer des analyses descriptives et préparer des rapports. Rencontrera les membres de l'équipe pour examiner l'exhaustivité et l'exactitude des données et discuter des résultats. Aidera le développement ou développera de systèmes d'organisation des données pour analyser, identifier et signaler les tendances. Exécutera des programmes de validation des données et résoudra les écarts de données. Écrira des textes de recherche pour effectuer des tâches de traitement de données. Effectuera d'autres tâches connexes attribuées par le superviseur. QUALIFICATIONS, COMPÉTENCES ET CAPACITÉS Une inscription actuelle à un programme d'études supérieures (MSc) en épidémiologie, en biostatistique ou en sciences des données (essentiel) Une connaissance des méthodes biostatistiques (essentiel) Une compétence dans le langage de programmation de recherche (Essentiel) Une capacité d'exécuter, d'évaluer et d'interpréter des modèles statistiques (Essentiel) Une capacité de travailler indépendamment, car le travail est à distance (essentiel) D'excellentes compétences en communication en anglais (essentiel) Une connaissance du code R et du nettoyage des données ninja (Préféré) Une connaissance du marquage R pour la recherche reproductible (préféré) Une expérience de la recherche clinique ou de la recherche en santé (p. ex. Bonnes pratiques cliniques (BPC), éthique et confidentialité des données sur le niveau de patient, etc.) (Préféré) Une capacité de repérer les partis pris dans les jeux de données (Préféré) CONDITIONS DE TRAVAIL La souplesse de travailler dans un modèle de travail hybride qui pourrait à la fois inclure le travail à distance et, occasionnellement, le travail sur place. AUTRES EXIGENCES L'autorisation de travailler au Canada; Le respect de la politique universelle de vaccination contre la COVID-19 de l'IR de CHEO ; La vérification du casier judiciaire. POUR POSTULER Veuillez envoyer un Curriculum Vitae complet et une lettre de motivation à Angélique Blackmore par courriel à l'adresse suivante : ClinicalResearchUnit @cheo.on.ca L'Institut de recherche de CHEO valorise la diversité et est un employeur qui souscrit au principe de l'égalité d'accès. Nous nous sommes engagés à fournir un environnement de travail inclusif et sans obstacle, en commençant par le processus d'embauche et nous sommes heureux de recevoir des demandes provenant de tous les candidats qualifiés. Les candidats ou les candidates qui auront besoin de mesures d'adaptation durant le processus de demande d'emploi sont priés d'envoyer un courriel aux Ressources humaines, conformément à la Loi sur l'accessibilité pour les personnes handicapées de l'Ontario, à l'adresse suivante : researchhr@cheo.on.ca. L'Institut de recherche de CHEO cherche à accroître l'équité, la diversité et l'inclusion dans toutes ses activités, y compris la recherche, l'éducation et l'avancement de carrière, les partenariats avec les patients, les familles et les donateurs. Nous valorisons les parcours et les perspectives de carrière diversifiés et non traditionnels, ainsi que les compétences telles que la résilience, la collaboration et l'établissement de relations. Nous invitons les membres de minorités racisées ou de peuples autochtones, les personnes handicapées, les personnes ayant une orientation sexuelle ou une identité de genre minoritaire, et toute autre personne ayant les compétences et connaissances nécessaires à présenter leur demande, afin de s'engager de manière productive auprès de diverses communautés. Seules les candidatures des personnes autorisées à travailler au Canada seront prises en considération. Nous remercions tous les candidats de leur intérêt, cependant, nous ne communiquerons qu'avec ceux qui seront convoqués à une entrevue. Job Types: Full-time, Part-time Salary: $18.00-$20.00 per hour Work Location: Hybrid remote in Ottawa, ON K1H 8L1",
    "processed_description": "description post Posting period – position Research Student analyst CHEO RI TERM contract SALARY hour report Director Operations CHEO RI research arm – CHEO affiliated institute . CHEO beloved institution workplace recognize anchor community . create knowledge evidence support CHEO provision class care child . mission connect exceptional talent technology pursuit life change research child youth family community . requirement Research Student analyst . highly motivated graduate student join research team exciting contract position . responsible provide support biostatistician epidemiologist methodologist support CHEO clinician scientist . insight datum aid discovery inspire good life child youth range pediatric research subspecialities e.g . emergency medicine inpatient care neonatology critical care infectious disease genetic ... . method equally diverse e.g. evidence synthesis RCTs observational data health administrative datum survey . responsibility general supervision collaborate statistician investigator descriptive analysis prepare report . meet team review data completeness accuracy discuss result . assist develop system organize datum analyse identify report trend . execute data validation program resolve data discrepancy . write script perform datum processing task . perform relate duty assign supervisor . qualification SKILL ABILITIES current enrolment graduate program MSc epidemiology biostatistic data science program essential knowledge biostatistical method essential proficient programing language essential evaluate interpret statistical model essential independently remote essential excellent communication skill essential familiar coding datum cleaning ninja preferred familiar markdown reproducible research preferred clinical health research ethic privacy patient level datum . preferred spot bias dataset preferred working condition flexibility hybrid model include remote occasional site . requirement eligible compliance . apply send cover letter mail ClinicalResearchUnit diversity equal employer . committed provide inclusive barrier free environment start hiring process interest qualified applicant . applicant require accommodation application process Accessibility Ontarians Disabilities notify . seek increase equity diversity inclusion activity include research education career development patient family donor partnership . diverse traditional career path perspective skill resilience collaboration relationship building . application racialized minority indigenous people person person minority sexual orientation gender identity skill knowledge productively engage diverse community . application consider eligible . applicant interest invite interview contact . . – etudiant IR CHEO duree Temps partiel heure RELEVE IR CHEO hospitalier pour « IR CHEO » est l'organisme recherche du Centre traitement pour enfant hospitalier pour enfant l'est l'Ontario situe « CHEO » institut affilie l'Universite d'Ottawa . CHEO est une institution milieu travail nous cherisson est largement reconnu pour . prestation soins classe mondiale enfant . Notre mission technology exceptionnel au service recherche change vie chaque enfant . une exigence pour analyste etudiant . Nous sommes etudiant diplome hautement motive pour se joindre pour . l'analyste recherche etudiant est charge fournir soutien biostatisticien epidemiologiste methodologistes pour appuyer les cliniciens les scientifiques CHEO . provenant donnees permettront faire des decouvertes seront des inspiration pour meilleure vie des enfant des jeunes dans une gamme sous specialites recherche pediatrie p. . medecine d'urgence soin hospitalier soin critique malady infectieuse genetique ... . sont tout p. . donnees d'observation donnees . supervision generale du directeur des operation etudiant pour effectuer des analyses descriptives preparer des rapport . . developpera systemes d'organisation des donnees pour analyser identifier signaler les tendance . Executera programme validation des donnees resoudra les ecart donnees . pour effectuer des tache traitement donnees . Effectuera d'autre tache connexe attribuees par superviseur . qualification COMPETENCES CAPACITES Une inscription actuelle programme d'etudes superieures MSc essentiel Une connaissance des methodes biostatistique essentiel Une competence dans langage programmation recherche Essentiel Une capacite d'executer d'evaluer d'interpreter des modele statistique Essentiel Une capacite travailler independamment car travail est distance essentiel d'excellente competence communication anglais essentiel du code du nettoyage des donnees ninja Prefere Une connaissance du marquage pour prefere Une recherche clinique recherche sante p. . Bonnes pratique clinique ethique confidentialite des donnees sur niveau patient . souplesse travailler dans travail hybride pourrait fois inclure travail distance travail sur place . autres exigence respect politique universelle vaccination contre COVID l'IR CHEO du casier judiciaire . POUR POSTULER complet une lettre motivation Angelique Blackmore par courriel l'adresse suivante ClinicalResearchUnit L'Institut recherche CHEO valorise diversite est employeur souscrit au principe l'egalite d'acces . nous nous sommes engages fournir environnement travail inclusif sans obstacle commencant par nous provenant tous les candidats qualifie . Les candidat les auront besoin mesures d'adaptation durant processus demande dthemploi sont pries d'envoyer courriel aux Ressources humaines l'adresse suivante . toutes ses activites compris l'education l'avancement carriere les partenariat avec les patient les familles les donateur . nous valorison les parcour les perspectives carriere diversifies traditionnel ainsi les competences telles resilience collaboration l'etablissement relation . nous inviton les membres minorites racisees peuple autochtone identite genre minoritaire toute autre personne ayant les competences connaissances necessaires presenter leur demande afin s'engager maniere productive aupres diverses communautes . Seules les candidature des personnes autorisees travailler seront prise consideration . nous remercion tous les candidats leur interet cependant nous ne communiquerons qu'avec ceux seront convoques une entrevue . type salary hour location hybrid remote",
    "results_group": {
        "extracted_noun_chunks": [
            "data validation program",
            "Temps partiel heure RELEVE IR",
            "interview contact",
            "Accessibility Ontarians Disabilities",
            "Director Operations",
            "qualified applicant",
            "sont tout p.",
            "Seules",
            "requirement",
            "synthesis RCTs observational data health administrative datum survey",
            "provenant",
            "research team exciting contract position",
            "mission",
            "applicant",
            "traitement",
            "nous nous sommes",
            "POUR",
            "diverses",
            "anchor community",
            "Effectuera d'autre tache connexe",
            "l'Universite d'Ottawa",
            "research education career development patient family donor partnership",
            "statistical model",
            "des rapport",
            "Executera programme validation des donnees resoudra les ecart donnees",
            "preferred spot bias dataset preferred working condition flexibility hybrid model",
            "exceptional talent technology pursuit life",
            "qualification",
            "report",
            "donateur",
            "nous valorison les parcour les perspectives",
            "enfant hospitalier pour enfant l'est l'Ontario situe « CHEO",
            "insight datum aid discovery",
            "knowledge evidence support",
            "description post Posting period",
            "analyste",
            "applicant interest",
            "candidature des personnes autorisees travailler seront prise consideration",
            "ses activites",
            "type salary hour location",
            "emergency medicine inpatient care neonatology critical care infectious disease genetic",
            "developpera systemes d'organisation des donnees",
            "afin s'engager maniere productive",
            "position Research Student analyst",
            "inclusive barrier free environment",
            "l'analyste recherche etudiant est charge fournir soutien biostatisticien epidemiologiste methodologistes",
            "nous remercion tous les candidats leur interet cependant nous ne communiquerons qu'avec ceux seront convoques",
            "Bonnes pratique clinique ethique confidentialite des donnees sur niveau patient",
            "l'education l'avancement carriere les partenariat avec les patient les familles les",
            "exigence",
            "Prefere Une connaissance",
            "data discrepancy",
            "employeur souscrit au principe l'egalite",
            "accommodation application process",
            "essential familiar coding datum cleaning ninja preferred familiar markdown reproducible research preferred clinical health research ethic privacy patient level datum",
            "e.g. evidence",
            "diverse traditional career path perspective skill resilience collaboration relationship building",
            "langage programmation",
            "datum analyse",
            "duty assign supervisor",
            "medecine d'urgence soin hospitalier soin critique malady infectieuse genetique",
            "donnees d'observation donnees .",
            "result",
            "system",
            "etudiant diplome hautement motive pour se joindre pour",
            "fournir environnement travail inclusif sans obstacle commencant par nous provenant tous les candidats qualifie",
            "supervision generale du directeur des operation etudiant pour effectuer des analyses descriptives",
            "highly motivated graduate student",
            "durant processus",
            "cover letter mail",
            "traditionnel ainsi les competences telles resilience collaboration l'etablissement relation",
            "application racialized minority indigenous people person person minority sexual orientation gender identity skill knowledge",
            "essential proficient programing language",
            "genre minoritaire toute autre personne ayant les competences connaissances",
            "remote occasional site",
            "CHEO",
            "team review data completeness accuracy",
            "courriel l'adresse suivante",
            "CHEO provision class care child",
            "etudiant IR CHEO",
            "requirement Research Student analyst",
            "application",
            "diverse community",
            "Les candidat les auront besoin mesures d'adaptation",
            "eligible compliance",
            "CHEO beloved institution workplace",
            "research child youth family community",
            "qualification SKILL ABILITIES current enrolment graduate program MSc epidemiology biostatistic data science program essential knowledge biostatistical method",
            "process interest",
            "Notre mission technology exceptionnel au service recherche change vie chaque enfant",
            "effectuer des tache traitement donnees",
            "prestation soins classe mondiale enfant",
            "gamme sous specialites",
            "write script",
            "autres exigence respect politique universelle vaccination contre",
            "affiliated institute",
            "datum processing task",
            "diversity equal employer",
            "good life child youth range pediatric research subspecialities e.g",
            "entrevue",
            "report trend",
            "institution milieu",
            "responsible provide support biostatistician epidemiologist methodologist support",
            "equity diversity inclusion activity",
            "capacite d'executer d'evaluer d'interpreter des modele statistique",
            "humaines l'adresse suivante",
            "dthemploi sont pries",
            "du marquage",
            "Nous sommes",
            "Essentiel Une capacite travailler independamment car travail est distance essentiel d'excellente competence communication anglais essentiel du code du nettoyage des donnees ninja",
            "analyser identifier signaler les tendance",
            "lettre motivation Angelique Blackmore par",
            "travail hybride",
            "seront des inspiration"
        ],
        "combined_lemmatized_tokens": "description post Posting period – position Research Student analyst CHEO RI TERM contract SALARY hour report Director Operations CHEO RI research arm – CHEO affiliated institute . CHEO beloved institution workplace recognize anchor community . create knowledge evidence support CHEO provision class care child . mission connect exceptional talent technology pursuit life change research child youth family community . requirement Research Student analyst . highly motivated graduate student join research team exciting contract position . responsible provide support biostatistician epidemiologist methodologist support CHEO clinician scientist . insight datum aid discovery inspire good life child youth range pediatric research subspecialities e.g . emergency medicine inpatient care neonatology critical care infectious disease genetic ... . method equally diverse e.g. evidence synthesis RCTs observational data health administrative datum survey . responsibility general supervision collaborate statistician investigator descriptive analysis prepare report . meet team review data completeness accuracy discuss result . assist develop system organize datum analyse identify report trend . execute data validation program resolve data discrepancy . write script perform datum processing task . perform relate duty assign supervisor . qualification SKILL ABILITIES current enrolment graduate program MSc epidemiology biostatistic data science program essential knowledge biostatistical method essential proficient programing language essential evaluate interpret statistical model essential independently remote essential excellent communication skill essential familiar coding datum cleaning ninja preferred familiar markdown reproducible research preferred clinical health research ethic privacy patient level datum . preferred spot bias dataset preferred working condition flexibility hybrid model include remote occasional site . requirement eligible compliance . apply send cover letter mail ClinicalResearchUnit diversity equal employer . committed provide inclusive barrier free environment start hiring process interest qualified applicant . applicant require accommodation application process Accessibility Ontarians Disabilities notify . seek increase equity diversity inclusion activity include research education career development patient family donor partnership . diverse traditional career path perspective skill resilience collaboration relationship building . application racialized minority indigenous people person person minority sexual orientation gender identity skill knowledge productively engage diverse community . application consider eligible . applicant interest invite interview contact . . – etudiant IR CHEO duree Temps partiel heure RELEVE IR CHEO hospitalier pour « IR CHEO » est l'organisme recherche du Centre traitement pour enfant hospitalier pour enfant l'est l'Ontario situe « CHEO » institut affilie l'Universite d'Ottawa . CHEO est une institution milieu travail nous cherisson est largement reconnu pour . prestation soins classe mondiale enfant . Notre mission technology exceptionnel au service recherche change vie chaque enfant . une exigence pour analyste etudiant . Nous sommes etudiant diplome hautement motive pour se joindre pour . l'analyste recherche etudiant est charge fournir soutien biostatisticien epidemiologiste methodologistes pour appuyer les cliniciens les scientifiques CHEO . provenant donnees permettront faire des decouvertes seront des inspiration pour meilleure vie des enfant des jeunes dans une gamme sous specialites recherche pediatrie p. . medecine d'urgence soin hospitalier soin critique malady infectieuse genetique ... . sont tout p. . donnees d'observation donnees . supervision generale du directeur des operation etudiant pour effectuer des analyses descriptives preparer des rapport . . developpera systemes d'organisation des donnees pour analyser identifier signaler les tendance . Executera programme validation des donnees resoudra les ecart donnees . pour effectuer des tache traitement donnees . Effectuera d'autre tache connexe attribuees par superviseur . qualification COMPETENCES CAPACITES Une inscription actuelle programme d'etudes superieures MSc essentiel Une connaissance des methodes biostatistique essentiel Une competence dans langage programmation recherche Essentiel Une capacite d'executer d'evaluer d'interpreter des modele statistique Essentiel Une capacite travailler independamment car travail est distance essentiel d'excellente competence communication anglais essentiel du code du nettoyage des donnees ninja Prefere Une connaissance du marquage pour prefere Une recherche clinique recherche sante p. . Bonnes pratique clinique ethique confidentialite des donnees sur niveau patient . souplesse travailler dans travail hybride pourrait fois inclure travail distance travail sur place . autres exigence respect politique universelle vaccination contre COVID l'IR CHEO du casier judiciaire . POUR POSTULER complet une lettre motivation Angelique Blackmore par courriel l'adresse suivante ClinicalResearchUnit L'Institut recherche CHEO valorise diversite est employeur souscrit au principe l'egalite d'acces . nous nous sommes engages fournir environnement travail inclusif sans obstacle commencant par nous provenant tous les candidats qualifie . Les candidat les auront besoin mesures d'adaptation durant processus demande dthemploi sont pries d'envoyer courriel aux Ressources humaines l'adresse suivante . toutes ses activites compris l'education l'avancement carriere les partenariat avec les patient les familles les donateur . nous valorison les parcour les perspectives carriere diversifies traditionnel ainsi les competences telles resilience collaboration l'etablissement relation . nous inviton les membres minorites racisees peuple autochtone identite genre minoritaire toute autre personne ayant les competences connaissances necessaires presenter leur demande afin s'engager maniere productive aupres diverses communautes . Seules les candidature des personnes autorisees travailler seront prise consideration . nous remercion tous les candidats leur interet cependant nous ne communiquerons qu'avec ceux seront convoques une entrevue . type salary hour location hybrid remote"
    }
}