{
    "id": "72d5cd8824b6e662",
    "company": "Chartered Professional Accountants of Canada",
    "positionName": "Principal, Audit and Assurance Standards (12-months contract)",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-19T05:10:40.320Z",
    "url": "https://www.indeed.ca/rc/clk?jk=72d5cd8824b6e662&from=jasx&tk=1hkikdavvii12803&bb=Z_xYV__n_sQAK0ynFsc1LuNy5w4ZKyBemFcGijByL_zDXN_oZF9pRMyfNeQawnbQPbL2khvBhMGgaEjQUlWQ5b6HCOsd67-HRG7D0YPYV-Ardt4U9kd8mg%3D%3D&xkcb=SoBh67M3FSg6uFQ22p0EbzkdCdPP&vjs=3",
    "externalApplyLink": "https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html?cid=15dadf4b-f9d2-4ab9-8274-debc4bfdaa88&ccId=19000101_000001&jobId=518438&source=IN&lang=en_CA&ittk=Z2KS1XXTXQ",
    "companyDescription": "",
    "description": "Principal, Audit and Assurance Standards [12-month Contract Position]\n    \n     About Chartered Professional Accountants of Canada\n     Chartered Professional Accountants of Canada (CPA Canada) works collaboratively with the provincial, territorial and Bermudian CPA bodies, as it represents the Canadian accounting profession, both nationally and internationally. This collaboration allows the Canadian profession to champion best practices that benefit business and society, as well as prepare its members for an ever-evolving operating environment featuring unprecedented change. Representing more than 220,000 members, CPA Canada is one of the largest national accounting bodies worldwide.\n    \n     About the opportunity\n     The Auditing and Assurance Standards Board (AASB) is an independent body created to serve the public interest by setting high-quality standards and guidance and supporting their effective application to address the evolving needs of Canadians. The AASB is actively involved in adopting international standards and developing domestic standards fit for purpose in the Canadian environment.\n     You will be a member of a highly-skilled, energetic and committed team of professionals to advise and carry out the work of the AASB. Working directly with senior professionals, you will be developing audit, sustainability, other assurance and related services standards and guidance for practitioners. This work will involve leading standard-setting projects, developing technical proposals for consideration by committees and the Board, and facilitating the Board's decision-making on issues identified.\n     You will also act as a credible and authoritative representative of the Board by consulting with a wide range of external parties to ascertain their views and share information. This work includes designing and conducting presentations, roundtables, webinars, etc.\n     The position offers the flexibility of remote work within Canada or a more traditional hybrid work option based out of any of CPA Canada's offices in Montreal, Ottawa, Toronto or Burnaby. Periodic travel may be required. The targeted base salary range for this position is $115k- 130k and is commensurate with experience.\n     What you'll do\n     You will become an integral part of a dedicated team of professionals providing support to the AASB. More specifically, you will:\n    \n      Act in the public interest to identify issues, explore alternatives and propose solutions\n      Work within a globally-respected due process rooted in consultation and consensus-building\n      Manage assigned projects by developing project plans, facilitating meetings and leading or supporting communication and risk mitigation strategies\n      Conduct research to support proposals; present results and recommendations to drive decisions\n      Prepare reports, presentations, dashboards and other material for internal and external use, ensuring complex topics are communicated in plain language\n      Interact with colleagues, volunteers and others to achieve collaborative outcomes\n      Establish and nurture senior-level contacts with various groups and international standard setters\n    \n    \n     What we're looking for\n     The ideal candidate possesses the following skills, interests and experience:\n    \n      CPA designation\n      5 years of professional experience with a background in Audit and Assurance\n      In-depth knowledge and application of auditing and assurance standards, including assurance outside of the historical financial statements\n      Passion for the technical aspects of standards development, including adherence to the principles of consultation, transparency and accountability\n      Solutions-oriented approach driven by research, analysis and critical reasoning; ability to collaborate with senior management to spot opportunities, manage risks and develop proposals\n      Ability to work both autonomously or collaboratively across departmental functions as needed\n      Strong supervisory and interpersonal skills, including the ability to listen effectively, respect divergent views, maintain flexibility and work with key individuals at all levels of management\n      Client service mindset with a proven ability to assess and resolve issues creatively; comfortable presenting ideas, facilitating plans and building consensus\n      Genuine pride in workmanship; ability to manage and be accountable for complex projects with unwavering attention to integrity, deadlines and quality\n      Solid verbal and written skills with an emphasis on clear, concise and effective communication\n      Advanced proficiency in MS Office 365, including Excel, Word, PowerPoint\n      Bilingual fluency in English and French would be preferred\n    \n    \n     What it's like to work here\n     CPA Canada is an inclusive place to work with a diverse workforce and a commitment to health and wellness for its employees. Should you require accommodation during the recruitment process, please contact careers@cpacanada.ca. The organization offers a flexible and balanced environment that allows individuals to maximize professional and personal development. CPA Canada employs over 400 people, with its headquarters in Toronto and regional offices in Burnaby, Ottawa and Montreal. Our technology-enabled culture is designed to attract qualified people and enable them to do their best work. Employee perks include competitive salaries and pension, a comprehensive benefits package, professional development programs, flexible working hours and opportunities to work from home, regular social events and a successful employee volunteer program. CPA Canada is dedicated to continual improvement and building a high-performing, innovative organization that creates value for members and other stakeholders.\n    \n     Organization values  We create a collaborative and constructive culture by:  • Acting with Integrity • Fostering Excellence • Respecting Others • Working Collaboratively • Being Accountable\n     CPA Canada is committed to cultivating an inclusive, accessible environment, where each employee feels respected, valued and supported. All qualified individuals may apply online. If you require a disability-related accommodation to participate in our recruitment process, please note this in your application. We'll be happy to work with you to meet your needs."
}