{
    "id": "4fdbaf3da79f707a",
    "companyDescription": "We want to help you do what you do best. At CBI Health, our extensive national network is here to help you increase your local impact. By joining our care team, you’ll receive the independence and experienced support structure you need to provide life-changing care for your clients and their families. And while you do that, our team of over 13,000 healthcare professionals has your back!\r\n\r\nFor millions of Canadians, CBI Health is where better begins. We are Canada’s leading community healthcare provider, reliably delivering innovative Rehabilitation and Home Health care programs that help our clients achieve their health goals. With 250+ locations in more than 800 communities, people are at the heart of what we do. Every day, all across the country, our team members work together to make a meaningful difference in our clients’ lives and help shape healthcare for the better. \r\nLearn more about CBI Health.\r\n\r\nCompany Mission/Culture\r\nPeople are at the heart of what we do. Together, we serve local clients and communities by delivering nationally supported Rehabilitation and Home Health services. We also serve every member of our team by helping them achieve their health career goals through meaningful work and impactful outcomes.\r\n\r\nOur Purpose, Promise, and Values are what inform and guide this mission. These essential elements are at the heart of the decisions we make, the programs we implement, and the strategies we develop. Across the country, the CBI Health team is committed to delivering on Our Purpose, keeping Our Promise, and living Our Values in every community we serve.\r\n\r\nOur Purpose: The health and well-being of Canadians is at the heart of what we do. Every day, we make a meaningful difference in people’s lives by supporting them in achieving their goals. Together, we shape healthcare for the better. \r\n\r\nOur Promise: For our clients, we promise to always:  \r\nTreat you with dignity, respect and kindness \r\nUnderstand you, your goals and what matters most \r\nEngage, motivate, and inspire you on your health journey \r\nBring together our knowledge, expertise and experience to deliver the best care \r\nEarn and appreciate the trust you place in us \r\n\r\nOur Values:\r\nHeart – We are passionate about making a positive difference \r\nRespect – We accept and value everyone \r\nReliability – We do what we say we will do \r\nTeamwork – We work well together and support each other \r\nInnovation – We are committed to learning, improving and growing.\r\n \r\nLearn more about the CBI Health culture.\r\n\r\nDiversity Programs and Initiatives: CBI Health continually strives to be an inclusive organization and create a respectful work environment where everyone feels included and valued. Diversity in our workplace allows us to share and implement different perspectives, which we believe inevitably leads to better internal and external outcomes. Accepting and valuing everyone, part of Our Values, ensures that the CBI Health culture is strong, enhances the well-being of all team members, and allows us to effectively work together to fulfill Our Purpose: shaping healthcare for the better. \r\n\r\nOur employee-led Diversity, Equity and Inclusion (DEI) Committee is now in its third year running and continues to make great progress in developing meaningful initiatives to help team members feel safe and accepted as their authentic selves. Creating impactful new DEI initiatives and enhancing existing initiatives will remain a CBI Health priority moving forward.\r\n\r\nAwards: CBI Health is proud to be a national leader in the field of community healthcare. We are regularly recognized for our exemplary Rehabilitation and Home Health expertise, as well as our commitment to industry-recognized organizational best practices. ",
    "description": "Clinical Talent Ambassador – Community Rehabilitation Services, ON \n  CBI Health is Canada’s leading community healthcare provider, and our passionate team is at the heart of what we do. Every day, our 13,000 staff make a meaningful difference in our clients’ lives as we live the core values that define us: heart, respect, reliability, teamwork and innovation. Along with mentoring and continuous learning opportunities to help advance your career, we are building a culture of inspiration, recognition and celebration for the meaningful work our team does every day, all across the country. Join CBI Health and find where your better begins. \n  About this opportunity \n  As Canada’s largest provider of integrated community healthcare services, CBI Health is dedicated to improving the health and enriching the lives of Canadians. What sets us apart is our ability to work as a unified network dedicated to the ongoing learning that allows us to foster best practices, improve access to care and create better results for our clients. \n  With a dotted line to the National Manager, Clinical Talent Ambassador, the Clinical Talent Ambassador will work very closely with the regional talent acquisition team and the Director of Clinical Services across Community Rehabilitation Services to identify and attract top clinical talent for the province. You will play a key role in helping the talent acquisition team fill priority roles by leveraging social media, your network - including university contacts, and other tools to engage, connect, and secure talent in this increasingly competitive talent landscape. \n  This job post will be closed at 4:00 PM on Wednesday, January 31, 2024. Please ensure you submit your application prior to this deadline. \n  Take an inside look at what you’ll do each day \n  \n  Collaborate with the talent acquisition team lead and Regional Directors/Managers to develop and refine talent acquisition strategies aligned to provincial talent priorities  \n  Support the recruitment of various clinical professionals throughout the recruitment lifecycle  \n  Play a key role in attracting talent to CBI Health – promote roles on social media (ie LinkedIn, Facebook, Twitter, Instagram, etc.) and other platforms to engage and connect with clinicians  \n  Leverage your network, the networks of your peers and LinkedIn Recruiter (which provides access to the global network) to source and tap into broader talent pools  \n  Be the first point of contact for key talent and promote CBI Health as an employer of choice by promoting key differentiators  \n  Participate in/or support the interview process, as required  \n  Build and maintain a pipeline of candidates for priority roles – Stay connected with key candidates and keep them engaged for future roles  \n  Support the talent acquisition team at campus/virtual/networking events and/or information sessions to champion CBI Health as the best place to start a clinical career in healthcare  \n  Provide regular reporting and updates to all appropriate stakeholders  \n  Be an ambassador and champion for CBI Health whenever the opportunity presents itself  \n \n What you need to be successful \n  \n  Passion for rehab services and a keen interest in attracting talent to CBI Health  \n  Ability to articulate CBI Health’s vision and employee value proposition  \n  Knowledge and understanding of the different clinical experiences at CBI Health for different disciplines  \n  Experience using LinkedIn (regular platform), sharing stories form a clinical perspective and using other social media tools  \n  Strong interpersonal skills – the ability to network in person and online  \n  A collaborative approach – a strong team player  \n  Proven organization, communication and presentation skills  \n  A superior focus on the details, proactive and tech savvy approach  \n  Excellent knowledge of all Microsoft products  \n \n What CBI Health offers you \n  \n  Continuous learning and skills development, including management opportunities  \n  Training and mentoring from a national network of experts  \n  Competitive compensation with comprehensive benefits and rewards package, including group health, dental and vision benefits, paid 100% by the employer  \n  Flexible hours, which allow work-life balance and focus on quality of life  \n \n About us \n  For millions of Canadians, CBI Health is where better begins. We are Canada’s leading community healthcare provider, reliably delivering innovative rehabilitation and home care programs that help our clients achieve their health goals. With 250+ locations and supporting more than 800 communities, people are at the heart of what we do. Every day, all across the country, our 13,000 staff work together to make a meaningful difference in our clients’ lives and help shape healthcare for the better. Learn more at cbihealth.ca. \n  CBI Health is proud to be recognized by Deloitte as one of Canada’s Best Managed Companies for the 15th year in a row. A huge thank you to all our team members, whose dedication, passion, and innovation have enabled us to achieve this recognition year after year. \n  CBI Health is committed to providing a diverse, equitable, and inclusive workplace where everyone feels safe and accepted as their authentic selves. We actively seek qualified candidates who share our commitment to equity and inclusion and contribute to the diversification of ideas and perspectives that help us innovate and provide the best possible care to our clients. \n  We welcome applications from all individuals regardless of race, colour, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or any other characteristics that make each of us different.",
    "preprocessed_description": "Clinical Talent Ambassador – Community Rehabilitation Services, ON CBI Health is Canada's leading community healthcare provider, and our passionate team is at the heart of what we do. Every day, our 13,000 staff make a meaningful difference in our clients' lives as we live the core values that define us: heart, respect, reliability, teamwork and innovation. Along with mentoring and continuous learning opportunities to help advance your career, we are building a culture of inspiration, recognition and celebration for the meaningful work our team does every day, all across the country. Join CBI Health and find where your better begins. About this opportunity As Canada's largest provider of integrated community healthcare services, CBI Health is dedicated to improving the health and enriching the lives of Canadians. What sets us apart is our ability to work as a unified network dedicated to the ongoing learning that allows us to foster best practices, improve access to care and create better results for our clients. With a dotted line to the National Manager, Clinical Talent Ambassador, the Clinical Talent Ambassador will work very closely with the regional talent acquisition team and the Director of Clinical Services across Community Rehabilitation Services to identify and attract top clinical talent for the province. You will play a key role in helping the talent acquisition team fill priority roles by leveraging social media, your network - including university contacts, and other tools to engage, connect, and secure talent in this increasingly competitive talent landscape. This job post will be closed at 4:00 Project Manager on Wednesday, January 31, 2024. Please ensure you submit your application prior to this deadline. Take an inside look at what you will do each day Collaborate with the talent acquisition team lead and Regional Directors/Managers to develop and refine talent acquisition strategies aligned to provincial talent priorities Support the recruitment of various clinical professionals throughout the recruitment lifecycle Play a key role in attracting talent to CBI Health – promote roles on social media (ie LinkedIn, Facebook, Twitter, Instagram, etc.) and other platforms to engage and connect with clinicians Leverage your network, the networks of your peers and LinkedIn Recruiter (which provides access to the global network) to source and tap into broader talent pools Be the first point of contact for key talent and promote CBI Health as an employer of choice by promoting key differentiators Participate in/or support the interview process, as required Build and maintain a pipeline of candidates for priority roles – Stay connected with key candidates and keep them engaged for future roles Support the talent acquisition team at campus/virtual/networking events and/or information sessions to champion CBI Health as the best place to start a clinical career in healthcare Provide regular reporting and updates to all appropriate stakeholders Be an ambassador and champion for CBI Health whenever the opportunity presents itself What you need to be successful Passion for rehab services and a keen interest in attracting talent to CBI Health Ability to articulate CBI Health's vision and employee value proposition Knowledge and understanding of the different clinical experiences at CBI Health for different disciplines Experience using LinkedIn (regular platform), sharing stories form a clinical perspective and using other social media tools Strong interpersonal skills – the ability to network in person and online A collaborative approach – a strong team player Proven organization, communication and presentation skills A superior focus on the details, proactive and tech savvy approach Excellent knowledge of all Microsoft products What CBI Health offers you Continuous learning and skills development, including management opportunities Training and mentoring from a national network of experts Competitive compensation with comprehensive benefits and rewards package, including group health, dental and vision benefits, paid 100% by the employer Flexible hours, which allow work-life balance and focus on quality of life About us For millions of Canadians, CBI Health is where better begins. We are Canada's leading community healthcare provider, reliably delivering innovative rehabilitation and home care programs that help our clients achieve their health goals. With 250+ locations and supporting more than 800 communities, people are at the heart of what we do. Every day, all across the country, our 13,000 staff work together to make a meaningful difference in our clients' lives and help shape healthcare for the better. Learn more at cbihealth.ca. CBI Health is proud to be recognized by Deloitte as one of Canada's Best Managed Companies for the 15th year in a row. A huge thank you to all our team members, whose dedication, passion, and innovation have enabled us to achieve this recognition year after year. CBI Health is committed to providing a diverse, equitable, and inclusive workplace where everyone feels safe and accepted as their authentic selves. We actively seek qualified candidates who share our commitment to equity and inclusion and contribute to the diversification of ideas and perspectives that help us innovate and provide the best possible care to our clients. We welcome applications from all individuals regardless of race, colour, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or any other characteristics that make each of us different.",
    "processed_description": "Clinical Talent Ambassador – Canada's lead community healthcare provider passionate team heart . staff meaningful difference client' life live core define heart respect reliability teamwork innovation . mentoring continuous learning help advance career build culture inspiration recognition celebration meaningful team country . join CBI Health find . Canada's large provider integrate community healthcare service dedicate improve health enrich life . set apart unified network dedicate ongoing learning allow foster good practice improve access care create result client . dotted National Manager Clinical Talent Ambassador Clinical Talent Ambassador closely regional talent acquisition team identify attract clinical talent province . play key role help talent acquisition team fill priority role leverage social medium network include university contact tool engage connect secure talent increasingly competitive talent landscape . post close Project Manager . ensure submit application prior deadline . inside collaborate talent acquisition team lead develop refine talent acquisition strategy align provincial talent priority support recruitment clinical professional recruitment lifecycle play key role attract talent – promote role social medium . platform engage connect clinician leverage network network peer provide access global network source tap broad talent pool point contact key talent promote employer choice promote key differentiator participate support interview process require Build maintain pipeline priority role – stay connected key engaged future role support talent acquisition team campus virtual networking event information session champion good place start clinical career provide regular reporting update appropriate stakeholder ambassador champion successful passion rehab service keen interest attract talent articulate CBI Health's vision employee proposition knowledge understanding clinical discipline LinkedIn regular platform share story form clinical perspective social medium tool strong interpersonal skill – network person online collaborative approach – strong team player Proven organization communication presentation skill superior focus detail proactive tech savvy approach excellent knowledge Microsoft product offer continuous learning skill development include management training mentor national network expert Competitive compensation comprehensive benefit reward package include group health dental vision benefit pay employer allow life balance focus quality life . Canada's lead community healthcare provider reliably deliver innovative rehabilitation care program help client achieve health goal . + location support community people heart . country staff meaningful difference client' life help shape healthcare . learn . recognize . huge team dedication passion innovation enable achieve recognition . commit provide diverse equitable inclusive workplace feel safe accept authentic . actively seek qualified share commitment equity inclusion contribute diversification idea perspective help innovate provide good care client . application individual race colour religion gender gender identity expression sexual orientation national origin genetic age veteran status characteristic .",
    "results_group": {
        "extracted_noun_chunks": [
            "quality life",
            "talent acquisition strategy",
            "access care create result client",
            "diverse equitable inclusive workplace",
            "diversification idea perspective help",
            "healthcare",
            "life",
            "clinical career",
            "strong team player Proven organization communication presentation skill superior focus detail proactive tech savvy approach excellent knowledge",
            "prior deadline",
            "key differentiator participate support interview process",
            "heart respect reliability teamwork innovation",
            "Canada's lead community healthcare provider",
            "Canada's lead community healthcare provider passionate team heart",
            "pipeline priority role",
            "unified network",
            "health goal",
            "employer choice",
            "priority role leverage social medium network",
            "clinical discipline LinkedIn regular platform share story",
            "advance career",
            "location support community people",
            "close Project Manager",
            "collaborate",
            "access global network source",
            "provincial talent priority support recruitment clinical professional recruitment lifecycle",
            "CBI Health find",
            "country staff meaningful difference client' life help",
            "clinical talent province",
            "appropriate stakeholder ambassador champion successful passion rehab service",
            "connected key engaged future role support talent acquisition team campus virtual networking event information session champion good place",
            "good care client",
            "role social medium",
            "life balance",
            "management training mentor national network expert Competitive compensation comprehensive benefit reward package",
            "regular reporting update",
            "foster good practice",
            "ongoing learning",
            "clinician leverage network network peer",
            "Canada's large provider",
            "Clinical Talent Ambassador",
            "form clinical perspective social medium tool strong interpersonal skill",
            "group health dental vision benefit pay employer",
            "increasingly competitive talent landscape",
            "National Manager Clinical Talent Ambassador Clinical Talent Ambassador closely regional talent acquisition team",
            "network person",
            "staff meaningful difference client' life live core",
            "recognition",
            "Build",
            "application individual race colour religion gender gender identity expression sexual orientation national origin",
            "key role",
            "qualified share commitment equity inclusion",
            "key talent",
            "secure talent",
            "Microsoft product",
            "innovative rehabilitation care program help client",
            "university contact tool",
            "continuous learning skill development",
            "application",
            "talent",
            "huge team dedication passion innovation",
            "online collaborative approach",
            "keen interest",
            "platform",
            "talent acquisition team",
            "community healthcare service dedicate",
            "CBI Health's vision employee proposition knowledge"
        ],
        "combined_lemmatized_tokens": "Clinical Talent Ambassador – Canada's lead community healthcare provider passionate team heart . staff meaningful difference client' life live core define heart respect reliability teamwork innovation . mentoring continuous learning help advance career build culture inspiration recognition celebration meaningful team country . join CBI Health find . Canada's large provider integrate community healthcare service dedicate improve health enrich life . set apart unified network dedicate ongoing learning allow foster good practice improve access care create result client . dotted National Manager Clinical Talent Ambassador Clinical Talent Ambassador closely regional talent acquisition team identify attract clinical talent province . play key role help talent acquisition team fill priority role leverage social medium network include university contact tool engage connect secure talent increasingly competitive talent landscape . post close Project Manager . ensure submit application prior deadline . inside collaborate talent acquisition team lead develop refine talent acquisition strategy align provincial talent priority support recruitment clinical professional recruitment lifecycle play key role attract talent – promote role social medium . platform engage connect clinician leverage network network peer provide access global network source tap broad talent pool point contact key talent promote employer choice promote key differentiator participate support interview process require Build maintain pipeline priority role – stay connected key engaged future role support talent acquisition team campus virtual networking event information session champion good place start clinical career provide regular reporting update appropriate stakeholder ambassador champion successful passion rehab service keen interest attract talent articulate CBI Health's vision employee proposition knowledge understanding clinical discipline LinkedIn regular platform share story form clinical perspective social medium tool strong interpersonal skill – network person online collaborative approach – strong team player Proven organization communication presentation skill superior focus detail proactive tech savvy approach excellent knowledge Microsoft product offer continuous learning skill development include management training mentor national network expert Competitive compensation comprehensive benefit reward package include group health dental vision benefit pay employer allow life balance focus quality life . Canada's lead community healthcare provider reliably deliver innovative rehabilitation care program help client achieve health goal . + location support community people heart . country staff meaningful difference client' life help shape healthcare . learn . recognize . huge team dedication passion innovation enable achieve recognition . commit provide diverse equitable inclusive workplace feel safe accept authentic . actively seek qualified share commitment equity inclusion contribute diversification idea perspective help innovate provide good care client . application individual race colour religion gender gender identity expression sexual orientation national origin genetic age veteran status characteristic ."
    }
}