{
    "id": "61cdc3dd7f3f5b49",
    "companyDescription": "",
    "description": "Requisition ID: 10419 Department: Public Works Dept. Service: Solid Waste Services Branch: Solid Waste Program Planning Branch Employment Type: 1 Full-time Temporary - Up to 1 year Work Hours: 35.00 hours per week Affiliation: CIPP Salary Information: $87,068.80 - $105,951.30 annually (20XX rates of pay) Salary Information: $47.840 - $58.215 per hour (20XX rates of pay) Location: Trail Waste Fac, 4475 Trail Road City: Ottawa, ON Job Category: Administrative and Support Services Application Close: 07/11/2023 \n       \n        \n         \n           JOB SUMMARY \n         \n         \n           The Project Manager, Environmental Program will be instrumental in supporting the planning, development, implementation, evaluation and enhancement of the City's long-term Solid Waste plans and related policies, programs, services and projects that will guide the management of recyclables and garbage over the next thirty years. \n          The incumbent is responsible for designing, budgeting, implementing and managing projects/initiatives that will enable achievement of departmental and City solid waste objectives, leads and motivates project team to successful delivery of projects, and manages consultants to assist with project delivery. \n         \n        \n        \n         \n           EDUCATION AND EXPERIENCE \n         \n         \n           Completion of 4 year degree in Environmental Science (Biology, Chemistry, Earth Sciences, and Physical Geography), Public or Business Administration, Civil or Environmental Engineering, or related field \n          Minimum of 5 years of related experience in supporting operational, strategic and business planning, and in managing/evaluating projects relating to program development and related initiatives, within a public works or utility environment. Experience should include conducting research/analysis, interacting with the general public and environmental regulators, and managing external consultants. \n         \n        \n        \n         \n           KNOWLEDGE \n         \n         \n          \n           Structure and processes of municipal government, including inter-governmental stakeholders \n           General knowledge relating to wastewater collection and treatment and bio-solids management; water production distribution and conservation; solid waste, surface and ground water protection and management, energy and air quality management \n           Applicable legislation, policies, regulations, guidelines and operational procedures relevant to the operational area, such as the Environmental Protection Act, Ontario Water Resources Act, the Environmental Assessment Act, Green Energy Act, Nutrient Management Act \n           Communication and consultation approaches \n           Facilitation and negotiation processes \n           Quality Management systems \n           Research methodologies, data collection and analyses \n           Principles of project management \n           Contract management tools and procedures \n           Program and project evaluation and performance measurement processes \n           Knowledge of applicable health and safety legislation, including the rights and duties of workers \n          \n         \n        \n        \n         \n          COMPETENCIES, SKILLS AND ABILITIES \n         \n         \n          \n           Work independently, with minimal direction, and collaboratively with all staff as part of a team \n           Able to identify and analyze problems and manage multi-disciplinary assignments \n           Able to provide leadership to plan, lead, coordinate, implement and manage projects to completion, provide functional supervision to others, and to manage work quality, scheduling and completion \n           Possess organizational skills and flexibility to plan, initiate, organize and prioritize own work, to manage a high volume of projects and to deal effectively with multiple demands, conflicting priorities, pressures and deadlines \n           Able to use primary and secondary research techniques to perform data analysis, to evaluate existing and proposed processes, materials, equipment and operational practices, make judgments on the interpretation of issues/data, and formulate recommendations \n           Able to manage contracted work, and foster good working relationships with a variety of stakeholders in order to achieve Branch objectives \n           Possess computer literacy in applications such as MS Office Suite, Powerpoint, database management, and Project tracking \n           Possess excellent consultative, collaboration and interpersonal skills, and the ability to manage confrontational situations, persuade/influence others and to bring conflicting points of view to consensus \n           Possess strong documentation, report writing and presentation skills \n           Demonstrate leadership and initiative \n           Able to foster and maintain positive relationships with a variety of stakeholders \n           Flexible and adaptable \n           Possess diplomacy, discretion and tact \n           Client service oriented \n           Able to demonstrate sound judgement and decision-making capabilities \n           \n         \n        \n       \n       WHAT YOU NEED TO KNOW \n       \n        Language Requirement: English oral, reading, writing \n        Driver’s License Requirement: This position requires the successful candidate to use their own transportation. \n        Experience and formal training combined with demonstrated performance and ability may substitute for stipulated academic requirements. \n        Please save a copy of the job poster. Once the closing date has passed, it will no longer be available.\n       \n        \n        \n       We wish to thank all applicants for their interest and effort in applying for this position. Only candidates selected for interviews will be contacted.\n        \n        \n       The City of Ottawa promotes the principles of diversity and inclusion and adheres to the tenets of the Canadian Human Rights Act and the Ontario Human Rights Code. We encourage applications from members of Indigenous, Black and other racialized communities, persons with disabilities, women and non-binary persons, persons of all ethnic origins, religions, sexual orientations, classes, gender identities and expressions. Candidates are encouraged to self-identify as a member of one or more designated employment equity groups in the self-identification questionnaire.\n        \n        \n       The City of Ottawa provides accommodation during all parts of the hiring process, upon request, to applicants with disabilities. If contacted to proceed to the selection process, please advise us if you require any accommodation.\n        \n        \n       Accessible formats and communication supports are available upon request. Please contact the HR Service Centre at 613-580-2424, extension 47411.",
    "preprocessed_description": "Requisition ID: 10419 Department: Public Works Dept. Service: Solid Waste Services Branch: Solid Waste Program Planning Branch Employment Type: 1 Full-time Temporary - Up to 1 year Work Hours: 35.00 hours per week Affiliation: CIPP Salary Information: $87,068.80 - $105,951.30 annually (20XX rates of pay) Salary Information: $47.840 - $58.215 per hour (20XX rates of pay) Location: Trail Waste Fac, 4475 Trail Road City: Ottawa, ON Job Category: Administrative and Support Services Application Close: 07/11/2023 JOB SUMMARY The Project Manager, Environmental Program will be instrumental in supporting the planning, development, implementation, evaluation and enhancement of the City's long-term Solid Waste plans and related policies, programs, services and projects that will guide the management of recyclables and garbage over the next thirty years. The incumbent is responsible for designing, budgeting, implementing and managing projects/initiatives that will enable achievement of departmental and City solid waste objectives, leads and motivates project team to successful delivery of projects, and manages consultants to assist with project delivery. EDUCATION AND EXPERIENCE Completion of 4 year degree in Environmental Science (Biology, Chemistry, Earth Sciences, and Physical Geography), Public or Business Administration, Civil or Environmental Engineering, or related field Minimum of 5 years of related experience in supporting operational, strategic and business planning, and in managing/evaluating projects relating to program development and related initiatives, within a public works or utility environment. Experience should include conducting research/analysis, interacting with the general public and environmental regulators, and managing external consultants. KNOWLEDGE Structure and processes of municipal government, including inter-governmental stakeholders General knowledge relating to wastewater collection and treatment and bio-solids management; water production distribution and conservation; solid waste, surface and ground water protection and management, energy and air quality management Applicable legislation, policies, regulations, guidelines and operational procedures relevant to the operational area, such as the Environmental Protection Act, Ontario Water Resources Act, the Environmental Assessment Act, Green Energy Act, Nutrient Management Act Communication and consultation approaches Facilitation and negotiation processes Quality Management systems Research methodologies, data collection and analyses Principles of project management Contract management tools and procedures Program and project evaluation and performance measurement processes Knowledge of applicable health and safety legislation, including the rights and duties of workers COMPETENCIES, SKILLS AND ABILITIES Work independently, with minimal direction, and collaboratively with all staff as part of a team Able to identify and analyze problems and manage multi-disciplinary assignments Able to provide leadership to plan, lead, coordinate, implement and manage projects to completion, provide functional supervision to others, and to manage work quality, scheduling and completion Possess organizational skills and flexibility to plan, initiate, organize and prioritize own work, to manage a high volume of projects and to deal effectively with multiple demands, conflicting priorities, pressures and deadlines Able to use primary and secondary research techniques to perform data analysis, to evaluate existing and proposed processes, materials, equipment and operational practices, make judgments on the interpretation of issues/data, and formulate recommendations Able to manage contracted work, and foster good working relationships with a variety of stakeholders in order to achieve Branch objectives Possess computer literacy in applications such as MS Office Suite, Powerpoint, database management, and Project tracking Possess excellent consultative, collaboration and interpersonal skills, and the ability to manage confrontational situations, persuade/influence others and to bring conflicting points of view to consensus Possess strong documentation, report writing and presentation skills Demonstrate leadership and initiative Able to foster and maintain positive relationships with a variety of stakeholders Flexible and adaptable Possess diplomacy, discretion and tact Client service oriented Able to demonstrate sound judgement and decision-making capabilities WHAT YOU NEED TO KNOW Language Requirement: English oral, reading, writing Driver's License Requirement: This position requires the successful candidate to use their own transportation. Experience and formal training combined with demonstrated performance and ability may substitute for stipulated academic requirements. Please save a copy of the job poster. Once the closing date has passed, it will no longer be available. We wish to thank all applicants for their interest and effort in applying for this position. Only candidates selected for interviews will be contacted. The City of Ottawa promotes the principles of diversity and inclusion and adheres to the tenets of the Canadian Human Rights Act and the Ontario Human Rights Code. We encourage applications from members of Indigenous, Black and other racialized communities, persons with disabilities, women and non-binary persons, persons of all ethnic origins, religions, sexual orientations, classes, gender identities and expressions. Candidates are encouraged to self-identify as a member of one or more designated employment equity groups in the self-identification questionnaire. The City of Ottawa provides accommodation during all parts of the hiring process, upon request, to applicants with disabilities. If contacted to proceed to the selection process, please advise us if you require any accommodation. Accessible formats and communication supports are available upon request. Please contact the Human Resources Service Centre at 613-580-2424, extension 47411.",
    "processed_description": "requisition department Public Works Dept . service Solid Waste Services Branch Solid Waste Program Planning Branch Employment Type temporary hour week Affiliation CIPP Salary information annually 20xx rate pay Salary information hour 20xx rate pay location Trail Waste Fac close summary Project Manager instrumental support planning development implementation evaluation enhancement City's long term Solid Waste plan policy program service project guide management recyclable garbage . incumbent responsible designing budgeting implement manage project initiative enable achievement departmental City solid waste objective lead motivate project team successful delivery project manage consultant assist project delivery . education completion degree Civil Environmental Engineering field Minimum support operational strategic business planning manage evaluating project relate program development initiative public utility environment . include conduct research analysis interact general public environmental regulator manage external consultant . KNOWLEDGE Structure process municipal government include inter governmental stakeholder general knowledge relate wastewater collection treatment bio solid management water production distribution conservation solid waste surface ground water protection management energy air quality management Applicable legislation policy regulation guideline operational procedure relevant operational area Water Resources consultation approach negotiation process Quality Management systems Research methodology data collection analysis principle project management Contract management tool procedure Program project evaluation performance measurement process knowledge applicable health safety legislation include duty worker competency skill ABILITIES independently minimal direction collaboratively staff team identify analyze problem manage multi disciplinary assignment provide leadership plan lead coordinate implement manage project completion provide functional supervision manage quality scheduling completion possess organizational skill flexibility plan initiate organize prioritize manage high volume project deal effectively multiple demand conflicting priority pressure deadline primary secondary research technique perform data analysis evaluate exist propose process material equipment operational practice judgment interpretation issue datum formulate recommendation manage contract foster good relationship variety stakeholder order achieve computer literacy application database management excellent consultative collaboration interpersonal skill manage confrontational situation persuade influence bring conflicting point view consensus possess strong documentation report writing presentation skill demonstrate leadership initiative foster maintain positive relationship variety stakeholder flexible adaptable possess diplomacy discretion tact Client service orient demonstrate sound judgement decision capability Language Requirement english oral reading write position require successful transportation . formal training combine demonstrate performance substitute stipulate academic requirement . save copy poster . closing pass long . applicant interest effort apply position . select interview contact . promote principle diversity inclusion adhere tenet . encourage application Indigenous Black racialized community person woman binary person person ethnic origin religion sexual orientation class gender identity expression . encourage identify designate employment equity group identification questionnaire . provide accommodation hiring process request applicant . contact proceed selection process advise require accommodation . accessible format communication support request . contact extension .",
    "results_group": {
        "extracted_noun_chunks": [
            "multiple demand",
            "incumbent responsible designing budgeting implement manage project initiative",
            "conflicting priority pressure deadline primary secondary research technique",
            "City's long term",
            "tenet",
            "duty worker competency skill ABILITIES",
            "position",
            "influence",
            "designate employment equity group identification questionnaire",
            "achievement departmental City solid waste objective lead",
            "selection process",
            "general public environmental regulator",
            "leadership plan",
            "exist propose process material equipment operational practice judgment interpretation issue datum formulate recommendation manage contract foster good relationship variety stakeholder order",
            "Solid Waste plan policy program service project",
            "computer literacy application database management excellent consultative collaboration interpersonal skill",
            "multi disciplinary assignment",
            "Affiliation",
            "functional supervision",
            "formal training combine",
            "organizational skill flexibility plan",
            "quality scheduling completion",
            "applicant interest effort",
            "coordinate implement manage project completion",
            "ethnic origin",
            "accessible format communication support request",
            "relevant operational area",
            "successful transportation",
            "program development initiative public utility environment",
            "select interview contact",
            "KNOWLEDGE Structure process municipal government",
            "project delivery",
            "confrontational situation",
            "leadership initiative foster",
            "conflicting point view consensus",
            "copy poster",
            "applicant",
            "sound judgement decision capability Language Requirement english oral reading write position",
            "external consultant",
            "Salary information hour 20xx",
            "academic requirement",
            "accommodation",
            "Solid Waste Services Branch Solid Waste Program Planning Branch Employment Type",
            "problem",
            "consultant",
            "requisition department Public Works Dept",
            "Water Resources consultation approach negotiation process",
            "closing pass",
            "research analysis",
            "project team successful delivery project",
            "contact",
            "strong documentation report",
            "data analysis",
            "positive relationship variety stakeholder",
            "high volume project deal",
            "independently minimal direction collaboratively staff team",
            "presentation skill",
            "performance substitute",
            "inter governmental stakeholder general knowledge",
            "principle diversity inclusion",
            "contact extension",
            "project",
            "education completion degree Civil Environmental Engineering field Minimum support"
        ],
        "combined_lemmatized_tokens": "requisition department Public Works Dept . service Solid Waste Services Branch Solid Waste Program Planning Branch Employment Type temporary hour week Affiliation CIPP Salary information annually 20xx rate pay Salary information hour 20xx rate pay location Trail Waste Fac close summary Project Manager instrumental support planning development implementation evaluation enhancement City's long term Solid Waste plan policy program service project guide management recyclable garbage . incumbent responsible designing budgeting implement manage project initiative enable achievement departmental City solid waste objective lead motivate project team successful delivery project manage consultant assist project delivery . education completion degree Civil Environmental Engineering field Minimum support operational strategic business planning manage evaluating project relate program development initiative public utility environment . include conduct research analysis interact general public environmental regulator manage external consultant . KNOWLEDGE Structure process municipal government include inter governmental stakeholder general knowledge relate wastewater collection treatment bio solid management water production distribution conservation solid waste surface ground water protection management energy air quality management Applicable legislation policy regulation guideline operational procedure relevant operational area Water Resources consultation approach negotiation process Quality Management systems Research methodology data collection analysis principle project management Contract management tool procedure Program project evaluation performance measurement process knowledge applicable health safety legislation include duty worker competency skill ABILITIES independently minimal direction collaboratively staff team identify analyze problem manage multi disciplinary assignment provide leadership plan lead coordinate implement manage project completion provide functional supervision manage quality scheduling completion possess organizational skill flexibility plan initiate organize prioritize manage high volume project deal effectively multiple demand conflicting priority pressure deadline primary secondary research technique perform data analysis evaluate exist propose process material equipment operational practice judgment interpretation issue datum formulate recommendation manage contract foster good relationship variety stakeholder order achieve computer literacy application database management excellent consultative collaboration interpersonal skill manage confrontational situation persuade influence bring conflicting point view consensus possess strong documentation report writing presentation skill demonstrate leadership initiative foster maintain positive relationship variety stakeholder flexible adaptable possess diplomacy discretion tact Client service orient demonstrate sound judgement decision capability Language Requirement english oral reading write position require successful transportation . formal training combine demonstrate performance substitute stipulate academic requirement . save copy poster . closing pass long . applicant interest effort apply position . select interview contact . promote principle diversity inclusion adhere tenet . encourage application Indigenous Black racialized community person woman binary person person ethnic origin religion sexual orientation class gender identity expression . encourage identify designate employment equity group identification questionnaire . provide accommodation hiring process request applicant . contact proceed selection process advise require accommodation . accessible format communication support request . contact extension ."
    }
}