{
    "id": "545216d947beb5a5",
    "company": "Bath & Body Works",
    "positionName": "Sales Associate-ST-LAURENT SHOPPING CENTRE",
    "jobType": [
        "Part-time"
    ],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-08T03:09:59.672Z",
    "url": "https://www.indeed.ca/rc/clk?jk=545216d947beb5a5&from=jasx&tk=1hjm3501uhbi2800&vjs=3",
    "externalApplyLink": "https://ca.indeed.com/applystart?jk=545216d947beb5a5&from=vj&pos=top&mvj=0&spon=0&sjdu=o7sfz71MPdMgyiV0LZq0d4DDplm6SwWjHcxyoDIphKkb2wby-fSqoHLVOpQwhlAvkz4JtaHgw2MzIq8alvrICG7nUoMl5m7N-39T7ScaDnoQB2jYo7TNtLYA4KyAJltbdx6clGiwLalwO3yvfQv_WSMRv1zoEo_WPL-XBk7QS7QpIOL9qgvmLnIAAj5iHEBCw9_XINGINv7OnqX9-Wv1cg&vjfrom=serp&log=1&astse=804932638e6a087f&assa=9001",
    "companyDescription": "",
    "description": "Brand: Bath & Body Works Location: Ottawa, ON, CA Location Type: On-site Job ID: 041QF Job Area: Store: Sales and Support Associate Employment type: Part-time \n \n \n \n  Description \n  \n   At Bath & Body Works, everyone belongs. We are committed to creating a diverse, equitable and inclusive culture focused on delivering exceptional fragrances and experiences to our customers. We focus on recruiting, retaining, and advancing diverse talent where our associate population is as diverse as the communities we serve, live and work. In addition, we work to improve our communities and our planet in a way that will make us proud for years to come because we believe the world is a brighter, happier place when everyone has access to the things that make them happy. \n   We invite you to join Gingham Nation, where we invest in our associates through competitive compensation, benefits, and development opportunities, so they can continue to be their best at work, at home, and in their communities. \n   We’re looking for you to join our team as a sales associate. In this role, you will be the face of Bath & Body Works — understanding our customers’ needs and helping them find the best products for themselves and others. Our associates are dedicated to delivering exceptional and consistent customer experiences that positively impact sales growth in their store, and contribute to a positive, high-energy environment.. \n   Responsibilities \n   \n    Deliver exceptional in-store shopping experiences \n    Build a highly satisfied and loyal customer base through engagement, uncovering needs, making product recommendations, and gathering customer information to support continued engagement \n    Support product replenishment activities that keep the store full and abundant \n    Assist with floorset execution, window changes, visual presentation and marketing placement as needed \n    Maintain our values, policies and procedures \n   \n  \n  Qualifications \n  Qualifications & Experience \n  \n   Thrives in a customer first based retail environment. \n   Demonstrated sales and customer service results in a fast-paced environment \n   Availability for varied weekly shifts including weekend, closing and peak periods \n   Effective communication skills, being open to feedback and the ability to adapt quickly \n  \n  Core Competencies \n  \n   Lead with Curiosity & Humility \n   Build High Performing Teams for Today & Tomorrow \n   Influence & Inspire with Vision & Purpose \n   Observe, Engage & Connect \n   Strive to Achieve Operational Excellence \n   Deliver Business Results \n  \n  The above statements are intended to describe the general nature and level of work being performed by people assigned to this job. They are not intended to be an exhaustive list of all responsibilities, duties and skills required. \n  We will accommodate applicants and associates with disabilities in the recruitment, selection and assessment process as appropriate and as required by applicable law. Please call 855-556-2675 or email applicantaccomodation@bbw.com if you require an accommodation. \n  We are an equal opportunity and affirmative action employer. We do not make employment decisions based on an individual’s race, color, religion, gender, gender identity, national origin, citizenship, age, disability, sexual orientation, marital status, pregnancy, genetic information, protected veteran status or any other legally protected status, and we comply with all laws concerning nondiscriminatory employment practices. We are committed to providing reasonable accommodations for associates and job applicants with disabilities. Our management team is dedicated to ensuring fulfillment of this policy with respect to recruitment, hiring, placement, promotion, transfer, training, compensation, benefits, associate activities and general treatment during employment. We only hire individuals authorized for employment in Canada."
}