{
    "id": "da0a73bbb15f94d3",
    "company": "The Anglican Diocese of Ottawa",
    "positionName": "Social Support Worker",
    "jobType": [
        "Permanent",
        "Full-time"
    ],
    "location": "The Anglican Diocese of Ottawa in Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-04T03:14:07.378Z",
    "url": "https://www.indeed.ca/rc/clk?jk=da0a73bbb15f94d3&from=jasx&tk=1hjm3csar2cja000&vjs=3",
    "externalApplyLink": null,
    "companyDescription": "",
    "description": "Background\nWe are seeking passionate and dedicated Social Support Workers to join our team as we expand our services. Belong Ottawa offers up to four weeks of vacation time, competitive pension plan, and group benefits!\nThis year, three Anglican Day Programs (The Well, St Luke’s Table and Centre 454) officially consolidated into one Anglican Community Ministry named Belong Ottawa.\nOur new name and new logo are the result of a collaborative effort with staff and participants. Collectively, we chose a new name and logo showing a bold new look and three coloured arches that exemplify the Day Programs, and capture our mission to be an inclusive, safe, and nurturing community for all.\nMission Statement\nBelong Ottawa offers support to homeless and vulnerably housed people to ensure health and well-being, nourishment, and social connection. Our programs promote equity and address barriers such as housing, food and income insecurity. Everyone who comes to our agencies will be given the opportunity to have their individual needs addressed through a variety of services unique to each program and space. Our mission is to provide safe spaces that connect people and create a community in which we foster dignity, wellness and hope for all.\nJob Summary\nThe Social Support Worker reports to the Program Manager and is the front-line support to the participants of Belong Ottawa. They are involved in all aspects of the daily operations and will participate in organizing social and other programming.\nThe Social Support Worker assists participants as required to meet their basic needs and work toward their goals. Programs are evaluated, and refined, on an ongoing basis in order to meet the needs of the participants.\nThe Social Support Worker is also involved in monitoring program goals and reporting on the outcomes of services as required by the Program Manager. Each of the day programs offer programs and services unique to their community needs.\nThe daily routine work requires minimal to moderate physical exertion. However, there may be instances that may arise that will require moderate to high physical exertion.\nSocial Support Workers may be called upon for outreach services in the local community. Belong Ottawa provides street outreach, enabling us to reach a larger demographic, including assisting individuals living with disabilities. Street outreach includes, but is not limited to, providing social support, personal hygiene supplies, referring individuals to our programs, networking with other agencies and making referrals to other community resources. Street outreach requires long periods of mobility within each community sector. The needs of each community are unique and as such we will support our communities to the best of our ability based on what each agency is able to offer.\nDuties and Responsibilities\n\n Ensure that a safe and supportive environment is maintained at the Centre.\n Assist in the planning and supervision of recreational activities.\n Assist during mealtimes.\n Encourage participants to be engaged in activities and daily tasks related to the program.\n Provide information, assistance, and advocacy to participants in accordance with the policies and procedures of each social service drop-in centre.\n Provide support and to the volunteers at each drop-in centre.\n Advise and mentor academic students, as directed by the Team Leader.\n Make referrals to other agencies and community resources as required.\n Ensure that each Centre is secured upon closing each day.\n Ensure that emergency and critical participant incident management plans are affected appropriately.\n Work collaboratively with the other staff on site, including the Program Administrator, other Program Support Workers, the Food Services Coordinator, ODSP Application Assistants, Social Support workers.\n Support the Program Manager in the administration and operational responsibilities of the organization as required.\n\nJob Requirements and Qualifications\n\n Post-secondary education in the social sciences, social work or equivalent experience and education.\n A client-centered and non-judgmental approach.\n A demonstrated flexible approach with the ability to problem solve.\n Understanding issues related to poverty, homelessness, addictions, mental illness and a strong motivation to support people to achieve their potential.\n Strong interpersonal and communication skills.\n Ability to maintain professionalism in stressful situations.\n Ability to work in a demanding and busy environment.\n Experience working with people from marginalized communities and diverse populations.\n Experience working with people who have experienced homelessness.\n Excellent knowledge of community resources and social services in Ottawa.\n Harm reduction training such as Naloxone and safe needle handling/disposal.\n Non-Violent Crisis Intervention Training.\n First Aid, CPR, AED training.\n Bilingualism, English/French, is preferred and additional languages would be an asset.\n Moderate computer skills (ie: basic use of MS office).\n Vulnerable Sector Police Record Check is required\n\nWork Schedule\nEvening and weekends availability is required. Full-time over five days a week.\nSubmitting your application\nDon't just apply for a job, apply for a cause! Click on \"Apply for This Job\" and submit your application by January 31st, 2024. We'll be reviewing applications as they come in, so don't delay!\nWhile all applications will be gratefully received, only individuals selected for further consideration will be contacted. The Anglican Diocese of Ottawa reserves the right to contact individuals and to arrange for interviews at any time.\nOur organization is committed to creating a diverse environment and is proud to be an equal-opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, age, veteran status, or disability. We will accommodate the needs of applicants under the Ontario Human Rights Code and the Accessibility for Ontarians with Disabilities Act (AODA). Please advise during the search process if you require accommodation by contacting us at hr@ottawa.anglican.ca\nJob Types: Full-time, Permanent\nSalary: From $22.44 per hour\nBenefits:\n\n Company pension\n Dental care\n Employee assistance program\n Extended health care\n Life insurance\n Paid time off\n\nSchedule:\n\n Day shift\n Evening shift\n Monday to Friday\n Weekends as needed\n\nWork Location: In person"
}