{
    "id": "da0a73bbb15f94d3",
    "companyDescription": "",
    "description": "Background\nWe are seeking passionate and dedicated Social Support Workers to join our team as we expand our services. Belong Ottawa offers up to four weeks of vacation time, competitive pension plan, and group benefits!\nThis year, three Anglican Day Programs (The Well, St Luke’s Table and Centre 454) officially consolidated into one Anglican Community Ministry named Belong Ottawa.\nOur new name and new logo are the result of a collaborative effort with staff and participants. Collectively, we chose a new name and logo showing a bold new look and three coloured arches that exemplify the Day Programs, and capture our mission to be an inclusive, safe, and nurturing community for all.\nMission Statement\nBelong Ottawa offers support to homeless and vulnerably housed people to ensure health and well-being, nourishment, and social connection. Our programs promote equity and address barriers such as housing, food and income insecurity. Everyone who comes to our agencies will be given the opportunity to have their individual needs addressed through a variety of services unique to each program and space. Our mission is to provide safe spaces that connect people and create a community in which we foster dignity, wellness and hope for all.\nJob Summary\nThe Social Support Worker reports to the Program Manager and is the front-line support to the participants of Belong Ottawa. They are involved in all aspects of the daily operations and will participate in organizing social and other programming.\nThe Social Support Worker assists participants as required to meet their basic needs and work toward their goals. Programs are evaluated, and refined, on an ongoing basis in order to meet the needs of the participants.\nThe Social Support Worker is also involved in monitoring program goals and reporting on the outcomes of services as required by the Program Manager. Each of the day programs offer programs and services unique to their community needs.\nThe daily routine work requires minimal to moderate physical exertion. However, there may be instances that may arise that will require moderate to high physical exertion.\nSocial Support Workers may be called upon for outreach services in the local community. Belong Ottawa provides street outreach, enabling us to reach a larger demographic, including assisting individuals living with disabilities. Street outreach includes, but is not limited to, providing social support, personal hygiene supplies, referring individuals to our programs, networking with other agencies and making referrals to other community resources. Street outreach requires long periods of mobility within each community sector. The needs of each community are unique and as such we will support our communities to the best of our ability based on what each agency is able to offer.\nDuties and Responsibilities\n\n Ensure that a safe and supportive environment is maintained at the Centre.\n Assist in the planning and supervision of recreational activities.\n Assist during mealtimes.\n Encourage participants to be engaged in activities and daily tasks related to the program.\n Provide information, assistance, and advocacy to participants in accordance with the policies and procedures of each social service drop-in centre.\n Provide support and to the volunteers at each drop-in centre.\n Advise and mentor academic students, as directed by the Team Leader.\n Make referrals to other agencies and community resources as required.\n Ensure that each Centre is secured upon closing each day.\n Ensure that emergency and critical participant incident management plans are affected appropriately.\n Work collaboratively with the other staff on site, including the Program Administrator, other Program Support Workers, the Food Services Coordinator, ODSP Application Assistants, Social Support workers.\n Support the Program Manager in the administration and operational responsibilities of the organization as required.\n\nJob Requirements and Qualifications\n\n Post-secondary education in the social sciences, social work or equivalent experience and education.\n A client-centered and non-judgmental approach.\n A demonstrated flexible approach with the ability to problem solve.\n Understanding issues related to poverty, homelessness, addictions, mental illness and a strong motivation to support people to achieve their potential.\n Strong interpersonal and communication skills.\n Ability to maintain professionalism in stressful situations.\n Ability to work in a demanding and busy environment.\n Experience working with people from marginalized communities and diverse populations.\n Experience working with people who have experienced homelessness.\n Excellent knowledge of community resources and social services in Ottawa.\n Harm reduction training such as Naloxone and safe needle handling/disposal.\n Non-Violent Crisis Intervention Training.\n First Aid, CPR, AED training.\n Bilingualism, English/French, is preferred and additional languages would be an asset.\n Moderate computer skills (ie: basic use of MS office).\n Vulnerable Sector Police Record Check is required\n\nWork Schedule\nEvening and weekends availability is required. Full-time over five days a week.\nSubmitting your application\nDon't just apply for a job, apply for a cause! Click on \"Apply for This Job\" and submit your application by January 31st, 2024. We'll be reviewing applications as they come in, so don't delay!\nWhile all applications will be gratefully received, only individuals selected for further consideration will be contacted. The Anglican Diocese of Ottawa reserves the right to contact individuals and to arrange for interviews at any time.\nOur organization is committed to creating a diverse environment and is proud to be an equal-opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, age, veteran status, or disability. We will accommodate the needs of applicants under the Ontario Human Rights Code and the Accessibility for Ontarians with Disabilities Act (AODA). Please advise during the search process if you require accommodation by contacting us at hr@ottawa.anglican.ca\nJob Types: Full-time, Permanent\nSalary: From $22.44 per hour\nBenefits:\n\n Company pension\n Dental care\n Employee assistance program\n Extended health care\n Life insurance\n Paid time off\n\nSchedule:\n\n Day shift\n Evening shift\n Monday to Friday\n Weekends as needed\n\nWork Location: In person",
    "preprocessed_description": "Background We are seeking passionate and dedicated Social Support Workers to join our team as we expand our services. Belong Ottawa offers up to four weeks of vacation time, competitive pension plan, and group benefits! This year, three Anglican Day Programs (The Well, St Luke's Table and Centre 454) officially consolidated into one Anglican Community Ministry named Belong Ottawa. Our new name and new logo are the result of a collaborative effort with staff and participants. Collectively, we chose a new name and logo showing a bold new look and three coloured arches that exemplify the Day Programs, and capture our mission to be an inclusive, safe, and nurturing community for all. Mission Statement Belong Ottawa offers support to homeless and vulnerably housed people to ensure health and well-being, nourishment, and social connection. Our programs promote equity and address barriers such as housing, food and income insecurity. Everyone who comes to our agencies will be given the opportunity to have their individual needs addressed through a variety of services unique to each program and space. Our mission is to provide safe spaces that connect people and create a community in which we foster dignity, wellness and hope for all. Job Summary The Social Support Worker reports to the Program Manager and is the front-line support to the participants of Belong Ottawa. They are involved in all aspects of the daily operations and will participate in organizing social and other programming. The Social Support Worker assists participants as required to meet their basic needs and work toward their goals. Programs are evaluated, and refined, on an ongoing basis in order to meet the needs of the participants. The Social Support Worker is also involved in monitoring program goals and reporting on the outcomes of services as required by the Program Manager. Each of the day programs offer programs and services unique to their community needs. The daily routine work requires minimal to moderate physical exertion. However, there may be instances that may arise that will require moderate to high physical exertion. Social Support Workers may be called upon for outreach services in the local community. Belong Ottawa provides street outreach, enabling us to reach a larger demographic, including assisting individuals living with disabilities. Street outreach includes, but is not limited to, providing social support, personal hygiene supplies, referring individuals to our programs, networking with other agencies and making referrals to other community resources. Street outreach requires long periods of mobility within each community sector. The needs of each community are unique and as such we will support our communities to the best of our ability based on what each agency is able to offer. Duties and Responsibilities Ensure that a safe and supportive environment is maintained at the Centre. Assist in the planning and supervision of recreational activities. Assist during mealtimes. Encourage participants to be engaged in activities and daily tasks related to the program. Provide information, assistance, and advocacy to participants in accordance with the policies and procedures of each social service drop-in centre. Provide support and to the volunteers at each drop-in centre. Advise and mentor academic students, as directed by the Team Leader. Make referrals to other agencies and community resources as required. Ensure that each Centre is secured upon closing each day. Ensure that emergency and critical participant incident management plans are affected appropriately. Work collaboratively with the other staff on site, including the Program Administrator, other Program Support Workers, the Food Services Coordinator, ODSP Application Assistants, Social Support workers. Support the Program Manager in the administration and operational responsibilities of the organization as required. Job Requirements and Qualifications Post-secondary education in the social sciences, social work or equivalent experience and education. A client-centered and non-judgmental approach. A demonstrated flexible approach with the ability to problem solve. Understanding issues related to poverty, homelessness, addictions, mental illness and a strong motivation to support people to achieve their potential. Strong interpersonal and communication skills. Ability to maintain professionalism in stressful situations. Ability to work in a demanding and busy environment. Experience working with people from marginalized communities and diverse populations. Experience working with people who have experienced homelessness. Excellent knowledge of community resources and social services in Ottawa. Harm reduction training such as Naloxone and safe needle handling/disposal. Non-Violent Crisis Intervention Training. First Aid, CPR, AED training. Bilingualism, English/French, is preferred and additional languages would be an asset. Moderate computer skills (ie: basic use of MS office). Vulnerable Sector Police Record Check is required Work Schedule Evening and weekends availability is required. Full-time over five days a week. Submitting your application Don't just apply for a job, apply for a cause! Click on \"Apply for This Job\" and submit your application by January 31st, 2024. We'll be reviewing applications as they come in, so do not delay! While all applications will be gratefully received, only individuals selected for further consideration will be contacted. The Anglican Diocese of Ottawa reserves the right to contact individuals and to arrange for interviews at any time. Our organization is committed to creating a diverse environment and is proud to be an equal-opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, age, veteran status, or disability. We will accommodate the needs of applicants under the Ontario Human Rights Code and the Accessibility for Ontarians with Disabilities Act (AODA). Please advise during the search process if you require accommodation by contacting us at hr@ottawa.anglican.ca Job Types: Full-time, Permanent Salary: From $22.44 per hour Benefits: Company pension Dental care Employee assistance program Extended health care Life insurance Paid time off Schedule: Day shift Evening shift Monday to Friday Weekends as needed Work Location: In person",
    "processed_description": "background seek join team expand service . belong offer vacation competitive pension plan group benefit anglican Programs St Luke's Table Centre officially consolidate . logo result collaborative effort staff participant . collectively choose logo bold coloured arch exemplify Programs capture mission inclusive safe nurture community . mission statement offer support homeless vulnerably house people ensure health nourishment social connection . program promote equity address barrier housing food income insecurity . agency individual address variety service unique program space . mission provide safe space connect people create community foster dignity wellness . summary Social Support Worker report Program Manager support participant . involve aspect daily operation participate organize social programming . assist participant require meet basic goal . program evaluate refine ongoing basis order meet participant . involve monitor program goal reporting outcome service require Program Manager . program offer program service unique community . daily routine require minimal moderate physical exertion . instance require moderate high physical exertion . outreach service local community . belong provide street outreach enable reach large demographic include assist individual live . Street outreach include limit provide social support personal hygiene supply refer individual program network agency referral community resource . street outreach require long period mobility community sector . community unique support community good base agency offer . duty Responsibilities ensure safe supportive environment maintain assist planning supervision recreational activity . assist mealtime . encourage participant engage activity daily task relate program . provide information assistance advocacy participant policy procedure social service drop centre . provide support volunteer drop centre . advise mentor academic student direct Team Leader . referral agency community resource require . ensure Centre secure close . ensure emergency critical participant incident management plan affect appropriately . collaboratively staff site include Program Administrator Food Services Coordinator Social Support worker . support Program Manager administration operational responsibility organization require . Requirements Qualifications Post secondary education social science social equivalent education . client center judgmental approach . demonstrate flexible approach problem solve . understand issue relate poverty homelessness addiction mental illness strong motivation support people achieve potential . strong interpersonal communication skill . maintain professionalism stressful situation . demanding busy environment . people marginalize community diverse population . people homelessness . excellent knowledge community resource social service . harm reduction training safe needle handling disposal . . CPR AED training . Bilingualism prefer additional language asset . moderate computer skill basic MS office . vulnerable Sector Police Record check require weekend availability require . week . submit application apply apply click apply submit application . review application delay application gratefully receive individual select consideration contact . reserve contact individual arrange interview . organization commit create diverse environment equal employer . qualified applicant receive consideration employment regard race color religion gender gender identity expression sexual orientation national origin genetic age veteran status . accommodate applicant AODA . advise search process require accommodation contact type permanent salary hour benefit company pension Dental care Employee assistance program extended health care life insurance Paid schedule shift evening shift location person",
    "results_group": {
        "extracted_noun_chunks": [
            "support volunteer drop centre",
            "vacation competitive pension plan group",
            "review application delay application",
            "potential",
            "application apply",
            "supervision recreational activity",
            "accommodation contact type permanent salary hour benefit company pension Dental care Employee assistance program",
            "Program Manager",
            "issue",
            "qualified applicant",
            "limit",
            "community diverse population",
            "mentor academic student direct Team Leader",
            "support",
            "ongoing basis order",
            "safe supportive environment",
            "applicant AODA",
            "collaborative effort staff participant",
            "minimal moderate physical exertion",
            "mission",
            "flexible approach problem",
            "community unique support community good base agency offer",
            "homeless vulnerably house people",
            "street outreach",
            "professionalism stressful situation",
            "social programming",
            "CPR AED training",
            "outcome service",
            "activity",
            "background",
            "Program Manager administration operational responsibility organization",
            "community foster dignity wellness",
            "logo",
            "agency individual address variety service unique program space",
            "diverse environment equal employer",
            "organization commit",
            "safe space",
            "busy environment",
            "mental illness strong motivation support",
            "poverty homelessness addiction",
            "basic MS office",
            "duty Responsibilities",
            "health nourishment social connection",
            "reserve contact individual arrange interview",
            "Centre",
            "mealtime",
            "referral agency community resource",
            "moderate computer skill",
            "social support personal hygiene supply",
            "Programs",
            "Bilingualism",
            "Requirements Qualifications Post secondary education social science social equivalent education",
            "consideration employment regard race color religion gender gender identity expression",
            "join team",
            "basic goal",
            "Social Support Worker report Program Manager support participant",
            "sexual orientation national origin",
            "daily task",
            "health care life insurance Paid schedule shift evening shift location person",
            "instance",
            "collaboratively staff site",
            "excellent knowledge community resource social service",
            "people",
            "individual program network agency referral community resource",
            "weekend availability require",
            "individual select consideration contact",
            "moderate high physical exertion",
            "equity address barrier housing food income insecurity",
            "submit application",
            "aspect",
            "additional language asset",
            "participant",
            "Program Administrator Food Services Coordinator Social Support worker",
            "daily routine",
            "program service",
            "service",
            "emergency critical participant incident management plan",
            "click",
            "mission inclusive safe nurture community",
            "mission statement",
            "individual live",
            "program goal",
            "logo bold coloured arch",
            "Street outreach",
            "program",
            "Programs St Luke's Table Centre",
            "safe needle handling disposal",
            "genetic age veteran status",
            "daily operation participate",
            "search process",
            "strong interpersonal communication skill",
            "week",
            "vulnerable Sector Police Record check",
            "outreach service local community",
            "information assistance advocacy participant policy procedure social service drop centre",
            "client center judgmental approach",
            "long period mobility community sector"
        ],
        "combined_lemmatized_tokens": "background seek join team expand service . belong offer vacation competitive pension plan group benefit anglican Programs St Luke's Table Centre officially consolidate . logo result collaborative effort staff participant . collectively choose logo bold coloured arch exemplify Programs capture mission inclusive safe nurture community . mission statement offer support homeless vulnerably house people ensure health nourishment social connection . program promote equity address barrier housing food income insecurity . agency individual address variety service unique program space . mission provide safe space connect people create community foster dignity wellness . summary Social Support Worker report Program Manager support participant . involve aspect daily operation participate organize social programming . assist participant require meet basic goal . program evaluate refine ongoing basis order meet participant . involve monitor program goal reporting outcome service require Program Manager . program offer program service unique community . daily routine require minimal moderate physical exertion . instance require moderate high physical exertion . outreach service local community . belong provide street outreach enable reach large demographic include assist individual live . Street outreach include limit provide social support personal hygiene supply refer individual program network agency referral community resource . street outreach require long period mobility community sector . community unique support community good base agency offer . duty Responsibilities ensure safe supportive environment maintain assist planning supervision recreational activity . assist mealtime . encourage participant engage activity daily task relate program . provide information assistance advocacy participant policy procedure social service drop centre . provide support volunteer drop centre . advise mentor academic student direct Team Leader . referral agency community resource require . ensure Centre secure close . ensure emergency critical participant incident management plan affect appropriately . collaboratively staff site include Program Administrator Food Services Coordinator Social Support worker . support Program Manager administration operational responsibility organization require . Requirements Qualifications Post secondary education social science social equivalent education . client center judgmental approach . demonstrate flexible approach problem solve . understand issue relate poverty homelessness addiction mental illness strong motivation support people achieve potential . strong interpersonal communication skill . maintain professionalism stressful situation . demanding busy environment . people marginalize community diverse population . people homelessness . excellent knowledge community resource social service . harm reduction training safe needle handling disposal . . CPR AED training . Bilingualism prefer additional language asset . moderate computer skill basic MS office . vulnerable Sector Police Record check require weekend availability require . week . submit application apply apply click apply submit application . review application delay application gratefully receive individual select consideration contact . reserve contact individual arrange interview . organization commit create diverse environment equal employer . qualified applicant receive consideration employment regard race color religion gender gender identity expression sexual orientation national origin genetic age veteran status . accommodate applicant AODA . advise search process require accommodation contact type permanent salary hour benefit company pension Dental care Employee assistance program extended health care life insurance Paid schedule shift evening shift location person"
    }
}