{
    "id": "5ae132584c6c1e14",
    "companyDescription": "",
    "description": "Canada  \n     \n     \n      \n       \n        \n         \n          Join us in creating the technology that helps the world act together\n          \n         \n        \n         \n          We are a B2B technology innovation leader pioneering the future where networks meet cloud. At Nokia you will have a positive impact on people’s lives and help build the capabilities needed for a more productive, sustainable, and accessible world.\n         \n          \n          Be part of a culture built on an inclusive way of working where we are open to your ideas, you are empowered to take risks and are encouraged to be fearless in bringing your authentic self to work. \n         \n        \n         \n          The team you'll be part of\n          \n         \n        \n         \n          The pandemic has highlighted how important telecoms networks are to society. Nokia’s Network Infrastructure group is at the heart of a revolution to bring more and faster network capacity to people worldwide through our ambition, innovation, and technical expertise.\n          \n         \n         \n         \n          We need talented software developers to further the tremendous success of the Service Router product family (including the 7950, 7750, and 7250). We are #2 in carrier edge routing worldwide, with over a million platforms shipped to over 1000+ customers in 130+ countries. We lead the industry in Network Processor technology (FP4 @ 3 Tb/s), QoS, parallel processing, Network Function Virtualization, and, importantly, product quality. Join a highly talented team, delivering the leading technology which makes the Internet go!\n          \n         \n        \n         \n          What we offer\n          \n         \n          \n           Nokia offers flexible and hybrid working schemes, continuous learning opportunities, well-being programs to support you mentally and physically, opportunities to join and get supported by employee resource groups, mentoring programs and highly diverse teams with an inclusive culture where people thrive and are empowered.\n           \n          \n           \n            Nokia is committed to inclusion and is an equal opportunity employer\n            \n          \n          \n           \n            Nokia has received the following recognitions for its commitment to inclusion & equality:\n            \n          \n          \n           One of the World’s Most Ethical Companies by Ethisphere \n           Gender-Equality Index by Bloomberg \n           Workplace Pride Global Benchmark \n          \n         \n         \n          \n           At Nokia, we act inclusively and respect the uniqueness of people\n           \n         \n         \n          \n           Nokia’s employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law.\n            We are committed to a culture of inclusion built upon our core value of respect.\n           \n         \n         \n          \n           Join us and be part of a company where you will feel included and empowered to succeed.\n           \n         \n        \n       \n      \n     \n    \n   \n  \n \n \n  \n   \n    \n     \n      \n       RESPONSIBILITIES \n       \n        \n         Kanata is a major R&D site in this international team with development in key areas of all products. We have a wealth of growth opportunities which include:\n        \n         \n         \n         Embedded platform OS/driver (64-bit SMP) \n         Linux (Yocto, KVM, QEMU, libvirt, python3) \n         Data path (including proprietary network processor, 3rd party, and virtualized) \n         Control plane protocols (IP/MPLS) \n         OAM (CFM, EFM, TWAMP, Performance Monitoring) \n         Timing (PTP, NTP, SyncE, SETS, BITS, and GNSS) \n         PHY and Optics (Ethernet PHY, MAC, SerDes, Clock Recovery, 100/400G Optical Transceivers) \n         Deep Packet Inspection (Application Assurance) \n         Management interfaces (SNMP, NETCONF, YANG) \n         Network Function Virtualization (VSR) \n        \n       \n      \n     \n    \n   \n  \n \n \n  \n   \n    \n     \n      REQUIRED SKILLS\n      \n     \n      \n       \n        \n         Minimum bachelor's degree in Computer/software engineering, Computer Science, equivalent, or better. \n         Good working knowledge of C and/or C++. \n         Experience in embedded development. \n         Demonstrated track record of excellence. \n         Ability to work independently and as part of a team \n         \n        It would be nice if you also had: \n         \n         Hands-on experience with IP routers and/or IP test tools. \n         Background in networking \n         Interest in technical leadership and mentoring junior developers \n         \n        Aptitude and Attitude are more important than specific experience criteria. If you have strong embedded software skills, you are a candidate for our team.\n        \n      \n     \n    \n   \n  \n \n \n \n  \n   \n    \n     \n      \n       ABOUT US \n       \n        \n         Come create the technology that helps the world act together\n          \n          \n          Nokia is committed to innovation and technology leadership across mobile, fixed and cloud networks. Your career here will have a positive impact on people’s lives and will help us build the capabilities needed for a more productive, sustainable, and inclusive world.\n          We challenge ourselves to create an inclusive way of working where we are open to new ideas, empowered to take risks and fearless to bring our authentic selves to work\n          \n          \n         What we offer\n          \n          Nokia offers continuous learning opportunities, well-being programs to support you mentally and physically, opportunities to join and get supported by employee resource groups, mentoring programs and highly diverse teams with an inclusive culture where people thrive and are empowered.\n          \n          \n         Nokia is committed to inclusion and is an equal opportunity employer\n          \n          \n          Nokia has received the following recognitions for its commitment to inclusion & equality:\n        \n         \n         \n         One of the World’s Most Ethical Companies by Ethisphere \n         Gender-Equality Index by Bloomberg \n         Workplace Pride Global Benchmark\n        \n         \n          At Nokia, we act inclusively and respect the uniqueness of people. Nokia’s employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law. \n         We are committed to a culture of inclusion built upon our core value of respect.\n         \n         \n         \n        Join us and be part of a company where you will feel included and empowered to succeed. \n       \n      \n     \n    \n   \n  \n \n \n \n  \n   \n    \n     \n      \n       JOB INFO \n       \n        \n         \n          \n           \n            \n             Job Category\n             \n            \n             Applied R&D\n             \n           \n           \n            \n             Posting Date\n             \n            \n             12/08/2023, 11:30 AM\n             \n           \n           \n            \n             Apply Before\n             \n            \n             06/07/2024, 12:30 PM\n             \n           \n           \n            \n             Degree Level\n             \n            \n             Bachelor's Degree\n             \n           \n           \n            \n             Job Schedule\n             \n            \n             Full time\n             \n           \n           \n            \n             Locations\n             \n             \n             \n             \n              600 March Road, Ottawa, Ontario, K2K 2E6, CA \n             \n            \n           \n           \n            \n             Role Type\n             \n            \n             Individual contributor",
    "preprocessed_description": "Canada Join us in creating the technology that helps the world act together We are a Business-to-Business technology innovation leader pioneering the future where networks meet cloud. At Nokia you will have a positive impact on people's lives and help build the capabilities needed for a more productive, sustainable, and accessible world. Be part of a culture built on an inclusive way of working where we are open to your ideas, you are empowered to take risks and are encouraged to be fearless in bringing your authentic self to work. The team you will be part of The pandemic has highlighted how important telecoms networks are to society. Nokia's Network Infrastructure group is at the heart of a revolution to bring more and faster network capacity to people worldwide through our ambition, innovation, and technical expertise. We need talented software developers to further the tremendous success of the Service Router product family (including the 7950, 7750, and 7250). We are #2 in carrier edge routing worldwide, with over a million platforms shipped to over 1000+ customers in 130+ countries. We lead the industry in Network Processor technology (FP4 @ 3 Tb/s), QoS, parallel processing, Network Function Virtualization, and, importantly, product quality. Join a highly talented team, delivering the leading technology which makes the Internet go! What we offer Nokia offers flexible and hybrid working schemes, continuous learning opportunities, well-being programs to support you mentally and physically, opportunities to join and get supported by employee resource groups, mentoring programs and highly diverse teams with an inclusive culture where people thrive and are empowered. Nokia is committed to inclusion and is an equal opportunity employer Nokia has received the following recognitions for its commitment to inclusion & equality: One of the World's Most Ethical Companies by Ethisphere Gender-Equality Index by Bloomberg Workplace Pride Global Benchmark At Nokia, we act inclusively and respect the uniqueness of people Nokia's employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law. We are committed to a culture of inclusion built upon our core value of respect. Join us and be part of a company where you will feel included and empowered to succeed. RESPONSIBILITIES Kanata is a major Research and Development site in this international team with development in key areas of all products. We have a wealth of growth opportunities which include: Embedded platform OS/driver (64-bit SMP) Linux (Yocto, KVM, QEMU, libvirt, python3) Data path (including proprietary network processor, 3rd party, and virtualized) Control plane protocols (IP/MPLS) OAM (CFM, EFM, TWAMP, Performance Monitoring) Timing (PTP, NTP, SyncE, SETS, BITS, and GNSS) PHY and Optics (Ethernet PHY, MAC, SerDes, Clock Recovery, 100/400G Optical Transceivers) Deep Packet Inspection (Application Assurance) Management interfaces (SNMP, NETCONF, YANG) Network Function Virtualization (VSR) REQUIRED SKILLS Minimum bachelor's degree in Computer/software engineering, Computer Science, equivalent, or better. Good working knowledge of C and/or C++. Experience in embedded development. Demonstrated track record of excellence. Ability to work independently and as part of a team It would be nice if you also had: Hands-on experience with IP routers and/or IP test tools. Background in networking Interest in technical leadership and mentoring junior developers Aptitude and Attitude are more important than specific experience criteria. If you have strong embedded software skills, you are a candidate for our team. ABOUT US Come create the technology that helps the world act together Nokia is committed to innovation and technology leadership across mobile, fixed and cloud networks. Your career here will have a positive impact on people's lives and will help us build the capabilities needed for a more productive, sustainable, and inclusive world. We challenge ourselves to create an inclusive way of working where we are open to new ideas, empowered to take risks and fearless to bring our authentic selves to work What we offer Nokia offers continuous learning opportunities, well-being programs to support you mentally and physically, opportunities to join and get supported by employee resource groups, mentoring programs and highly diverse teams with an inclusive culture where people thrive and are empowered. Nokia is committed to inclusion and is an equal opportunity employer Nokia has received the following recognitions for its commitment to inclusion & equality: One of the World's Most Ethical Companies by Ethisphere Gender-Equality Index by Bloomberg Workplace Pride Global Benchmark At Nokia, we act inclusively and respect the uniqueness of people. Nokia's employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law. We are committed to a culture of inclusion built upon our core value of respect. Join us and be part of a company where you will feel included and empowered to succeed. JOB INFO Job Category Applied Research and Development Posting Date 12/08/2023, 11:30 AM Apply Before 06/07/2024, 12:30 Project Manager Degree Level Bachelor's Degree Job Schedule Full time Locations 600 March Road, Ottawa, Ontario, K2K 2E6, CA Role Type Individual contributor",
    "processed_description": "join create technology help business business technology innovation leader pioneer future network meet cloud . positive impact people's life help build capability productive sustainable accessible . culture build inclusive open idea empower risk encourage fearless bring authentic . team pandemic highlight telecoms network society . Nokia's Network Infrastructure group heart revolution bring fast network capacity people worldwide ambition innovation technical expertise . talented software developer tremendous success Service Router product family include . carrier edge route worldwide platform ship + customer + country . lead industry Network Processor technology FP4 Tb parallel processing importantly product quality . join highly talented team deliver lead technology internet offer offer flexible hybrid working scheme continuous learning program support mentally physically join support employee resource group mentor program highly diverse team inclusive culture people thrive empower . committed inclusion receive follow recognition commitment inclusion equality World's Ethical Companies Ethisphere Gender Equality Index inclusively respect uniqueness people Nokia's employment decision race color national ethnic origin religion gender sexual orientation gender identity expression age marital status protect veteran status characteristic protect law . committed culture inclusion build core respect . join company feel include empower succeed . responsibility major Research Development site international team development key area product . wealth growth include embedded platform OS driver bit SMP Linux KVM python3 Data path include proprietary network processor 3rd party virtualize Control plane protocol ip mpls CFM EFM TWAMP performance monitoring timing PTP SyncE SETS GNSS PHY Optics Ethernet PHY 400G Optical Transceivers Deep Packet Inspection Application Assurance management interface SNMP NETCONF YANG Network Function Virtualization REQUIRED SKILLS Minimum bachelor's degree Computer software engineering equivalent . good working knowledge C++ . embed development . demonstrate track record excellence . independently team nice hand ip router ip test tool . background network Interest technical leadership mentor junior developer aptitude attitude specific criterion . strong embed software skill team . create technology help commit innovation technology leadership mobile cloud network . career positive impact people's life help build capability productive sustainable inclusive . challenge create inclusive open idea empower risk fearless bring authentic offer offer continuous learn program support mentally physically join support employee resource group mentor program highly diverse team inclusive culture people thrive empower . committed inclusion receive follow recognition commitment inclusion equality World's Ethical Companies Ethisphere Gender Equality Index inclusively respect uniqueness people . Nokia's employment decision race color national ethnic origin religion gender sexual orientation gender identity expression age marital status protect veteran status characteristic protect law . committed culture inclusion build core respect . join company feel include empower succeed . INFO Category Applied Research Development Posting Project Manager Degree Level Bachelor Degree schedule location Road Role Type individual contributor",
    "results_group": {
        "extracted_noun_chunks": [
            "Nokia's employment decision race color national ethnic origin religion gender sexual orientation",
            "uniqueness people",
            "risk",
            "technology",
            "400G",
            "highly diverse team inclusive culture people",
            "challenge",
            "support employee resource group mentor program",
            "key area product",
            "continuous learn program support",
            "gender identity expression",
            "wealth growth",
            "core respect",
            "background network Interest technical leadership mentor junior developer aptitude attitude specific criterion",
            "talented software developer tremendous success Service Router product family",
            "join company",
            "career positive impact people's life",
            "good working knowledge C++",
            "technology help",
            "positive impact people's life",
            "lead technology internet offer",
            "software skill team",
            "committed inclusion",
            "customer + country",
            "independently team",
            "development",
            "cloud",
            "veteran status",
            "PHY",
            "business business technology innovation leader pioneer future network",
            "team pandemic",
            "culture",
            "highly talented team",
            "fast network capacity people",
            "law",
            "carrier edge route worldwide platform ship",
            "Nokia's Network Infrastructure group heart revolution",
            "committed culture inclusion",
            "telecoms network society",
            "capability",
            "nice hand ip router ip test tool",
            "Linux KVM",
            "innovation technology leadership mobile cloud network",
            "ambition innovation technical expertise",
            "authentic offer",
            "inclusive open idea",
            "product quality",
            "follow recognition commitment inclusion equality World's Ethical Companies Ethisphere Gender Equality Index",
            "protect law",
            "embedded platform OS driver bit",
            "industry Network Processor technology",
            "PHY Optics Ethernet",
            "responsibility major Research Development site international team",
            "track record excellence",
            "age marital status",
            "flexible hybrid working scheme continuous learning program support",
            "INFO Category Applied Research Development Posting Project Manager Degree Level Bachelor Degree schedule location Road Role Type individual contributor"
        ],
        "combined_lemmatized_tokens": "join create technology help business business technology innovation leader pioneer future network meet cloud . positive impact people's life help build capability productive sustainable accessible . culture build inclusive open idea empower risk encourage fearless bring authentic . team pandemic highlight telecoms network society . Nokia's Network Infrastructure group heart revolution bring fast network capacity people worldwide ambition innovation technical expertise . talented software developer tremendous success Service Router product family include . carrier edge route worldwide platform ship + customer + country . lead industry Network Processor technology FP4 Tb parallel processing importantly product quality . join highly talented team deliver lead technology internet offer offer flexible hybrid working scheme continuous learning program support mentally physically join support employee resource group mentor program highly diverse team inclusive culture people thrive empower . committed inclusion receive follow recognition commitment inclusion equality World's Ethical Companies Ethisphere Gender Equality Index inclusively respect uniqueness people Nokia's employment decision race color national ethnic origin religion gender sexual orientation gender identity expression age marital status protect veteran status characteristic protect law . committed culture inclusion build core respect . join company feel include empower succeed . responsibility major Research Development site international team development key area product . wealth growth include embedded platform OS driver bit SMP Linux KVM python3 Data path include proprietary network processor 3rd party virtualize Control plane protocol ip mpls CFM EFM TWAMP performance monitoring timing PTP SyncE SETS GNSS PHY Optics Ethernet PHY 400G Optical Transceivers Deep Packet Inspection Application Assurance management interface SNMP NETCONF YANG Network Function Virtualization REQUIRED SKILLS Minimum bachelor's degree Computer software engineering equivalent . good working knowledge C++ . embed development . demonstrate track record excellence . independently team nice hand ip router ip test tool . background network Interest technical leadership mentor junior developer aptitude attitude specific criterion . strong embed software skill team . create technology help commit innovation technology leadership mobile cloud network . career positive impact people's life help build capability productive sustainable inclusive . challenge create inclusive open idea empower risk fearless bring authentic offer offer continuous learn program support mentally physically join support employee resource group mentor program highly diverse team inclusive culture people thrive empower . committed inclusion receive follow recognition commitment inclusion equality World's Ethical Companies Ethisphere Gender Equality Index inclusively respect uniqueness people . Nokia's employment decision race color national ethnic origin religion gender sexual orientation gender identity expression age marital status protect veteran status characteristic protect law . committed culture inclusion build core respect . join company feel include empower succeed . INFO Category Applied Research Development Posting Project Manager Degree Level Bachelor Degree schedule location Road Role Type individual contributor"
    }
}