{
    "id": "59e81eddedb1917c",
    "company": "MNP",
    "positionName": "Manager, Tax",
    "jobType": [
        "Full-time"
    ],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-26T12:13:35.295Z",
    "url": "https://www.indeed.ca/rc/clk?jk=59e81eddedb1917c&from=jasx&tk=1hl5dcuan2fci002&bb=meFSaZ2jpWfCb2DCBnnuQNylzM0KjbHvv_gOQ9pD_d34MUIuA17mkERYzEYiebcclJhgga30Zp_p79U9hDhgs-BlLhKVlHyhwEKWYSi57lqIqKZ5NEISQA%3D%3D&xkcb=SoD467M3FlS8FtXIwZ0HbzkdCdPP&vjs=3",
    "externalApplyLink": "https://recruiting.ultipro.ca/MNP5000MNPL/JobBoard/062c8fba-7371-4cd7-9e8a-94a0b8019ffc/OpportunityDetail?opportunityId=f35d9e9d-8f1c-4106-86d2-15f6d6d9dce7&postingId=bfa5444d-5a68-44ba-a110-16c27d86d46c",
    "companyDescription": "It’s not just any career, it’s your career. As one of Canada’s largest accounting and business consulting firms, we offer thousands of opportunities to support your growth and help your talents shine through. \r\n\r\nMNP is a place where you can channel your ambition, achieve your best in and away from the office, and always feel proud of what sets you apart. We’re committed to delivering the supportive culture and resources you need to be successful. \r\n\r\nNo matter your field of expertise or what you want to achieve, you can expect every day to be an exciting and stimulating adventure at MNP. \r\n",
    "description": "Inspirational, innovative and entrepreneurial - this is how we describe our empowered teams. Combine your passion with purpose and join a culture that is thriving in the face of change. \n  Make an impact with our Tax team as a Manager. This diverse team of professionals delivers customized tax strategies within a complex and dynamic regulatory framework. As a trusted advisor, you’ll design solutions for clients that meet compliance and reporting requirements, minimize risk, drive efficiencies and maximize returns. \n  MNP is proudly Canadian. Providing business strategies and solutions, we are a leading national accounting, tax and business advisory firm in Canada. Entrepreneurial to our core, our talented team members transcend obstacles into opportunities and are successfully transforming mid-market business practices. \n  Responsibilities \n  \n  Lead multiple client facing engagement teams responsible for the completion of tax engagements \n  Deliver industry and technical expertise taxation and assurance through client interactions, reports, technical work, management presentations and high-quality deliverables \n  Evaluate existing business processes and policies and advise on policy and tax changes; developing proactive tax strategies that make effective use of business opportunities and ensure businesses are run effectively \n  Liaise with Canada Revenue Agency and relevant provincial ministries on client issues \n  Prepare election forms required in corporate reorganizations \n  Assist in the management of the administration of personal and trust tax compliance seasons \n  Manage a portfolio of clients while understanding their business, key risks and ways to deliver added value; ensuring their needs are met and that relationships and accounts grow and develop \n  Accountable for engagement planning and scheduling as well as project financials (i.e. budgets, WIPS, timely billing, collection and variance recognition) \n  Maintain high quality control and apply specialized knowledge to anticipate, identify and address issues relevant to the client’s business, financial entries and reports \n  Network in the local business community, consider business development opportunities and contribute to the preparation and delivery of competitive proposals to meet client needs \n  Contribute to the development of new ideas and approaches in order to improve work processes \n  Mentor, motivate and coach team members towards professional and personal development by setting clear expectations, providing feedback and conducting performance reviews \n  Maintain flexibility to travel, as necessary \n  \n Skills and Experience \n  \n  CPA designation \n  Completion of Level 1 of In-depth Tax Program and other specialist development courses \n  4 to 5 years of relevant public accounting or tax consulting experience \n  Extensive working knowledge of Canadian Tax \n  Strong understanding of business, accounting, management and practice development principles \n  Proven people management, relationship building and leadership skills \n  Ability to speak French (written and oral) is an asset.\n \n  \n  \n  MyRewards@MNP \n  With a focus on high-potential earnings, MNP is proud to offer customized rewards that support our unique culture and a balanced lifestyle to thrive at work and outside of the office. You will be rewarded with generous base pay, vacation time, 4 paid personal days, a group pension plan with 4% matching, voluntary savings products, bonus programs, flexible benefits, mental health resources, exclusive access to perks and discounts, professional development assistance, MNP University, a flexible ‘Dress For Your Day’ environment, firm sponsored social events and more! \n  Diversity@MNP \n  We embrace diversity as a core value and celebrate our differences. We believe each team member contributes unique gifts and amplifying their potential makes our business stronger. We encourage people with disabilities to apply!"
}