{
    "id": "45cef6eb35163ed2",
    "company": "LifeLabs",
    "positionName": "Lab Patient Technician",
    "jobType": [
        "Part-time",
        "Full-time"
    ],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-07T03:10:50.987Z",
    "url": "https://www.indeed.ca/rc/clk?jk=45cef6eb35163ed2&from=jasx&tk=1hjm36nun2ap4000&vjs=3",
    "externalApplyLink": "https://jobs.lifelabs.com/job/Ottawa-Lab-Patient-Technician-ON/1115477500/?feedId=281500&utm_source=Indeed&utm_campaign=LifeLabs_Indeed&jobPipeline=Indeed",
    "companyDescription": "",
    "description": "LifeLabs is the largest community diagnostics laboratory in Canada, serving the healthcare needs of Canadians for over 50 years. Our team members are truly centred around our customers, and we know that behind every lab requisition, sample being tested, or investment in technology is an individual and their family counting on us. \n Consistently named one of Canada's Best Employers by Forbes, LifeLabs has also been recognized for having an award-winning Mental Health Program from Benefits Canada. The passion and commitment of over 6,000 diverse and innovative team members unites and motivates us to ensure our customers receive high quality tests and results that they can trust. Agile, customer-centred, caring and teamwork: we live these values every day in what we do to support our customers and healthcare providers, driving forward our vision of empowering a healthier you.\n  Make a difference – join the LifeLabs team today!\n \n  Do you want to help improve patients’ healthcare outcomes? Now you can. LifeLabs Medical Laboratory Services is a proud Canadian company with over 50 years’ experience. We provide laboratory testing services that help healthcare providers diagnose, treat, monitor and prevent disease in patients. LifeLabs is currently looking for a Lab Patient Technician to join our team in Ottawa, Ontario (267 O'Connor St.).\n \n  As a Lab Patient Technician you will be responsible for the specimen collection process, from greeting patients through to preparation of specimens for transportation. This is an important role in patient care and our business, and will let you see the difference that you make in patients’ lives. This is a part-time regular role suitable for an individual with a flexible schedule and includes the opportunity to pick up additional shifts at other LifeLabs locations.\n \n  The successful candidate will be scheduled 20-37.5 hrs per week at the O'Connor location. The hours of operation for the site are Monday to Friday, from 7am-4pm. The schedule will include occasional Saturday shifts at the Orleans location.\n  In this role you will:\n \n   Greet and request required information from patients, explain the specimen collection process, and ensure patients have followed necessary test protocol prior to specimen collection.\n   Perform phlebotomies, connect/disconnect holter monitors, and perform ECG tracings.\n   Perform special test collections, such as medical/legal drug screens, paternity tests, and clinical trials, and complete related documentation.\n   Maintain client relationships, including responding to inquiries and following up on requests.\n   Complete data entry of required patient demographics, requisition information, and other information related to processing test results.\n   Prepare specimens for transportation and testing.\n \n \n  The right person for this role will be focused on great customer/patient service, and be able to relate to patients and clients even in stressful situations. Some key qualities include: empathy, flexibility, adaptability to change, and problem solving skills. Other requirements include\n \n   Graduate of an approved Laboratory Assistant program or equivalent.\n   Phlebotomy experience.\n   Excellent communication skills.\n   Good computer skills with a minimum typing speed of 40 wpm.\n   Ability to maintain the strictest standards of patient privacy and confidentiality.\n \n  We are looking for passionate individuals who share in the importance of our values: Caring, Customer Driven, Agile and One Team and can live these values with us every day.\n \n  Ready to make a difference? Apply today.\n \n  Hiring Range: $22.07 to $26.89\n  The hiring range has been established, however, the final salary recommendation will be determined based off the level of experience, education requirement, external market conditions and internal equity.\n \n  Employee Benefits:\n  In this position, you will be eligible to participate LifeLabs’ group benefits plan which is available to LifeLabs employees in accordance with the terms and conditions of those plans.\n \n  Retirement Savings Plan:\n  The LifeLabs plans provide members with an easy way to save for retirement. By participating in the plan, you receive contributions made to your account on your behalf from LifeLabs.\n \n  Vacation Entitlement:\n  In this position, you will be entitled to vacation pay, which will be applied to each pay.\n \n  Employee Wellness:\n  LifeLabs offers an award-winning Wellness Program focused on supporting your total health and well-being under our physical, emotional, and financial wellness pillars. We have been recognized in the industry for our focus on mental health supports.\n \n  Employee Giving program:\n  Designed to support any employee who donates, fundraises or volunteers for a Canadian Registered Charity or Non-Profit Organization.\n \n  In addition, LifeLabs offers professional development and membership reimbursement, access to preferred rates and discount programs - WorkPerks, Home and Auto Insurance, Costco Membership, etc. - and Optional Health-related Benefits.\n \n  Make a difference - join the LifeLabs team today!\n \n  At LifeLabs, we strive to create an inclusive and equitable workplace where our team members and the communities we serve feel accepted, valued, and respected.\n \n  In accordance with LifeLabs’ Accessibility Policy, the Accessibility for Ontarians with Disabilities Act, and the Ontario Human Rights Code, accommodations are available by request for candidates taking part in all aspects of the recruitment and selection process. For a confidential inquiry or to request an accommodation, please contact your recruiter or email careers@lifelabs.com.\n  \n Vaccinations are highly encouraged at LifeLabs’. Vaccinations may be mandatory for selected employees if regulated by provincial or regional governments, or through employer-led vaccination policies in the facilities we service. Please ensure you ask if this position requires the successful candidate to be fully vaccinated with the current Government approved COVID-19 vaccinations."
}