{
    "id": "80df6e7f49810e6f",
    "companyDescription": "",
    "description": "Position Information\n  \n \n  \n   \n    \n     Posting Number:\n     \n    \n     ROM23-380E\n     \n   \n    \n   \n    \n     Title:\n     \n    \n     Executive Assistant I (RFT 1.0 FTE)\n     \n   \n    \n   \n    \n     Position Status:\n     \n    \n     Regular Full-time\n     \n   \n    \n   \n    \n     FTE:\n     \n    \n     1.0\n     \n   \n    \n   \n    \n     Job Schedule:\n     \n    \n     Days\n     \n   \n    \n   \n    \n     Department:\n     \n    \n     Administration\n     \n   \n    \n   \n    \n     Union:\n     \n    \n     Non-union \n    \n   \n    \n   \n    \n     Site:\n     \n    \n     Royal Ottawa Mental Health Centre\n    \n   \n   \n   \n     \n   \n    \n  \n \n \n \n  About The Royal\n  \n As one of Canada’s foremost mental health care and academic health science centres, The Royal has a clear purpose: to get more people living with mental illness into recovery faster. This is at the core of everything we do and it is driven by the passion, focus and dedication of our employees. Every day, the work that we do transforms the lives of people with mental illness through specialized mental healthcare, advocacy, research and education. \n \n This position provides professional administrative support and office management to the Associate Chief, the Vice President Patient Care Services & Chief Nursing Executive, and the Vice President Patient Care Services & Community Mental Health; to ensure efficient and effective administration of the department/program.\n  Duties:\n  Accountability #1: Administrative support/Office management\n \n   Responsible for organization & scheduling of meetings, including collection of agenda items, follow up on action items, preparation and distribution of agenda packages, recording, production and distribution of minutes\n   Manages calendars and assists with time management\n   Drafts and types correspondence, receives/sends mail, including email\n   Responds to queries from the general public, hospital departments, external organizations \n  Screens and actions incoming mail, emails and telephone calls using own judgment and knowledge\n   Makes travel arrangements & completes expense reports as required\n   Ensures all deadlines are met, including project tracking, information gathering, report production, etc.\n   Schedules staff meetings\n   Provides office and automated systems orientation and training for new staff members\n   Prepares invoices/requisitions as required for ordering office supplies, materials, repairs, etc.\n   Prepares Personnel Action Forms of reporting staff and other documents, as required\n   Provides daily schedule including preparation of background information for the days’ meetings\n   Maintains bring forward system and organizes/maintains an effective filing system\n   Maintains OREO pages for department/program\n   Coordinates site visits\n   Arranges interviews and prepares information for potential and new physicians, composes offer letters and gathers appropriate information for credentialing\n   Ensures sessionals/stipends are paid accurately\n   Requests cheques for physicians not paid through Medco Services\n   Prepares & drafts PowerPoint presentations and other presentations as required\n   Schedules on-call services physicians\n   Liaises with senior management teams, directors and their administrative assistants\n   Liaises with pharmaceutical representatives to plan and schedule continuing mental health education sessions; plan, advertise, evaluate feedback, follow up for conferences\n \n  Accountability #2: Budgeting responsibilities\n \n   Assists with annual budget preparation\n   Assists with budget planning; monitors and tracks budget expenses – operating and salary\n   Audits payroll, sick leave, vacation and labour distribution reports and reports variances\n \n  Accountability #3: Data Management\n \n   Organizes/maintains major legal, financial and administrative documents\n   Assists in gathering, compilation and dissemination of data and statistics\n   Maintains the corporate files of the program/department\n   Maintains accurate leave records for staff\n   Ensures confidentiality of sensitive information – patient correspondence, public enquires, patient/family complaints\n   Processes bi-weekly pay cards and maintains appropriate supporting documentation\n   Maintains a copy of all policies and procedures and updates as new polices/procedures become available\n   Facilitates completion of annual performance appraisals of reporting staff\n   Processes and maintains billing for the Associate Chief and Physicians\n \n  Accountability #4: Other Duties\n \n   Assists with projects as needed\n   Works in a manner that is in compliance with staff and patient/client safety practices, policies and procedures of The Royal.\n   Ensures a work environment that is conducive to The Royal’s Harassment-Free Workplace and Occupational Health and Safety policies.\n   Undertakes special assignments/projects and other duties as assigned.\n \n  Qualifications:\n \n   Post-secondary level education, preferably a two (2) year community college diploma in Office Administration or equivalent experience\n   Minimum of five years recent, related secretarial/administrative experience supporting senior level management\n   Typing speed – minimum of 60 words per minute with high accuracy.\n   Demonstrated experience in windows-based applications including a high level of competency with Outlook, Microsoft Office Suite (Word, PowerPoint, and Excel). \n  Planning, prioritization and organization skills to ensure that tasks are completed; work well under pressure\n   Power B1 system knowledge would be an asset\n   Demonstrate interpersonal skills and proficiency in business vocabulary\n   Time management skills to plan, manage and coordinate activities\n   Attention to detail and decision-making skills to respond to high-pressure situations\n   Demonstrate ability to handle confidential/sensitive information\n   Prepare clear, concise and accurate documentation\n   Establish and maintain effective working relationships\n   Ability to work independently in the completion of assigned tasks\n   Ability to meet deadlines, established objectives with multiple interruptions\n   Excellent communication skills – verbal and written\n   Strong problem-solving and analytical skills and the ability to handle multiple responsibilities effectively\n   Ability to coordinate and manage small administrative projects\n   English level A- is mandatory in oral expression, comprehension, reading & writing. Bilingual (French/English) is considered an asset\n  \n \n  \n \n  Additional Information\n  \n \n  All applicants must provide a recent resume that clearly indicate that they meet the required qualifications. \n  The Royal sincerely thanks all applicants for their interest in a career with us; however, only those applicants selected for an interview will be contacted. \n  All new hires will be required to obtain a clear and valid Criminal Record or Vulnerable Sector Records Check as a pre-condition of employment. \n  The Royal is an equal opportunity employer. Upon request, accommodations due to a disability are available throughout the recruitment process.",
    "preprocessed_description": "Position Information Posting Number: ROM23-380E Title: Executive Assistant I (RFT 1.0 FTE) Position Status: Regular Full-time FTE: 1.0 Job Schedule: Days Department: Administration Union: Non-union Site: Royal Ottawa Mental Health Centre About The Royal As one of Canada's foremost mental health care and academic health science centres, The Royal has a clear purpose: to get more people living with mental illness into recovery faster. This is at the core of everything we do and it is driven by the passion, focus and dedication of our employees. Every day, the work that we do transforms the lives of people with mental illness through specialized mental healthcare, advocacy, research and education. This position provides professional administrative support and office management to the Associate Chief, the Vice President Patient Care Services & Chief Nursing Executive, and the Vice President Patient Care Services & Community Mental Health; to ensure efficient and effective administration of the department/program. Duties: Accountability #1: Administrative support/Office management Responsible for organization & scheduling of meetings, including collection of agenda items, follow up on action items, preparation and distribution of agenda packages, recording, production and distribution of minutes Manages calendars and assists with time management Drafts and types correspondence, receives/sends mail, including email Responds to queries from the general public, hospital departments, external organizations Screens and actions incoming mail, emails and telephone calls using own judgment and knowledge Makes travel arrangements & completes expense reports as required Ensures all deadlines are met, including project tracking, information gathering, report production, etc. Schedules staff meetings Provides office and automated systems orientation and training for new staff members Prepares invoices/requisitions as required for ordering office supplies, materials, repairs, etc. Prepares Personnel Action Forms of reporting staff and other documents, as required Provides daily schedule including preparation of background information for the days' meetings Maintains bring forward system and organizes/maintains an effective filing system Maintains OREO pages for department/program Coordinates site visits Arranges interviews and prepares information for potential and new physicians, composes offer letters and gathers appropriate information for credentialing Ensures sessionals/stipends are paid accurately Requests cheques for physicians not paid through Medco Services Prepares & drafts PowerPoint presentations and other presentations as required Schedules on-call services physicians Liaises with senior management teams, directors and their administrative assistants Liaises with pharmaceutical representatives to plan and schedule continuing mental health education sessions; plan, advertise, evaluate feedback, follow up for conferences Accountability #2: Budgeting responsibilities Assists with annual budget preparation Assists with budget planning; monitors and tracks budget expenses – operating and salary Audits payroll, sick leave, vacation and labour distribution reports and reports variances Accountability #3: Data Management Organizes/maintains major legal, financial and administrative documents Assists in gathering, compilation and dissemination of data and statistics Maintains the corporate files of the program/department Maintains accurate leave records for staff Ensures confidentiality of sensitive information – patient correspondence, public enquires, patient/family complaints Processes bi-weekly pay cards and maintains appropriate supporting documentation Maintains a copy of all policies and procedures and updates as new polices/procedures become available Facilitates completion of annual performance appraisals of reporting staff Processes and maintains billing for the Associate Chief and Physicians Accountability #4: Other Duties Assists with projects as needed Works in a manner that is in compliance with staff and patient/client safety practices, policies and procedures of The Royal. Ensures a work environment that is conducive to The Royal's Harassment-Free Workplace and Occupational Health and Safety policies. Undertakes special assignments/projects and other duties as assigned. Qualifications: Post-secondary level education, preferably a two (2) year community college diploma in Office Administration or equivalent experience Minimum of five years recent, related secretarial/administrative experience supporting senior level management Typing speed – minimum of 60 words per minute with high accuracy. Demonstrated experience in windows-based applications including a high level of competency with Outlook, Microsoft Office Suite (Word, PowerPoint, and Excel). Planning, prioritization and organization skills to ensure that tasks are completed; work well under pressure Power B1 system knowledge would be an asset Demonstrate interpersonal skills and proficiency in business vocabulary Time management skills to plan, manage and coordinate activities Attention to detail and decision-making skills to respond to high-pressure situations Demonstrate ability to handle confidential/sensitive information Prepare clear, concise and accurate documentation Establish and maintain effective working relationships Ability to work independently in the completion of assigned tasks Ability to meet deadlines, established objectives with multiple interruptions Excellent communication skills – verbal and written Strong problem-solving and analytical skills and the ability to handle multiple responsibilities effectively Ability to coordinate and manage small administrative projects English level A- is mandatory in oral expression, comprehension, reading & writing. Bilingual (French/English) is considered an asset Additional Information All applicants must provide a recent resume that clearly indicate that they meet the required qualifications. The Royal sincerely thanks all applicants for their interest in a career with us; however, only those applicants selected for an interview will be contacted. All new hires will be required to obtain a clear and valid Criminal Record or Vulnerable Sector Records Check as a pre-condition of employment. The Royal is an equal opportunity employer. Upon request, accommodations due to a disability are available throughout the recruitment process.",
    "processed_description": "position information posting number ROM23 380E title Executive Assistant RFT FTE Position Status schedule Department union site Canada's foremost mental health care academic health science centre clear purpose people live mental illness recovery fast . core drive passion focus dedication employee . transform life people mental illness specialized mental healthcare advocacy research education . position provide professional administrative support office management Associate Chief Chief Nursing Executive ensure efficient effective administration department program . duty accountability administrative support Office management responsible organization scheduling meeting include collection agenda item follow action item preparation distribution agenda package recording production distribution Manages calendar assist management draft type correspondence receive send mail include email respond query general public hospital department external organization Screens action incoming mail email judgment knowledge travel arrangement complete expense report require Ensures deadline meet include project tracking information gathering report production . schedule staff meeting provide office automate system orientation training staff prepare invoice requisition require order office supply material repair . prepare Personnel Action Forms report staff document require provide daily schedule include preparation background information day' meeting maintain bring forward system organize maintain effective filing system maintain OREO department program Coordinates site visit arrange interview prepare information potential physician compose offer letter gather appropriate information credentiale ensure sessional stipend pay accurately request cheque physician pay draft PowerPoint presentation presentation require Schedules service physician Liaises senior management team director administrative assistant Liaises pharmaceutical representative plan schedule continue mental health education session plan advertise evaluate feedback follow conference accountability budget responsibility assist annual budget preparation assist budget planning monitor track budget expense – operating salary audits payroll sick leave vacation labour distribution report report variance accountability maintain major legal financial administrative document assist gathering compilation dissemination datum statistic maintain corporate file program department maintain accurate leave record staff ensure confidentiality sensitive information – patient correspondence public enquire patient family complaint Processes bi weekly pay card maintain appropriate support documentation maintain copy policy procedure update police procedure Facilitates completion annual performance appraisal report staff Processes maintain billing Associate Chief Physicians Accountability duty assist project manner compliance staff patient client safety practice policy procedure Royal . ensure environment conducive Royal's Harassment Free Workplace Occupational Health Safety policy . Undertakes special assignment project duty assign . qualification post secondary level education preferably community college diploma equivalent Minimum relate secretarial administrative support senior level management typing speed – minimum word minute high accuracy . demonstrate window base application include high level competency Microsoft Office Suite Word . planning prioritization organization skill ensure task complete pressure Power B1 system knowledge asset interpersonal skill proficiency business vocabulary management skill plan manage coordinate activity attention detail decision skill respond high pressure situation handle confidential sensitive information prepare clear concise accurate maintain effective relationship independently completion assign task meet deadline establish objective multiple interruption excellent communication skill – verbal write strong problem solving analytical skill handle multiple responsibility effectively coordinate manage small administrative project english level mandatory oral expression comprehension reading writing . consider asset Additional Information applicant provide resume indicate meet require qualification . sincerely applicant interest career applicant select interview contact . hire require clear valid Criminal Record Vulnerable Sector Records Check pre condition employment . equal employer . request accommodation recruitment process .",
    "results_group": {
        "extracted_noun_chunks": [
            "vacation labour distribution report report variance accountability",
            "Executive Assistant RFT FTE Position Status",
            "corporate file program department",
            "Canada's foremost mental health care academic health science centre clear purpose people",
            "Minimum",
            "OREO department program",
            "Undertakes special assignment project duty assign",
            "380E title",
            "schedule staff meeting",
            "patient correspondence public",
            "analytical skill",
            "small administrative project english level mandatory oral expression comprehension",
            "task complete pressure Power B1 system knowledge asset interpersonal skill proficiency business vocabulary management skill plan",
            "Royal",
            "clear concise accurate maintain effective relationship",
            "staff document",
            "accommodation recruitment process",
            "writing",
            "high pressure situation",
            "order office supply material repair",
            "high level competency",
            "life",
            "position information",
            "copy policy procedure update police procedure",
            "email",
            "office automate system orientation training staff",
            "Schedules service physician Liaises senior management team director administrative assistant Liaises pharmaceutical representative plan schedule",
            "statistic",
            "preferably community college diploma",
            "budget planning monitor track budget expense",
            "daily schedule",
            "sincerely applicant interest career applicant select interview contact",
            "action incoming mail email judgment knowledge travel arrangement complete expense report",
            "coordinate activity attention detail decision skill",
            "major legal financial administrative document",
            "resume",
            "potential physician compose offer letter",
            "environment",
            "mental illness specialized mental healthcare advocacy research education",
            "window base application",
            "multiple responsibility",
            "efficient effective administration department program",
            "request",
            "site visit",
            "preparation background information day' meeting",
            "invoice requisition",
            "completion",
            "system",
            "meet require qualification",
            "sessional stipend pay",
            "Personnel Action Forms",
            "operating salary audits payroll",
            "patient family complaint Processes bi weekly pay card",
            "core drive passion focus dedication employee",
            "compilation dissemination datum",
            "professional administrative support office management Associate Chief Chief Nursing Executive",
            "asset Additional Information applicant",
            "confidentiality sensitive information",
            "people",
            "objective multiple interruption excellent communication skill",
            "information",
            "Royal's Harassment Free Workplace Occupational Health Safety policy",
            "Ensures deadline meet",
            "query general public hospital department external organization Screens",
            "accurate leave record staff",
            "appropriate information credentiale",
            "number",
            "feedback follow conference accountability budget responsibility",
            "verbal write strong problem",
            "position",
            "management draft type correspondence",
            "speed",
            "effective filing system",
            "Microsoft Office Suite Word",
            "confidential sensitive information",
            "appropriate support documentation",
            "mail",
            "annual performance appraisal report staff Processes",
            "task meet deadline",
            "project manner compliance staff patient client safety practice policy procedure",
            "planning prioritization organization skill",
            "action item preparation distribution agenda package recording production distribution Manages calendar",
            "duty accountability administrative support Office management responsible organization scheduling meeting",
            "pre condition employment",
            "equal employer",
            "information gathering report production",
            "annual budget preparation",
            "qualification post secondary level education",
            "project"
        ],
        "combined_lemmatized_tokens": "position information posting number ROM23 380E title Executive Assistant RFT FTE Position Status schedule Department union site Canada's foremost mental health care academic health science centre clear purpose people live mental illness recovery fast . core drive passion focus dedication employee . transform life people mental illness specialized mental healthcare advocacy research education . position provide professional administrative support office management Associate Chief Chief Nursing Executive ensure efficient effective administration department program . duty accountability administrative support Office management responsible organization scheduling meeting include collection agenda item follow action item preparation distribution agenda package recording production distribution Manages calendar assist management draft type correspondence receive send mail include email respond query general public hospital department external organization Screens action incoming mail email judgment knowledge travel arrangement complete expense report require Ensures deadline meet include project tracking information gathering report production . schedule staff meeting provide office automate system orientation training staff prepare invoice requisition require order office supply material repair . prepare Personnel Action Forms report staff document require provide daily schedule include preparation background information day' meeting maintain bring forward system organize maintain effective filing system maintain OREO department program Coordinates site visit arrange interview prepare information potential physician compose offer letter gather appropriate information credentiale ensure sessional stipend pay accurately request cheque physician pay draft PowerPoint presentation presentation require Schedules service physician Liaises senior management team director administrative assistant Liaises pharmaceutical representative plan schedule continue mental health education session plan advertise evaluate feedback follow conference accountability budget responsibility assist annual budget preparation assist budget planning monitor track budget expense – operating salary audits payroll sick leave vacation labour distribution report report variance accountability maintain major legal financial administrative document assist gathering compilation dissemination datum statistic maintain corporate file program department maintain accurate leave record staff ensure confidentiality sensitive information – patient correspondence public enquire patient family complaint Processes bi weekly pay card maintain appropriate support documentation maintain copy policy procedure update police procedure Facilitates completion annual performance appraisal report staff Processes maintain billing Associate Chief Physicians Accountability duty assist project manner compliance staff patient client safety practice policy procedure Royal . ensure environment conducive Royal's Harassment Free Workplace Occupational Health Safety policy . Undertakes special assignment project duty assign . qualification post secondary level education preferably community college diploma equivalent Minimum relate secretarial administrative support senior level management typing speed – minimum word minute high accuracy . demonstrate window base application include high level competency Microsoft Office Suite Word . planning prioritization organization skill ensure task complete pressure Power B1 system knowledge asset interpersonal skill proficiency business vocabulary management skill plan manage coordinate activity attention detail decision skill respond high pressure situation handle confidential sensitive information prepare clear concise accurate maintain effective relationship independently completion assign task meet deadline establish objective multiple interruption excellent communication skill – verbal write strong problem solving analytical skill handle multiple responsibility effectively coordinate manage small administrative project english level mandatory oral expression comprehension reading writing . consider asset Additional Information applicant provide resume indicate meet require qualification . sincerely applicant interest career applicant select interview contact . hire require clear valid Criminal Record Vulnerable Sector Records Check pre condition employment . equal employer . request accommodation recruitment process ."
    }
}