{
    "id": "9b1a1f2513bcab70",
    "company": "Plan Group",
    "positionName": "Project Manager, Commercial Mechanical - Ottawa, ON",
    "jobType": [
        "Full-time"
    ],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-05T03:13:37.176Z",
    "url": "https://www.indeed.ca/rc/clk?jk=9b1a1f2513bcab70&from=jasx&tk=1hjm3b3kbip98800&vjs=3",
    "externalApplyLink": "https://plan-group.acquiretm.com/(X(1)S(2jy1zynlda435g15a0aymohy))/job_details_clean.aspx?ID=1793&source=indeed&AspxAutoDetectCookieSupport=1",
    "companyDescription": "",
    "description": "Do you thrive on the challenge of having financial accountability and making operational decisions? Are you looking for an opportunity to lead a team in building a multi-million dollar project? Are you looking to take your career to the next level? Take the leap and make your mark at Plan Group!\n  As a Project Manager, Commercial Mechanical, you will:\n \n   Establish and achieve project targets and milestones to deliver mechanical construction projects on-time and within budget.\n   Provide active promotion and leadership in Health and Safety.\n   Monitor and provide status updates of work in progress, forecasts, cost control and project schedule in line with Plan Group’s T.I.M.E. efficiency program.\n   Proactively identify and bring to management’s attention potential problems and/or schedule delays.\n   Lead and manage project quality assurance, commissioning, and handover objectives.\n   Develop and lead value engineering, cost savings, and pricing initiatives and activities.\n   Monitor and analyze critical path activities and advise project team accordingly.\n   Review and manage short interval planning.\n   Lead pre-job planning including estimate turnover, kick off meetings, subcontractor selection, material handling strategies and opportunities for risk management and improved productivity.\n   Follow up with site supervision on labour/manpower progress; identify and reduce roadblocks to success.\n   Manage project team to ensure requirements for document control, change order process, coordination of equipment and material deliveries, site meetings and progress documentation are adhered to.\n   Identify opportunities to provide project team members with regular feedback, coaching and training.\n   Build strong relationships with clients, GCs and Engineers to positively contribute to the success of the project.\n \n  QUALIFICATIONS:\n \n   Mechanical Engineering post-secondary education or related.\n   Minimum of five (5) years mechanical construction project management experience; trade experience a definite asset.\n   Experience managing large scale mechanical commercial and institutional projects."
}