{
    "id": "79b15273b3b0b320",
    "companyDescription": "",
    "description": "Looking for a new challenge? The Oz Store, a well-known cannabis retail chain in Eastern Ontario, has an opening for a part time Retail Associate & Driver (vehicle provided by store) to join our store in Orleans, Ottawa. We welcome an application from anyone seeking a long term career with opportunities for growth, including promotion to Key Holder and Key Lead (and perhaps even store manager at a new location).\nThis is a starting position and remuneration begins at $17.25 per hour, with opportunities for tips. If you stay with our organization and move up to full time hours, you may become eligible for health care related benefits, e.g. dental and vision.\nThe ideal candidate should:\n-enjoy dealing with the public in a fast-paced environment\n-have a licence and clean driving record\n-have a high school diploma\n-be able to function within a team setting\n-be knowledgeable and passionate about legal Cannabis products\n-have a keen attention to detail, and a willingness to learn\nResponsibilities Include:\n-Carrying out cashier duties (taking orders and cashing out customers at the till)\n-Answering phones and appropriately helping customers with their inquiries\n-Gathering, processing, and packaging online orders\n-Assisting the Keyholders/Manager in receiving and organizing merchandise\n-Maintaining the physical appearance of the store\n-Assisting the Keyholders/Manager in the opening and closing of the store.\n-Driving for delivery purposes (if applicable)\nIt’s a bonus if you:\n-are bilingual (English with French or Spanish)\nJob Types: Casual, Part-time\nSalary: From $17.25 per hour\nBenefits:\n\n On-site parking\n Store discount\n\nDay range:\n\n Monday to Friday\n Weekends as needed\n\nFlexible Language Requirement:\n\n French not required\n\nShift:\n\n Day shift\n Evening shift\n\nWork setting:\n\n Specialty store\n\nAbility to commute/relocate:\n\n Orleans, ON K1E 1E2: reliably commute or plan to relocate before starting work (required)\n\nApplication question(s):\n\n Do you have a clean/good driving record, e.g. no speeding tickets, collisions, or other significant driving infractions?\n Are you able to speak French?\n Are you available to work at either our Orleans, Ottawa store location AND/OR Centretown, Ottawa location? Any preference - or are you flexible depending on where you may be needed?\n\nEducation:\n\n Secondary School (preferred)\n\nExperience:\n\n sales: 2 years (preferred)\n driving: 1 year (preferred)\n\nLicence/Certification:\n\n Ontario Driver's licence (preferred)\n\nWork Location: In person\nExpected start date: 2023-10-25",
    "preprocessed_description": "Looking for a new challenge? The Oz Store, a well-known cannabis retail chain in Eastern Ontario, has an opening for a part time Retail Associate & Driver (vehicle provided by store) to join our store in Orleans, Ottawa. We welcome an application from anyone seeking a long term career with opportunities for growth, including promotion to Key Holder and Key Lead (and perhaps even store manager at a new location). This is a starting position and remuneration begins at $17.25 per hour, with opportunities for tips. If you stay with our organization and move up to full time hours, you may become eligible for health care related benefits, e.g. dental and vision. The ideal candidate should: -enjoy dealing with the public in a fast-paced environment -have a licence and clean driving record -have a high school diploma -be able to function within a team setting -be knowledgeable and passionate about legal Cannabis products -have a keen attention to detail, and a willingness to learn Responsibilities Include: -Carrying out cashier duties (taking orders and cashing out customers at the till) -Answering phones and appropriately helping customers with their inquiries -Gathering, processing, and packaging online orders -Assisting the Keyholders/Manager in receiving and organizing merchandise -Maintaining the physical appearance of the store -Assisting the Keyholders/Manager in the opening and closing of the store. -Driving for delivery purposes (if applicable) It's a bonus if you: -are bilingual (English with French or Spanish) Job Types: Casual, Part-time Salary: From $17.25 per hour Benefits: On-site parking Store discount Day range: Monday to Friday Weekends as needed Flexible Language Requirement: French not required Shift: Day shift Evening shift Work setting: Specialty store Ability to commute/relocate: Orleans, ON K1E 1E2: reliably commute or plan to relocate before starting work (required) Application question(s): Do you have a clean/good driving record, e.g. no speeding tickets, collisions, or other significant driving infractions? Are you able to speak French? Are you available to work at either our Orleans, Ottawa store location AND/OR Centretown, Ottawa location? Any preference - or are you flexible depending on where you may be needed? Education: Secondary School (preferred) Experience: sales: 2 years (preferred) driving: 1 year (preferred) Licence/Certification: Ontario Driver's licence (preferred) Work Location: In person Expected start date: 2023-10-25",
    "processed_description": "challenge cannabis retail chain opening vehicle provide store join store . application seek long term career growth include promotion Key Lead store manager location . starting position remuneration hour . stay organization eligible health care relate benefit e.g. dental vision . ideal enjoy deal public fast pace environment licence clean driving record high school diploma function team set knowledgeable passionate legal cannabis product keen attention detail willingness learn responsibility include carrye cashier duty order cash customer till answere phone appropriately help customer inquiry gathering processing package online order assiste Keyholders Manager receive organize merchandise maintaine physical appearance store assiste Keyholders Manager opening closing store . drive delivery purpose applicable bonus type casual salary hour benefit site parking discount range require shift shift evening shift setting specialty store commute relocate reliably commute plan relocate start require application question clean good driving record e.g. speeding ticket collision driving infraction speak Orleans store location Centretown location preference flexible depend education preferred sale preferred driving preferred Licence Certification Driver's licence preferred location person expect start",
    "results_group": {
        "extracted_noun_chunks": [
            "specialty store commute",
            "carrye cashier duty order cash customer",
            "education preferred sale",
            "processing package",
            "Keyholders Manager",
            "Key Lead store manager location",
            "benefit",
            "challenge cannabis retail chain opening vehicle",
            "promotion",
            "public fast pace environment licence clean driving record high school diploma function team",
            "keen attention detail willingness",
            "preferred Licence Certification Driver's licence preferred location person",
            "merchandise maintaine physical appearance store assiste",
            "Orleans store location Centretown location preference",
            "long term career growth",
            "e.g. dental vision",
            "position remuneration hour",
            "shift shift evening shift",
            "good driving record",
            "closing store",
            "store join store",
            "application question",
            "responsibility",
            "drive delivery purpose applicable bonus type casual salary hour benefit site parking discount range",
            "infraction",
            "application",
            "knowledgeable passionate legal cannabis product",
            "start",
            "ticket collision",
            "reliably commute plan",
            "answere phone"
        ],
        "combined_lemmatized_tokens": "challenge cannabis retail chain opening vehicle provide store join store . application seek long term career growth include promotion Key Lead store manager location . starting position remuneration hour . stay organization eligible health care relate benefit e.g. dental vision . ideal enjoy deal public fast pace environment licence clean driving record high school diploma function team set knowledgeable passionate legal cannabis product keen attention detail willingness learn responsibility include carrye cashier duty order cash customer till answere phone appropriately help customer inquiry gathering processing package online order assiste Keyholders Manager receive organize merchandise maintaine physical appearance store assiste Keyholders Manager opening closing store . drive delivery purpose applicable bonus type casual salary hour benefit site parking discount range require shift shift evening shift setting specialty store commute relocate reliably commute plan relocate start require application question clean good driving record e.g. speeding ticket collision driving infraction speak Orleans store location Centretown location preference flexible depend education preferred sale preferred driving preferred Licence Certification Driver's licence preferred location person expect start"
    }
}