{
    "id": "cb7bceb274590f9c",
    "companyDescription": "As a well-respected government contractor, we’re moving people forward by providing transformative technology services, digitally enabled customer experiences, and clinical health services that change lives. \r\n\r\nOur employees share an authentic desire to make vital services available to the public and support the mission of our customers. This is why we’re committed to creating the best employee experience possible— continuously improving our compensation offers, benefits, work environment, diversity, equity, and inclusion initiatives, and engagement events.  \r\n\r\n",
    "description": "Company Profile: \n \n   About Maximus\n \n \n   At Maximus, we share an authentic desire to do something meaningful to help others succeed. We apply our deep operational expertise, technology innovation, and digitally enabled citizen engagement in new ways and help governments solve complex problems.\n \n \n \n   Maximus has been reinventing the way government agencies engage with citizens and are sought out by governments to solve complex problems. By supporting various Healthcare Administration, Employment and Citizen service programs worldwide in the United States, Australia, Italy, Saudi Arabia, Singapore, South Korea, Sweden and the United Kingdom.\n \n \n \n   Our mission is to affect fundamental change in the lives of every individual with whom we engage and at every touchpoint. But ultimately, what we do is improve people’s lives. And that is a testament to the ingenuity, commitment, and compassion everyone brings to their role at Maximus and their dedication to connecting citizens with the services they need from Government agencies.\n \n \n \n   We welcome and encourage applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process\n  Job Description: \n  Department Overview\n \n \n   This is a front line support service connecting citizens with all the information and referrals they need quicker and with higher satisfaction.\n \n \n   \n \n Position Summary\n \n  The Supervisor leads a team of 15 to 25 staff who handle a variety of calls. The Supervisor is responsible for delivering departmental strategic outcomes, coaching/mentoring, employee development, driving performance and attendance management outcomes, and participating in internal and external projects and initiatives.\n \n  The role requires solid leadership and technical competencies to ensure Service Level targets and departmental key performance indicators (KPI’s) are met. Tight deadlines along with detailed client deliverables require the supervisor to manage several streams of work with agility and confidence, and to utilize a diverse competency profile to motivate employees within a high performance culture.\n \n  Your typical week at Maximus\n  \n \n \n   Lead the workforce in order to meet SLR’s and SLO’s, enhance employee engagement and performance, communicate and execute business goals, all within a high performance culture.\n   Assign workflow and oversee departmental activities for effective utilization of resources and systems.\n   Identify opportunities for improvement and work with the Continuous Improvement agents to lead change.\n   Customer focus: ensure strong business relationships are built internally and externally while working on daily activities and project-related initiatives.\n   Play a key role in change management by encouraging innovation and creativity.\n   Implement goals: create individual and team goals, while at the same time advocating employee empowerment and accountabilities.\n   Lead the workforce to contribute to a positive workplace and to the growth of a successful business.\n   Other duties as required\n \n \n  What you offer us\n  Knowledge, Skills and Abilities\n  \n \n \n   Recruit, select and hire individuals most qualified to perform the requirements of each position.\n   Provide leadership to ensure Quality Assurance goals are met.\n   Monitor, track and report a designated number of Quality Assurance checks for each employee, each month.\n   Initiate appropriate timing and phases of the performance management continuum:\n   Identify high-performing/high-potential employees and facilitate development through “stretch assignments” or other employee development strategies available. \n  Ensure compliance with daily/weekly/monthly workflow schedules (see Workflow Streams Per Department).\n   Investigate and resolve employee/client escalations regarding business policies or procedures.\n   Report system failures immediately and, when appropriate, temporarily change processes to ensure SLR’s are met.\n   Ensure all processes adhere to client and MAXIMUS Canada policies.\n   Review policies and procedure documents and make recommendations for updates due to procedure or policy changes.\n   Perform all supervisory duties in accordance to human rights standards and effective management principles, in a manner that fosters productive employees.\n   Initiate and act on ideas, and generate solutions that benefit your team, department, and company. (i.e., analyze and resolve root causes of performance inhibitors, recommend resource changes, recommend process changes).\n   Communicate verbally and in writing clearly and concisely, with an appropriate tone and message.\n   Escalate resource, workforce or process concerns to managers, HR, and colleagues in a timely manner.\n   Acknowledge and reward employee achievement through formal and informal employee recognition activities or programs.\n   Chair team and committee meetings to inform, and to convey a clear, consistent, and compelling message that links employees to the company’s business goals and to a positive, quality-driven workplace culture.\n   Collaborate with clients, clients’ affiliates and Maximus stakeholders to recommend changes to business policies and processes.\n \n \n  Education and Experience\n  \n \n \n   Minimum 2 years’ experience supervising an operational unit of a least 15 employees\n   Current and/or relevant call centre leadership experience an asset\n   Related post-secondary education in business administration, human relations, public administration, etc.\n   In-depth knowledge of Contact Centre operations\n   Knowledge of the principles of employee engagement and motivation\n   Proven experience in business process improvement\n   Principles related to human rights and employment standards legislation\n   Proficient knowledge of MS Office suite; Word, Excel, PowerPoint, etc.\n \n  \n Other\n \n   Must clear Federal Reliability Security Clearance\n   Must be bilingual (French and English)\n \n  What we offer you \n \n  We value your work, which enables us to continuously raise the bar on how we can best serve citizens worldwide. Maximus Canada offers the following:\n \n  \n \n \n   Competitive market-based salaries\n   Comprehensive employer-paid benefits\n   Three weeks of paid vacation\n   Group Retirement Savings Plan\n   Hybrid and remote work environments in Canada\n   Workplace Telework allowance \n  Employee appreciation events\n \n \n   \n \n \n  Maximus is passionate about our employees and place their well-being at the center of our people strategy. We are committed and proud to build a workforce that reflects the communities we serve. We value diversity, equity and inclusion and invite all interested individuals to apply and encourage applications from people with disabilities, Indigenous, ethnic and cultural origins, sexual orientations and gender identities recognizing that this is paramount for the growth and success of our organization.\n \n \n \n   Salary Range – $59,543.57 - $64,048.99 CDN\n \n \n  Maximus Global Core Values\n \n   Accountability - Accepting responsibility to solve problems and rise to each challenge\n   Collaboration - Partnering to instill trust and working as one\n   Compassion - Empowering humanity by applying empathy and insight to every interaction\n   Customer Focus - Cultivating an authentic desire to help others succeed\n   Innovation - Embracing change and championing new ways forward\n   Respect - Valuing the work we do, who we do it with, and the people we serve\n \n  \n  Additional Information: \n \n   We will be accepting applications until 11:59 PM on February 09, 2024.\n \n \n \n   Please note that while all applications are appreciated, only those candidates selected for an interview will be contacted\n  . \n  (No Agencies, Please)",
    "preprocessed_description": "Company Profile: About Maximus At Maximus, we share an authentic desire to do something meaningful to help others succeed. We apply our deep operational expertise, technology innovation, and digitally enabled citizen engagement in new ways and help governments solve complex problems. Maximus has been reinventing the way government agencies engage with citizens and are sought out by governments to solve complex problems. By supporting various Healthcare Administration, Employment and Citizen service programs worldwide in the United States, Australia, Italy, Saudi Arabia, Singapore, South Korea, Sweden and the United Kingdom. Our mission is to affect fundamental change in the lives of every individual with whom we engage and at every touchpoint. But ultimately, what we do is improve people's lives. And that is a testament to the ingenuity, commitment, and compassion everyone brings to their role at Maximus and their dedication to connecting citizens with the services they need from Government agencies. We welcome and encourage applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process Job Description: Department Overview This is a front line support service connecting citizens with all the information and referrals they need quicker and with higher satisfaction. Position Summary The Supervisor leads a team of 15 to 25 staff who handle a variety of calls. The Supervisor is responsible for delivering departmental strategic outcomes, coaching/mentoring, employee development, driving performance and attendance management outcomes, and participating in internal and external projects and initiatives. The role requires solid leadership and technical competencies to ensure Service Level targets and departmental key performance indicators (Key Performance Indicators's) are met. Tight deadlines along with detailed client deliverables require the supervisor to manage several streams of work with agility and confidence, and to utilize a diverse competency profile to motivate employees within a high performance culture. Your typical week at Maximus Lead the workforce in order to meet SLR's and SLO's, enhance employee engagement and performance, communicate and execute business goals, all within a high performance culture. Assign workflow and oversee departmental activities for effective utilization of resources and systems. Identify opportunities for improvement and work with the Continuous Improvement agents to lead change. Customer focus: ensure strong business relationships are built internally and externally while working on daily activities and project-related initiatives. Play a key role in change management by encouraging innovation and creativity. Implement goals: create individual and team goals, while at the same time advocating employee empowerment and accountabilities. Lead the workforce to contribute to a positive workplace and to the growth of a successful business. Other duties as required What you offer us Knowledge, Skills and Abilities Recruit, select and hire individuals most qualified to perform the requirements of each position. Provide leadership to ensure Quality Assurance goals are met. Monitor, track and report a designated number of Quality Assurance checks for each employee, each month. Initiate appropriate timing and phases of the performance management continuum: Identify high-performing/high-potential employees and facilitate development through \"stretch assignments\" or other employee development strategies available. Ensure compliance with daily/weekly/monthly workflow schedules (see Workflow Streams Per Department). Investigate and resolve employee/client escalations regarding business policies or procedures. Report system failures immediately and, when appropriate, temporarily change processes to ensure SLR's are met. Ensure all processes adhere to client and MAXIMUS Canada policies. Review policies and procedure documents and make recommendations for updates due to procedure or policy changes. Perform all supervisory duties in accordance to human rights standards and effective management principles, in a manner that fosters productive employees. Initiate and act on ideas, and generate solutions that benefit your team, department, and company. (i.e., analyze and resolve root causes of performance inhibitors, recommend resource changes, recommend process changes). Communicate verbally and in writing clearly and concisely, with an appropriate tone and message. Escalate resource, workforce or process concerns to managers, Human Resources, and colleagues in a timely manner. Acknowledge and reward employee achievement through formal and informal employee recognition activities or programs. Chair team and committee meetings to inform, and to convey a clear, consistent, and compelling message that links employees to the company's business goals and to a positive, quality-driven workplace culture. Collaborate with clients, clients' affiliates and Maximus stakeholders to recommend changes to business policies and processes. Education and Experience Minimum 2 years' experience supervising an operational unit of a least 15 employees Current and/or relevant call centre leadership experience an asset Related post-secondary education in business administration, human relations, public administration, etc. In-depth knowledge of Contact Centre operations Knowledge of the principles of employee engagement and motivation Proven experience in business process improvement Principles related to human rights and employment standards legislation Proficient knowledge of MS Office suite; Word, Excel, PowerPoint, etc. Other Must clear Federal Reliability Security Clearance Must be bilingual (French and English) What we offer you We value your work, which enables us to continuously raise the bar on how we can best serve citizens worldwide. Maximus Canada offers the following: Competitive market-based salaries Comprehensive employer-paid benefits Three weeks of paid vacation Group Retirement Savings Plan Hybrid and remote work environments in Canada Workplace Telework allowance Employee appreciation events Maximus is passionate about our employees and place their well-being at the center of our people strategy. We are committed and proud to build a workforce that reflects the communities we serve. We value diversity, equity and inclusion and invite all interested individuals to apply and encourage applications from people with disabilities, Indigenous, ethnic and cultural origins, sexual orientations and gender identities recognizing that this is paramount for the growth and success of our organization. Salary Range – $59,543.57 - $64,048.99 CDN Maximus Global Core Values Accountability - Accepting responsibility to solve problems and rise to each challenge Collaboration - Partnering to instill trust and working as one Compassion - Empowering humanity by applying empathy and insight to every interaction Customer Focus - Cultivating an authentic desire to help others succeed Innovation - Embracing change and championing new ways forward Respect - Valuing the work we do, who we do it with, and the people we serve Additional Information: We will be accepting applications until 11:59 Project Manager on February 09, 2024. Please note that while all applications are appreciated, only those candidates selected for an interview will be contacted . (No Agencies, Please)",
    "processed_description": "company profile Maximus share authentic desire meaningful help succeed . apply deep operational expertise technology innovation digitally enable citizen engagement help government solve complex problem . reinvent government agency engage citizen seek government solve complex problem . support Employment Citizen service program worldwide . mission affect fundamental change life individual engage touchpoint . ultimately improve people's life . testament ingenuity commitment compassion bring role dedication connect citizen service Government agency . encourage application people . accommodation request aspect selection process support service connect citizen information referral quick high satisfaction . position summary Supervisor lead team staff handle variety . Supervisor responsible deliver departmental strategic outcome coaching mentoring employee development drive performance attendance management outcome participate internal external project initiative . role require solid leadership technical competency ensure Service Level target departmental key performance indicator key Performance Indicators meet . tight deadline detailed client deliverable require supervisor manage stream agility confidence utilize diverse competency profile motivate employee high performance culture . Maximus Lead workforce order meet enhance employee engagement performance communicate execute business goal high performance culture . assign workflow oversee departmental activity effective utilization resource system . identify improvement Continuous Improvement agent lead change . customer focus ensure strong business relationship build internally externally daily activity project relate initiative . play key role change management encourage innovation creativity . implement goal create individual team goal advocate employee empowerment accountability . lead workforce contribute positive workplace growth successful business . duty require offer Knowledge Skills Abilities select hire individual qualified perform requirement position . provide leadership ensure Quality Assurance goal meet . monitor track report designate number Quality Assurance check employee . initiate appropriate timing phase performance management continuum identify high perform high potential employee facilitate development stretch assignment employee development strategy . ensure compliance daily weekly monthly workflow schedule . investigate resolve employee client escalation regard business policy procedure . report system failure appropriate temporarily change process ensure meet . ensure process adhere client policy . review policy procedure document recommendation update procedure policy change . perform supervisory duty human standard effective management principle manner foster productive employee . initiate idea generate solution benefit team department company . i.e. analyze resolve root performance inhibitor recommend resource change recommend process change . communicate verbally write concisely appropriate tone message . escalate resource workforce process concern manager colleague timely manner . acknowledge reward employee achievement formal informal employee recognition activity program . chair team committee meeting inform convey clear consistent compelling message link employee company's business goal positive quality drive workplace culture . collaborate client client' affiliate Maximus stakeholder recommend change business policy process . education Minimum year' supervise operational unit employee current relevant centre leadership asset post secondary education business administration human relation public administration . depth knowledge principle employee engagement motivation proven business process improvement principle relate human employment standard legislation proficient knowledge MS Office suite . clear offer enable continuously raise bar serve citizen worldwide . offer follow competitive market base salary Comprehensive employer pay benefit remote environment Workplace Telework allowance employee appreciation event passionate employee place center people strategy . committed build workforce reflect community serve . diversity equity inclusion invite interested individual apply encourage application people indigenous ethnic cultural origin sexual orientation gender identity recognize paramount growth success organization . Salary Range – cdn Maximus Global Core accountability accept responsibility solve problem rise instill trust Compassion empower humanity apply empathy insight interaction authentic desire help succeed innovation embrace change champion forward respect people serve accept application Project Manager . note application appreciate select interview contact . Agencies",
    "results_group": {
        "extracted_noun_chunks": [
            "deep operational expertise technology innovation",
            "competitive market base salary Comprehensive employer",
            "respect",
            "government",
            "high potential employee",
            "role dedication",
            "application people",
            "testament ingenuity commitment compassion",
            "compliance daily weekly monthly workflow schedule",
            "review",
            "concisely appropriate tone message",
            "appropriate timing phase performance management continuum",
            "mission",
            "positive workplace growth successful business",
            "meaningful help",
            "root performance inhibitor",
            "depth knowledge principle employee engagement motivation",
            "lead workforce",
            "role",
            "complex problem",
            "position summary Supervisor lead",
            "touchpoint",
            "key Performance Indicators",
            "initiative",
            "sexual orientation gender identity",
            "leadership",
            "report system failure",
            "individual team goal advocate employee",
            "benefit remote environment Workplace Telework allowance employee appreciation event",
            "tight deadline detailed client deliverable require supervisor",
            "departmental activity effective utilization resource system",
            "goal",
            "resource workforce process concern manager colleague",
            "innovation creativity",
            "paramount growth success organization",
            "individual qualified perform requirement position",
            "business goal high performance culture",
            "process change",
            "idea",
            "responsibility",
            "diverse competency profile",
            "change champion",
            "committed build workforce",
            "citizen engagement",
            "track report",
            "diversity equity inclusion",
            "indigenous ethnic cultural origin",
            "problem rise instill trust Compassion empower humanity",
            "company",
            "strong business relationship",
            "business process improvement principle",
            "quick high satisfaction",
            "bar serve citizen",
            "human relation",
            "employee high performance culture",
            "policy procedure document recommendation update procedure policy change",
            "Agencies",
            "Supervisor",
            "accommodation request aspect selection process support service",
            "cdn Maximus Global Core accountability",
            "authentic desire help",
            "citizen information",
            "business policy procedure",
            "client policy",
            "select interview contact",
            "citizen service Government agency",
            "duty require",
            "Maximus",
            "solution benefit team department company",
            "supervisory duty human standard effective management principle manner",
            "Salary Range",
            "clear consistent compelling message link employee company's business goal positive quality drive workplace culture",
            "people",
            "education Minimum year",
            "employee client escalation",
            "government agency",
            "fundamental change life individual",
            "application Project Manager",
            "resource change",
            "people's life",
            "Service Level target departmental key performance indicator",
            "key role change management",
            "client client' affiliate Maximus stakeholder",
            "chair team committee meeting",
            "citizen",
            "change",
            "solid leadership technical competency",
            "internal external project initiative",
            "foster productive employee",
            "note application",
            "reward employee achievement formal informal employee recognition activity program",
            "team staff",
            "customer focus",
            "Employment Citizen service program",
            "Knowledge Skills Abilities select",
            "authentic desire",
            "interested individual",
            "improvement",
            "process",
            "number Quality Assurance check employee",
            "internally externally daily activity project",
            "business policy process",
            "stream agility confidence",
            "workflow",
            "human employment standard legislation proficient knowledge MS Office suite",
            "employee engagement performance",
            "employee development drive performance attendance management outcome",
            "development stretch assignment employee development strategy",
            "variety",
            "empathy insight interaction",
            "innovation",
            "Maximus Lead workforce order",
            "Quality Assurance goal meet"
        ],
        "combined_lemmatized_tokens": "company profile Maximus share authentic desire meaningful help succeed . apply deep operational expertise technology innovation digitally enable citizen engagement help government solve complex problem . reinvent government agency engage citizen seek government solve complex problem . support Employment Citizen service program worldwide . mission affect fundamental change life individual engage touchpoint . ultimately improve people's life . testament ingenuity commitment compassion bring role dedication connect citizen service Government agency . encourage application people . accommodation request aspect selection process support service connect citizen information referral quick high satisfaction . position summary Supervisor lead team staff handle variety . Supervisor responsible deliver departmental strategic outcome coaching mentoring employee development drive performance attendance management outcome participate internal external project initiative . role require solid leadership technical competency ensure Service Level target departmental key performance indicator key Performance Indicators meet . tight deadline detailed client deliverable require supervisor manage stream agility confidence utilize diverse competency profile motivate employee high performance culture . Maximus Lead workforce order meet enhance employee engagement performance communicate execute business goal high performance culture . assign workflow oversee departmental activity effective utilization resource system . identify improvement Continuous Improvement agent lead change . customer focus ensure strong business relationship build internally externally daily activity project relate initiative . play key role change management encourage innovation creativity . implement goal create individual team goal advocate employee empowerment accountability . lead workforce contribute positive workplace growth successful business . duty require offer Knowledge Skills Abilities select hire individual qualified perform requirement position . provide leadership ensure Quality Assurance goal meet . monitor track report designate number Quality Assurance check employee . initiate appropriate timing phase performance management continuum identify high perform high potential employee facilitate development stretch assignment employee development strategy . ensure compliance daily weekly monthly workflow schedule . investigate resolve employee client escalation regard business policy procedure . report system failure appropriate temporarily change process ensure meet . ensure process adhere client policy . review policy procedure document recommendation update procedure policy change . perform supervisory duty human standard effective management principle manner foster productive employee . initiate idea generate solution benefit team department company . i.e. analyze resolve root performance inhibitor recommend resource change recommend process change . communicate verbally write concisely appropriate tone message . escalate resource workforce process concern manager colleague timely manner . acknowledge reward employee achievement formal informal employee recognition activity program . chair team committee meeting inform convey clear consistent compelling message link employee company's business goal positive quality drive workplace culture . collaborate client client' affiliate Maximus stakeholder recommend change business policy process . education Minimum year' supervise operational unit employee current relevant centre leadership asset post secondary education business administration human relation public administration . depth knowledge principle employee engagement motivation proven business process improvement principle relate human employment standard legislation proficient knowledge MS Office suite . clear offer enable continuously raise bar serve citizen worldwide . offer follow competitive market base salary Comprehensive employer pay benefit remote environment Workplace Telework allowance employee appreciation event passionate employee place center people strategy . committed build workforce reflect community serve . diversity equity inclusion invite interested individual apply encourage application people indigenous ethnic cultural origin sexual orientation gender identity recognize paramount growth success organization . Salary Range – cdn Maximus Global Core accountability accept responsibility solve problem rise instill trust Compassion empower humanity apply empathy insight interaction authentic desire help succeed innovation embrace change champion forward respect people serve accept application Project Manager . note application appreciate select interview contact . Agencies"
    }
}