{
    "id": "2f20008250d32e04",
    "company": "WUSC / EUMC",
    "positionName": "Senior Program Officer or Program Manager",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2023-10-07T02:02:43.877Z",
    "url": "https://www.indeed.ca/rc/clk?jk=2f20008250d32e04&from=jasx&tk=1hc6garcoih7o800&vjs=3",
    "externalApplyLink": "https://wusc.ca/careers/senior-program-officer-or-program-manager-523/",
    "companyDescription": "",
    "description": "POSITION TITLE: Sr. Program Officer or Program Manager – (depending on skills and experience)\n  POSITION LOCATION: Hybrid work model in a country in which WUSC has an office. Accra, Ghana or Ottawa, Canada preferred.\n  REPORTS TO: Country Director, Ghana\n  CONTRACT TERM: Indeterminate\n  SALARY LEVEL: PRO 2 or PRO 3 (following salary scale of the country of hiring) \n APPLICATION DEADLINE: Until filled\n  EXPECTED START DATE: November 2023\n  LANGUAGE REQUIRED: Fluency in English. Strong competency in French is preferred.\n  Are you passionate about international development project management? WUSC is currently looking for a Senior Program Officer or Program Manager to provide support to market systems development, agriculture and youth economic opportunities projects!\n  BACKGROUND\n  RESPONSIBILITIES\n  The Program Manager / Sr. Program Officer, will support the strategic implementation of WUSC projects falling under the Economic Opportunities portfolio initially focusing support on a soon to be awarded project supporting Agricultural Technical and Vocational Education and Training in Ghana. The position will expand to include a number of other projects in the Economic Opportunities area in the near future. The position will work in a matrix management environment reporting initially to the Country Director, Ghana (based in Ghana) and work closely on a day-to-day basis with the project teams based in the countries of operation. The PM / SPO will play a critical role in: supporting the Project Director to comply with donor policies and project reporting requirements; managing the WUSC Ottawa portion of the project budget; fostering collaboration and communication between WUSC Ottawa and WUSC country teams; managing quality control processes; and supporting the growth of WUSC’s programming portfolio. Duties include:\n  Program Management\n \n   Provide support to project teams on the technical direction and implementation including preparation of Work Plans, Monitoring and Evaluation Plans, Gender Equality and Social Inclusion (GESI) Strategies, and other relevant documents required by the donor;\n   Support the Project Director in effectively establishing relationships for project management and governance (ie. developing Memoranda of Understanding, supporting the Project Steering Committee);\n   Provide general troubleshooting and facilitation support to requests from the WUSC country teams and act as a coordinator with various functional units within WUSC’s HQ (e.g. communications, IT, human resources, etc.) to deliver support WUSC country teams;\n   Support project reporting in collaboration with the WUSC country teams;\n   Ensure WUSC’s Gender Equality Policy is applied and support gender mainstreaming in projects, including participating in the development of project-specific gender strategies and providing coaching to staff in gender equality;\n   Exercise budget control and manage project procurement for international contracts in accordance with contractual obligations and in consultation with the Financial Analyst, the Project Director; and\n   Work with the Financial Analysts to monitor budgets, prepare financial reports and provide financial analysis.\n \n  Quality Assurance and Capacity Development\n \n   Identify relevant technical expertise from WUSC’s networks of partners, volunteers and consultants;\n   Collaborate with technical advisors in Canada and in our country offices in order to ensure a robust approach to programming, drawing from international best practices, within and across our project portfolio;\n   Collaborate with WUSC’s current network of relevant technical experts in multiple project countries in order to develop WUSC’s toolbox and approaches to relevant issues within our thematic areas;\n   Ensure the consistent identification and application of internal quality standards, lessons learned and external best practices in economic opportunities and related programming;\n   Support program staff in the development or revision of program/project-specific strategies, plans and activities;\n   Assist program staff in project planning and management approaches (including results based management tools) and propose strategies to increase project/program impact;\n   Collaborate with existing WUSC technical resources to identify strengths and weaknesses in existing practices, leading the development of improved systems, processes, and tools for improving our results;\n   Collaborate with existing WUSC technical resources to create resources and tools (i.e. tipsheets, webinars, etc.) that to assist staff in effectively prioritizing and integrating best practices in their work; and\n   Support capacity building efforts related to education and related programming for WUSC Ottawa and field staff, including training and coaching to WUSC staff and partners.\n \n  Networking, Thought Leadership, and Positioning\n \n   Identify potential international, Canadian and local partners for new initiatives;\n   Seek opportunities for WUSC to convene and collaborate with peers and thought leaders in our programming areas, especially on issues related to market systems development and youth economic opportunities;\n   Represent WUSC at relevant conferences, fora, working groups and meetings and maintain close working relationships with counterparts in other relevant international NGOs, donors, partners, and academia;\n   Prepare and deliver presentations about WUSC’s programs as required;\n   Seek opportunities to increase the awareness, commitment and involvement of WUSC’s University and College members, private sector partners and other key stakeholders; and\n   Participate in WUSC’s communications work by providing data, information and other material for use with WUSC’s Canadian and international constituency and assist in implementing constituency building, communication strategies, and fundraising activities.\n \n  Work environment\n \n   Promote and maintain an organizational culture that advances gender equality, reduces power abuse and inequalities, and fosters trust, respect and safety.\n   Create a working environment is free from sexual exploitation, abuse and harassment (SEAH)\n   Ensure high standards of prevention and response measures for SEAH are in place consistent with the WUSC’s safeguarding policies and WUSC’s Code of Conduct.\n   Any other duties as assigned.\n \n  QUALIFICATIONS AND COMPETENCIES\n  Education\n  Bachelor’s degree in a related field (social sciences, agriculture, business) or equivalent working experience. Master’s degree in a related field an asset\n  Formal training in Market Systems Development is preferred\n  Experience & Competencies\n \n   A minimum of 5 years of experience working for international development organizations, preferably in developing countries and in Canada;\n   Knowledge of one or more of WUSC’s thematic priorities of education, economic opportunity and empowerment including programming priorities and approaches\n   Excellent working knowledge of Results Based Management\n   Experience with a range of institutional donors, especially MasterCard Foundation or Global Affairs Canada\n   Excellent administration and organizational skills, including ability to prioritize tasks and handle multiple initiatives under tight deadlines;\n   Preference for working in teams;\n   Proven ability to work productively with a variety of stakeholders to run participatory processes and meet tight deadlines with an emphasis on producing quality products;\n   Effective interpersonal and influencing skills, including the ability to build relationships, network, communicate and represent at a senior level are essential;\n   Flexibility, with a strong work ethic and an entrepreneurial spirit to accommodate high levels of responsibility and multiple priorities;\n   Excellent capacity building skills, with demonstrated experience in effective training, coaching and facilitation;\n   Share in WUSC’s commitment and approach to advance gender equality and social inclusion for all young people;\n   Ability to contribute to WUSC’s organizational culture that respects differences, including sex, age, ability, refugee or migration status, race, ethnicity, religion, gender identity and expression, sexual orientation, and other identity factors.\n \n  Languages: Complete fluency in English. French competency is preferred.\n  Other:\n  Ability to travel internationally roughly 20 percent of time;\n  Ability to work a flexible schedule.\n  WHY WORK WITH WUSC?\n  Join Us. Our work is important, cutting-edge, and rewarding. We encourage curiosity, innovation, and flexibility.\n  WUSC offers a dynamic international work environment with a diverse intercultural workforce. We offer employees exciting opportunities to apply their skills and gain experience all while making a difference in the lives of youth around the world. Employees at WUSC work hard to create lasting change in education, economic opportunities and empowerment.\n  WUSC currently has offices in Canada (headquarters), the Caribbean (Jamaica, Guyana, Barbados, Dominica), Côte d’Ivoire, Ghana, Iraq, Jordan, Kenya, Malawi, Mali, South Sudan, Sri Lanka, and Uganda.\n  APPLICATIONS\n  WUSC’s activities seek to balance inequities and create sustainable development around the globe; the work ethic of our staff, volunteers, representatives and partners shall correspond to the values and mission of the organization. WUSC promotes responsibility, respect, honesty, and professional excellence and we will not tolerate harassment, coercion, sexual exploitation or abuse of any form. Successful applicants will be required to undertake an enhanced criminal record check where appropriate.\n  WUSC is an equal opportunity employer. We welcome and encourage applications from people with disabilities. Accommodations are available upon request for candidates taking part in all aspects of the selection process. Only those candidates selected for an interview will be contacted. No telephone calls please."
}