{
    "id": "2f20008250d32e04",
    "companyDescription": "",
    "description": "POSITION TITLE: Sr. Program Officer or Program Manager – (depending on skills and experience)\n  POSITION LOCATION: Hybrid work model in a country in which WUSC has an office. Accra, Ghana or Ottawa, Canada preferred.\n  REPORTS TO: Country Director, Ghana\n  CONTRACT TERM: Indeterminate\n  SALARY LEVEL: PRO 2 or PRO 3 (following salary scale of the country of hiring) \n APPLICATION DEADLINE: Until filled\n  EXPECTED START DATE: November 2023\n  LANGUAGE REQUIRED: Fluency in English. Strong competency in French is preferred.\n  Are you passionate about international development project management? WUSC is currently looking for a Senior Program Officer or Program Manager to provide support to market systems development, agriculture and youth economic opportunities projects!\n  BACKGROUND\n  RESPONSIBILITIES\n  The Program Manager / Sr. Program Officer, will support the strategic implementation of WUSC projects falling under the Economic Opportunities portfolio initially focusing support on a soon to be awarded project supporting Agricultural Technical and Vocational Education and Training in Ghana. The position will expand to include a number of other projects in the Economic Opportunities area in the near future. The position will work in a matrix management environment reporting initially to the Country Director, Ghana (based in Ghana) and work closely on a day-to-day basis with the project teams based in the countries of operation. The PM / SPO will play a critical role in: supporting the Project Director to comply with donor policies and project reporting requirements; managing the WUSC Ottawa portion of the project budget; fostering collaboration and communication between WUSC Ottawa and WUSC country teams; managing quality control processes; and supporting the growth of WUSC’s programming portfolio. Duties include:\n  Program Management\n \n   Provide support to project teams on the technical direction and implementation including preparation of Work Plans, Monitoring and Evaluation Plans, Gender Equality and Social Inclusion (GESI) Strategies, and other relevant documents required by the donor;\n   Support the Project Director in effectively establishing relationships for project management and governance (ie. developing Memoranda of Understanding, supporting the Project Steering Committee);\n   Provide general troubleshooting and facilitation support to requests from the WUSC country teams and act as a coordinator with various functional units within WUSC’s HQ (e.g. communications, IT, human resources, etc.) to deliver support WUSC country teams;\n   Support project reporting in collaboration with the WUSC country teams;\n   Ensure WUSC’s Gender Equality Policy is applied and support gender mainstreaming in projects, including participating in the development of project-specific gender strategies and providing coaching to staff in gender equality;\n   Exercise budget control and manage project procurement for international contracts in accordance with contractual obligations and in consultation with the Financial Analyst, the Project Director; and\n   Work with the Financial Analysts to monitor budgets, prepare financial reports and provide financial analysis.\n \n  Quality Assurance and Capacity Development\n \n   Identify relevant technical expertise from WUSC’s networks of partners, volunteers and consultants;\n   Collaborate with technical advisors in Canada and in our country offices in order to ensure a robust approach to programming, drawing from international best practices, within and across our project portfolio;\n   Collaborate with WUSC’s current network of relevant technical experts in multiple project countries in order to develop WUSC’s toolbox and approaches to relevant issues within our thematic areas;\n   Ensure the consistent identification and application of internal quality standards, lessons learned and external best practices in economic opportunities and related programming;\n   Support program staff in the development or revision of program/project-specific strategies, plans and activities;\n   Assist program staff in project planning and management approaches (including results based management tools) and propose strategies to increase project/program impact;\n   Collaborate with existing WUSC technical resources to identify strengths and weaknesses in existing practices, leading the development of improved systems, processes, and tools for improving our results;\n   Collaborate with existing WUSC technical resources to create resources and tools (i.e. tipsheets, webinars, etc.) that to assist staff in effectively prioritizing and integrating best practices in their work; and\n   Support capacity building efforts related to education and related programming for WUSC Ottawa and field staff, including training and coaching to WUSC staff and partners.\n \n  Networking, Thought Leadership, and Positioning\n \n   Identify potential international, Canadian and local partners for new initiatives;\n   Seek opportunities for WUSC to convene and collaborate with peers and thought leaders in our programming areas, especially on issues related to market systems development and youth economic opportunities;\n   Represent WUSC at relevant conferences, fora, working groups and meetings and maintain close working relationships with counterparts in other relevant international NGOs, donors, partners, and academia;\n   Prepare and deliver presentations about WUSC’s programs as required;\n   Seek opportunities to increase the awareness, commitment and involvement of WUSC’s University and College members, private sector partners and other key stakeholders; and\n   Participate in WUSC’s communications work by providing data, information and other material for use with WUSC’s Canadian and international constituency and assist in implementing constituency building, communication strategies, and fundraising activities.\n \n  Work environment\n \n   Promote and maintain an organizational culture that advances gender equality, reduces power abuse and inequalities, and fosters trust, respect and safety.\n   Create a working environment is free from sexual exploitation, abuse and harassment (SEAH)\n   Ensure high standards of prevention and response measures for SEAH are in place consistent with the WUSC’s safeguarding policies and WUSC’s Code of Conduct.\n   Any other duties as assigned.\n \n  QUALIFICATIONS AND COMPETENCIES\n  Education\n  Bachelor’s degree in a related field (social sciences, agriculture, business) or equivalent working experience. Master’s degree in a related field an asset\n  Formal training in Market Systems Development is preferred\n  Experience & Competencies\n \n   A minimum of 5 years of experience working for international development organizations, preferably in developing countries and in Canada;\n   Knowledge of one or more of WUSC’s thematic priorities of education, economic opportunity and empowerment including programming priorities and approaches\n   Excellent working knowledge of Results Based Management\n   Experience with a range of institutional donors, especially MasterCard Foundation or Global Affairs Canada\n   Excellent administration and organizational skills, including ability to prioritize tasks and handle multiple initiatives under tight deadlines;\n   Preference for working in teams;\n   Proven ability to work productively with a variety of stakeholders to run participatory processes and meet tight deadlines with an emphasis on producing quality products;\n   Effective interpersonal and influencing skills, including the ability to build relationships, network, communicate and represent at a senior level are essential;\n   Flexibility, with a strong work ethic and an entrepreneurial spirit to accommodate high levels of responsibility and multiple priorities;\n   Excellent capacity building skills, with demonstrated experience in effective training, coaching and facilitation;\n   Share in WUSC’s commitment and approach to advance gender equality and social inclusion for all young people;\n   Ability to contribute to WUSC’s organizational culture that respects differences, including sex, age, ability, refugee or migration status, race, ethnicity, religion, gender identity and expression, sexual orientation, and other identity factors.\n \n  Languages: Complete fluency in English. French competency is preferred.\n  Other:\n  Ability to travel internationally roughly 20 percent of time;\n  Ability to work a flexible schedule.\n  WHY WORK WITH WUSC?\n  Join Us. Our work is important, cutting-edge, and rewarding. We encourage curiosity, innovation, and flexibility.\n  WUSC offers a dynamic international work environment with a diverse intercultural workforce. We offer employees exciting opportunities to apply their skills and gain experience all while making a difference in the lives of youth around the world. Employees at WUSC work hard to create lasting change in education, economic opportunities and empowerment.\n  WUSC currently has offices in Canada (headquarters), the Caribbean (Jamaica, Guyana, Barbados, Dominica), Côte d’Ivoire, Ghana, Iraq, Jordan, Kenya, Malawi, Mali, South Sudan, Sri Lanka, and Uganda.\n  APPLICATIONS\n  WUSC’s activities seek to balance inequities and create sustainable development around the globe; the work ethic of our staff, volunteers, representatives and partners shall correspond to the values and mission of the organization. WUSC promotes responsibility, respect, honesty, and professional excellence and we will not tolerate harassment, coercion, sexual exploitation or abuse of any form. Successful applicants will be required to undertake an enhanced criminal record check where appropriate.\n  WUSC is an equal opportunity employer. We welcome and encourage applications from people with disabilities. Accommodations are available upon request for candidates taking part in all aspects of the selection process. Only those candidates selected for an interview will be contacted. No telephone calls please.",
    "preprocessed_description": "POSITION TITLE: Sr. Program Officer or Program Manager – (depending on skills and experience) POSITION LOCATION: Hybrid work model in a country in which WUSC has an office. Accra, Ghana or Ottawa, Canada preferred. REPORTS TO: Country Director, Ghana CONTRACT TERM: Indeterminate SALARY LEVEL: PRO 2 or PRO 3 (following salary scale of the country of hiring) APPLICATION DEADLINE: Until filled EXPECTED START DATE: November 2023 LANGUAGE REQUIRED: Fluency in English. Strong competency in French is preferred. Are you passionate about international development project management? WUSC is currently looking for a Senior Program Officer or Program Manager to provide support to market systems development, agriculture and youth economic opportunities projects! BACKGROUND RESPONSIBILITIES The Program Manager / Sr. Program Officer, will support the strategic implementation of WUSC projects falling under the Economic Opportunities portfolio initially focusing support on a soon to be awarded project supporting Agricultural Technical and Vocational Education and Training in Ghana. The position will expand to include a number of other projects in the Economic Opportunities area in the near future. The position will work in a matrix management environment reporting initially to the Country Director, Ghana (based in Ghana) and work closely on a day-to-day basis with the project teams based in the countries of operation. The Project Manager / SPO will play a critical role in: supporting the Project Director to comply with donor policies and project reporting requirements; managing the WUSC Ottawa portion of the project budget; fostering collaboration and communication between WUSC Ottawa and WUSC country teams; managing quality control processes; and supporting the growth of WUSC's programming portfolio. Duties include: Program Management Provide support to project teams on the technical direction and implementation including preparation of Work Plans, Monitoring and Evaluation Plans, Gender Equality and Social Inclusion (GESI) Strategies, and other relevant documents required by the donor; Support the Project Director in effectively establishing relationships for project management and governance (ie. developing Memoranda of Understanding, supporting the Project Steering Committee); Provide general troubleshooting and facilitation support to requests from the WUSC country teams and act as a coordinator with various functional units within WUSC's HQ (e.g. communications, IT, human resources, etc.) to deliver support WUSC country teams; Support project reporting in collaboration with the WUSC country teams; Ensure WUSC's Gender Equality Policy is applied and support gender mainstreaming in projects, including participating in the development of project-specific gender strategies and providing coaching to staff in gender equality; Exercise budget control and manage project procurement for international contracts in accordance with contractual obligations and in consultation with the Financial Analyst, the Project Director; and Work with the Financial Analysts to monitor budgets, prepare financial reports and provide financial analysis. Quality Assurance and Capacity Development Identify relevant technical expertise from WUSC's networks of partners, volunteers and consultants; Collaborate with technical advisors in Canada and in our country offices in order to ensure a robust approach to programming, drawing from international best practices, within and across our project portfolio; Collaborate with WUSC's current network of relevant technical experts in multiple project countries in order to develop WUSC's toolbox and approaches to relevant issues within our thematic areas; Ensure the consistent identification and application of internal quality standards, lessons learned and external best practices in economic opportunities and related programming; Support program staff in the development or revision of program/project-specific strategies, plans and activities; Assist program staff in project planning and management approaches (including results based management tools) and propose strategies to increase project/program impact; Collaborate with existing WUSC technical resources to identify strengths and weaknesses in existing practices, leading the development of improved systems, processes, and tools for improving our results; Collaborate with existing WUSC technical resources to create resources and tools (i.e. tipsheets, webinars, etc.) that to assist staff in effectively prioritizing and integrating best practices in their work; and Support capacity building efforts related to education and related programming for WUSC Ottawa and field staff, including training and coaching to WUSC staff and partners. Networking, Thought Leadership, and Positioning Identify potential international, Canadian and local partners for new initiatives; Seek opportunities for WUSC to convene and collaborate with peers and thought leaders in our programming areas, especially on issues related to market systems development and youth economic opportunities; Represent WUSC at relevant conferences, fora, working groups and meetings and maintain close working relationships with counterparts in other relevant international NGOs, donors, partners, and academia; Prepare and deliver presentations about WUSC's programs as required; Seek opportunities to increase the awareness, commitment and involvement of WUSC's University and College members, private sector partners and other key stakeholders; and Participate in WUSC's communications work by providing data, information and other material for use with WUSC's Canadian and international constituency and assist in implementing constituency building, communication strategies, and fundraising activities. Work environment Promote and maintain an organizational culture that advances gender equality, reduces power abuse and inequalities, and fosters trust, respect and safety. Create a working environment is free from sexual exploitation, abuse and harassment (SEAH) Ensure high standards of prevention and response measures for SEAH are in place consistent with the WUSC's safeguarding policies and WUSC's Code of Conduct. Any other duties as assigned. QUALIFICATIONS AND COMPETENCIES Education Bachelor's degree in a related field (social sciences, agriculture, business) or equivalent working experience. Master's degree in a related field an asset Formal training in Market Systems Development is preferred Experience & Competencies A minimum of 5 years of experience working for international development organizations, preferably in developing countries and in Canada; Knowledge of one or more of WUSC's thematic priorities of education, economic opportunity and empowerment including programming priorities and approaches Excellent working knowledge of Results Based Management Experience with a range of institutional donors, especially MasterCard Foundation or Global Affairs Canada Excellent administration and organizational skills, including ability to prioritize tasks and handle multiple initiatives under tight deadlines; Preference for working in teams; Proven ability to work productively with a variety of stakeholders to run participatory processes and meet tight deadlines with an emphasis on producing quality products; Effective interpersonal and influencing skills, including the ability to build relationships, network, communicate and represent at a senior level are essential; Flexibility, with a strong work ethic and an entrepreneurial spirit to accommodate high levels of responsibility and multiple priorities; Excellent capacity building skills, with demonstrated experience in effective training, coaching and facilitation; Share in WUSC's commitment and approach to advance gender equality and social inclusion for all young people; Ability to contribute to WUSC's organizational culture that respects differences, including sex, age, ability, refugee or migration status, race, ethnicity, religion, gender identity and expression, sexual orientation, and other identity factors. Languages: Complete fluency in English. French competency is preferred. Other: Ability to travel internationally roughly 20 percent of time; Ability to work a flexible schedule. WHY WORK WITH WUSC? Join Us. Our work is important, cutting-edge, and rewarding. We encourage curiosity, innovation, and flexibility. WUSC offers a dynamic international work environment with a diverse intercultural workforce. We offer employees exciting opportunities to apply their skills and gain experience all while making a difference in the lives of youth around the world. Employees at WUSC work hard to create lasting change in education, economic opportunities and empowerment. WUSC currently has offices in Canada (headquarters), the Caribbean (Jamaica, Guyana, Barbados, Dominica), Côte d'Ivoire, Ghana, Iraq, Jordan, Kenya, Malawi, Mali, South Sudan, Sri Lanka, and Uganda. APPLICATIONS WUSC's activities seek to balance inequities and create sustainable development around the globe; the work ethic of our staff, volunteers, representatives and partners shall correspond to the values and mission of the organization. WUSC promotes responsibility, respect, honesty, and professional excellence and we will not tolerate harassment, coercion, sexual exploitation or abuse of any form. Successful applicants will be required to undertake an enhanced criminal record check where appropriate. WUSC is an equal opportunity employer. We welcome and encourage applications from people with disabilities. Accommodations are available upon request for candidates taking part in all aspects of the selection process. Only those candidates selected for an interview will be contacted. No telephone calls please.",
    "processed_description": "position TITLE Sr . Program Officer Manager – depend skill position location hybrid model country office . prefer . report Country Director Ghana contract term indeterminate salary level pro pro follow salary scale country hire application deadline fill expect START LANGUAGE REQUIRED fluency . strong competency prefer . passionate international development project management currently Senior Program Officer Program Manager provide support market system development agriculture youth economic project background responsibilitie Program Manager Sr . Program Officer support strategic implementation WUSC project fall Economic Opportunities portfolio initially focus support award project support . position expand include number project Economic Opportunities area future . position matrix management environment report initially Country Director base closely basis project team base country operation . play critical role support Project Director comply donor policy project reporting requirement manage WUSC portion project budget foster collaboration communication WUSC country team manage quality control process support growth WUSC's programming portfolio . duty include support project team technical direction implementation include preparation plan Monitoring Evaluation plan GESI strategy relevant document require donor support Project Director effectively establish relationship project management governance . develop support provide general troubleshooting facilitation support request WUSC country team coordinator functional unit WUSC's HQ e.g. communication human resource . deliver support WUSC country team support project report collaboration WUSC country team ensure apply support gender mainstreame project include participate development project specific gender strategy provide coaching staff gender equality exercise budget control manage project procurement international contract contractual obligation consultation Financial Analyst Project Director Financial analyst monitor budget prepare financial report provide financial analysis . Quality Assurance Capacity Development identify relevant technical expertise WUSC's network partner volunteer consultant collaborate technical advisor country office order ensure robust approach programming draw international good practice project portfolio collaborate WUSC's current network relevant technical expert multiple project country order develop WUSC's toolbox approach relevant issue thematic area ensure consistent identification application internal quality standard lesson learn external good practice economic programming support program staff development revision program project specific strategy plan activity assist program staff project planning management approach include result base management tool propose strategy increase project program impact collaborate exist WUSC technical resource identify strength weakness exist practice lead development improved system process tool improve result collaborate exist WUSC technical resource create resource tool i.e. webinars . assist staff effectively prioritize integrate good practice support capacity building effort relate education programming WUSC field staff include training coaching WUSC staff partner . networking Thought Leadership potential international canadian local partner initiative seek convene collaborate peer leader programming area issue relate market system development youth economic represent relevant conference fora group meeting maintain close relationship counterpart relevant international NGOs donor partner academia prepare deliver presentation WUSC's program require seek increase awareness commitment involvement WUSC's University College private sector partner key stakeholder WUSC's communication provide datum information material WUSC's canadian international constituency assist implement constituency building communication strategy fundraising activity . environment promote maintain organizational culture advance gender equality reduce power abuse inequality foster trust respect safety . create environment free sexual exploitation abuse harassment seah ensure high standard prevention response measure seah place consistent WUSC's safeguarding policy . duty assign . qualification degree field agriculture business equivalent . Master's degree relate field asset formal training minimum international development organization preferably develop country Knowledge WUSC's thematic priority education economic empowerment include programming priority approach excellent knowledge result Based Management range institutional donor MasterCard Foundation Global Affairs excellent administration organizational skill include prioritize task handle multiple initiative tight deadline team proven productively variety stakeholder participatory process meet tight deadline emphasis produce quality product effective interpersonal influence skill include build relationship network communicate represent senior level essential flexibility strong ethic entrepreneurial spirit accommodate high level responsibility multiple priority excellent capacity building skill demonstrate effective training coaching facilitation Share WUSC's commitment approach advance gender equality social inclusion young people contribute WUSC's organizational culture respect difference include sex age refugee migration status race ethnicity religion gender identity expression sexual orientation identity factor . language complete fluency . french competency prefer . travel internationally flexible schedule . WUSC join . cutting edge rewarding . encourage curiosity innovation flexibility . offer dynamic international environment diverse intercultural workforce . offer employee exciting apply skill gain difference life youth . employee WUSC hard create change education economic empowerment . currently office headquarters . application WUSC's activity seek balance inequity create sustainable development globe ethic staff volunteer representative partner correspond mission organization . promote responsibility respect honesty professional excellence tolerate harassment coercion sexual exploitation abuse form . successful applicant require undertake enhance criminal record check appropriate . equal employer . encourage application people . accommodation request aspect selection process . select interview contact . .",
    "results_group": {
        "extracted_noun_chunks": [
            "datum information material",
            "support project team technical direction implementation",
            "duty assign",
            "participate development project specific gender strategy",
            "environment free sexual exploitation abuse harassment seah",
            "external good practice economic programming support program staff development revision program project specific strategy plan activity",
            "WUSC's toolbox approach relevant issue thematic area",
            "MasterCard Foundation Global Affairs",
            "application people",
            "market system development youth economic",
            "support",
            "change education economic empowerment",
            "internationally flexible schedule",
            "duty",
            "curiosity innovation flexibility",
            "relevant technical expert",
            "effective training coaching facilitation Share WUSC's commitment approach advance gender equality social inclusion",
            "technical advisor country office order",
            "task handle multiple initiative tight deadline team",
            "constituency building communication strategy fundraising activity",
            "honesty",
            "balance inequity",
            "relevant conference fora group meeting",
            "position expand",
            "donor policy project reporting requirement",
            "TITLE Sr",
            "communication human resource",
            "integrate good practice support capacity building effort",
            "Economic Opportunities portfolio",
            "WUSC technical resource",
            "successful applicant",
            "report",
            "young people",
            "sex age refugee migration status race ethnicity religion gender identity expression sexual orientation identity factor",
            "convene",
            "support award project support",
            "general troubleshooting facilitation support request",
            "difference life youth",
            "WUSC's program",
            "edge",
            "program staff project planning management approach",
            "increase awareness commitment involvement",
            "preparation plan Monitoring Evaluation plan GESI strategy",
            "senior level essential flexibility strong ethic entrepreneurial spirit",
            "robust approach programming",
            "WUSC's activity",
            "WUSC's canadian international constituency",
            "position matrix management environment report",
            "dynamic international environment",
            "application deadline fill",
            "WUSC staff partner",
            "professional excellence",
            "quality product effective interpersonal influence skill",
            "WUSC's safeguarding policy",
            "diverse intercultural workforce",
            "number project Economic Opportunities area future",
            "peer leader programming area issue",
            "relationship project management governance",
            "quality control process support growth WUSC's programming portfolio",
            "strong competency",
            "high standard prevention response measure seah place",
            "presentation",
            "WUSC's organizational culture respect difference",
            "variety stakeholder participatory process",
            "Senior Program Officer Program Manager",
            "Program Manager Sr",
            "strength weakness",
            "Quality Assurance Capacity Development",
            "organizational culture",
            "build relationship network",
            "select interview contact",
            "WUSC",
            "relevant document",
            "staff gender equality exercise budget control",
            "qualification degree field agriculture business equivalent",
            "relevant technical expertise",
            "donor support Project Director",
            "programming priority approach excellent knowledge result",
            "support gender mainstreame project",
            "Country Director Ghana contract term indeterminate salary level pro pro follow salary scale country",
            "high level responsibility multiple priority excellent capacity building skill",
            "WUSC's network partner volunteer consultant",
            "networking Thought Leadership potential international canadian local partner initiative",
            "START LANGUAGE REQUIRED fluency",
            "sustainable development globe ethic staff volunteer representative partner correspond mission organization",
            "application",
            "critical role support Project Director",
            "Master's degree",
            "employee",
            "WUSC's University College private sector partner key stakeholder WUSC's communication",
            "education programming WUSC field staff",
            "international good practice project portfolio",
            "practice lead development improved system process tool",
            "passionate international development project management",
            "harassment coercion sexual exploitation abuse form",
            "field asset formal training minimum international development organization",
            "language complete fluency",
            "WUSC country team coordinator functional unit",
            "french competency",
            "position",
            "Program Officer Manager",
            "power abuse inequality foster trust respect safety",
            "WUSC country team support project report collaboration WUSC country team",
            "financial analysis",
            "currently office headquarters",
            "strategy increase project program impact collaborate",
            "skill position location hybrid model country office",
            "resource tool",
            "WUSC portion project budget foster collaboration communication WUSC country team",
            "tight deadline emphasis",
            "accommodation request aspect selection process",
            "consistent identification application internal quality standard lesson",
            "project procurement international contract contractual obligation consultation Financial Analyst Project Director Financial analyst monitor budget",
            "advance gender equality",
            "criminal record check",
            "equal employer",
            "Country Director base closely basis project team base country operation",
            "Program Officer",
            "country Knowledge WUSC's thematic priority education economic empowerment",
            "financial report",
            "i.e. webinars",
            "WUSC's HQ e.g.",
            "staff",
            "support market system development agriculture youth economic project background responsibilitie"
        ],
        "combined_lemmatized_tokens": "position TITLE Sr . Program Officer Manager – depend skill position location hybrid model country office . prefer . report Country Director Ghana contract term indeterminate salary level pro pro follow salary scale country hire application deadline fill expect START LANGUAGE REQUIRED fluency . strong competency prefer . passionate international development project management currently Senior Program Officer Program Manager provide support market system development agriculture youth economic project background responsibilitie Program Manager Sr . Program Officer support strategic implementation WUSC project fall Economic Opportunities portfolio initially focus support award project support . position expand include number project Economic Opportunities area future . position matrix management environment report initially Country Director base closely basis project team base country operation . play critical role support Project Director comply donor policy project reporting requirement manage WUSC portion project budget foster collaboration communication WUSC country team manage quality control process support growth WUSC's programming portfolio . duty include support project team technical direction implementation include preparation plan Monitoring Evaluation plan GESI strategy relevant document require donor support Project Director effectively establish relationship project management governance . develop support provide general troubleshooting facilitation support request WUSC country team coordinator functional unit WUSC's HQ e.g. communication human resource . deliver support WUSC country team support project report collaboration WUSC country team ensure apply support gender mainstreame project include participate development project specific gender strategy provide coaching staff gender equality exercise budget control manage project procurement international contract contractual obligation consultation Financial Analyst Project Director Financial analyst monitor budget prepare financial report provide financial analysis . Quality Assurance Capacity Development identify relevant technical expertise WUSC's network partner volunteer consultant collaborate technical advisor country office order ensure robust approach programming draw international good practice project portfolio collaborate WUSC's current network relevant technical expert multiple project country order develop WUSC's toolbox approach relevant issue thematic area ensure consistent identification application internal quality standard lesson learn external good practice economic programming support program staff development revision program project specific strategy plan activity assist program staff project planning management approach include result base management tool propose strategy increase project program impact collaborate exist WUSC technical resource identify strength weakness exist practice lead development improved system process tool improve result collaborate exist WUSC technical resource create resource tool i.e. webinars . assist staff effectively prioritize integrate good practice support capacity building effort relate education programming WUSC field staff include training coaching WUSC staff partner . networking Thought Leadership potential international canadian local partner initiative seek convene collaborate peer leader programming area issue relate market system development youth economic represent relevant conference fora group meeting maintain close relationship counterpart relevant international NGOs donor partner academia prepare deliver presentation WUSC's program require seek increase awareness commitment involvement WUSC's University College private sector partner key stakeholder WUSC's communication provide datum information material WUSC's canadian international constituency assist implement constituency building communication strategy fundraising activity . environment promote maintain organizational culture advance gender equality reduce power abuse inequality foster trust respect safety . create environment free sexual exploitation abuse harassment seah ensure high standard prevention response measure seah place consistent WUSC's safeguarding policy . duty assign . qualification degree field agriculture business equivalent . Master's degree relate field asset formal training minimum international development organization preferably develop country Knowledge WUSC's thematic priority education economic empowerment include programming priority approach excellent knowledge result Based Management range institutional donor MasterCard Foundation Global Affairs excellent administration organizational skill include prioritize task handle multiple initiative tight deadline team proven productively variety stakeholder participatory process meet tight deadline emphasis produce quality product effective interpersonal influence skill include build relationship network communicate represent senior level essential flexibility strong ethic entrepreneurial spirit accommodate high level responsibility multiple priority excellent capacity building skill demonstrate effective training coaching facilitation Share WUSC's commitment approach advance gender equality social inclusion young people contribute WUSC's organizational culture respect difference include sex age refugee migration status race ethnicity religion gender identity expression sexual orientation identity factor . language complete fluency . french competency prefer . travel internationally flexible schedule . WUSC join . cutting edge rewarding . encourage curiosity innovation flexibility . offer dynamic international environment diverse intercultural workforce . offer employee exciting apply skill gain difference life youth . employee WUSC hard create change education economic empowerment . currently office headquarters . application WUSC's activity seek balance inequity create sustainable development globe ethic staff volunteer representative partner correspond mission organization . promote responsibility respect honesty professional excellence tolerate harassment coercion sexual exploitation abuse form . successful applicant require undertake enhance criminal record check appropriate . equal employer . encourage application people . accommodation request aspect selection process . select interview contact . ."
    }
}