{
    "id": "10070190b2b77984",
    "company": "Smile Innovations Group",
    "positionName": "Dental Technician - Case Consultant & Quality Control",
    "jobType": [],
    "location": "Gatineau, QC",
    "salary": null,
    "postingDateParsed": "2023-09-19T22:41:11.088Z",
    "url": "https://www.indeed.ca/rc/clk?jk=10070190b2b77984&from=jasx&tk=1hb2v4hd2is3q800&vjs=3",
    "externalApplyLink": "https://smileinnovationsgroup.bamboohr.com/careers/44?source=indeed&src=indeed&postedDate=2023-09-18",
    "companyDescription": "",
    "description": "Dental Technician - Case Consultant & Quality Control \n  (Français version suit)\n \n  ABOUT MILIDENT \n  Opened in June 1995, Milident Inc specializes in the creation of complex cases, implant-supported crown and bridge, fixed and removable dentures as well as orthodontic appliances. Always at the forefront of technology, Milident Inc. continues to offer its products and services tailored to the specific needs of its clientele. Through its internal research and development program, Milident Inc. is continually exploring new technological advances in manufacturing its high-precision dental prosthesis.\n  \n  \n Description: \n  The Case Consultant is responsible for client communication with regards to case support and treatment planning, while maintaining a high level of customer satisfaction. This position will also be responsible for managing final quality control and providing internal team training around technical aspects of all cases.\n  \n  \n If you have at least 5 years’ experience in the dental lab industry, together with strong supervisory skills, we want to hear from you! A relocation package will be available.\n  \n  \n  General Responsibilities:\n \n  Case Consultant \n  \n  Assess, identify, and offer solutions for problem restorative cases \n  Discuss restorative options with doctors via phone/email \n  Ensure proper instructions are given to the technicians regarding problem cases \n  \n \n Final Quality Control \n  \n  Ensure final restoration and appliances meet the company quality control standards\n \n  \n  \n  Qualifications:\n  \n  \n  \n  Technical School – Certification as a Registered Dental Technician or equivalent education and experience \n  5 years of experience in dental lab industry \n  Must be able to manage people, processes, and technology \n  Must possess effective English and French communication skills (both oral and written,) while offering strong interpersonal skills \n  Excellent time management skills; acts skillfully with a sense of urgency \n  High attention to detail and accuracy \n  Ability to think strategically and to lead \n  Advanced troubleshooting and multi-tasking experience \n  Awareness of relevant industry technology trends and applications\n \n  \n  \n Technicien dentaire - Consultant cas et contrôle de la qualité\n \n  À PROPOS DE NOUS \n  Fondée en juin 1995, nous nous spécialisons dans la création de cas complexes, de prothèses dentaires fixes et amovibles ainsi que d’appareils orthodontiques. Toujours à l’avant-garde de la technologie, nous continuons d’offrir des produits et services adaptés aux besoins particuliers de notre clientèle. Par l’entremise de nos programmes interne de recherche et développement, nous explorons continuellement les nouvelles avancées technologiques dans la fabrication de prothèse dentaire de haute précision. \n  Description: \n  Le consultant en cas est responsable de la communication avec les clients en ce qui concerne le soutien aux cas et la planification du traitement, tout en maintenant un niveau élevé de satisfaction de la clientèle. Ce poste sera également responsable de la gestion du contrôle final de la qualité et de la formation interne de l’équipe sur les aspects techniques de tous les cas.\n  \n  \n Si vous avez au moins 5 ans d’expérience dans l’industrie des laboratoires dentaires, ainsi que de solides compétences en supervision, nous voulons avoir de vos nouvelles!\n  \n  Responsabilités Principales:\n \n  Consultante en cas \n \n  Évaluer, identifier et proposer des solutions aux cas de restauration problématique \n  Discuter des options réparatrices avec les médecins par téléphone / courriel \n  S’assurer que des instructions appropriées sont données aux techniciens concernant les cas problématiques \n  \n \n Contrôle final de la qualité \n  \n  S’assurer que la restauration finale et les appareils répondent aux normes de contrôle de la qualité de l’entreprise\n \n  \n  \n  Qualifications:\n  \n  \n  \n  École technique – Certification en tant que technicien dentaire agréé ou formation et expérience équivalentes \n  5 ans d’expérience dans l’industrie des laboratoires dentaires \n  Doit être capable de gérer les personnes, les processus et la technologie \n  Doit posséder des compétences efficaces en anglais et en communication Français (à l’oral et à l’écrit) tout en offrant de solides compétences interpersonnelles \n  Excellentes compétences en gestion du temps; agit habilement avec un sentiment d’urgence \n  Grande attention aux détails et à la précision \n  Capacité à penser stratégiquement et à diriger \n  Dépannage avancé et expérience multitâche \n  Connaissance des tendances et des applications technologiques pertinentes de l’industrie"
}