{
    "id": "02c369c8ab08ce60",
    "companyDescription": "The Federation of Canadian Municipalities (FCM, (French) Fédération canadienne des municipalités) is an advocacy group representing over 2000 Canadian municipalities.  It is an organization with no formal power but significant ability to influence debate and policy, as it is a main national lobby group of mayors, councillors and other elected municipal officials.",
    "description": "The Federation of Canadian Municipalities (FCM) is the national voice of municipal governments, representing the interests of cities and communities with the federal government. \n  \n  \n   \n    \n     Position\n     \n    \n     Advisor, Communications - Community Canopies\n     \n   \n    \n   \n    \n     Department\n     \n    \n     Growth and Development - Green Municipal Funds (GMF) - Communications\n     \n   \n    \n   \n    \n     Classification\n     \n    \n     Level 5\n     \n   \n    \n   \n    \n     Salary Band\n     \n    \n     $73,000 to $82,500\n     \n   \n    \n   \n    \n     Languages\n     \n    \n     Bilingualism (English/French) is required.\n     \n   \n    \n   \n    \n     Term\n     \n    \n     Permanent Full-Time\n     \n   \n    \n   \n    \n     Location\n     \n    \n     Hybrid (Ottawa)/Remote (Canada)\n    \n   \n    \n  \n  \n \n \n  \n   \n    \n     Why GMF is the place for you\n    \n   \n    \n    \n    \n     At GMF, we empower our people to create change where it has the most impact – municipalities. GMF is a $1.6 billion permanent endowment from the Government of Canada, managed at arm's length, making it nimble and available for higher-risk, higher-impact initiatives. A further $530M investment into GMF to support the National Adaptation Strategy was announced in November 2022. Our team is committed to helping local governments switch to sustainable practices faster. GMF is the cornerstone program of the Federation of Canadian Municipalities (FCM). \n      Our unique mix of funding, resources, and training gives municipalities the tools they need to build resiliency — and create better lives for Canadians. Through GMF, municipalities have reduced carbon emissions; built better transportation assets; constructed efficient and resilient buildings; diverted waste from landfill; made previously unusable land available for development; and improved soil and water quality.\n    \n   \n    \n  \n \n \n \n  \n   \n    \n     You in this role\n    \n   \n    \n    \n    \n     The Advisor, Communications - Community Canopies develops and leads communications strategies, plans and services in support of FCM’s MAMP. He/she provides strategic communications advice, planning and senior writing support to assigned program areas. The Advisor, Communications - Community Canopies oversees the planning and implementation of the communications products and activities and assesses FCM Program communication vehicles and recommends measures, processes and tools for quality assurance, effective dissemination of resources, and continuous improvement. \n      The work at FCM includes FCM becoming an even more member-driven organization that balances the realization of its goals with a people-centered approach. The incumbent embodies FCM’s commitment to being a healthy, diverse, inclusive, and anti-racist organization. As a member of the team, the Advisor, Communications - Community Canopies works in a manner that embraces these values, the corporate culture and the passion for FCM’s mandate\n    \n   \n    \n  \n \n \n \n  \n   \n    \n     What you’ll be doing\n    \n   \n    \n    \n    \n     The Advisor, Communications - Community Canopies: \n      \n      Provides strategic communications advice and oversees the implementation of communications and marketing workplan. \n      Oversees the development and delivery of communications programs/activities (English/French) to advance FCM’s corporate objectives. \n      Provides senior writing and editing services for a broad range of communications and promotional products, including key messages, website and social media content, e-communication, publications, presentations and annual reports. \n      Coordinates and oversees work assignments with external suppliers, such as editors, graphic designers and translators. \n      Leads the monitoring and evaluation of communication activities, including the analysis of analytics related to the GCCC initiative, to ensure continuous improvements in the development and dissemination of program information and resources. \n      Contributes to strategic approach to GMF’s web-based communications to ensure quality, accuracy, timeliness, relevance and alignment with overall communications strategies and standards. \n      Leads project teams and works collaboratively with team members for projects that frequently must be delivered on time and on budget. \n      Is responsible for conduct aligned to FCM’s competencies and values. \n      May be called upon to participate in cross-functional teamwork.\n     \n    \n     \n   \n    \n  \n \n \n \n  \n   \n    \n     Your skills make us better\n    \n   \n    \n    \n    \n     You bring:\n      \n      \n      \n      \n       Education: \n        \n        A combination of professional and lived experience and/or post-secondary education in communications, journalism, or other relevant field or a combination of education and experience that would be considered equivalent. \n        \n       Experience: \n       \n      \n       \n        Five to six (5-6) years of professional writing experience, with a preference given to speech writing experience. \n        Demonstrated experience using key messages to construct engaging narratives that further corporate and political objectives. \n        Experience as a copy editor adhering to organizational style guidelines, as well as voice and tone. \n        Experience working with elected officials or senior corporate figures considered an asset. \n        \n      \n     \n     \n      \n       Knowledge: \n       \n      \n       \n        Thorough working knowledge of MS Office applications used for word processing and presentation creation (Outlook,Word, and PowerPoint). \n        Understanding of Canadian municipal and federal political structures and issues considered an asset. \n        \n      \n     \n     \n      \n       Competencies: \n       \n      \n       \n        Ability to develop clear, concise, and engaging content that’s tailored to specific audiences, reflecting relevant political sensitivities. \n        Strong project management abilities; capable of prioritizing and planning multiple projects simultaneously, under tight time constraints and within budget parameters. \n        Strong strategic thinking and visioning skills considered an asset. \n        Strong time management skills and ability to work effectively under pressure, meet tight deadlines, prioritize and deal with uncertainty in a fast-paced environment. \n        Attention to detail and an eye for quality. \n        Ability to work with limited guidance and support structures. \n        Ability to manage multiple priorities and adapt in a quickly changing, fast paced environment. · \n        Bilingualism (English/French) is considered an asset.\n       \n      \n       \n      \n    \n   \n    \n  \n \n \n \n  \n   \n    \n     Why working here rocks\n    \n   \n   \n    \n      \n      \n     We prioritize work-life balance with our flexible model: \n      \n      When we say flexible work model, we mean that in collaboration with your manager and based on what your team needs, you have the flexibility to determine when you work so that you can enjoy a healthy balance between work and personal demands. \n      While you do need to live in Canada for this role, you can primarily work from home. Travel may be required to Head Office in Ottawa periodically. The majority of the GMF team operates from the National Capital Region. \n      We do like to visit the areas we are impacting and it allows us to see unique and wonderful parts of our country. You may find yourself traveling nationally 10-15% of the time.\n     \n      \n      \n      We don’t just talk about employee wellness, we live it: \n      \n      Summer hours between July 1 and Labour Day: \n       \n        7-hour workdays rather than 7.5 \n        Every Friday off in the summer \n       \n      Flexible work arrangements to support productivity and well-being \n      Commitment to employee development \n      Competitive range of employee benefits and services \n      Office facilities located in the Byward Market and Ottawa’s downtown core \n      \n     We’re committed to fostering an organizational culture that embraces equity, diversity, inclusion and belonging, where individuals from diverse racial and ethnic identities, nationalities, social economic status, sexual orientation, gender identity/expression and physical and mental abilities can thrive and be fully engaged at their best level. \n      We welcome and encourage applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the recruitment and selection process.\n    \n   \n    \n    \n  \n \n \n How to apply \n  If this role speaks to you and the impact you want to make, we’d love to hear from you! Apply today. \n  The deadline to apply is February 7th, 2024. \n  The future of work here includes a hybrid work model; therefore, this role will be a combination of virtual and on-site work. The successful candidate is required to live in and be authorized to work in Canada. They are also required to be able to work from home/remotely, from within Canada. All in-office work and in-person meetings for work that take place inside and/or outside of the offices located in Ottawa will be subject to FCM’s Safe Workplace Vaccination Policy, as well as its health and safety procedures. \n  For additional information on this posting, or for further information on FCM, access our website at www.fcm.ca. Learn more about the Green Municipal Fund at https://greenmunicipalfund.ca/",
    "preprocessed_description": "The Federation of Canadian Municipalities (FCM) is the national voice of municipal governments, representing the interests of cities and communities with the federal government. Position Advisor, Communications - Community Canopies Department Growth and Development - Green Municipal Funds (GMF) - Communications Classification Level 5 Salary Band $73,000 to $82,500 Languages Bilingualism (English/French) is required. Term Permanent Full-Time Location Hybrid (Ottawa)/Remote (Canada) Why GMF is the place for you At GMF, we empower our people to create change where it has the most impact – municipalities. GMF is a $1.6 billion permanent endowment from the Government of Canada, managed at arm's length, making it nimble and available for higher-risk, higher-impact initiatives. A further $530M investment into GMF to support the National Adaptation Strategy was announced in November 2022. Our team is committed to helping local governments switch to sustainable practices faster. GMF is the cornerstone program of the Federation of Canadian Municipalities (FCM). Our unique mix of funding, resources, and training gives municipalities the tools they need to build resiliency — and create better lives for Canadians. Through GMF, municipalities have reduced carbon emissions; built better transportation assets; constructed efficient and resilient buildings; diverted waste from landfill; made previously unusable land available for development; and improved soil and water quality. You in this role The Advisor, Communications - Community Canopies develops and leads communications strategies, plans and services in support of FCM's MAMP. He/she provides strategic communications advice, planning and senior writing support to assigned program areas. The Advisor, Communications - Community Canopies oversees the planning and implementation of the communications products and activities and assesses FCM Program communication vehicles and recommends measures, processes and tools for quality assurance, effective dissemination of resources, and continuous improvement. The work at FCM includes FCM becoming an even more member-driven organization that balances the realization of its goals with a people-centered approach. The incumbent embodies FCM's commitment to being a healthy, diverse, inclusive, and anti-racist organization. As a member of the team, the Advisor, Communications - Community Canopies works in a manner that embraces these values, the corporate culture and the passion for FCM's mandate What you will be doing The Advisor, Communications - Community Canopies: Provides strategic communications advice and oversees the implementation of communications and marketing workplan. Oversees the development and delivery of communications programs/activities (English/French) to advance FCM's corporate objectives. Provides senior writing and editing services for a broad range of communications and promotional products, including key messages, website and social media content, e-communication, publications, presentations and annual reports. Coordinates and oversees work assignments with external suppliers, such as editors, graphic designers and translators. Leads the monitoring and evaluation of communication activities, including the analysis of analytics related to the GCCC initiative, to ensure continuous improvements in the development and dissemination of program information and resources. Contributes to strategic approach to GMF's web-based communications to ensure quality, accuracy, timeliness, relevance and alignment with overall communications strategies and standards. Leads project teams and works collaboratively with team members for projects that frequently must be delivered on time and on budget. Is responsible for conduct aligned to FCM's competencies and values. May be called upon to participate in cross-functional teamwork. Your skills make us better You bring: Education: A combination of professional and lived experience and/or post-secondary education in communications, journalism, or other relevant field or a combination of education and experience that would be considered equivalent. Experience: Five to six (5-6) years of professional writing experience, with a preference given to speech writing experience. Demonstrated experience using key messages to construct engaging narratives that further corporate and political objectives. Experience as a copy editor adhering to organizational style guidelines, as well as voice and tone. Experience working with elected officials or senior corporate figures considered an asset. Knowledge: Thorough working knowledge of MS Office applications used for word processing and presentation creation (Outlook,Word, and PowerPoint). Understanding of Canadian municipal and federal political structures and issues considered an asset. Competencies: Ability to develop clear, concise, and engaging content that is tailored to specific audiences, reflecting relevant political sensitivities. Strong project management abilities; capable of prioritizing and planning multiple projects simultaneously, under tight time constraints and within budget parameters. Strong strategic thinking and visioning skills considered an asset. Strong time management skills and ability to work effectively under pressure, meet tight deadlines, prioritize and deal with uncertainty in a fast-paced environment. Attention to detail and an eye for quality. Ability to work with limited guidance and support structures. Ability to manage multiple priorities and adapt in a quickly changing, fast paced environment. · Bilingualism (English/French) is considered an asset. Why working here rocks We prioritize work-life balance with our flexible model: When we say flexible work model, we mean that in collaboration with your manager and based on what your team needs, you have the flexibility to determine when you work so that you can enjoy a healthy balance between work and personal demands. While you do need to live in Canada for this role, you can primarily work from home. Travel may be required to Head Office in Ottawa periodically. The majority of the GMF team operates from the National Capital Region. We do like to visit the areas we are impacting and it allows us to see unique and wonderful parts of our country. You may find yourself traveling nationally 10-15% of the time. We do not just talk about employee wellness, we live it: Summer hours between July 1 and Labour Day: 7-hour workdays rather than 7.5 Every Friday off in the summer Flexible work arrangements to support productivity and well-being Commitment to employee development Competitive range of employee benefits and services Office facilities located in the Byward Market and Ottawa's downtown core We're committed to fostering an organizational culture that embraces equity, diversity, inclusion and belonging, where individuals from diverse racial and ethnic identities, nationalities, social economic status, sexual orientation, gender identity/expression and physical and mental abilities can thrive and be fully engaged at their best level. We welcome and encourage applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the recruitment and selection process. How to apply If this role speaks to you and the impact you want to make, we would love to hear from you! Apply today. The deadline to apply is February 7th, 2024. The future of work here includes a hybrid work model; therefore, this role will be a combination of virtual and on-site work. The successful candidate is required to live in and be authorized to work in Canada. They are also required to be able to work from home/remotely, from within Canada. All in-office work and in-person meetings for work that take place inside and/or outside of the offices located in Ottawa will be subject to FCM's Safe Workplace Vaccination Policy, as well as its health and safety procedures. For additional information on this posting, or for further information on FCM, access our website at www.fcm.ca. Learn more about the Green Municipal Fund at https://greenmunicipalfund.ca/",
    "processed_description": "national voice municipal government represent interest city community federal government . Position Advisor Communications Community Canopies Department Growth Development Green Municipal Funds GMF Communications Classification Level Salary Band Languages Bilingualism require . term Permanent Location Hybrid GMF place empower people create change impact – municipality . billion permanent endowment manage arm's length nimble high risk high impact initiative . 530M investment GMF support . team committed help local government switch sustainable practice fast . GMF cornerstone program . unique mix funding resource training municipality tool build resiliency — create life . GMF municipality reduce carbon emission build transportation asset construct efficient resilient building divert waste landfill unusable land development improved soil water quality . role Advisor develop lead communication strategy plan service support . provide strategic communication advice planning senior writing support assign program area . Advisor oversee planning implementation communication product activity assess FCM Program communication vehicle recommend measure process tool quality assurance effective dissemination resource continuous improvement . include drive organization balance realization goal people center approach . incumbent embody FCM's commitment healthy diverse inclusive anti racist organization . team Advisor Communications Community Canopies manner embrace corporate culture passion FCM's mandate Advisor Communications Community canopy provide strategic communication advice oversee implementation communication marketing workplan . oversee development delivery communication program activity advance FCM's corporate objective . provide senior writing edit service broad range communication promotional product include key message website social medium content communication publication presentation annual report . coordinate oversee assignment external supplier editor graphic designer translator . lead monitoring evaluation communication activity include analysis analytic relate GCCC initiative ensure continuous improvement development dissemination program information resource . contribute strategic approach GMF's web base communication ensure quality accuracy timeliness relevance alignment communication strategy standard . lead project team collaboratively team project frequently deliver budget . responsible conduct align FCM's competency . participate cross functional teamwork . skill bring education combination professional live post secondary education communication journalism relevant field combination education consider equivalent . professional writing preference speech writing . demonstrate key message construct engaging narrative corporate political objective . copy editor adhere organizational style guideline voice tone . elect official senior corporate figure consider asset . knowledge thorough knowledge MS Office application word processing presentation creation Outlook Word . understand canadian municipal federal political structure issue consider asset . competency develop clear concise engage content tailor specific audience reflect relevant political sensitivity . strong project management capable prioritize plan multiple project simultaneously tight constraint budget parameter . strong strategic thinking visione skill consider asset . strong management skill effectively pressure meet tight deadline prioritize deal uncertainty fast pace environment . attention detail eye quality . limited guidance support structure . manage multiple priority adapt change fast pace environment . · Bilingualism consider asset . rock prioritize life balance flexible model flexible model collaboration manager base team flexibility determine enjoy healthy balance personal demand . live role . travel require periodically . majority GMF team operate . visit area impact allow unique wonderful country . find travel nationally . talk employee wellness live Labour hour workday Friday flexible arrangement support productivity commitment employee development competitive range employee benefit service Office facility locate Ottawa's downtown core committed foster organizational culture embrace equity diversity inclusion belonging individual diverse racial ethnic identity nationality social economic status sexual orientation gender identity expression physical mental thrive fully engage good level . encourage application people . accommodation request aspect recruitment selection process . apply role speak impact love hear apply . deadline apply . future include hybrid model role combination virtual site . successful require live authorize . require remotely . office person meeting place inside office locate subject FCM's Safe Workplace Vaccination Policy health safety procedure . additional information posting information access website . learn",
    "results_group": {
        "extracted_noun_chunks": [
            "organizational style guideline voice tone",
            "employee wellness",
            "budget",
            "program area",
            "additional information",
            "engaging narrative corporate political objective",
            "education combination professional live post secondary education communication journalism relevant field combination education",
            "application people",
            "local government",
            "implementation communication product activity",
            "lead communication strategy plan service support",
            "office",
            "530M investment GMF support",
            "Advisor",
            "visit area impact",
            "Position Advisor Communications Community Canopies Department Growth Development Green Municipal Funds GMF Communications Classification Level Salary Band Languages Bilingualism",
            "deal uncertainty fast pace environment",
            "role Advisor",
            "sustainable practice",
            "office person",
            "FCM's commitment healthy diverse inclusive anti racist organization",
            "healthy balance personal demand",
            "measure process tool quality assurance effective dissemination resource continuous improvement",
            "unique wonderful country",
            "arm's length nimble high risk high impact initiative",
            "key message",
            "competency",
            "senior writing support",
            "continuous improvement development dissemination program information resource",
            "national voice municipal government",
            "travel",
            "asset",
            "life",
            "relevant political sensitivity",
            "strategic communication advice",
            "assignment external supplier editor graphic designer translator",
            "change impact",
            "content tailor specific audience",
            "strong management skill",
            "term",
            "key message website social medium content communication publication presentation annual report",
            "tight deadline",
            "quality accuracy timeliness relevance alignment communication strategy standard",
            "Ottawa's downtown core committed foster organizational culture",
            "professional writing preference speech writing",
            "FCM's corporate objective",
            "incumbent",
            "unique mix funding resource training municipality tool",
            "live role",
            "hybrid model role combination virtual site",
            "clear concise engage",
            "FCM's competency",
            "team Advisor Communications Community Canopies manner",
            "skill",
            "Bilingualism",
            "development delivery communication program activity advance",
            "FCM Program communication vehicle",
            "future",
            "implementation communication marketing workplan",
            "team",
            "majority GMF team",
            "project team",
            "knowledge thorough knowledge MS Office application word processing presentation creation Outlook Word",
            "role speak impact love",
            "canadian municipal federal political structure issue",
            "strategic approach GMF's web base communication",
            "subject FCM's Safe Workplace Vaccination Policy health safety procedure",
            "corporate culture passion FCM's mandate Advisor Communications Community canopy",
            "attention detail eye quality",
            "billion permanent endowment",
            "people",
            "resiliency",
            "cross functional teamwork",
            "carbon emission build transportation asset",
            "interest city community federal government",
            "senior writing edit service broad range communication promotional product",
            "limited guidance support structure",
            "deadline",
            "copy editor",
            "rock",
            "soil water quality",
            "change fast pace environment",
            "evaluation communication activity",
            "efficient resilient building",
            "drive organization balance realization goal people center approach",
            "responsible conduct",
            "elect official senior corporate figure",
            "good level",
            "GMF cornerstone program",
            "GCCC initiative",
            "Permanent Location Hybrid GMF place",
            "multiple priority",
            "Friday flexible arrangement support productivity commitment employee development competitive range employee benefit service Office facility",
            "waste landfill unusable land development",
            "equity diversity inclusion",
            "place",
            "strong strategic thinking visione skill",
            "individual diverse racial ethnic identity nationality social economic status sexual orientation gender identity expression physical mental thrive",
            "accommodation request aspect recruitment selection process",
            "GMF municipality",
            "strong project management capable prioritize plan multiple project simultaneously tight constraint budget parameter",
            "information access website"
        ],
        "combined_lemmatized_tokens": "national voice municipal government represent interest city community federal government . Position Advisor Communications Community Canopies Department Growth Development Green Municipal Funds GMF Communications Classification Level Salary Band Languages Bilingualism require . term Permanent Location Hybrid GMF place empower people create change impact – municipality . billion permanent endowment manage arm's length nimble high risk high impact initiative . 530M investment GMF support . team committed help local government switch sustainable practice fast . GMF cornerstone program . unique mix funding resource training municipality tool build resiliency — create life . GMF municipality reduce carbon emission build transportation asset construct efficient resilient building divert waste landfill unusable land development improved soil water quality . role Advisor develop lead communication strategy plan service support . provide strategic communication advice planning senior writing support assign program area . Advisor oversee planning implementation communication product activity assess FCM Program communication vehicle recommend measure process tool quality assurance effective dissemination resource continuous improvement . include drive organization balance realization goal people center approach . incumbent embody FCM's commitment healthy diverse inclusive anti racist organization . team Advisor Communications Community Canopies manner embrace corporate culture passion FCM's mandate Advisor Communications Community canopy provide strategic communication advice oversee implementation communication marketing workplan . oversee development delivery communication program activity advance FCM's corporate objective . provide senior writing edit service broad range communication promotional product include key message website social medium content communication publication presentation annual report . coordinate oversee assignment external supplier editor graphic designer translator . lead monitoring evaluation communication activity include analysis analytic relate GCCC initiative ensure continuous improvement development dissemination program information resource . contribute strategic approach GMF's web base communication ensure quality accuracy timeliness relevance alignment communication strategy standard . lead project team collaboratively team project frequently deliver budget . responsible conduct align FCM's competency . participate cross functional teamwork . skill bring education combination professional live post secondary education communication journalism relevant field combination education consider equivalent . professional writing preference speech writing . demonstrate key message construct engaging narrative corporate political objective . copy editor adhere organizational style guideline voice tone . elect official senior corporate figure consider asset . knowledge thorough knowledge MS Office application word processing presentation creation Outlook Word . understand canadian municipal federal political structure issue consider asset . competency develop clear concise engage content tailor specific audience reflect relevant political sensitivity . strong project management capable prioritize plan multiple project simultaneously tight constraint budget parameter . strong strategic thinking visione skill consider asset . strong management skill effectively pressure meet tight deadline prioritize deal uncertainty fast pace environment . attention detail eye quality . limited guidance support structure . manage multiple priority adapt change fast pace environment . · Bilingualism consider asset . rock prioritize life balance flexible model flexible model collaboration manager base team flexibility determine enjoy healthy balance personal demand . live role . travel require periodically . majority GMF team operate . visit area impact allow unique wonderful country . find travel nationally . talk employee wellness live Labour hour workday Friday flexible arrangement support productivity commitment employee development competitive range employee benefit service Office facility locate Ottawa's downtown core committed foster organizational culture embrace equity diversity inclusion belonging individual diverse racial ethnic identity nationality social economic status sexual orientation gender identity expression physical mental thrive fully engage good level . encourage application people . accommodation request aspect recruitment selection process . apply role speak impact love hear apply . deadline apply . future include hybrid model role combination virtual site . successful require live authorize . require remotely . office person meeting place inside office locate subject FCM's Safe Workplace Vaccination Policy health safety procedure . additional information posting information access website . learn"
    }
}