{
    "id": "5221928fb0cdb2c7",
    "company": "Stantec",
    "positionName": "Senior Compensation Consultant",
    "jobType": [],
    "location": "3001331 Clyde Avenue, Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-18T05:12:03.834Z",
    "url": "https://www.indeed.ca/rc/clk?jk=5221928fb0cdb2c7&from=jasx&tk=1hkikgnghkee4800&bb=705ODd93W8sq4u4Hp1uXMdWdhNQ4UREkJWOk0NySXNK6Ccu7Ju3luFyyeV5D8U482UudeGxYz3oCGZc4QKeU5xJV8_j9aa3q8edevFeX-9i3_lCOjvVBdQ%3D%3D&xkcb=SoA167M3FShNKBx1FB0HbzkdCdPP&vjs=3",
    "externalApplyLink": "https://stantec.jobs/ottawa-on/senior-compensation-consultant/680B17DBFF1A4226BD3DF1B397994C21/job/?vs=1554&utm_source=Indeed-DE&utm_medium=Job%20Aggregator&utm_campaign=Indeed",
    "companyDescription": "",
    "description": "Senior Compensation Consultant - ( 2400008D ) \n Description \n Grow with the best. Join a smart, creative, and inspired team that works to support operational excellence. The Stantec community unites more than 28,000 employees working in over 400 locations across 6 continents. Our Functional Services Team (FST) includes Corporate Development, Finance, HR, HSSE, IT, Legal, Marketing/Communications, Practice Services and Real Estate and Procurement. Bringing together individuals with diverse backgrounds, talents, and expertise, our FSTs are vital to making our Company stronger. Explore opportunities in Human Resources. \n Your Opportunity \n We have an exciting opportunity for a Senior Compensation professional to join our team. The primary responsibilities will be to provide strategic compensation consultation for assigned business operating units and lead and participate in a variety of compensation projects. As a client focused professional with demonstrated consulting capabilities, you will research, analyze, and recommend sound compensation solutions in support of our Human Resources strategy and other organizational objectives. You will also understand compensation data modeling and be able to interpret for business and human resources leaders to influence positive change and inform pay decisions at all levels of the organization. Join our remote collaborative Global Compensation team and play an integral role delivering strategic compensation services. We offer flexible working arrangement. This role can be remote, hybrid, or in-office. \n Your Key Responsibilities \n \n  Engage with HR business partners and business leaders to diagnose complex compensation issues and guide business leaders and managers on application of our compensation programs, policies, and guidelines in support of organization goals. \n  Lead and participate in the development and delivery of compensation training for human resources and business leaders. \n  Lead or be a key team member on a variety of compensation projects. \n  Develop and present competitive assessments and salary analysis to advise human resources and business leaders on pay management strategies and decisions. \n  Develop and/or maintain a variety of excel based tools and data models to support team and client-based projects and processes. \n  Conduct and interpret data analytics to deliver actionable and relevant insights in support of informed compensation planning. \n  Perform other duties of a similar nature and level as required. \n \n Qualifications \n Your Capabilities and Credentials \n \n  Experience consulting on compensation programs, policies, and practices that support informed decision making. \n  Advanced understanding of compensation best practices and principles. \n  Experience developing and delivering compensation training for human resources and business leaders in support of organization goals. \n  Ability to compile, analyze, and interpret large amounts of information/data from multiple sources. \n  Experience developing and running data models; effectively leveraging data to tell the story in support of informed decision making. \n  Understanding and application of project management approaches, tools, and phases of the project lifecycle. \n  Apply effective oral/written communication and presentation skills. \n  Demonstrate problem solving and critical thinking skills. \n  Exercise confidentiality, discretion, and sound judgment. \n  Proficient MS Office Suite skills required; advanced Excel skills required. \n  Experience with HRIS Systems (preferably Oracle). \n  Understand and apply compensation-related legislation, rules, and regulations for North America (required); multi-national knowledge strongly preferred. \n  CCP preferred or in progress. \n \n Education and Experience \n Bachelor’s degree or equivalent in Human Resources, Business, or related field; Minimum of 7 years of related experience in compensation. \n Typical office environment working with computers and remaining sedentary for long periods of time. Travel may be required throughout North America. \n This description is not a comprehensive listing of activities, duties or responsibilities that may be required of the employee and other duties, responsibilities and activities may be assigned or may be changed at any time with or without notice. \n Stantec is a place where the best and brightest come to build on each other’s talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best. \n Benefits Summary: Regular full-time and part-time employees will have access to health, dental, and vision plans, a well-being program, health care spending account, wellness spending accounts, group registered retirement savings plan, employee stock purchase program, group tax-free savings account, life and accidental death & dismemberment (AD&D) insurance, short-term/long-term disability plans, emergency travel benefits, tuition reimbursement, professional membership fee coverage, and paid time off. \n Temporary/casual employees will have access to group registered retirement savings plan, employee stock purchase program, and group tax-free savings account. \n The benefits information listed above may not apply to union positions because benefits for such positions are governed by applicable collective bargaining agreements. \n Primary Location : Canada-Alberta-Calgary \n Other Locations : Canada-Alberta-Edmonton, Canada-Ontario-Ottawa, Canada-Ontario-Waterloo \n Work Locations : \n Edmonton AB \n Organization : BC-1197 HR Talent Services-CA Canada \n Employee Status : Regular \n Job Level : Individual Contributor \n Travel : No \n Schedule : Full-time \n Job Posting : Jan 19, 2024, 7:13:21 AM \n Req ID: 2400008D \n Stantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans"
}