{
    "id": "a70d9a29ae3701d2",
    "companyDescription": "",
    "description": "The Strategic Business Manager (SBM) is responsible for increasing the Chemsyn footprint by acquiring key accounts, chain accounts and national accounts. The SBM is a champion for the Chemsyn brand internally and externally of the organisation promoting Chemsyn as a valued partner in solving real problems and providing a cohesive approach to winning our customers’ business and loyalty.\nCompensation - On Track Earnings: $100,000 based on experience, inclusive of commissions earned; commissions have no cap.\n· Development of annual customer business plan utilizing strategies and tactics to create win-win partnerships\n· Development, execution and evaluation of customized Key Account programs\n· Build, maintain, and own Key Accounts' Head Office relationships\n· Support Customer Marketing Team in developing customized programs, strategies and tactical marketing/sales initiatives\n· Accountable for managing all components of the customer's budget\n· Build internal and external communication plans\n· Responsible for managing the monthly and quarterly performance reviews with the key accounts\n· Make telephone calls, in-person visits, and presentations to existing and prospective customers;\n· Expedite the resolution of customer problems and complaints\n· Participate in trade shows, conventions, and sales meetings;\n· Gather market intelligence.\nJob Qualifications\n\n University Degree in Business or related field\n Minimum of 3-5 years of Field Sales experience, preferably complemented with 2 years Sales Back-Office experience\n Excellent relationship building skills\n Strong presentation skills to champion Key Account pitches\n Ability to interact professionally with senior levels, C-Suite representatives of Key Accounts\n Strong budget management experience (manage budget to provide partnership with external Key Accounts)\n Strong project management and organization skills to manage the number priorities from each on-premise key account\n Proficient in using a computer, including Microsoft Office (Word, Excel, Outlook);\n Able to communicate effectively (both written and verbal);\n Strong problem-solving skills;\n Accountable and dependable;\n Able to work in a team environment as well as independently;\n Exceptional attention to detail and quality of work;\n Good organizational, time management and prioritizing skills;\n Ability to demonstrate a positive attitude and strong work ethic; and\n Ability to handle multiple priorities and tasks.\n\nx\nLe Gestionnaire de ComptesLe Gestionnaire de Comptes Stratégiques (GCS) est chargé d'augmenter l'empreinte de Chemsyn en acquérant des comptes clés, des comptes de chaîne et des comptes nationaux. Le GCS est un champion de la marque Chemsyn à l'interne et à l'externe de l'organisation, faisant la promotion de Chemsyn en tant que partenaire précieux dans la résolution de problèmes réels et offrant une approche cohérente pour gagner les affaires et la fidélité de nos clients.\nRémunération - Gains sur la bonne voie jusqu'à 100 000 $ en fonction de l'expérience. Les commissions n'ont pas de plafond.\n· Élaboration d'un plan d'affaires client annuel utilisant des stratégies et des tactiques pour créer des partenariats gagnant-gagnant\n· Développement, exécution et évaluation de programmes personnalisés pour grands comptes\n· Construire, maintenir et posséder les relations avec le siège social des grands comptes\n· Soutenir l'équipe de marketing client dans le développement de programmes personnalisés, de stratégies et d'initiatives tactiques de marketing/ventes\n· Responsable de la gestion de toutes les composantes du budget du client\n· Construire des plans de communication interne et externe\n· Responsable de la gestion des revues de performance mensuelles et trimestrielles avec les grands comptes\n· Faire des appels téléphoniques, des visites en personne et des présentations aux clients existants et potentiels ;\n· Accélérer la résolution des problèmes et des plaintes des clients\n· Participer à des foires commerciales, congrès et réunions de vente;\n· Recueillir des informations sur le marché.\nQualifications professionnelles\n\n Diplôme universitaire en commerce ou dans un domaine connexe\n Minimum de 3 à 5 ans d'expérience en vente sur le terrain, de préférence complétée par 2 ans d'expérience en ventes internes\n Excellentes compétences en matière d'établissement de relations\n Solides compétences de présentation pour défendre les arguments des grands comptes\n Capacité à interagir professionnellement avec des cadres supérieurs et des membres de l’exécutif de grands comptes\n Solide expérience en gestion budgétaire (gérer le budget pour fournir un partenariat avec des comptes clés externes)\n Solides compétences en gestion de projet et en organisation pour gérer les priorités numériques de chaque compte clé sur site\n Maîtrise de l'utilisation d'un ordinateur, y compris Microsoft Office (Word, Excel, Outlook);\n Capable de communiquer efficacement en anglais et en français (tant à l'écrit qu'à l'oral);\n Solides compétences en résolution de problèmes;\n Responsable et fiable ;\n Capable de travailler en équipe ainsi que de façon autonome;\n Souci exceptionnel du détail et qualité du travail;\n Bonnes capacités d'organisation, de gestion du temps et de priorisation ;\n Capacité à démontrer une attitude positive et une solide éthique de travail; et\n Capacité à gérer plusieurs priorités et tâches. Stratégique (GCS)est chargé d'augmenter l'empreinte de Chemsyn en acquérant des comptes clés, des comptes de chaîne et des comptes nationaux. Le GCS est un champion de la marque Chemsyn à l'interne et à l'externe de l'organisation, faisant la promotion de Chemsyn en tant que partenaire précieux dans la résolution de problèmes réels et offrant une approche cohérente pour gagner les affaires et la fidélité de nos clients.\n\nType d'emploi : Temps plein, Permanent\nSalaire : 55 000,00$ à 60 000,00$ par an\nAvantages :\n\n Assurance Dentaire\n Assurance Maladie Complémentaire\n Assurance Vision\n\nHoraires de travail :\n\n 8 Heures\n\nTypes de paie supplémentaire :\n\n Commissions\n\nLieu du poste : En présentiel",
    "preprocessed_description": "The Strategic Business Manager (SBM) is responsible for increasing the Chemsyn footprint by acquiring key accounts, chain accounts and national accounts. The SBM is a champion for the Chemsyn brand internally and externally of the organisation promoting Chemsyn as a valued partner in solving real problems and providing a cohesive approach to winning our customers' business and loyalty. Compensation - On Track Earnings: $100,000 based on experience, inclusive of commissions earned; commissions have no cap. · Development of annual customer business plan utilizing strategies and tactics to create win-win partnerships · Development, execution and evaluation of customized Key Account programs · Build, maintain, and own Key Accounts' Head Office relationships · Support Customer Marketing Team in developing customized programs, strategies and tactical marketing/sales initiatives · Accountable for managing all components of the customer's budget · Build internal and external communication plans · Responsible for managing the monthly and quarterly performance reviews with the key accounts · Make telephone calls, in-person visits, and presentations to existing and prospective customers; · Expedite the resolution of customer problems and complaints · Participate in trade shows, conventions, and sales meetings; · Gather market intelligence. Job Qualifications University Degree in Business or related field Minimum of 3-5 years of Field Sales experience, preferably complemented with 2 years Sales Back-Office experience Excellent relationship building skills Strong presentation skills to champion Key Account pitches Ability to interact professionally with senior levels, C-Suite representatives of Key Accounts Strong budget management experience (manage budget to provide partnership with external Key Accounts) Strong project management and organization skills to manage the number priorities from each on-premise key account Proficient in using a computer, including Microsoft Office (Word, Excel, Outlook); Able to communicate effectively (both written and verbal); Strong problem-solving skills; Accountable and dependable; Able to work in a team environment as well as independently; Exceptional attention to detail and quality of work; Good organizational, time management and prioritizing skills; Ability to demonstrate a positive attitude and strong work ethic; and Ability to handle multiple priorities and tasks. x Le Gestionnaire de ComptesLe Gestionnaire de Comptes Stratégiques (GCS) est chargé d'augmenter l'empreinte de Chemsyn en acquérant des comptes clés, des comptes de chaîne et des comptes nationaux. Le GCS est un champion de la marque Chemsyn à l'interne et à l'externe de l'organisation, faisant la promotion de Chemsyn en tant que partenaire précieux dans la résolution de problèmes réels et offrant une approche cohérente pour gagner les affaires et la fidélité de nos clients. Rémunération - Gains sur la bonne voie jusqu'à 100 000 $ en fonction de l'expérience. Les commissions n'ont pas de plafond. · Élaboration d'un plan d'affaires client annuel utilisant des stratégies et des tactiques pour créer des partenariats gagnant-gagnant · Développement, exécution et évaluation de programmes personnalisés pour grands comptes · Construire, maintenir et posséder les relations avec le siège social des grands comptes · Soutenir l'équipe de marketing client dans le développement de programmes personnalisés, de stratégies et d'initiatives tactiques de marketing/ventes · Responsable de la gestion de toutes les composantes du budget du client · Construire des plans de communication interne et externe · Responsable de la gestion des revues de performance mensuelles et trimestrielles avec les grands comptes · Faire des appels téléphoniques, des visites en personne et des présentations aux clients existants et potentiels ; · Accélérer la résolution des problèmes et des plaintes des clients · Participer à des foires commerciales, congrès et réunions de vente; · Recueillir des informations sur le marché. Qualifications professionnelles Diplôme universitaire en commerce ou dans un domaine connexe Minimum de 3 à 5 ans d'expérience en vente sur le terrain, de préférence complétée par 2 ans d'expérience en ventes internes Excellentes compétences en matière d'établissement de relations Solides compétences de présentation pour défendre les arguments des grands comptes Capacité à interagir professionnellement avec des cadres supérieurs et des membres de l'exécutif de grands comptes Solide expérience en gestion budgétaire (gérer le budget pour fournir un partenariat avec des comptes clés externes) Solides compétences en gestion de projet et en organisation pour gérer les priorités numériques de chaque compte clé sur site Maîtrise de l'utilisation d'un ordinateur, y compris Microsoft Office (Word, Excel, Outlook); Capable de communiquer efficacement en anglais et en français (tant à l'écrit qu'à l'oral); Solides compétences en résolution de problèmes; Responsable et fiable ; Capable de travailler en équipe ainsi que de façon autonome; Souci exceptionnel du détail et qualité du travail; Bonnes capacités d'organisation, de gestion du temps et de priorisation ; Capacité à démontrer une attitude positive et une solide éthique de travail; et Capacité à gérer plusieurs priorités et tâches. Stratégique (GCS)est chargé d'augmenter l'empreinte de Chemsyn en acquérant des comptes clés, des comptes de chaîne et des comptes nationaux. Le GCS est un champion de la marque Chemsyn à l'interne et à l'externe de l'organisation, faisant la promotion de Chemsyn en tant que partenaire précieux dans la résolution de problèmes réels et offrant une approche cohérente pour gagner les affaires et la fidélité de nos clients. Type d'emploi : Temps plein, Permanent Salaire : 55 000,00$ à 60 000,00$ par an Avantages : Assurance Dentaire Assurance Maladie Complémentaire Assurance Vision Horaires de travail : 8 Heures Types de paie supplémentaire : Commissions Lieu du poste : En présentiel",
    "processed_description": "Strategic Business Manager responsible increase Chemsyn footprint acquire key account chain account national account . champion Chemsyn brand internally externally organisation promote partner solve real problem provide cohesive approach win customer' business loyalty . compensation Track earning base inclusive commission earn commission cap . · development annual customer business plan utilize strategy tactic create win win partnership · development execution evaluation customize Key Account program · build maintain Key Accounts' Head Office relationship · develop customize program strategy tactical marketing sale initiative · accountable manage component customer's budget · build internal external communication plan · responsible manage monthly quarterly performance review key account · person visit presentation exist prospective customer · expedite resolution customer problem complaint · participate trade convention sale meeting · gather market intelligence . field Minimum Field sale preferably complement sale office excellent relationship building skill strong presentation skill champion Key Account pitch interact professionally senior level Suite representative Key Accounts Strong budget management manage budget provide partnership strong project management organization skill manage number priority premise key account proficient computer include Word Excel Outlook communicate effectively write verbal strong problem solving skill accountable dependable team environment independently exceptional attention detail quality good organizational management prioritizing skill demonstrate positive attitude strong ethic handle multiple priority task . Strategiques est charge acquerant des comptes cles des comptes chaine des comptes nationaux . champion marque l'externe l'organisation faisant promotion Chemsyn tant partenaire precieux dans resolution problemes reels offrant une approche coherente pour gagner les affaires fidelite client . . les commission n'ont pas plafond . · elaboration d'un plan d'affaires client annuel utilisant des strategies des tactique pour creer des partenariats gagnant gagnant · Developpement execution evaluation programme personnalise pour grand comptes social des grands comptes · Soutenir l'equipe marketing client dans developpement programme personnalises · Responsable gestion toutes les composantes du budget du client · Construire des plan communication interne externe · Responsable gestion des revue comptes aux client existant potentiels · des plaintes des client · Participer des foire commerciales congres reunions vente · . qualification professionnelle Diplome universitaire commerce dans domaine ans d'experience vente sur terrain competence matiere d'etablissement relation Solides competence presentation pour compte des membres l'executif grands comptes Solide gestion budgetaire gerer budget pour fournir partenariat solide competence gestion projet organisation pour site Maitrise l'utilisation d'un ordinateur compris Word Excel Outlook capable communiquer efficacement anglais francais tant l'ecrit qu'a l'oral solide competence resolution probleme fiable capable travailler equipe ainsi facon autonome exceptionnel du detail qualite du travail gestion du temps priorisation attitude positive une solide travail tache . Strategique GCS est charge d'augmenter lthempreinte Chemsyn acquerant des comptes cles des comptes chaine des comptes nationaux . champion marque l'externe l'organisation faisant promotion Chemsyn tant partenaire precieux dans resolution problemes reels offrant une approche coherente pour gagner les affaires fidelite client . Temps plein avantage Assurance Dentaire Assurance Vision travail Heures Types paie supplementaire Commissions Lieu du poste presentiel",
    "results_group": {
        "extracted_noun_chunks": [
            "approche coherente",
            "resolution customer problem complaint",
            "multiple priority task",
            "independently exceptional attention detail quality good organizational management prioritizing skill",
            "matiere d'etablissement",
            "n'ont pas plafond",
            "cohesive approach win customer' business loyalty",
            "Key Accounts' Head Office relationship",
            "gagner les affaires fidelite client",
            "real problem",
            "field",
            "development annual customer business plan",
            "Key Account program",
            "Strategique GCS est charge d'augmenter lthempreinte Chemsyn acquerant des comptes",
            "program strategy tactical marketing sale initiative",
            "verbal strong problem",
            "Minimum Field sale",
            "commission cap",
            "budget",
            "Temps plein avantage Assurance Dentaire Assurance Vision travail Heures Types paie supplementaire Commissions Lieu",
            "monthly quarterly performance review key account",
            "solide travail tache",
            "champion Chemsyn brand",
            "professionally senior level Suite representative",
            "faisant promotion Chemsyn",
            "· des plaintes des client",
            "trade convention sale meeting",
            "accountable dependable team environment",
            "Responsable gestion des revue comptes aux client existant potentiels",
            "chaine des comptes",
            "site Maitrise l'utilisation d'un ordinateur",
            "positive attitude strong ethic",
            "base",
            "offrant",
            "grand comptes social des grands comptes",
            "relation",
            "number priority premise",
            "elaboration d'un plan d'affaires client annuel utilisant des strategies des tactique pour creer des partenariats gagnant gagnant · Developpement execution evaluation programme personnalise",
            "key account chain account national account",
            "programme personnalises",
            "prospective customer",
            "market intelligence",
            "les commission",
            "Solide gestion budgetaire gerer budget pour fournir partenariat solide competence gestion projet organisation",
            "sale office excellent relationship building skill strong presentation skill champion Key Account pitch",
            "Key Accounts Strong budget management",
            "development execution evaluation",
            "reels",
            "Chemsyn footprint",
            "Participer des foire commerciales congres reunions vente",
            "partnership",
            "d'experience vente sur terrain competence",
            "partner",
            "internally externally organisation",
            "accountable manage component customer's budget",
            "du poste presentiel",
            "strategy tactic",
            "win win partnership",
            "Word Excel Outlook capable communiquer efficacement",
            "Responsable gestion toutes les composantes du budget du client",
            "Strategic Business Manager responsible increase",
            "l'ecrit qu'a",
            "Strategiques est charge acquerant des comptes cles des comptes",
            "nationaux",
            "Word Excel Outlook",
            "compte des membres l'executif grands comptes",
            "internal external communication plan",
            "Diplome universitaire commerce dans domaine ans",
            "skill"
        ],
        "combined_lemmatized_tokens": "Strategic Business Manager responsible increase Chemsyn footprint acquire key account chain account national account . champion Chemsyn brand internally externally organisation promote partner solve real problem provide cohesive approach win customer' business loyalty . compensation Track earning base inclusive commission earn commission cap . · development annual customer business plan utilize strategy tactic create win win partnership · development execution evaluation customize Key Account program · build maintain Key Accounts' Head Office relationship · develop customize program strategy tactical marketing sale initiative · accountable manage component customer's budget · build internal external communication plan · responsible manage monthly quarterly performance review key account · person visit presentation exist prospective customer · expedite resolution customer problem complaint · participate trade convention sale meeting · gather market intelligence . field Minimum Field sale preferably complement sale office excellent relationship building skill strong presentation skill champion Key Account pitch interact professionally senior level Suite representative Key Accounts Strong budget management manage budget provide partnership strong project management organization skill manage number priority premise key account proficient computer include Word Excel Outlook communicate effectively write verbal strong problem solving skill accountable dependable team environment independently exceptional attention detail quality good organizational management prioritizing skill demonstrate positive attitude strong ethic handle multiple priority task . Strategiques est charge acquerant des comptes cles des comptes chaine des comptes nationaux . champion marque l'externe l'organisation faisant promotion Chemsyn tant partenaire precieux dans resolution problemes reels offrant une approche coherente pour gagner les affaires fidelite client . . les commission n'ont pas plafond . · elaboration d'un plan d'affaires client annuel utilisant des strategies des tactique pour creer des partenariats gagnant gagnant · Developpement execution evaluation programme personnalise pour grand comptes social des grands comptes · Soutenir l'equipe marketing client dans developpement programme personnalises · Responsable gestion toutes les composantes du budget du client · Construire des plan communication interne externe · Responsable gestion des revue comptes aux client existant potentiels · des plaintes des client · Participer des foire commerciales congres reunions vente · . qualification professionnelle Diplome universitaire commerce dans domaine ans d'experience vente sur terrain competence matiere d'etablissement relation Solides competence presentation pour compte des membres l'executif grands comptes Solide gestion budgetaire gerer budget pour fournir partenariat solide competence gestion projet organisation pour site Maitrise l'utilisation d'un ordinateur compris Word Excel Outlook capable communiquer efficacement anglais francais tant l'ecrit qu'a l'oral solide competence resolution probleme fiable capable travailler equipe ainsi facon autonome exceptionnel du detail qualite du travail gestion du temps priorisation attitude positive une solide travail tache . Strategique GCS est charge d'augmenter lthempreinte Chemsyn acquerant des comptes cles des comptes chaine des comptes nationaux . champion marque l'externe l'organisation faisant promotion Chemsyn tant partenaire precieux dans resolution problemes reels offrant une approche coherente pour gagner les affaires fidelite client . Temps plein avantage Assurance Dentaire Assurance Vision travail Heures Types paie supplementaire Commissions Lieu du poste presentiel"
    }
}