{
    "id": "928312f9db2893d9",
    "company": "Landreville Promotions Inc.",
    "positionName": "Production Manager - Custom Cabinetmaking",
    "jobType": [
        "Permanent",
        "Full-time"
    ],
    "location": "Landreville Promotions Inc. in Gatineau, QC",
    "salary": "$60,000–$80,000 a year",
    "postingDateParsed": "2024-01-23T12:19:26.902Z",
    "url": "https://www.indeed.ca/pagead/clk?mo=r&ad=-6NYlbfkN0AR4ckvGzKPkBGJqZeaRaqETPynlHbyUGvBB1MOlMuQaV7tF9VvHN0AHwo72V6QZEfz-dGoGFXJs6XI11OhGz7UA6wxkHNNC1UbUH6FVkpmq2lVypPZNHGMAzuo1n-1TgttEr_gQHc2Jlet_H9UL5Y_eJaZ6USIRwR6bzy86vFP_ATU3RF0ABbnHmL8qCVWzvvRO2ML7wnJ_E3BA5ZoWp5NMExvxB_OIrXB9RbhdUKX2qKTrtQXJW-i0WbHYh5N2XpIij-DK5mAXqbK2FKVJvwSfzagYLjGKfTUZ7aQobfevudQ_SkwOGwb9GT7qCtyR8jpR7VJG2K2wczWoApMKP-MrWiF4YtO1bqHcMiWCUx-vabJBQu6fpUiYcSIRdFhM_qCIExhgZnjOe4Nxa2npXG13jbJ4XFFmp7G0Yh7eKcs8AjOivllDuUhbCzplG9TQcbXx528zOkReYu75fQ_L4U2QnfY944SEYIc9Uex1cIq_YkKnrWoEFexhcL-bp-XuIv5ZaVwt7j_llmbdQd9KsdONdiYyFIwoYcyUxp3Rn2gQytu9S1AK0tBnBzLLA1uz0M8Nonp98mXo-op2swj4DmWFubIoG8dTcBW3l-xamQABIwnkQid_mendexfSuDNOqY8sigHPNe-qlfu2SkYmbw83LNMbCOXfB3tZxrzWcT3YYiM8ayQYZtQBF6IKp_Sx1v-NZtbg9iKfxAE9BV7tp__F6eevWNLUH_lZ5Aa2B1I4A%3D%3D&xkcb=SoAi6_M3FlTQ5AwTEJ0MbzkdCdPP&p=7&fvj=1&vjs=3&jsa=2155&tk=1hl5dnps928uu000&from=jasx&wvign=1",
    "externalApplyLink": null,
    "companyDescription": null,
    "description": "We are looking for an experienced production manager for a well-equipped commercial cabinetmaking facility.\nExpozone\nExpozone is a custom manufacturer which specializes in the creation of exhibitions for museums and science centres as well as corporate interiors, reception areas, exhibition booths, sales outlets, and exhibition halls. It is also known for its custom-made furniture and graphic elements, such as banners, large format digital prints, and custom signage.\nWe are looking for the following skills and qualities:\nExperience as a floor manager in cabinetry, demonstrated leadership, blueprint reading, ability to motivate and work as part of a team.\nKey skills required: analytical skills, leadership skills and creativity which are very helpful in fulfilling this role.\nResponsibilities\n\n The Production Director is responsible for making decisions about what needs to be done, when, and by whom.\n They establish the appropriate structure to ensure that work is done in the most efficient and productive way.\n They make decisions about what needs to be done in order to achieve organizational objectives.\n Oversee all production across company.\n Production directors work with production teams to manage the operation workflow, quality, and schedule adherence.\n Monitor production activities to make necessary adjustments to the schedule to ensure that all deliverables are delivered on time.\n Develop ideas for process improvements and optimize production speed while maintaining the quality of the products.\n Analyzing the efficiency of manufacturing processes\n Answer technical questions from employees, designers and project managers.\n Ensure the discipline and efficiency of employees under your responsibility.\n\n· Perform quality control. You are responsible for the quality of every piece of furniture and exhibit that is produced by your department.\n\n Creating goals for the team.\n Training employees to perform their tasks.\n Establish daily٫ weekly and monthly objectives and communicate them to employees.\n Manage the workflow by assigning responsibilities and preparing schedules to meet deadlines.\n Guide and coach employees٫ monitoring their productivity.\n Oversee safe use of equipment and schedule regular maintenance.\n Perform verification of production output according to specifications.\n Detect issues in efficiency and suggest improvements.\n Consult new employees on how to safely use machinery and follow procedures.\n Ensure strict adherence to safety guidelines and company standards.\n Responding to employee and customer inquiries and complaints—elevating them, as necessary.\n\nProduction Director serves as an important communication conduit between other departments and, often, between key external resources like vendors, customers, and business partners.\nThe Production Director will report directly to the General Manager\nType d'emploi : Permanent, Temps Plein\nSalaire : 60 000,00$ à 80 000,00$ par an\nAvantages :\n\n Assurance Dentaire\n Assurance Maladie Complémentaire\n Assurance Vision\n Horaires flexibles\n Stationnement sur place\n Tenue Décontractée\n\nHoraires de travail :\n\n 8 Heures\n\nTypes de paie supplémentaire :\n\n Primes\n\nLieu du poste : En présentiel"
}