{
    "id": "088a8068b2b62911",
    "company": "Extendicare",
    "positionName": "Medex Clinical Coordinator RN (Maternity leave)",
    "jobType": [
        "Full-time"
    ],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-24T12:18:58.183Z",
    "url": "https://www.indeed.ca/rc/clk?jk=088a8068b2b62911&from=jasx&tk=1hl5dm5j5kc37800&bb=oevkGIDXh7gG1VwZljrf7-ATaPbEuOAaxMAIssbxneYGagj5bsEMS7XVhIMTeyKK3X74PAvrP-m_-PNRmcHdacWdiFKV5o2YrgtDk3VEfc3gGwAbOyflRg%3D%3D&xkcb=SoAO67M3FlTXbXRRp50LbzkdCdPP&vjs=3",
    "externalApplyLink": "https://extendicare.wd10.myworkdayjobs.com/en-US/Extendicare2023/job/Ottawa-Ontario/Medex-Clinical-Coordinator-RN--Maternity-leave-_R9204",
    "job_info_group": {
        "extracted_phone_numbers": [],
        "extracted_links": [
            "HTTP/HTTPS Links",
            "General Links",
            "WWW Links",
            "TLDs"
        ],
        "extracted_emails": [],
        "extracted_location_data": [
            "Ontario",
            "Ottawa"
        ],
        "extracted_dates": [
            "every day"
        ],
        "extracted_languages": [],
        "extracted_laws": [],
        "extracted_norps": [],
        "extracted_orgs": [
            "Infection Control and Continuous Quality Improvement",
            "ExtendicareOttawaclinical",
            "E-MAR",
            "i.e. PCC",
            "Extendicare",
            "Continuous Quality Improvement",
            "Extendicare Assist",
            "the Director of Care",
            "QUALIFICATIONS Registered Nurse/ BSCN"
        ],
        "extracted_persons": [
            "Extendicare"
        ],
        "extracted_products": [],
        "extracted_money": [],
        "processed_text": "description invite apply temporary bi weekly position long term care facility . report Clinical Coordinator assist clinical supervision program impact delivery care include limit Orientation service education . responsibility develop implement annual education plan staff attend participate committee meeting provide frontline presence unit support evaluate understand quality educational . identify gap training education develop solution Adheres establish policy procedure regard quality assurance fire safety environment infection control . duty deem operational requirement . prefer CNO Registration RNAO registration prefer demonstrate knowledge clinical issue geriatric resident infection control principle adult education . knowledgeable principle philosophy long term care . previous long term care knowledge prefer Familiarity understanding electronic health record system RAI MDS RUGS proof Concept tablet – asset knowledge LTC industry regulatory requirement current Best Practices asset independently direct excellent write oral communication coordinator Type choose build career join team dedicate difference . focus energy enrich life resident transform quality life quality . passion care turn rewarding career affiliated organization include partner accommodate applicant recruitment selection process request ."
    },
    "companyDescription": "Extendicare is a leading provider of care and services for seniors across Canada. We are committed to delivering quality care throughout the health continuum to meet the needs of a growing seniors population. We operate a network of 120 senior care and retirement living centres and home health care services under the Extendicare, Esprit Lifestyle and ParaMed brands. Our qualified and highly trained workforce of approximately 23,000 individuals is passionate about providing high quality services to help people live better.",
    "description": "Job Description\n  \n \n \n \n   Candidates are invited to apply for the temporary part-time (60 hours bi-weekly) position for our long-term care facility in Ottawa, Ontario.\n \n \n \n   Reporting to the Director of Care; the Clinical Coordinator assists with clinical supervision and programs impacting on delivery of care, including but not limited to, Orientation, In-service education, Infection Control and Continuous Quality Improvement.\n \n \n \n   RESPONSIBILITIES\n \n \n   Developing and implementing annual education plan to staff\n   Attend and participate in committee meetings\n   Provide frontline presence on the units to support, evaluate and better understand quality and educational opportunities.\n   Identify gaps in training and education and develop solutions\n   Adheres to established policies and procedures regarding quality assurance, fire, safety, and environment and infection control.\n   Other duties as deemed necessary for operational requirements.\n \n \n \n   QUALIFICATIONS\n \n \n   Registered Nurse/ BSCN preferred\n   CNO Registration\n   RNAO registration preferred\n   Demonstrated knowledge of clinical issues for geriatric residents, infection control, principles of adult education and Continuous Quality Improvement.\n   Knowledgeable in principles and philosophy of long-term care.\n   Previous long-term care experience and knowledge preferred\n   Familiarity and understanding of electronic health record systems i.e. PCC, RAI/MDS, RUGS, E-MAR, POC tablets – asset\n   Knowledge of LTC industry regulatory requirements and current Best Practices - asset\n   Ability to work independently and be self-directed\n   Excellent written and oral communication\n \n \n \n   #ExtendicareOttawaclinical coordinator\n \n \n \n   Time Type:\n \n  Full time\n \n \n  \n    When you choose to build your career with Extendicare, you’re joining a team dedicated to making a difference. By focusing our energy on enriching the lives of our residents every day, we transform both the quality of their lives and the quality of our own work experiences.\n  \n \n \n \n  \n    If you have a passion for caring, turn it into a rewarding career with Extendicare!\n  \n \n \n \n   Extendicare and affiliated organizations including our partner homes in Extendicare Assist, accommodate the needs of job applicants throughout its recruitment and selection processes upon request."
}