{
    "id": "586a4c8c76d5a16e",
    "company": "BDO",
    "positionName": "Consultant, Technology - AppDev",
    "jobType": [],
    "location": "Ottawa, ON",
    "salary": null,
    "postingDateParsed": "2024-01-19T05:09:02.874Z",
    "url": "https://www.indeed.ca/rc/clk?jk=586a4c8c76d5a16e&from=jasx&tk=1hkikb4a7k5qp800&bb=lTPy9GC8AEMesPUlCsHFKvqXVRITvDsXlCu8tmBUZcC5PlMTXp4-gQBsmARyzqzI_bdKPRa-MkYbwg2JjTLeuQ8qufV_Yn8XaqK3A0ksbiMJRu3JrnVY5A%3D%3D&xkcb=SoAj67M3FSgjV4x1FB0FbzkdCdPP&vjs=3",
    "externalApplyLink": "https://bdo.wd3.myworkdayjobs.com/en-US/BDO/job/Ottawa---Coventry-Rd/Consultant--Technology---AppDev_JR1892?utm_source=indeed&utm_medium=referral&utm_campaign=indeed_organic",
    "companyDescription": "",
    "description": "Putting people first, every day \n BDO is a firm built on a foundation of positive relationships with our people and our clients. Each day, our professionals provide exceptional service, helping clients with advice and insight they can trust. In turn, we offer an award-winning environment that fosters a people-first culture with a high priority on your personal and professional growth. \n \n Your Opportunity \n \n BDO Lixar is looking for a Quality Assurance Automation Engineer to join our Technology Consulting Practice. In this role, you will need to plan and execute various types of testing including UI web application, database, webservices, data transformation, regression, etc. for software or infrastructure projects and support initiatives, while adhering to testing and quality standards and best practices. \n To be successful in this role, you must be ambitious, agile, a strong communicator and be able to take an assignment and run with it. If you're ready to take that next step in your career and put your skills to the test, don't delay and apply today. \n Responsibilities will include: \n \n  Review business requirements, system requirement specifications, design and other project documents for clarity and completeness and provide constructive feedback. \n  Design, develop and document test strategy, test plans, test scenarios and test cases based on functional and non-functional requirements and best practices. \n  Perform test execution including capturing test results, documenting defects and adhering to defect management workflow. \n  Perform back-end and front-end testing to ensure data consistency. \n  Estimate test effort and develop test schedule for projects and support initiatives. \n  Facilitate test planning and review meetings with project team and stakeholders. \n  Provide timely, concise test progress /status reports. \n  Provide recommendations for QA process improvement. \n  Maintain positive and professional relationships with project or support stakeholders. Knowledge sharing with, and support of, other team members. \n  Liaise with business users, business analysts, and developers to ensure that planned testing meets project requirements. \n  Respond proactively to both business and project issues, risks and escalate appropriately. \n  Perform other job-related duties as assigned. \n \n \n How do we define success for your role? \n \n  You demonstrate BDO's core values through all aspect of your work: Integrity, Respect and Collaboration You understand your client\n  's industry, challenges, and opportunities; client describe you as positive, professional, and delivering high quality work \n  You identify, recommend, and are focused on effective service delivery to your clients \n  You share in an inclusive and engaging work environment that develops, retains & attracts talent \n  You actively participate in the adoption of digital tools and strategies to drive an innovative workplace \n  You grow your expertise through learning and professional development. \n \n \n Your Qualifications \n \n  University Degree or College/CEGEP Diploma related to Commerce, Business Administration, Computer Science, Information Technology, Engineering, or Science from a recognized post-secondary institution. \n  Minimum of 3 years of experience in a Quality Assurance Analyst role with expertise in functional testing, system testing, and system integration testing including test automation. \n  Solid understanding of SDLC, Software QA methodologies, tools and process with proven experience in Waterfall, Agile or Hybrid development environment. \n  Excellent ability to develop and document comprehensive test plans, procedures, test cases and results that are simple to understand. \n  Experience with cloud platforms, application modernization and data migration. \n  Must have knowledge writing SQL queries to validate data integrity. Deep experience with Cucumber and Selenium\n  Experience with Appium is nice to have \n  Exceptional comprehension and analytical skills. Competence in concisely explaining problems, both verbally and in a written format. \n  Willingness to learn new technology skills to keep pace with the improvements of the testing process. \n  Ability to pick up projects mid-stream, be a self-starter requiring minimal supervision. \n  Strong ability to manage multiple priorities, work under pressure to meet deadlines. Experience in security, vulnerability, load/performance testing is an asset. \n \n  Why BDO?   Our people-first approach to talent has earned us a spot among Canada's Top 100 Employers for 2023 . This recognition is a milestone we're thrilled to add to our collection of awards for both experienced and student talent experiences. \n \n Our firm is committed to providing an environment where you can be successful in the following ways: \n \n  We enable you to engage with how we change and evolve, being a key contributor to the success and growth of BDO in Canada. \n  We help you become a better professional within our services, industries, and markets with extensive opportunities for learning and development. \n  We support your achievement of personal goals outside of the office and making an impact on your community. \n \n \n Giving back adds up: Where company meets community. BDO is actively involved in our communities by supporting local charity initiatives. We support staff with local and national events where you will be given the opportunity to contribute to your community. \n  Total rewards that matter: We pay for performance with competitive total cash compensation that recognizes and rewards your contribution. We provide flexible benefits from day one, and a market leading personal time off policy. We are committed to supporting your overall wellness beyond working hours and provide reimbursement for wellness initiatives that fit your lifestyle. \n  Everyone counts: We believe every employee should have the opportunity to participate and succeed. Through leadership by our Chief Inclusion and Diversity Officer, we are committed to a workplace culture of respect, inclusion, and diversity. We recognize and celebrate the valuable differences among each of us, including race, religious beliefs, physical or mental disabilities, age, place of origin, marital status, family status, gender or gender identity and sexual orientation. If you require accommodation to complete the application process, please contact us . \n \n Flexibility: All BDO personnel are expected to spend some of their time working in the office, at the client site, and virtually unless accommodations or alternative work arrangements are in place. \n \n Our model is a blended approach designed to support the flexible needs of our people, the firm and our clients. It's about creating work experiences that meet everyone's needs and providing flexibility to adjust when, where and how we work to meet the expectations of our role.\n  \n \n Ready to make your mark at BDO? Click \"Apply now\" to send your up-to-date resume to one of our Talent Acquisition Specialists. \n \n To explore other opportunities at BDO, check out our careers page ."
}