{
    "id": "da043a3c461826bd",
    "companyDescription": "",
    "description": "Every great story has a new beginning, and yours starts here.\n   Welcome to Warner Bros. Discovery… the stuff dreams are made of.\n  \n   Who We Are… \n  When we say, “the stuff dreams are made of,” we’re not just referring to the world of wizards, dragons and superheroes, or even to the wonders of Planet Earth. Behind WBD’s vast portfolio of iconic content and beloved brands, are the storytellers bringing our characters to life, the creators bringing them to your living rooms and the dreamers creating what’s next…\n  \n   From brilliant creatives, to technology trailblazers, across the globe, WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive.\n  \n   We are the now and the next. The power behind the people building the future. We are born from the spirit of innovation. We are created from the idea that people around the world want more, need more, deserve more. We are the home of the global digital revolution. We are CNN.\n  \n   See what it’s like to work at CNN! Follow us on Instagram, Twitter and Facebook.\n  \n   Staff Software Developer – CNN iOS Mobile Engineering\n  \n   The Staff Engineering role is the technical lead on the Audio/Video development team. He/she is an individual contributor, self-directed, able to work with minimal supervision, and is typically expected to take on the most difficult technical challenges. The Staff Engineer will lead the technical direction, supporting the Principal Engineers/Architects in defining the technology strategy and implementation. He/she will provide guidance and mentoring to less experienced developers. We need our engineers to be versatile and always eager to tackle new problems while working in a fun, collaborative and fast-paced environment.\n  \n   The iOS Mobile Staff Engineer drives mobile tech. strategy, architecture, best practices, and choice of tools and technology stack across iOS app platforms, supporting mobile backend APIs, mobile CI/CD tools, and testing automation. He/she ensures technical execution and release of CNN’s mobile apps to end consumers. He/she partners with Product, Design and Delivery Leaders to help teams deliver on product initiatives and operational execution.\n  \n   PRIMARY RESPONSIBILITIES:\n  \n    Architect and build intuitive, simple and elegantly designed mobile apps that people want to use\n    Provide support and development of software tools and procedures to extend and enhance the core production pipeline\n    Work with multiple departments, including Product, Design, Delivery, Editorial and Engineering to implement CNN Digital consumer experience solutions and apps\n    Assist with troubleshooting production problems, root cause analysis, and debugging\n    Development and maintenance of existing production systems supporting CNN’s digital ecosystem\n    Mentor more junior developers\n    Ensure software development follows industry best practices, policies and guidelines. Specifically, ensuring that technical solutions are in line with established CNN Digital strategy, standards in respect to architecture, security, corporate governance, coding standards, monitoring, logging, unit test, and service enablement\n  \n  \n   REQUIREMENTS:\n  \n    BS/MS in computer science (or equivalent)\n    Demonstrated advanced understanding of troubleshooting, root-cause analysis, application design, solution development, human factors/usability design, and implementation of projects for major business units or the enterprise\n    Minimum 8 years professional development environment\n    Strong foundation in programming fundamentals such as data structures and algorithms\n    Ability to develop new and innovative applications as well as maintaining existing code\n    Demonstrated full-mobile stack development experience (mobile native client and SDK, build CI/CD, and APIs), e.g. Swift/SwiftUI, Realm, Core Data, Apple Pay, Keychain, etc.\n    Demonstrated expert knowledge of software development methodologies, practice, and architecture, specifically experience architecting performant, scalable, secure, and cost optimized cloud solutions on AWS. AWS Professional Certification preferred, but not required\n    Hands-on experience with mobile DevOps CI/CD tools and implementing best practices, including automation of code signing tools and automated tests. Preferred familiarity with Jenkins, Git, Maven/Gradle, Swift Package Manager/CocoaPods, Terraform, and Appium\n    General familiarity with database technologies (SQL/RDBMS, NoSQL, GraphDB, etc.)\n    Ability to communicate effectively, both written and verbal, with technical and non-technical cross-functional teams\n    Experience building flexible software architecture to accommodate shifting business needs\n    Knowledge of Cloud Computing platforms like Amazon AWS, OpenStack, OpenShift\n  \n  \n   How We Get Things Done…\n  \n   This last bit is probably the most important! Here at WBD, our guiding principles are the core values by which we operate and are central to how we get things done. You can find them at www.wbd.com/guiding-principles/ along with some insights from the team on what they mean and how they show up in their day to day. We hope they resonate with you and look forward to discussing them during your interview.\n  \n   The Legal Bits…\n   Warner Bros. Discovery embraces the opportunity to build a workforce that reflects the diversity of our society and the world around us. Being an equal opportunity employer means that we take seriously our responsibility to consider qualified candidates on the basis of merit, without regard to race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, and genetic information, marital status, citizenship status, military status, protected veteran status or any other category protected by law.\n   If you’re a qualified candidate and you require adjustments or accommodations to search for a job opening or apply for a position, please contact us at recruitadmin@wbd.com.",
    "preprocessed_description": "Every great story has a new beginning, and yours starts here. Welcome to Warner Bros. Discovery… the stuff dreams are made of. Who We Are… When we say, \"the stuff dreams are made of,\" we are not just referring to the world of wizards, dragons and superheroes, or even to the wonders of Planet Earth. Behind WBD's vast portfolio of iconic content and beloved brands, are the storytellers bringing our characters to life, the creators bringing them to your living rooms and the dreamers creating what is next… From brilliant creatives, to technology trailblazers, across the globe, WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive. We are the now and the next. The power behind the people building the future. We are born from the spirit of innovation. We are created from the idea that people around the world want more, need more, deserve more. We are the home of the global digital revolution. We are CNN. See what it is like to work at CNN! Follow us on Instagram, Twitter and Facebook. Staff Software Developer – CNN iOS Mobile Engineering The Staff Engineering role is the technical lead on the Audio/Video development team. He/she is an individual contributor, self-directed, able to work with minimal supervision, and is typically expected to take on the most difficult technical challenges. The Staff Engineer will lead the technical direction, supporting the Principal Engineers/Architects in defining the technology strategy and implementation. He/she will provide guidance and mentoring to less experienced developers. We need our engineers to be versatile and always eager to tackle new problems while working in a fun, collaborative and fast-paced environment. The iOS Mobile Staff Engineer drives mobile tech. strategy, architecture, best practices, and choice of tools and technology stack across iOS app platforms, supporting mobile backend APIs, mobile Continuous Integration/Continuous Deployment tools, and testing automation. He/she ensures technical execution and release of CNN's mobile apps to end consumers. He/she partners with Product, Design and Delivery Leaders to help teams deliver on product initiatives and operational execution. PRIMARY RESPONSIBILITIES: Architect and build intuitive, simple and elegantly designed mobile apps that people want to use Provide support and development of software tools and procedures to extend and enhance the core production pipeline Work with multiple departments, including Product, Design, Delivery, Editorial and Engineering to implement CNN Digital consumer experience solutions and apps Assist with troubleshooting production problems, root cause analysis, and debugging Development and maintenance of existing production systems supporting CNN's digital ecosystem Mentor more junior developers Ensure software development follows industry best practices, policies and guidelines. Specifically, ensuring that technical solutions are in line with established CNN Digital strategy, standards in respect to architecture, security, corporate governance, coding standards, monitoring, logging, unit test, and service enablement REQUIREMENTS: BS/MS in computer science (or equivalent) Demonstrated advanced understanding of troubleshooting, root-cause analysis, application design, solution development, human factors/usability design, and implementation of projects for major business units or the enterprise Minimum 8 years professional development environment Strong foundation in programming fundamentals such as data structures and algorithms Ability to develop new and innovative applications as well as maintaining existing code Demonstrated full-mobile stack development experience (mobile native client and Software Development Kit, build Continuous Integration/Continuous Deployment, and APIs), e.g. Swift/SwiftUI, Realm, Core Data, Apple Pay, Keychain, etc. Demonstrated expert knowledge of software development methodologies, practice, and architecture, specifically experience architecting performant, scalable, secure, and cost optimized cloud solutions on Amazon Web Services. Amazon Web Services Professional Certification preferred, but not required Hands-on experience with mobile Development Operations Continuous Integration/Continuous Deployment tools and implementing best practices, including automation of code signing tools and automated tests. Preferred familiarity with Jenkins, Git, Maven/Gradle, Swift Package Manager/CocoaPods, Terraform, and Appium General familiarity with database technologies (Structured Query Language/RDBMS, NoSQL, GraphDB, etc.) Ability to communicate effectively, both written and verbal, with technical and non-technical cross-functional teams Experience building flexible software architecture to accommodate shifting business needs Knowledge of Cloud Computing platforms like Amazon Amazon Web Services, OpenStack, OpenShift How We Get Things Done… This last bit is probably the most important! Here at WBD, our guiding principles are the core values by which we operate and are central to how we get things done. You can find them at www.wbd.com/guiding-principles/ along with some insights from the team on what they mean and how they show up in their day to day. We hope they resonate with you and look forward to discussing them during your interview. The Legal Bits… Warner Bros. Discovery embraces the opportunity to build a workforce that reflects the diversity of our society and the world around us. Being an equal opportunity employer means that we take seriously our responsibility to consider qualified candidates on the basis of merit, without regard to race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, and genetic information, marital status, citizenship status, military status, protected veteran status or any other category protected by law. If you are a qualified candidate and you require adjustments or accommodations to search for a job opening or apply for a position, please contact us at recruitadmin@wbd.com.",
    "processed_description": "great story start . ... stuff dream . ... stuff dream refer wizard dragon superhero wonder . WBD's vast portfolio iconic content beloved brand storyteller bring character life creator bring living room dreamer create ... brilliant creative technology trailblazer globe WBD offer career define thoughtfully curate benefit tool explore grow good . support celebrate thrive . . power people build future . bear spirit innovation . create idea people deserve . global digital revolution . . follow . – Staff Engineering role technical lead Audio video development team . individual contributor direct minimal supervision typically expect difficult technical challenge . Staff Engineer lead technical direction support define technology strategy implementation . provide guidance mentor experienced developer . engineer versatile eager tackle problem fun collaborative fast pace environment . drive mobile tech . strategy architecture good practice choice tool technology stack ios app platform support mobile backend api mobile Continuous Integration Continuous Deployment tool test automation . ensure technical execution release CNN's mobile app consumer . partner help team deliver product initiative operational execution . primary responsibility architect build intuitive simple elegantly design mobile app people provide support development software tool procedure extend enhance core production pipeline multiple department include Delivery Editorial Engineering implement CNN Digital consumer solution app assist troubleshoot production problem root analysis debug development maintenance exist production system support CNN's digital ecosystem Mentor junior developer ensure software development follow industry good practice policy guideline . ensure technical solution establish CNN Digital strategy standard respect architecture security corporate governance code standard monitoring logging unit test service enablement requirement computer science equivalent demonstrate advanced understanding troubleshoot root analysis application design solution development human factor usability design implementation project major business unit enterprise Minimum professional development environment Strong foundation programming fundamental data structure algorithm develop innovative application maintain exist code demonstrate mobile stack development build api Apple Pay . demonstrate expert knowledge software development methodology practice architecture architecte performant scalable secure cost optimize cloud solution . prefer require Hands mobile Development Operations Continuous Integration Continuous Deployment tool implement good practice include automation code signing tool automate test . preferred familiarity Git Manager CocoaPods Appium General familiarity database technology structure Query Language rdbms NoSQL GraphDB . communicate effectively write verbal technical technical cross functional team build flexible software architecture accommodate shift business Knowledge Cloud Computing platform OpenShift thing ... bit WBD guide principle core operate central thing . find insight team . resonate forward discuss interview . ... embrace build workforce reflect diversity society . equal employer seriously responsibility consider qualified basis merit regard race color religion national origin gender sexual orientation gender identity expression age mental physical genetic information marital status citizenship status military status protect veteran status category protect law . qualified require adjustment accommodation search opening apply position contact .",
    "results_group": {
        "extracted_noun_chunks": [
            "CNN's mobile app consumer",
            "CNN Digital strategy standard respect architecture security corporate governance code standard monitoring logging unit test service enablement requirement computer science equivalent",
            "Mentor junior developer",
            "ios app platform support mobile backend api mobile Continuous Integration Continuous Deployment tool test automation",
            "power",
            "wizard dragon superhero wonder",
            "mobile stack development",
            "veteran status category",
            "WBD guide principle core",
            "insight team",
            "future",
            "support development software tool procedure",
            "core production pipeline multiple department",
            "WBD's vast portfolio iconic content beloved brand storyteller",
            "good practice",
            "guidance mentor",
            "equal employer seriously responsibility",
            "development maintenance",
            "diversity society",
            "verbal technical technical cross functional team",
            "preferred familiarity Git Manager CocoaPods Appium General familiarity database technology structure Query Language",
            "age mental physical genetic information marital status citizenship status military status",
            "benefit tool explore",
            "scalable secure cost",
            "engineer versatile eager tackle problem",
            "Hands mobile Development Operations Continuous Integration Continuous Deployment tool",
            "trailblazer globe WBD",
            "cloud solution",
            "central thing",
            "interview",
            "product initiative operational execution",
            "build workforce",
            "qualified basis merit regard race color religion national origin gender sexual orientation gender identity expression",
            "Strong foundation programming",
            "brilliant creative technology",
            "adjustment accommodation search opening",
            "Staff Engineer",
            "Staff Engineering role technical lead Audio video development team",
            "shift business Knowledge Cloud Computing platform OpenShift thing",
            "production system support",
            "partner help team",
            "innovative application maintain exist code",
            "mobile tech",
            "primary responsibility architect",
            "difficult technical challenge",
            "law",
            "technical execution release",
            "idea",
            "troubleshoot root analysis application design solution development human factor usability design implementation project major business unit",
            "expert knowledge software development methodology practice architecture architecte performant",
            "Delivery Editorial Engineering",
            "global digital revolution",
            "automation code signing tool automate test",
            "spirit innovation",
            "career",
            "CNN Digital consumer solution app",
            "support celebrate",
            "people",
            "CNN's digital ecosystem",
            "living room dreamer",
            "technology strategy implementation",
            "individual contributor direct minimal supervision",
            "flexible software architecture",
            "software development",
            "position contact",
            "great story",
            "stuff dream",
            "strategy architecture good practice choice tool technology",
            "troubleshoot production problem root analysis",
            "technical direction support",
            "collaborative fast pace environment",
            "NoSQL GraphDB",
            "technical solution",
            "character life creator",
            "api Apple Pay",
            "intuitive simple elegantly design mobile app people"
        ],
        "combined_lemmatized_tokens": "great story start . ... stuff dream . ... stuff dream refer wizard dragon superhero wonder . WBD's vast portfolio iconic content beloved brand storyteller bring character life creator bring living room dreamer create ... brilliant creative technology trailblazer globe WBD offer career define thoughtfully curate benefit tool explore grow good . support celebrate thrive . . power people build future . bear spirit innovation . create idea people deserve . global digital revolution . . follow . – Staff Engineering role technical lead Audio video development team . individual contributor direct minimal supervision typically expect difficult technical challenge . Staff Engineer lead technical direction support define technology strategy implementation . provide guidance mentor experienced developer . engineer versatile eager tackle problem fun collaborative fast pace environment . drive mobile tech . strategy architecture good practice choice tool technology stack ios app platform support mobile backend api mobile Continuous Integration Continuous Deployment tool test automation . ensure technical execution release CNN's mobile app consumer . partner help team deliver product initiative operational execution . primary responsibility architect build intuitive simple elegantly design mobile app people provide support development software tool procedure extend enhance core production pipeline multiple department include Delivery Editorial Engineering implement CNN Digital consumer solution app assist troubleshoot production problem root analysis debug development maintenance exist production system support CNN's digital ecosystem Mentor junior developer ensure software development follow industry good practice policy guideline . ensure technical solution establish CNN Digital strategy standard respect architecture security corporate governance code standard monitoring logging unit test service enablement requirement computer science equivalent demonstrate advanced understanding troubleshoot root analysis application design solution development human factor usability design implementation project major business unit enterprise Minimum professional development environment Strong foundation programming fundamental data structure algorithm develop innovative application maintain exist code demonstrate mobile stack development build api Apple Pay . demonstrate expert knowledge software development methodology practice architecture architecte performant scalable secure cost optimize cloud solution . prefer require Hands mobile Development Operations Continuous Integration Continuous Deployment tool implement good practice include automation code signing tool automate test . preferred familiarity Git Manager CocoaPods Appium General familiarity database technology structure Query Language rdbms NoSQL GraphDB . communicate effectively write verbal technical technical cross functional team build flexible software architecture accommodate shift business Knowledge Cloud Computing platform OpenShift thing ... bit WBD guide principle core operate central thing . find insight team . resonate forward discuss interview . ... embrace build workforce reflect diversity society . equal employer seriously responsibility consider qualified basis merit regard race color religion national origin gender sexual orientation gender identity expression age mental physical genetic information marital status citizenship status military status protect veteran status category protect law . qualified require adjustment accommodation search opening apply position contact ."
    }
}