{
    "id": "6a5c3530ebe1ee08",
    "companyDescription": "Intelerad is a leader enterprise workflow and medical image archiving solutions for all types of healthcare organizations. Renowned for their innovative features and functionality, Intelerad solutions, such as InteleViewer™ and InteleOne® XE, increase productivity and streamline workflow by overcoming technical barriers in distributed and complex environments. Highly scalable, flexible and robust, Intelerad’s solutions offer high performance and industry leading customer service and support. ",
    "description": "Company Description\n  Improving healthcare through innovative technology is at the core of Intelerad’s work. Our scalable medical imaging platform connects clinicians to a powerful imaging ecosystem that is fast, smart, and tapped into the data they need, no matter their location. We’re focused on delivering a best-in-class medical image management solution that improves provider efficiency, decreases the cost of healthcare, and improves the overall health of populations.\n  Intelerad offers one of healthcare’s most comprehensive imaging and analytics platforms. Headquartered in Raleigh, NC and Montreal, Intelerad has nearly 700 employees located in offices across six countries. The company empowers nearly 2,000 healthcare organizations around the world with the speed, scalability, and simplicity needed to increase business performance while, most importantly, improving patient outcomes. Intelerad’s modern enterprise solutions have been acknowledged by a Best in KLAS recognition, ranking #1 for PACS Asia/Oceania in the 2021 Best in KLAS: Global Software (Non-US) report. To learn more, visit intelerad.com and follow Intelerad on LinkedIn and Twitter.\n  Job Description\n  Purpose\n  The System Technology Specialist will report directly to the support Manager Manager and work closely with support technicians, clinical and application specialists, engineering teams, and our clients to resolve the toughest technical issues. The System Technology Specialist is responsible for solving problems, sharing technical expertise and product experience. This involves mentoring less experienced team members, as well as providing a practical perspective to product design discussions to ensure our products work well within the various client architectures. Since the System Technology Specialist will be the highest point of escalation within client services, he/she will also be expected to provide requirements for product supportability and maintenance. The System Technology Specialist is also responsible for the development of tools for the Support team.\n  Major accountabilities\n  Accountabilities\n  Act as the primary escalation point for Level 1 System Support team and drive customer communications and follow ups until resolution, by respecting set service level agreements.\n  Act a major incident manager during system outages to support Level 1 and perform root cause analysis (RCA’s) for all Major Incidents\n  Participate in software requirements and root cause reviews with engineering as well as design reviews with a particular mindset into the supportability of the software and also provide fixes and/or workarounds to issues found in the field\n  Stay up to date with current development of the product (bug fixes and new features) and situations occurring at client site (ISP)\n  Participate in the creation/update of Knowledge articles used by the Support Team to reduce escalations to L2\n  Be available for urgent escalations reported by the support team that can occur after your regular work schedule: On Call Rotation Availability (24/7)\n  Participate in any project deemed necessary by the organization\n \n  Employment Pre-requisites\n  Pre-requisite\n  Degree in computer science, engineering, or equivalent\n  5-7 years of experience in client facing roles focused on Technical Support in Medical Software Field\n  Linux OS administration expertise\n  Experience running queries in SQL - an asset\n  Networking troubleshooting expertise (Cloud Infrastructure)\n  Development experience with scripting languages (PHP, Perl, Python, etc…)\n  Ability to read code in other high level languages\n \n  Qualifications\n  Desired Competencies\n  Competences\n  Highly motivated to excel and Committed to continual skills improvement\n  Team oriented with strong communication and interpersonal skills\n  Creative thinker and practical problem solver\n \n  Optional Skills:\n \n   Professional software development\n   Product applications support and training\n   Customer service or project management in a customer support environment\n \n \n  Additional Information\n  All applicants meeting minimum qualifications will be required to complete a 30 minute online assessment as part of your application. \n Intelerad is committed to the principles of equal employment. We are committed to complying with all federal, state and local laws providing equal employment opportunities and all other employment laws and regulations. Applicants, employees and former employees are protected from employment discrimination based on race, color, religion, sex (including pregnancy, sexual orientation, or gender identity), national origin, age (40 or older), disability and genetic information (including family medical history). Intelerad is dedicated to the fulfillment of this policy regarding all aspects of employment, including but not limited to recruiting, hiring, placement, transfer, training, promotion, rates of pay, and other compensation, termination, and all other terms, conditions, and privileges of employment.\n \n  Intelerad is committed to ensuring equal employment opportunity for qualified individuals with disabilities. Intelerad uses the Americans with Disabilities Act (“ADA”)as a standard for global recruiting and hiring purposes. This prohibits discrimination against qualified individuals with disabilities. The ADA defines “disability” as a physical or mental impairment that substantially limits one or more of the major life activities of an individual, a record of such impairment, or being regarded as having such an impairment.\n \n  Intelerad and Ambra Health Combine to Form the Global Industry Leader in Cloud PACS and Enterprise Imaging \n Intelerad Partners with Strategic Radiology to Bring Innovative Medical Image Management Solutions to More than 1,300 Radiologists Across the US\n  Meet Intelerad’s Leadership Team: https://www.intelerad.com/en/about/leadership-team/\n  #LI-Remote",
    "preprocessed_description": "Company Description Improving healthcare through innovative technology is at the core of Intelerad's work. Our scalable medical imaging platform connects clinicians to a powerful imaging ecosystem that is fast, smart, and tapped into the data they need, no matter their location. We're focused on delivering a best-in-class medical image management solution that improves provider efficiency, decreases the cost of healthcare, and improves the overall health of populations. Intelerad offers one of healthcare's most comprehensive imaging and analytics platforms. Headquartered in Raleigh, NC and Montreal, Intelerad has nearly 700 employees located in offices across six countries. The company empowers nearly 2,000 healthcare organizations around the world with the speed, scalability, and simplicity needed to increase business performance while, most importantly, improving patient outcomes. Intelerad's modern enterprise solutions have been acknowledged by a Best in KLAS recognition, ranking #1 for PACS Asia/Oceania in the 2021 Best in KLAS: Global Software (Non-US) report. To learn more, visit intelerad.com and follow Intelerad on LinkedIn and Twitter. Job Description Purpose The System Technology Specialist will report directly to the support Manager Manager and work closely with support technicians, clinical and application specialists, engineering teams, and our clients to resolve the toughest technical issues. The System Technology Specialist is responsible for solving problems, sharing technical expertise and product experience. This involves mentoring less experienced team members, as well as providing a practical perspective to product design discussions to ensure our products work well within the various client architectures. Since the System Technology Specialist will be the highest point of escalation within client services, he/she will also be expected to provide requirements for product supportability and maintenance. The System Technology Specialist is also responsible for the development of tools for the Support team. Major accountabilities Accountabilities Act as the primary escalation point for Level 1 System Support team and drive customer communications and follow ups until resolution, by respecting set service level agreements. Act a major incident manager during system outages to support Level 1 and perform root cause analysis (RCA's) for all Major Incidents Participate in software requirements and root cause reviews with engineering as well as design reviews with a particular mindset into the supportability of the software and also provide fixes and/or workarounds to issues found in the field Stay up to date with current development of the product (bug fixes and new features) and situations occurring at client site (ISP) Participate in the creation/update of Knowledge articles used by the Support Team to reduce escalations to L2 Be available for urgent escalations reported by the support team that can occur after your regular work schedule: On Call Rotation Availability (24/7) Participate in any project deemed necessary by the organization Employment Pre-requisites Pre-requisite Degree in computer science, engineering, or equivalent 5-7 years of experience in client facing roles focused on Technical Support in Medical Software Field Linux OS administration expertise Experience running queries in Structured Query Language - an asset Networking troubleshooting expertise (Cloud Infrastructure) Development experience with scripting languages (PHP, Perl, Python, etc…) Ability to read code in other high level languages Qualifications Desired Competencies Competences Highly motivated to excel and Committed to continual skills improvement Team oriented with strong communication and interpersonal skills Creative thinker and practical problem solver Optional Skills: Professional software development Product applications support and training Customer service or project management in a customer support environment Additional Information All applicants meeting minimum qualifications will be required to complete a 30 minute online assessment as part of your application. Intelerad is committed to the principles of equal employment. We are committed to complying with all federal, state and local laws providing equal employment opportunities and all other employment laws and regulations. Applicants, employees and former employees are protected from employment discrimination based on race, color, religion, sex (including pregnancy, sexual orientation, or gender identity), national origin, age (40 or older), disability and genetic information (including family medical history). Intelerad is dedicated to the fulfillment of this policy regarding all aspects of employment, including but not limited to recruiting, hiring, placement, transfer, training, promotion, rates of pay, and other compensation, termination, and all other terms, conditions, and privileges of employment. Intelerad is committed to ensuring equal employment opportunity for qualified individuals with disabilities. Intelerad uses the Americans with Disabilities Act (\"American Disabilities Act\")as a standard for global recruiting and hiring purposes. This prohibits discrimination against qualified individuals with disabilities. The American Disabilities Act defines \"disability\" as a physical or mental impairment that substantially limits one or more of the major life activities of an individual, a record of such impairment, or being regarded as having such an impairment. Intelerad and Ambra Health Combine to Form the Global Industry Leader in Cloud PACS and Enterprise Imaging Intelerad Partners with Strategic Radiology to Bring Innovative Medical Image Management Solutions to More than 1,300 Radiologists Across the US Meet Intelerad's Leadership Team: https://www.intelerad.com/en/about/leadership-team/ #LI-Remote",
    "processed_description": "company description improve healthcare innovative technology core Intelerad's . scalable medical imaging platform connect clinician powerful imaging ecosystem fast smart tap datum matter location . focus deliver good class medical image management solution improve provider efficiency decrease cost healthcare improve health population . Intelerad offer healthcare's comprehensive imaging analytic platform . headquarter employee locate office country . company empower healthcare organization speed scalability simplicity increase business performance importantly improve patient outcome . Intelerad's modern enterprise solution acknowledge KLAS recognition rank Best Global Software report . learn visit follow . description purpose System Technology Specialist report directly support Manager Manager closely support technician clinical application specialist engineering team client resolve tough technical issue . responsible solve problem share technical expertise product . involve mentor experienced team provide practical perspective product design discussion ensure product client architecture . high point escalation client service expect provide requirement product supportability maintenance . responsible development tool Support team . major accountability Accountabilities primary escalation point Level System Support team drive customer communication follow resolution respect set service level agreement . major incident manager system outage support Level perform root analysis major incident participate software requirement root review engineering design review mindset supportability software provide workaround issue find field stay current development product bug feature situation occur client site isp participate creation update Knowledge article reduce escalation L2 urgent escalation report support team occur regular schedule rotation availability participate project deem organization Employment Pre requisite pre requisite Degree computer science engineering equivalent client face role focus Field Linux OS administration expertise query structured Query Language asset networking troubleshooting expertise Cloud Infrastructure Development scripting language PHP Perl ... read code high level language qualification Desired Competencies competence highly motivated excel orient strong communication interpersonal skill creative thinker practical problem solver professional software development Product application support train customer service project management customer support environment Additional Information applicant meet minimum qualification require complete minute online assessment application . committed principle equal employment . committed comply federal state local law provide equal employment employment law regulation . applicant employee employee protect employment discrimination base race color religion sex include pregnancy sexual orientation gender identity national origin age genetic information include family medical history . Intelerad dedicate fulfillment policy regard aspect employment include limit recruiting hiring placement transfer training promotion rate pay compensation termination term condition privilege employment . committed ensure equal employment qualified individual . Intelerad Disabilities standard global recruiting hire purpose . prohibit discrimination qualified individual . define physical mental impairment limit major life activity individual record impairment regard impairment . Intelerad Combine form Global Industry Leader Cloud PACS bring LI Remote",
    "results_group": {
        "extracted_noun_chunks": [
            "current development product bug feature situation",
            "major incident manager system outage support Level",
            "requirement product supportability maintenance",
            "major incident",
            "Intelerad Disabilities standard global recruiting hire purpose",
            "applicant employee employee",
            "field",
            "Intelerad",
            "software requirement root review engineering design review",
            "equal employment",
            "employment discrimination base race color religion sex",
            "fast smart tap datum matter location",
            "responsible solve problem",
            "business performance",
            "mentor experienced team",
            "code high level language qualification",
            "Manager Manager",
            "product client architecture",
            "family medical history",
            "Global Industry Leader Cloud PACS",
            "supportability software",
            "federal state local law",
            "major life activity individual record impairment regard impairment",
            "physical mental impairment",
            "practical perspective product design discussion",
            "highly motivated excel orient strong communication interpersonal skill creative thinker practical problem",
            "Intelerad dedicate fulfillment policy regard aspect employment",
            "high point escalation client service",
            "principle equal employment",
            "Intelerad Combine",
            "regular schedule rotation availability participate project",
            "minimum qualification",
            "Additional Information applicant",
            "technician clinical application specialist engineering team client",
            "complete minute online assessment application",
            "Intelerad's modern enterprise solution",
            "healthcare's comprehensive imaging analytic platform",
            "scalability simplicity increase",
            "powerful imaging ecosystem",
            "equal employment employment law regulation",
            "tough technical issue",
            "patient outcome",
            "technical expertise product",
            "good class medical image management solution",
            "headquarter employee",
            "visit follow",
            "LI Remote",
            "PHP Perl",
            "Desired Competencies competence",
            "healthcare organization",
            "healthcare innovative technology core Intelerad",
            "responsible development tool Support team",
            "description purpose System Technology Specialist report",
            "resolution respect set service level agreement",
            "client site",
            "organization Employment Pre",
            "workaround issue",
            "recruiting hiring placement transfer training promotion rate pay compensation termination term condition privilege employment",
            "Query Language asset networking troubleshooting expertise Cloud Infrastructure Development scripting language",
            "provider efficiency decrease cost healthcare",
            "office country",
            "health population",
            "company description",
            "escalation L2 urgent escalation report support team",
            "customer communication",
            "clinician",
            "creation update Knowledge article",
            "requisite Degree computer science engineering equivalent client face role focus Field Linux OS administration expertise query",
            "major accountability Accountabilities primary escalation point Level System Support team",
            "discrimination qualified individual",
            "root analysis",
            "professional software development Product application support train customer service project management customer support environment",
            "pregnancy sexual orientation gender identity national origin age genetic information",
            "KLAS recognition rank Best Global Software report",
            "company"
        ],
        "combined_lemmatized_tokens": "company description improve healthcare innovative technology core Intelerad's . scalable medical imaging platform connect clinician powerful imaging ecosystem fast smart tap datum matter location . focus deliver good class medical image management solution improve provider efficiency decrease cost healthcare improve health population . Intelerad offer healthcare's comprehensive imaging analytic platform . headquarter employee locate office country . company empower healthcare organization speed scalability simplicity increase business performance importantly improve patient outcome . Intelerad's modern enterprise solution acknowledge KLAS recognition rank Best Global Software report . learn visit follow . description purpose System Technology Specialist report directly support Manager Manager closely support technician clinical application specialist engineering team client resolve tough technical issue . responsible solve problem share technical expertise product . involve mentor experienced team provide practical perspective product design discussion ensure product client architecture . high point escalation client service expect provide requirement product supportability maintenance . responsible development tool Support team . major accountability Accountabilities primary escalation point Level System Support team drive customer communication follow resolution respect set service level agreement . major incident manager system outage support Level perform root analysis major incident participate software requirement root review engineering design review mindset supportability software provide workaround issue find field stay current development product bug feature situation occur client site isp participate creation update Knowledge article reduce escalation L2 urgent escalation report support team occur regular schedule rotation availability participate project deem organization Employment Pre requisite pre requisite Degree computer science engineering equivalent client face role focus Field Linux OS administration expertise query structured Query Language asset networking troubleshooting expertise Cloud Infrastructure Development scripting language PHP Perl ... read code high level language qualification Desired Competencies competence highly motivated excel orient strong communication interpersonal skill creative thinker practical problem solver professional software development Product application support train customer service project management customer support environment Additional Information applicant meet minimum qualification require complete minute online assessment application . committed principle equal employment . committed comply federal state local law provide equal employment employment law regulation . applicant employee employee protect employment discrimination base race color religion sex include pregnancy sexual orientation gender identity national origin age genetic information include family medical history . Intelerad dedicate fulfillment policy regard aspect employment include limit recruiting hiring placement transfer training promotion rate pay compensation termination term condition privilege employment . committed ensure equal employment qualified individual . Intelerad Disabilities standard global recruiting hire purpose . prohibit discrimination qualified individual . define physical mental impairment limit major life activity individual record impairment regard impairment . Intelerad Combine form Global Industry Leader Cloud PACS bring LI Remote"
    }
}