{
    "id": "def95c5494bfad9e",
    "company": "BonLook Optique",
    "positionName": "Stylist",
    "jobType": [],
    "location": "Gatineau, QC",
    "salary": null,
    "postingDateParsed": "2023-10-07T02:03:50.322Z",
    "url": "https://www.indeed.ca/rc/clk?jk=def95c5494bfad9e&from=jasx&tk=1hc6gcllqltfi801&vjs=3",
    "externalApplyLink": "https://recruiting.ultipro.ca/FYI5000FYID/JobBoard/2f3e3a2c-3619-47a0-bb50-59b6f5e6300e/OpportunityDetail?opportunityId=cbcddb08-6020-43bd-8fc3-314ed5fe0440&postingId=ee5673bc-d5ce-4d57-940b-37d3370e0004",
    "companyDescription": "",
    "description": "À propos de BonLook \n  BonLook offre une expérience de vente novatrice et des produits qui ont du style, avec une qualité exceptionnelle. Depuis ses débuts, l’entreprise a pour objectif de rendre la lunette de prescription accessible afin d’en faire un accessoire mode incontournable au rapport qualité-prix sans égal. Initialement lancée en ligne, l’entreprise compte 35 points de vente au Canada et plus de 350 employés. Aujourd’hui, BonLook se définit comme étant l’ultime destination pour une garde-robe de montures tendance, pensées et dessinées à Montréal.\n  \n  \n  Pourquoi BonLook? \n  \n  Participer au succès d'une entreprise d’ici fondée par des entrepreneurs qui ont vu le potentiel de faire évoluer toute une industrie.  \n  Évoluer dans une compagnie dont les produits sont conçus et dessinés à Montréal dans un siège social situé au cœur du quartier Saint-Henri aux abords du Canal Lachine.  \n  Travailler dans une entreprise dont les valeurs organisationnelles sont appliquées au quotidien: joie, excellence, innovation et transparence.  \n  Participer à une culture axée sur la diversité et l’inclusion dans toutes les sphères de l'entreprise.  \n  Se développer professionnellement en ayant notamment accès à une formation sur l’optique via notre plateforme interne et le coaching de nos opticiens formateurs.  \n  Accéder à une rémunération globale compétitive et un rabais employé généreux pour vous, votre famille et vos amis.  \n \n Les principales responsabilités \n  \n  Apprendre à connaître nos clients afin de leur trouver les montures parfaites  \n  Accueillir chaque client et lui expliquer le concept BonLook, la marque, la vision et les produits  \n  Être en mesure de lire une prescription optique et de comprendre les besoins de nos clients  \n  Créer des profils de clients et des commandes et utiliser tous les outils fournis pour créer des liens avec nos clients  \n  Contribuer à maintenir la boutique propre et accueillante, appréciée de nos clients  \n  Créer un lien authentique et mémorable avec chaque client  \n  Atteindre les objectifs de vente  \n  Recevoir et transférer la marchandise au besoin  \n \n Le profil recherché \n  \n  Candidat disponible pour un horaire permanent à temps plein et à temps partiel  \n  Disponibilités flexibles (jour, soir et fin de semaine requis)  \n  Esprit d'équipe et capacité à travailler dans un milieu de travail collaboratif  \n  Capacité à aider nos clients tout en s'assurant que la boutique est accueillante  \n  Amour de la mode et des gens  \n  Volonté d'offrir un service à la clientèle authentique et personnalisé  \n  Minimum d'un an d’expérience dans le domaine de la vente ou une expérience similaire  \n  Pouvoir s'adapter facilement à un environnement changeant  \n  Être créatif et énergique dans l'approche avec l'équipe et les clients  \n \n Avantages \n  \n  Poste permanent à temps plein et à temps partiel  \n  Doit être disponible le jour, le soir et la fin de semaine  \n  Assurances collectives, incluant l’assurance médicale et dentaire, et RVER disponible pour les employés à temps plein  \n  Les employés du secteur de la vente au détail reçoivent une paire de lunettes gratuite et bénéficient d'un rabais corporatif pour des achats futurs ainsi que pour leur famille et amis  \n  Nous vous offrons une formation complète pour faire les bons choix pour nos clients  \n \n Depuis ses débuts, BonLook s’engage à faire une différence et favorise la diversité et l’inclusion. Nous croyons que la diversité au travail apporte aux employés la possibilité d’atteindre leur plein potentiel. BonLook encourage les personnes de tous genres et cultures à postuler sur nos rôles. Nous offrons des chances égales d’emploi à tous.\n  \n  \n  Le masculin a été utilisé afin d’alléger ce texte \n  __________________________________________________________ \n  About BonLook \n  BonLook offers an innovative sales experience and stylish products with high quality. Since its inception, the company's goal has been to make prescription eyewear accessible and a must-have fashion accessory with unparalleled value. Initially launched online, the company has 35 stores in Canada and over 350 employees. Today, BonLook defines itself as the ultimate destination for a wardrobe of trendy frames, designed and created in Montreal.\n  \n  \n  Why BonLook ? \n  \n  Participate in the success of a canadian company founded by entrepreneurs who saw the potential to develop an entire industry.  \n  Evolve in a company whose products are conceived and designed in Montreal in a head office located in the heart of the Saint-Henri district on the banks of the Lachine Canal.  \n  Work in a company whose organizational values are applied daily: joy, excellence, innovation and transparency.  \n  Participate in a culture of diversity and inclusion in all areas of the company.  \n  Develop professionally by having access to training on optics via our internal platform and the coaching of our optician trainers.  \n  Access to a competitive total compensation package and a generous employee discount for you, your family and your friends.  \n \n Responsibilities \n  \n  Get to know our customers to find them the perfect frames  \n  Greet every customer and explain the BonLook concept, brand, vision and products  \n  Be able to read an optical prescription and understand our customer’s needs  \n  Create customer profiles and orders, and use all tools provided to create customer connections  \n  Help maintain a clean and welcoming, well-loved store environment  \n  Create a genuine and memorable connection with each customer  \n  Meet sales goals  \n  Receive and transfer merchandise as needed  \n \n Qualifications \n  \n  Candidate available for a permanent full-time and part-time schedule  \n  Flexible availabilities (day, evening and week-end required)  \n  Team spirit and ability to work in a collaborative workplace  \n  Ability to assist customers while ensuring the store is in order  \n  Love for fashion and people  \n  Willingness to offer sincere and personalized customer service  \n  Minimum 1 years in sales or relative experience  \n  Can adapt easily to a changing environment  \n  Be creative and energetic in the approach with the team and customers  \n \n Work conditions \n  \n  Permanent full-time and permanent part-time position  \n  Must be available days, evenings and weekends  \n  Group insurance, including medical and dental insurance, and VRSP available to all full-time employees  \n  Retail employees receive one complimentary pair of glasses, and corporate discount on glasses for future purchase and for their family and friends.  \n  We offer a full training to help you make the best choices for our customers  \n \n Since its inception, BonLook has been committed to making a difference and promoting diversity and inclusion. We believe that diversity in the workplace empowers employees to reach their full potential. BonLook encourages people of all genders and cultures to apply for our roles. We provide equal employment opportunities for everyone."
}